[
    {
        "group": "Algiers",
        "repo": "www-chapter-algiers",
        "name": "OWASP Algiers Free Training Initiative | ISC2 CC: Certified in CyberSecurity",
        "date": "2024-05-25",
        "time": "20:00+01:00",
        "link": "https://www.meetup.com/owasp-algiers-chapter/events/301146140",
        "timezone": "Africa/Algiers",
        "description": "**Event Highlights:**\n\n**\\- Expert Instruction:** Learn from industry leader Taher Amine ELHOUARI.\n**\\- CC Certification:** Access a FREE exam voucher for the Certified in Cybersecurity (CC) certification.\n**\\- Networking Opportunities:** Connect with fellow enthusiasts and professionals.\n**\\- Comprehensive Curriculum:** Deep dive into essential cybersecurity domains.\n\n** Updated Registration Details:**\nLink for Students: [https://lnkd.in/dz4uS8uU](https://lnkd.in/dz4uS8uU)\nLink for Employees: [https://lnkd.in/dJCKFeVA](https://lnkd.in/dJCKFeVA)\n\nWe encourage you to register early to secure your spot. Thank you for your continued support and enthusiasm. Together, let's strengthen our cybersecurity skills and make a positive impact in the field.\n\n** Mark Your Calendars:**\nJoin us on 25 May 2024.\n\nWe can't wait to see you there!\nStay safe and stay secure!"
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "2. OWASP Augsburg Stammtisch",
        "date": "2024-05-29",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/300790684",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda**\n\n*Barcamp / Diskussion zum Thema \"Supply Chain Risiken\"*\n* Teaser\n* Wie manage ich Supply Chain Risiken?\n* Supply Chain Risiken im Kontext des EU Cyber Resilience Acts\n* Welche Maßnahmen gibt es gegen Supply Chain Risiken?\n* Supply Chain Risiken & Secure Device Provisioning\n* ...\n*Networking im Allgemeinen & Austausch zu beliebigen Themen*\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "June 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-06-13",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299655980",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, June 13th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Checkmarx](https://checkmarx.com)\n*Checkmarx is constantly pushing the boundaries of Application Security Testing to make security seamless and simple for the world’s developers and security teams. As the AppSec testing leader, we deliver the unparalleled accuracy, coverage, visibility, and guidance our customers need to build tomorrow’s software securely and at speed.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-13",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301223275",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-06",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301085528",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-05-30",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/300947621",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2024 (Online)",
        "date": "2024-05-28",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207005",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nPresentation: **Digital Deceit and AI Hallucinations: Safeguarding the Software Supply Chain**\n\nThe presentation unites Tyler Agypt's expertise in a riveting exploration of software supply chain threats, spanning traditional dangers to the novel challenge of AI Package Hallucination. Agypt, VP of Global Enablement at Checkmarx, exposes the hidden risks in software dependencies and the emerging threat of artificially generated, nonexistent code packages. Through real-world examples and insights from over 1 million malicious packages, he reveals the deceptive practices endangering our digital ecosystem, from Dependency Confusion to Star-Jacking to Repo-Jacking.\nAgypt advocates for robust defensive strategies, tools and improved dependency management, to counteract these threats. This presentation is a call to action for the developer and cybersecurity community to elevate their vigilance and adopt a proactive stance against the evolving challenges in software supply chain security. Join this enlightening session for a comprehensive understanding of both traditional and AI-induced vulnerabilities, and equip yourself to better face tomorrow's cybersecurity challenges.\n\n**Speaker: Tyler Agypt**\n\nTo RSVP for the in-person meeting at NI/Emerson, please see [https://owasp-austin-2024-may-g2.eventbrite.com](https://owasp-austin-2024-may-g2.eventbrite.com)"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combined Bangalore  Meet 25 May 2024",
        "date": "2024-05-25",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/301096225",
        "timezone": "Asia/Kolkata",
        "description": "Join us at the Null/OWASP Combined Meet in Bangalore on Saturday, May 25, 2024, from 09:30 AM to 02:30 PM at Tekion India Pvt Ltd, Bagamane Solarium City. This free event offers a platform for cybersecurity enthusiasts to learn and share knowledge through sessions including IoS Pentesting by Abida Shariff, Zeroclicks Everywhere by Mr-IoT, AD Pentesting by Surya Dev Singh, a Practical Approach to OWASP Machine Learning Top 10 by Rallapalli Nagarjun, and Microprobing with ICEBite by Karthik Ekanathan. Network with peers, engage in enriching discussions, and enhance your cybersecurity skills at this dynamic gathering. No registration fees are required; just bring an open mind and a willingness to learn!\n\n### Session Schedule\n\n| Name | Speaker | Start Time | End Time | Resources |\n| ---- | ------- | ---------- | -------- | --------- |\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM | |\n| [IoS Pentesting](https://null.community/event_sessions/4272-ios-pentesting) | [abida shariff](https://null.community/profile/38340-abida-shariff) | 09:40 AM | 10:10 AM | |\n| **Introduction** | 10:10 AM | 10:25 AM | |\n| [Zeroclicks Everywhere](https://null.community/event_sessions/4274-zeroclicks-everywhere) | [Mr-IoT](https://null.community/profile/3556-mr-iot) | 10:25 AM | 11:15 AM | |\n| [AD Pentesting](https://null.community/event_sessions/4275-ad-pentesting) | [Surya Dev Singh](https://null.community/profile/43956-surya-dev-singh) | 11:15 AM | 12:05 PM | |\n| **Networking Session + Break** | 12:05 PM | 12:30 PM | |\n| [Practical Approach to OWASP Machine Learning Top 10](https://null.community/event_sessions/4277-practical-approach-to-owasp-machine-learning-top-10) | [Rallapalli Nagarjun](https://null.community/profile/37824-rallapalli-nagarjun) | 12:30 PM | 01:20 PM | |\n| [Microprobing with ICEBite](https://null.community/event_sessions/4278-microprobing-with-icebite) | [Karthik Ekanathan](https://null.community/profile/32567-karthik-ekanathan) | 01:20 PM | 02:10 PM | |\n| **Feedback + Next Month’s Planning** | 02:10 PM | 02:30 PM |"
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "C3 Dev Festival - the contemporary software engineering and design festival",
        "date": "2024-06-14",
        "time": "08:00+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/300841713",
        "timezone": "Europe/London",
        "description": "OWASP Belfast is pleased to announce the C3, a contemporary software engineering & design festival!\n\n**With 3 free tickets, we'll run a draw on May 20th among all who comment on this post!**\n\nCode, career, creativity\n12 artists & 30 speakers\nSpeed Networking\n& many more\n\n**#Amsterdam, June 14-15, 2024 → https://c3fest.com**\n\nСonference announcement:\n\nCheck out the C3, a contemporary software engineering & design festival, organized by GitNation!\n\nIt is set to be one of the most vibrant festivals, blending technology, design, art, and music. It's a global gathering of tech enthusiasts in the beautiful city of Amsterdam!\n\nExcept for the 40 + speaker talks, the festival includes workshops, icebreaker activities, a game tournament, a pre-party, discussion rooms, a digital art exhibition, and a night party featuring 18+ DJs, musicians & creative coders on Techno/House, Algorave/Experimental, Night Cinema/Karaoke Hall stages\n\nAmongawesome first confirmed artists & speakers:\n\n• Rival Consoles, London-based critically acclaimed electronic music producer presenting a brand new unique performance that will take the form of an immersive audio-visual experience\n• Sam Aaron, key figure in algorave movement\n• Saskia Freeke, Creative coder, interaction designer, visual designer and educator\n• Christian Heilmann, Author of the Developer Advocacy Handbook\n& more\n\nExplore more about C3 and grab your ticket → https://c3fest.com/"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - June 2024",
        "date": "2024-06-12",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owaspboston/events/301105296",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Lindsay Kaye as our presenter. Lindsay will be giving her presentation an Overview of the PROXYLIB Campaign.\n\nIn May 2023, we identified a cluster of VPN apps available on the Google Play Store that transformed the user’s device into a proxy node without their knowledge. We’ve dubbed this operation PROXYLIB. Other researchers identified this malicious behavior in a single free VPN application—Oko VPN— which resulted in the app's removal from the Play Store. Based on further analysis of Oko VPN, Satori researchers uncovered 27 additional applications related to PROXYLIB. These apps shared a common native library, written in Golang, that enrolls the device as a proxy node. This talk will provide a high-level overview of the PROXYLIB Android malware and take the listener through the changes we observed in response to defenders’ actions.\n\nLindsay Kaye is the Vice President of Threat Intelligence at HUMAN Security. Her technical specialty spans the fields of malware analysis and reverse engineering, with a keen interest in dissecting custom cryptographic systems. Lindsay is an internationally-recognized cybersecurity speaker and author. Lindsay holds a BS in Engineering with a Concentration in Computing from Olin College of Engineering and an MBA from Babson College."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "How quantum computers can become a threat to cryptography",
        "date": "2024-06-10",
        "time": "17:55+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/301188369",
        "timezone": "Australia/Brisbane",
        "description": "Looking at recent developments in quantum computers, we try to make a prediction how much of a threat quantum computers will be for \"classical\" cryptography. Look at how technologies were able to penetrate our society seems to give a good indication of how prevalent quantum computers will become. We also look at research results, and how they inform us about the threat of quantum algorithms."
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Cairo Chapter in caisec 2024 ",
        "date": "2024-06-02",
        "time": "12:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/301160811",
        "timezone": "Africa/Cairo",
        "description": "**Important Note:** The OWASP room is open and free for anyone to attend, the room space is limited to 40 attendee and the event pre-registration is required. While registration for the CAISEC event is not mandatory, it is important to confirm your attendance. **Any confirmations made without attendance at the event will result in exclusion from future events hosted by the OWASP Cairo Chapter.**\n\n**Event Details:**\n\nThis OWASP Cairo chapter event will focus on application threat modeling and mobile security in the multiverse of madness. The event will consist of two workshops:\n\n**•⁠ ⁠Time:** 12:00 PM - 4:00 PM\n**•⁠ ⁠Venue:** Dedicated room provided by CaiSec organizers\n\n**Event Agenda**\n**1.⁠ ⁠Introduction to Application Threat Modeling (60 minutes) (By: Khaled Battah)**\n\n* Understanding the importance of threat modeling\n* Exploring the STRIDE (Spoofing, Tampering, Repudiation, Information Disclosure, Denial of Service, Elevation of Privilege) model\n* Applying the threat modeling process to web applications\n\n**2.⁠ Practical Application Threat Modeling with Attendees (90 minutes) (By: Mohamed alfateh and Khaled Battah)**\n\n* Attendees will work in small groups to perform a threat modeling exercise on a sample web application\n* Groups will present their findings and discuss mitigation strategies\n\n**3.⁠ Mobile Security in the Multiverse of Madness (60 minutes) (By: Kareem Selim and Hassan Mostafa)**\n\n* Analyzing the security challenges of mobile applications in the multiverse\n* Exploring common vulnerabilities and attack vectors in mobile apps\n* Discussing best practices for securing mobile applications\n* Hands-on exercises to demonstrate mobile security techniques"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "The Truman Show: Real-world application attacks instead of canned demos",
        "date": "2024-06-20",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/300788193",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nIn this presentation, Kevin Johnson of Secure Ideas will walk attendees through various scenarios used in penetration testing of applications. These demonstrations will use real attacks and discuss how a penetration tester views applications. This talk will explain the mindset of an attacker, using actual applications as well as demonstration apps to allow for exploitation.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland - Meet and Greet",
        "date": "2024-06-05",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/300914168",
        "timezone": "America/New_York",
        "description": "OWASP Cleveland is back! We're starting off with a meet & greet where we can get to know one another, gauge our community's areas of interest, and start planning our roadmap for the rest of the year.\n\n**Agenda:**\n\n* Introductions\n* Community roundtable: which AppSec topics and OWASP projects most interest you?\n* Planning for upcoming events\n\nJoin us at Market Avenue Wine Bar in Ohio City! Check them out here: [https://marketavenuewinebar.com/](https://marketavenuewinebar.com/)\n\n**About OWASP**\nThe Open Worldwide Application Security Project (OWASP) is a nonprofit foundation that works to improve the security of software. Our programming includes:\n\n* Community-led open source projects including code, documentation, and standards\n* Over 250+ local chapters worldwide\n* Tens of thousands of members\n* Industry-leading educational and training conferences\n\nEveryone is free to participate in OWASP and all of our materials are available under a free and open software license. Learn more about the OWASP Foundation and our work: [https://owasp.org/about/](https://owasp.org/about/)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS May 2024",
        "date": "2024-05-30",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/300804464",
        "timezone": "America/Denver",
        "description": "Speaker: Ben Struebing; \"The Summit Awaits: Are you ready the Purple Ascent?\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP June Meet - In person",
        "date": "2024-06-11",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/301038527",
        "timezone": "America/Chicago",
        "description": "\\*\\*\\*\\*AI Hallucination\\*\\*\\*\\*\\*\n\n90% of the code in Apps today comes from Open Source Software. Whether through infiltrating the software delivery pipeline, deliberately uploading malicious components to popular repositories, or taking advantage of existing vulnerabilities in open source components, attackers are leveraging gaps in supply chain controls to compromise organizations. With GenAI quickly becoming a popular tool for developers to generate code, a new threat has emerged. AI package hallucinations is one of the more recent attack types within supply chain that is easy to execute and can have devastating effects. During this session we will give an overview of Supply Chain Security with some examples of the current threats, discuss AI package hallucinations, and preventative measures."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Incident Response Coaching with SentinelOne's Purple AI and MNP Digital",
        "date": "2024-06-12",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/300949430",
        "timezone": "America/Edmonton",
        "description": "*As Franklin D. Roosevelt once wisely said, \"A smooth sea never made a skilled sailor.\"*\n\n**Ahoy, cyber sailors!** Just as sailors master the waves, [SentinelOne ](https://www.sentinelone.com/)and [MNP Digital](https://mnpdigital.ca/) are here to steer your ship through the stormy seas of cyberspace. Picture this: [SentinelOne's Purple AI](https://www.sentinelone.com/platform/purple/) is your trusty first mate, offering personalized coaching to navigate through cyber currents and dodge digital pirates‍. Together, we'll transform your crew into skilled cyber defenders ready to face any challenge on the high seas of security. \n\nAnd that's not all - [MNP](https://mnpdigital.ca/) is bringing in an Incident Response specialist to share the latest insights and trends. MNP doesn't just crunch numbers and balance the books like the superheroes of the accounting world. But they also fend off digital villains with their mighty Cybersecurity team. Think of MNP as your financial wizards by day and cyber warriors by night. They keep your money safe in more ways than one – after all, who knew accountants could also be your digital bodyguards? ‍\n\nJoin us for a day of learning, laughter, and delicious food as we level up our cyber defenses together!\n\n**Culinary Details**\nAfter the presentation, we'll be descending a few floors to MNP's brand new social and games floor, with a huge shoutout and special thanks to MNP for granting us early access! \n\nBut wait, there's more! Thanks to SentinelOne, we're serving up [Cornerstone BBQ's](https://www.cornerstonebbq.com/) mouthwatering beef brisket and grilled chicken at the event, all on the house! \n\n**Registration**\nJoin us for an open and inclusive gathering, dedicated to our shared theme. In compliance with our commitment to provide an optimal experience, we encourage timely registration to accommodate all interested participants within the policy guidelines. \n\n**Agenda **\n5:00 - 5:30 - Registration Verification\n5:30 - 6:00 - Presentation\n6:00 - 7:00 - Dinner and Socializing"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg AI Security and Header Injections",
        "date": "2024-05-29",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/300784706",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Benify's office for an interesting evening with food and drinks, and talks about AI security and the security implications of attacker controlled HTTP response headers!**\n\n**Where:** Benify, Masthamnsgatan 5, 413 27 Göteborg\n\n**Agenda:**\n**17:00 - 17:25:** Welcome to Benify\n\n**17:25 - 17:40:** Introduction from the event hosts and presentation of tonight's speakers.\n\n**17:40 - 18:40:** *Securing the Future: Ethical, Robust, and Secure AI Development*\n\nOutline:\n\nHistorical Overview of AI\n\n* Evolution of artificial intelligence\n* Key milestones in AI development\n\nAI and Ethics\n\n* Impact on business operations and decision-making\n* Overview of ethical guidelines and frameworks\n* Best practices for ethical AI implementation\n* Strategies to mitigate ethical risks\n\nRobustness & Reliability of AI Code Generation\n\n* Common misuse patterns and how to address them\n* Key metrics for measuring AI system reliability\n\nArtificial Intelligence Security Introduction\n\n* Historical case studies of AI failures\n\nOWASP Top Ten for Large Language Models\n\n* Security issues ranging from prompt injection to model theft\n\nThreat Modeling AI Systems\n\n* Methodologies for assessing and mitigating threats in AI ecosystems\n\nHugging Face Open Source AI Tools\n\n* Overview of tools for AI development and research\n\nDifferential Privacy and AI\n\n* Principles and applications to protect user data\n\nNIST AI Risk Framework\n\n* Framework for managing AI risks\n\nExecutive Order on AI Development and Use (Dated Oct 30, 2023)\n\n* Analysis of the executive order and its implications for AI\n\nEU AI Act\n\n* Exploration of the EU's first regulation on AI (link provided in the talk)\n\n**Jim Manico** is the Founder of Manicode Security, a company dedicated to providing expert training in secure coding and security engineering to software developers. His work at Manicode Security reflects his deep commitment to elevating software security standards in the industry. In addition to leading Manicode, Jim is actively involved in the tech startup ecosystem as an investor and advisor. His portfolio includes notable companies such as SemGrep, EdgeScan, Nucleus Security, Defect Dojo, KSOC, Akto, MergeBase, Inspectiv, Levo.ai and Pheonix. Furthermore, he is a fund-limited investor with Aviso Ventures, bringing his knowledge of software security to the venture capital domain. Jim is a recognized figure in the software development community, particularly known for his contributions to secure software practices. He holds the title of a Java Champion, acknowledging his contributions to the Java community. He is also the author of \"Iron-Clad Java: Building Secure Web Applications\", published by Oracle Press. Jim is committed to giving back to the community through his volunteer work with the OWASP foundation. He co-leads projects such as the OWASP Application Security Verification Standard and the OWASP Cheatsheet Series, contributing significantly to the field of web application security. For more information, please visit his LinkedIn profile at https://www.linkedin.com/in/jmanico or visit him on X/Twitter @manicode.\n\n**18:40 - 19:20:** Food & Drinks\n\n**19:20 - 20:00:** *Controlling the response: a peek into the risk of attacker-controlled HTTP headers*\nThe talk will present research into the security implications of attacker-controlled response headers. What can go wrong when we intentionally or unintentionally allow an attacker to control the headers of an HTTP response? We will examine some services where this exists \"by design\" where developers have tried to mitigate any risk using filters and Content Security Policies. We will also take a new look at the classic \"CRLF header injection\". The presentation will cover some known escalations in this area but also present a lesser-known escalation that abuses Network Error Logging.\n\n**Johan Carlsson** is a developer, bug bounty hunter, and hobby security researcher. He works at Recorded Future but has just finished three months of self-employment as a full-time bug hunter. Johan has found numerous vulnerabilities in many companies but is most known for his work on securing GitLab.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2024",
        "date": "2024-06-20",
        "time": "16:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/300592625",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy will host the next OWASP Italy Day 2024 on June 20th. It will be a full-day event dedicated to application security (AppSec)!\n\n#### **OWASP Italy Day 2024 will take place at Cagliari.** This is a free, one-day, informal event aimed at increasing awareness and knowledge of web application security. **Reserve your seat here:** [https://clicqui.net/2Lst5](https://clicqui.net/2Lst5)\n\nThe event is primarily intended to appeal to security professionals, software developers, software quality engineers, and computer science students with a strong interest in computer security.\n\n### **PROGRAM**\n\nThe event will take place next 20th June from 4 PM to 22 PM (Italian time). We are working on the program at the moment.\n\n#### **Dinis Cruz, Founder @ The Cyber Boardroom, Chief Scientist @ Glasswall, vCISO and GenAI expert, will be the esteemed keynote speaker at the upcoming OWASP Italy Day 202**4!\n\n### **Call for papers**\n\nThose who are interested in participating as speakers to the conference can submit an abstract of their proposed talk via Easychair by April, 2024. The Easychair link for submission is reported on this page.\nThe abstract must be in PDF format and should contain the following information:\nName and surname of the speaker Institutions and roles of the speaker therein Short biography of the speaker Title of the contribution Abstract of the presentation The submission must be no longer than 2 pages overall. No additional formatting requirements are in place.\nThe submission will be reviewed by the program committee and the most interesting talk proposals will be selected for the conference.\n[CFP OWASP Italy Day 2024](https://easychair.org/cfp/CJ24)\n\n### **Call for Sponsorship**\n\nWe are excited to offer sponsorship opportunities for the OWASP Italy Day 2024, taking place in Cagliari on June 20th. This event provides a unique platform to connect with professionals from multiple facets of the software industry, including security experts, developers, engineers, and influential academics.\n\n#### Why Sponsor OWASP Italy Day 2024?\n\nBrand Visibility: As a sponsor, your brand will be prominently displayed before, during, and after the event. This includes logo placement in event materials, promotional content, and key areas at the venue. Enhance your brand recognition within the cybersecurity and developer communities.\nCommunity Engagement: Engaging with the OWASP community puts your company in the spotlight as a leader in supporting open software and security advancements. This event will provide you with the opportunity to network with industry leaders and cybersecurity professionals, offering a chance to build relationships and share your company’s expertise and solutions.\nLead Generation: With hundreds of attendees from various sectors, sponsoring OWASP Italy Day 2024 gives you direct access to potential clients and customers. The event will provide a focused audience interested in cybersecurity solutions, products, and training.\nPlease see **[here for details](https://owasp.org/www-chapter-italy/assets/images/2024%20OWASP%20Italy%20Day%20Sponsorship.pptx.pdf)**\nFor detailed information on our sponsorship packages please read the details [here](https://owasp.org/www-chapter-italy/events/OWASPIt24SponsorKit)\n\n**RESERVE YOUR SEAT:**\n[https://clicqui.net/2Lst5](https://clicqui.net/2Lst5)\n\nEvent official site:\nhttps://owasp.org/www-chapter-italy/events/OwaspItalyDay2024-06-20"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-06-17",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686433",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Chapter Limassol meetup 2024-v1",
        "date": "2024-05-31",
        "time": "18:30+03:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/300819935",
        "timezone": "Asia/Nicosia",
        "description": "The location is **The Ballroom Suite B** at the [Crowne Plaza Hotel](https://maps.app.goo.gl/38rAWxBS9gMoSiH69).\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the fourth meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/), supported by [Semrush Inc.](https://semrush.com)!\n\nWe cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\nWe look forward to seeing you there and would be delighted to offer a **complimentary gift to each attendee**!\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19-00 — 19:35 **Ivan Elkin**, Application Security Team Leader at Exness with the topic **ASPM - story about unicorns, sneaky business and unexpected decisions**\n19-35 — 20:05 **Michael Markevich**, Security Lead at DHIS2, ex-CISO at Opera, with a talk **DHIS2: Building Security For An Open-Source Project**, which is a great opportunity to learn how a security professional can make the world of open-source better.\n20:05 — 20:30 A short break + Quiz\n20-30 — 21:00 **Dmitrii Stepul**, student of Neapolis university Pafos will talk about **Content Blocking system in Cyprus**\n21:05 — 21:40 **Sergey Belov**, Product Security Lead at Acronis. The topic will be **Impossible security - solving tasks with no right solution**\n21:40 — 22:05 Outro + Quiz\n22:05 — 23:00 Eat, drink, networking!\n\nIn addition, as usual, we are working hard to deliver the best knowledge to the community and are happy to announce that this event is fully packed with amazing gifts:\n\\- quizzes winners \\(**RTL-SDR Blog V3** R860 RTL2832U 1PPM TCXO HF Bias Tee SMA SDR with Dipole Antenna Kit) + branded T-shirt\n\\- activity winners \\(NooElec '**Yard Stick One**' USB Transceiver & 915MHz Antenne) + branded T-shirt\n\\- speakers \\(**Hamgeek HackRF One R9** and Portapack H2 Include 5 Antennas and Data Cable 1MHz-6GHz SDR Radio Unmounted Black) + branded T-shirt\n\nWe'll have catering and a chilly sunset view zone to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#07 - The Son",
        "date": "2024-05-28",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/300726135",
        "timezone": "Europe/Lisbon",
        "description": "Join us for the 7th OWASP Lisboa meetup!\n\nThe OWASP Lisboa chapter meetup will be held on May 28th, 2024, at 18:00, **and is** **supported by [Springer Nature Group](https://www.springernature.com/) and [AP2SI](https://ap2si.org/).**\n\nThe schedule is the following:\n**18:00** - **Welcome notes** by the OWASP Lisboa chapter leadership team\n**18:15** - **Technical Challenges of Security Scanning in CI/CD** by Tiago Mendo\n**19:10** - **Harnessing Reachability Analysis to Discern Real Threats in** by Joseph Hejderup\n**20:00** - **Drinks & Dinner** by Springer Nature Group\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Technical Challenges of Security Scanning in CI/CD**\n\nSpeaker: **Tiago Mendo**\n\nAbstract:\nHave you ever tried to add a web application security scanner to a CI/CD pipeline?\nI intend to draw attention to some of the challenges that development/security teams experience when trying to automate security tests.\nThe objective is to make the audience aware of these problems so that they can solve them as soon as possible, increasing the success of the tests and the adoption by the teams, which, in the end, will lead to greater security for the organization.\nThe focus will be on problems such as the scale of tests, speed of obtaining results, false positives and how these can destroy the process - or make it more expensive, and the use of the tools itself. All problems will be based on real situations, with examples whenever possible. I will propose solutions for different teams' maturity levels, giving practical tips to start implementing security in the developers' pipeline.\n\nBio:\nTiago Mendo is a co-founder and CTO of Probely, a cybersecurity company that does web and API security scanning. With over 19 years of experience in the security field, he has extensive experience in pentesting applications, training, and providing all-around security consultancy.\nHolds a Master's in Information Security from Carnegie Mellon University and a CISSP certification. He is also a qualified member of AP2SI, a non-profit organization that promotes Information Security, and Co-Leader of the OWASP Lisboa Chapter, in Portugal.\nHe is also an international speaker at security conferences, such as SnowFROC, LASCON, BSides Kraków, and BSides Lisbon.\n\nLinkedIn: [https://www.linkedin.com/in/tiagomendo/](https://www.linkedin.com/in/tiagomendo/)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Harnessing Reachability Analysis to Discern Real Threats in Software Dependencies**\n\nSpeaker: **Joseph Hejderup**\n\nAbstract:\nIn this talk, we will dive into the shortcomings of traditional dependency analysis methods, which usually focus on looking at build manifests and metadata, to spot security or performance vulnerabilities in Java projects. While tools like Maven Dependency Checker and Gradle's dependency-analysis plugin are invaluable for their ability to manage dependencies, they often fall short when we need quick and precise answers, forcing developers to lean on time-consuming tests and manual code reviews. We believe that a thorough look at how dependencies are actually used in the code—with the help of static and reachability analyses—can be a more effective way to pinpoint real threats in Java dependencies.\n\nWe'll use real-world examples to show how static analysis, and in particular reachability analysis, offers deeper insights into potential vulnerabilities by moving beyond simple metadata. By sharing examples where static analysis has been a game-changer, and pointing out where it might not be enough, we aim to shed light on the challenges and opportunities this method brings to improving security and performance in software projects.\n\nOur goal is to provide attendees with practical strategies for using static and reachability analyses, promoting a more detailed method for managing dependencies and finding vulnerabilities in software applications.\n\nBio:\nPart-time developer, part-time PhD student, full-time enthusiast in developing and researching techniques that makes package management system more intelligent and resilient against supply chain problems! Joseph Hejderup (Researcher/Software Engineer at Endor Labs & PhD student at Delft University of Technology) is applying program analysis techniques to better understand how we use third-party components and what risks third-party components entails from a security and maintenance perspective. Currently, he is applying years of research in Endor Labs with the mission to make dependency management a robust process that will empower developers, increase productivity, and solve security problems.\n\nLinkedIn: [https://www.linkedin.com/in/josephhejderup/](https://www.linkedin.com/in/josephhejderup/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "LayerOne Security Conference - Pasadena, CA",
        "date": "2024-05-25",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/301054531",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** will be hosting a booth at the **LayerOne 2024** security conference coming up in two short weeks! Be sure to stop by and say hi!\n\nDon’t forget – you have until May 25th to save big on registration. Head over to the [registration page](http://www.layerone.org/registration/) and secure your tickets now! Use promo code **L12024OWASPLA10** for 10% off registration courtesy of OWASP Los Angeles.\n\nPre-registration gets you full access to the event, all presentations, contests, villages, and the Saturday Night party.\n\nSee you there!!"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "June meetup: Hidden Risks in Open-Source Code and AI Models",
        "date": "2024-06-18",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/301154232",
        "timezone": "America/Chicago",
        "description": "**Hidden Risks in Open-Source Code and AI Models**\n**Ryan Wakeham, Senior Solutions Engineer, Checkmarx**\n\nThis presentation will explore some of the threats and risks associated with open-source code and generative AI models. Open-source packages, while widely adopted for their flexibility and collaborative benefits, can be exploited through supply chain attacks, where malicious code is introduced into trusted components. Similarly, open-source AI models face risks such as data poisoning, model theft, and adversarial attacks, which can compromise their integrity and reliability. Understanding these threats is crucial for developing robust security measures and ensuring the safe use of open-source technologies.\n\nAudience level: Moderately technical\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nPlease remember to register and keep your registration up to date so we know how many to expect."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Digital Safeguards: Your Essential Blueprint for Navigating Cyber Threats\"",
        "date": "2024-06-19",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300436528",
        "timezone": "America/Chicago",
        "description": "Outdated cybersecurity tactics leave us vulnerable. This thought-provoking talk introduces the “Cyber Risk Manifesto”, drawing upon the wisdom of military intelligence and corporate defense methodologies. Explore innovative strategies for predicting threats, reinforcing defenses, and empowering everyone to become cybersecurity guardians. Discover how outmaneuvering attackers is the key to digital resilience."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "June 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-06-20",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/300855942",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** VU, Amsterdam - Theater 7, 4E floor at the New University Building\n**Address:** De Boelelaan 1105\n**Parking information:** [https://www.parkerenbijvu.nl/](https://www.parkerenbijvu.nl/)\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Ship Happens: The Stormy Seas of Supply Chain Security** by **David Archer**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Technical leverage: dependencies are a mixed blessing** by **Fabio Massacci**\n\n**Ship Happens: The Stormy Seas of Supply Chain Security**\n*Abstract:*\n“The more I know about how software is made, the less I want to know” - Me\n\nAs a software developer with over a decade of experience and countless interactions with application security teams, I’ve discovered the unsettling complexities of modern software production. Despite what I thought I knew, the reality was far more intricate.\n\nModern software development is a sprawling network of open-source dependencies, sophisticated build tools, plugins, pipelines, and runtimes. These components are fundamental in securing critical sectors of our daily lives—finance, healthcare, infrastructure, transportation, and social interactions. However, this supply chain is under relentless attack and many of the potential threats are poorly understood.\n\nThis talk will delve into specific vulnerabilities, such as dependency poisoning and pipeline compromises, that exemplify the challenges we face. We’ll explore strategies to mitigate these threats and discuss practical takeaways that attendees can immediately implement in their software development practices. Expect to leave with a deeper understanding of supply chain security and with ideas to fortify your software factory against these escalating threats.\n\n*Bio:*\nDavid Archer is a Solution Architect at Endor Labs. He began his career as a software developer and witnessed significant shifts in how software is built over the last two decades. After spells as a development lead, product director and pre-sales consultancy roles David consistently saw a concerning trend: security often took a backseat amidst the hustle and bustle of development priorities.\n\nSeeking to help address this balance David took an opportunity in 2018 to work full-time in the field of application security with a particular focus on technologies that promise to enhance security without impeding development speed. Through his extensive experience with secure coding practises and hands-on experience with the myriad of code analysis tools like IAST, SAST, DAST, RASP and SCA, he gained valuable insights into their relevance and effectiveness in a modern software factory.\n\n**Technical leverage: dependencies are a mixed blessing**\n*Abstract:*\nModern applications are build upon a large supply chain of (possibly open source) libraries and tools. In finance, leverage is the ratio of debts (other people’s money) vs equity (your money) and the Lehman Brothers have made that concept famous. For software, technical leverage is the ratio between other people’s code and your own code. I will argue with some examples from the Maven, Python and the NPM ecosystems that this is both a risk and an opportunity. The Lehmans Brothers were 30 to 1, what about the Software Sisters?\n\n*Bio:*\nFabio Massacci is a co-author of CVSS v4. Among other things, he is also a professor at Vrije Universiteit. He has been a speaker at hackers’ venues (BlackHat USA, Asia) scientific security conferences (IEEE S&P, CCS), software engineering (ICSE,MSR) and risk analysis (SRA). He coordinates the EU project Sec4AI4Sec (name tells it all) and an NWO project on using AI for security threat intelligence. While almost all professors are sellers of tech (through their papers or their spin-offs) he was also for 7 years deputy for ICT procurements and services supervising a 70+ workforce and few millions Euro in outsourcing contracts. Being a buyer of tech makes a difference in perspective."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle June 2024",
        "date": "2024-06-19",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/300468663",
        "timezone": "Europe/London",
        "description": "We're back with our second event of 2024! We’ll be doing our usual two talks and pizza format.\n\nLocation: Precursor Security (at the old Newcastle Building Society office)\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1830 OWASP Newcastle Welcome\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk one\n**Title:** Supercharging Enterprise DFIR - 'Forensics as Code', AI, Automation and Cloud.\n**Speaker:** Michael L\n**Speaker Bio:** Currently the Director of SOC/DFIR for Precursor Security, experienced working in different SOC teams across public sector, financial services and managed services. I've lead DFIR engagements for a varied client base across EMEA.\n**Talk Synopsis:** This talk will introduce the latest techniques to supercharge your response to threat actors at enterprise scale. We will cover techniques I've employed to combat Lockbit, Akira and other TA's in challenging and diverse environments, focusing on new trends shaking up the DFIR corner such as performing forensics investigations 'as code', harnessing AI for DFIR and utilising Azure for automation and almost limitless scale.\n\nTalk two\n**Title:** Utilizing PowerBI for DFIR and incident investigation.\n**Speaker:** Venkatraman Krishnamoorthy\n**Speaker Bio:** Working as SOC manager for Sage . I have lead critical investigations, detection engineering efforts, Security automation.\nProviding free cyber security Mentoring for economically modest students.\n**Talk Synopsis:** Leveraging Power BI for Digital Forensics and Incident Response (DFIR): Enhancing Data Analysis and Visualization\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Steps to Reduce Friction between Development and Security Teams",
        "date": "2024-05-30",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/300805662",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on May 26th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Abstract**\nIn an era where cloud security is critical, the delicate balance between rapid development and maintaining stringent security measures is more critical than ever. Join Doron Naim (DevOcean) as he addresses this challenge head-on, offering members of OWASP new actionable strategies and expert insights for enhancing collaboration and efficiency in cloud security and remediation efforts.\n**Key Insights:**\n\n* **Collaboration Techniques**: Learn proven collaboration methods to boost synergy across security, DevOps, and development teams.\n* **Smart Remediation**: Discover how intelligent workflows can significantly speed up the identification and resolution of security vulnerabilities.\n* **Ownership & Efficiency**: Gain insights on automating the assignment of fixes to the right team members, streamlining the remediation pipeline, and cutting down on ticket clutter.\n* **Preventive Measures:** Explore methods to ensure vulnerabilities are fixed right the first time, preventing future occurrences.\n\n**Why Attend:**\n\n* **Immediate Value**: Walk away with strategies you can implement now, no matter your platform or tools.\n* **Enhanced Security Posture**: Learn how to reduce friction and elevate your cloud security practices.\n* **Practical Knowledge**: Whether or not DevOcean is part of your toolkit, this session promises insights to help your organization thrive in cloud security.\n\n**Ready to Bridge the Gap between Security and Dev?**\nJoin us to unlock NextGen collaboration strategies that support secure, rapid development. Learn how to streamline workflows, elevate your cloud security posture, and achieve continuous innovation."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-05-30",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/300641588",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "June 2024 Meeting",
        "date": "2024-06-04",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/301186933",
        "timezone": "America/Phoenix",
        "description": "**Intro to Web Application Firewalls (WAF’s)** \\- 15\\-20 Minutes\nHave you ever wanted to know more about Web Application Firewalls? This presentation will cover key concepts and considerations.\n\n1. What is a Web Application Firewall?\n2. Benefits\n3. Case Studies/Testimonials\n4. OWASP Support - ModSecurity\n5. Ruleset Concepts\n6. Quiz - View HTTP requests/responses - block or not?\n\n**Cost**\n\nFree!\n\n**OWASP Info**\n\nOWASP is a non-profit dedicated to **application security**. Our meetings are free to attend and you do not need to be a member, nor have any experience with application security. All are welcome!\n\n**Meetings Every Month!**\n\nMeetings occur the first Tuesday of every month. Be sure to join our Meetup page to be notified of future meetings and topics.\n\n**Free Parking**\n\nFree Parking Lot:\n1 N Macdonald St, Mesa, AZ 85201\n[https://downtownmesa.com/parking/green-lot](https://downtownmesa.com/parking/green-lot)\n\nNote that this parking lot is across the street from HeatSync Labs. There are other nearby lots and street parking as well."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "AppSec Days Pacific Northwest 2024",
        "date": "2024-06-15",
        "time": "21:00-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/301184004",
        "timezone": "America/Los_Angeles",
        "description": "AppSec PNW is an annual regional conference produced by the Portland, Seattle, Vancouver, and Victoria OWASP chapters. This year it will be in Vancouver BC. (Last year it was in Portland.)\n\nOur featured speakers are [E Coleen C.](https://www.linkedin.com/in/ecoleenc/), CISO Advisor, and [Jason Haddix](https://www.linkedin.com/in/jhaddix/), CEO of Arcanum Information Security! Coleen will kick off the builder track, and Jason will launch the breaker track.\n\nAll the talks are on Saturday this year, and all the workshops on Sunday. You can find full details, including the complete schedule, at [appsecpnw.org](https://www.appsecpnw.org/schedule). Registration is on [EventBrite](https://www.eventbrite.com/e/4th-annual-owasp-appsec-days-pacific-northwest-conference-june-15-16-tickets-858457528577?aff=oddtdtcreator)."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec/OWASP-SLC - May Meetup (in person) @ Murray Park - Pavilion #4",
        "date": "2024-05-29",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/300938258",
        "timezone": "America/Denver",
        "description": "**Agenda:**\n\n1. Lunch\n2. Discussion: **AppSec AI, how to test with it, test it, and LLMs.**\n1. Mini-presentations by Justin Ellis and Seth Law\n\nTo help us plan for food, please RSVP if you're plan to be there.\n\nSee you all then!\n[ADDRESS]\nMurray Park Pavilion #4, Murray, UT 84107\nhttps://maps.app.goo.gl/QdGX5UM2eAsM23Ur7"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "AppSec Days Pacific Northwest Conference 2024",
        "date": "2024-06-15",
        "time": "08:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/301143536",
        "timezone": "America/Los_Angeles",
        "description": "Join your security community for two days of  builder and breaker content, including session talks, workshops, and a CTF.\nLearn, play, network, meet new friends, or connect with existing ones.\n\nColeeen Coolidge will open our breaker track & Jason Haddix will kick off our breaker track.\n\nFull schedule @ [https://www.appsecpnw.org/schedule](https://www.appsecpnw.org/schedule)\nTickets @ [https://bit.ly/appsecpnw2024-tickets](https://bit.ly/appsecpnw2024-tickets)\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-06-12",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300218560",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "OWASP South Florida Chapter Meeting May 2024 ",
        "date": "2024-05-29",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/300771107",
        "timezone": "America/New_York",
        "description": "We still haven't found a suitable in-person meeting venue. We'll be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.\n\nPlease join us virtually for our May 2024 Meeting.\n\nBYOB - Bring Your Own Beverage\n\n**Agenda**\n===\n\n* Chapter update/news\n* Talk by Rohini Sulatycki\n* Virtual Networking\n\n**Talk Title:** Securing the Digital Pipeline: Unveiling the Power of Software Bill of Materials (SBOM)\n**Talk Summary:** A significant increase in cyber attacks due to vulnerabilities within the supply chain has led to a heightened awareness of the security of supply chains and creating a software bill of materials (SBOM) is gaining traction as a good initial step. A SBOM is essentially the “ingredient list” that goes into the making of the software. In this talk, we will discuss:\n\n* What is an SBOM\n* The elements that make up an SBOM\n* The problems that can be solved by an SBOM\n* SBOM tooling\n* Future thoughts"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Pub evening - Summer OWASP meet up and after-work near Odenplan",
        "date": "2024-06-05",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/299591604",
        "timezone": "Europe/Stockholm",
        "description": "Time for a summer get together before we all disappear for the summer holidays . This is the perfect opportunity for all of us app-sec interested folks to get together and meet up in real life for a relaxed chat and maybe a beer or some other refreshments.\n\n When: 5th June, 2024 17:00\n Where: The Old Brewer - Public House & Dining Room at Luntmakargatan 98, 113 51 Stockholm\n\nExpect:\n Quick AppSec Tips\n Networking\n Drinks & Laughter\n\nThe meeting will start at 17:00, but it's a casual event so turn up when it suits."
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "1st OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-06-06",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/300610888",
        "timezone": "Europe/Berlin",
        "description": "**OWASP® and beyond - much more than just OWASP Top 10**\n\nOWASP is famous for the OWASP Top 10. This session will explain why the OWASP Top 10 is misused all the time. You will learn about several other OWASP projects and their potential use in your daily work. There will also be a technical demo to solve together.\n\n**Referent**: Cybersecurity Expert [Tobias Glemser](https://www.linkedin.com/in/tobias-glemser/) will host this session. In his work as a BSI-certified penetration tester and volunteering [OWASP German Chapter](https://owasp.org/www-chapter-germany/) Lead, the managing director of the IT security company https://www.secuvera.de/[secuvera](https://www.secuvera.de/) has extensive practical experience since more than 20 years.\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation (TBD)\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Surabaya",
        "repo": "www-chapter-surabaya",
        "name": "Menjadi Ahli Keamanan Siber Dengan Wazuh: Pengenalan Untuk Pemula",
        "date": "2024-05-25",
        "time": "14:00+07:00",
        "link": "https://www.meetup.com/owasp-surabaya-chapter/events/301152307",
        "timezone": "Asia/Jakarta",
        "description": "![](https://static.xx.fbcdn.net/images/emoji.php/v9/tf4/1/16/2728.png) WEBINAR \"Menjadi Ahli Keamanan Siber Dengan Wazuh: Pengenalan Untuk Pemula\" ![](https://static.xx.fbcdn.net/images/emoji.php/v9/tf4/1/16/2728.png)\nHalo sobat penggiat server Indonesia!!! ![](https://static.xx.fbcdn.net/images/emoji.php/v9/tf5/1/16/1f44b_1f3fb.png)\nYuk join dalam webinar kami yang berjudul \"Menjadi Ahli Keamanan Siber Dengan Wazuh: Pengenalan Untuk Pemula\".\nBergabunglah dalam webinar kami yang membahas sebuah panduan yang dirancang khusus bagi para pemula yang ingin mempelajari dasar-dasar keamanan siber menggunakan platform Wazuh. Panduan ini menyajikan pengenalan yang komprehensif tentang konsep keamanan siber serta bagaimana menggunakan Wazuh sebagai alat untuk memantau dan melindungi sistem dan jaringan dari ancaman keamanan.. Segera daftar dan raih kesuksesan digital!\nAyo ikuti Webinar \"Menjadi Ahli Keamanan Siber Dengan Wazuh: Pengenalan Untuk Pemula\" yang akan menjelaskan Mulai dari :\n![1⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/t7a/1/16/31_20e3.png) Pengantar Wazuh:\n\\- Apa itu Wazuh?\n\\- Manfaat menggunakan Wazuh\n\\- Kasus penggunaan umum\n![2⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/t99/1/16/32_20e3.png) Instalasi dan Konfigurasi Dasar:\n\\- Persyaratan Sistem\n\\- Langkah \\- Langkah instalasi\n\\- Konfigurasi awal\n![3⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/tb8/1/16/33_20e3.png) Dasar - dasar Monitoring dan Deteksi Ancaman:\n\\- Memahami arsitektur Wazuh\n\\- Menggunakan antarmuka pengguna\n\\- Konfigurasi agen untuk pemantauan\n![4⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/td7/1/16/34_20e3.png) Analisis Log dan Respon Insiden:\n\\- Mengumpulkan dan menganalisis log\n\\- Teknik respon insiden dasar\n\\- Studi kasus sederhana\n![5⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/tf6/1/16/35_20e3.png) Q&A dan Diskusi:\n\\- Sesi tanya jawab dengan peserta\n\\- Diskusi mengenai tantangan dan solusi praktis\n![](https://static.xx.fbcdn.net/images/emoji.php/v9/tac/1/16/1f4cc.png)Benefit :\n![1⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/t7a/1/16/31_20e3.png)Relasi yang bermanfaat\n![2⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/t99/1/16/32_20e3.png)Modul materi pelatihan\n![3⃣](https://static.xx.fbcdn.net/images/emoji.php/v9/tb8/1/16/33_20e3.png)Mendapat E-sertifikat\nJadii... tunggu apa lagi??\nYuk, segera dafarkan dirimu!\nCatat tanggal dan waktunya yaa! ![](https://static.xx.fbcdn.net/images/emoji.php/v9/t4f/1/16/1f601.png)\n![](https://static.xx.fbcdn.net/images/emoji.php/v9/tff/1/16/1f4c6.png) : Sabtu, 25 Mei 2024\n![](https://static.xx.fbcdn.net/images/emoji.php/v9/te6/1/16/1f570.png) : 14.00 WIB - Selesai\n![](https://static.xx.fbcdn.net/images/emoji.php/v9/t8c/1/16/1f4bb.png) : Zoom Meeting (link dikirim ke email peserta H-1)\n![](https://static.xx.fbcdn.net/images/emoji.php/v9/tac/1/16/1f4cc.png)Link Pendaftaran :\n[https://s.klas.or.id/PendaftaranWebinar](https://s.klas.or.id/PendaftaranWebinar?fbclid=IwZXh0bgNhZW0CMTAAAR0k0Igh9nf1DkvYF0sXoc0TwwocicnGkqAk_6kvRqB87smEZBkx-ugwtZo_aem_ASFF6AKbwHD9rZhdadl0yaPKMRi8JV44lf8CzfH44ak6p-7rqyvZe1dgTeAFGMY6Ly83KMITbkZsN5dOYgSn-Bl5)\n![](https://static.xx.fbcdn.net/images/emoji.php/v9/tac/1/16/1f4cc.png)Contact Person :\n![‍](https://static.xx.fbcdn.net/images/emoji.php/v9/t67/1/16/1f64d_1f3fb_200d_2640.png)WA: 081335732252\n(Brian)\nKami tunggu partisipasi kalian yaa![](https://static.xx.fbcdn.net/images/emoji.php/v9/t4f/1/16/1f601.png)\nKembangkan terus ilmu kalian!!![](https://static.xx.fbcdn.net/images/emoji.php/v9/tf4/1/16/2728.png)"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "OWASP Switzerland Summit: Recharge & Reconnect",
        "date": "2024-06-05",
        "time": "13:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/300958621",
        "timezone": "Europe/Zurich",
        "description": "After more than two years with only online talks, we are going physical again.\nTo celebrate this reboot, we are organizing an summit with four captivating talks and lots of opportunity for you to reconnect with your local application security community and recharge with know-how.\n\nAs this is a physical event, please be sure to only register, if you will really be there, so that we get the amount of drinks right!\n\nBut now for the **program**:\n*Startup:*\n\n* **13:15** **Doors open**: Grab a drink, meet old and new friends from the OWASP Switzerland community\n* **13:50 Welcome words** (OWASP Switzerland Leader-Team)\n\n*Talks: Recharge your know-how*\n\n* **14:00** **OWASP Mobile Application Security for Developers and Penetration Testers** (Stefan Bernhardsgrütter, Lead Security Tester @ Redguard AG)\n* **15:00 Beyond the Top 10: Limits of a finite Checklist** (Marco Schnüriger, Security Consultant @ Protect7 GmbH)\n\n*Break:*\n\n* **16:00 Break**. Reconnect with peers and refill your drinks.\n\n*Talks: Recharge with even more know-how*\n\n* **16:30 Cloud Security - more info coming soon** (Andrew Hutchison, Technical Program Manager, ISE lead @ Google)\n* **17:30 Confidential Computing** (Thomas Bosshard, Security Consultant @ Zühlke Engineering)\n\n*On the move: Join DEFCON / OWASP Switzerland warm-up beer*\n\n* **18:45 Relocate** and join the warm-up beer with our friends from Area41/DEFCON Switzerland. Enjoy the community.\n\n**Talk details:**\n\n* **OWASP Mobile Application Security for Developers and Penetration Testers**: Mobile applications are central to digital life today. To ensure that mobile e-banking, door controls, health data, personal messages and photos are secure, mobile applications should also be developed securely. As the threat model for a mobile app can differ from other kinds of applications, frameworks such as the OWASP Application Security Verification Standard (ASVS) may not cover all the relevant IT security topics.\n* **Beyond the Top 10: Limits of a Finite Checklist**: In his talk, Marco will share insights from almost two decades of experience with the OWASP Top 10. He will discuss how this checklist has advanced web application security and brought critical issues to the forefront and also to the attention of non-technical people.\nMarco will provide real-world project anecdotes to highlight the limits of the Top 10, particularly in stakeholder communication. He will explore how broader resources like OWASP ASVS and SAMM provide additional guidance and fit into the bigger picture of establishing security practices.\nThe talk will conclude with an outlook on integrating practical checklists with detailed frameworks to enhance security strategies and stakeholder understanding. This session is a must for those seeking to bridge the gap between vulnerabilities and effective communication..\n* **Cloud Security**: More info coming soon\n* **Confidential Computing**: Encryption of data at rest and in transit are two well-established and generally advisable best practices for protecting IT environments. They can be implemented leveraging a plethora of tested and proven technologies such as disk encryption and network security. But what happens when data is processed, therefore not being at rest or in transit? At this point data becomes available in memory, usually in unencrypted to allow processing. This provides a window of opportunity for attackers to gain unallowed access to the data or perform various actions on it. Mitigating some of these attack vectors is what confidential computing aims to do. In this talk I will provide a brief overview over the concepts and outline use cases and limitations. There might after all be some caveats to it..."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Application Security Pacific Northwest Conference",
        "date": "2024-06-15",
        "time": "08:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/301142469",
        "timezone": "America/Vancouver",
        "description": "You have to buy tickets for this OWASP conference, please go to the following site to register for the event:\nhttps://www.eventbrite.com/e/4th-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-858457528577"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly OWASP SAMM Community Call - June 2024",
        "date": "2024-06-12",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/300918520",
        "timezone": "America/New_York",
        "description": "Our next community call in June 12, we will cover:\n1) Welcome new community members\n2) SAMM project updates\n2) Q&A"
    }
]