[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2025-01-28",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299786143",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with Norlys.\n\nAgenda:\n**19:00 – 19:10** Welcome by Norlys and OWASP Aarhus\n**19:10 – 20:00** ”Hybridwar, critical infrastructure and resilience…” by Ken Bonefeld Nielsen\n\nGet an insight into how vulnerable modern societies are when it comes to hybrid warfare. What can we do to make critical infrastructure more resilient…\n\nKen Bonefeld Nielsen – Senior Cyber Security and Resilience Advisor at Norlys shares his many years of experience from the military and international work for organizations like Sony, Tele2, Lundbeck and Norlys\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** \"The Journey of Cyber Entrepreneurship, Community Building, and Open Source Opportunities\" by Bjarke Petersen\n\nDiscover how true innovation emerges in entrepreneurial environments, the challenges it faces, and what it takes to succeed. Explore the vision behind Cybersikker.dk, a community designed to become Denmark's leading self-help hub for IT security. The session concludes with a collaborative exploration of impactful and affordable technological solutions, emphasizing the transformative potential of open-source tools.\n\nBjarke Petersen – Serial Cyber Entrepreneur and Community Enthusiast with experience in creating businesses. Now dedicated to building a free, self-help Cyber Community to support Danish SMEs in navigating and resolving their IT security challenges."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "AI Empowerment vs. Security Risk: Navigating the AppSec Challenges of AI Agents ",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304581179",
        "timezone": "America/New_York",
        "description": "In just a short span, AI Agents and low-code development have transformed how businesses operate, allowing users without coding backgrounds to create applications, automate processes, and streamline workflows. Business users are empowered as never before, using tools that merge AI with productivity—from email and business intelligence to application development. But while these tools amplify efficiency, they also introduce new security risks that challenge the traditional boundaries of IT and AppSec.\n\nAs security teams grapple with vulnerabilities like authorization misuse, data leakage, and the risk of exfiltration, they must decide how to approach the widespread adoption of AI-driven tools and low-code platforms without stifling innovation. In this session, we’ll explore recent research into the security challenges posed by AI agents and low-code development, emphasizing the pitfalls that emerge when business users become app creators. We’ll also outline how AppSec teams can adapt their approaches to balance security with productivity, ensuring they enable the business rather than block it."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "8. OWASP Augsburg Stammtisch",
        "date": "2025-01-22",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/305388800",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda - tbd**\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n Es werden noch Speaker\\*innen gesucht!! \n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - January 2025 (Online)",
        "date": "2025-01-28",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305488934",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nJoin us for the OWASP Austin Cryptoparty and discover practical ways to protect your privacy and enhance your digital security in a fun, interactive setting! Whether you're a tech enthusiast, a professional, or just starting your journey in cybersecurity, this event offers something for everyone. Gain hands-on experience with tools and techniques, hear from engaging speakers, and connect with a community passionate about building a safer online world. Don’t miss this opportunity to level up your security know-how—mark your calendar and **bring a friend**!\n\nFeaturing:\n\n* James Wickett\n* Mark Spears\n* Rafal Los\n* Josh Sokol\n\nIf you would like to attend in person, please pull a ticket for a free lunch at Emerson/NI location in Austin --\n[https://owasp-austin-2025-january.eventbrite.com](https://owasp-austin-2025-january.eventbrite.com)"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "NULL / OWASP Bangalore Combined 25 January 2025",
        "date": "2025-01-25",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/305648411",
        "timezone": "Asia/Kolkata",
        "description": "| Name | Speaker | Start Time | End Time | Resources |\n| ---- | ------- | ---------- | -------- | --------- |\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM | |\n| Threat Modeling 101 | **Vaibhav vishal singh** | 09:40 AM | 10:10 AM | |\n| **Intro** | 10:10 AM | 10:20 AM | |\n| Hunting Dumb Cybercriminals | koushik pal | 10:20 AM | 10:50 AM | |\n| **Networking Session + Break** | 10:50 AM | 11:20 AM | |\n| ATP Methodologies | Sanskar Kashyap | 11:20 AM | 11:50 AM | |\n| 51% attack on blockchain | Darshana M Chigari | 11:50 AM | 12:20 PM | |\n| **Feedback + Next Month's Planning** | 12:20 PM | 12:35 PM | |"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- Web Security Code Review Workshop",
        "date": "2025-02-11",
        "time": "17:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/305674357",
        "timezone": "America/Los_Angeles",
        "description": "Well, the Master himself is in town, so what do we do? Organize a hacker day! :)\nWe are delighted to announce a workshop on Web Security Code Review, led by none other than **Louis Nyffenegger, Founder and CEO of Pentester Lab—yes, our favorite hacker playground!.**\nTraveling all the way from Australia, this is a fantastic opportunity to learn from the master himself.\nThank you very much Semgrep for hosting the event. This meetup is in collaboration with [pacific hackers group](https://www.pacifichackers.org/)\n\n5 PM : Doors open\n5 PM -6 PM Networking\n6-8 PM : Workshop\n\nDetails Below:\n\n**\\# Title:** Web Security Code Review Workshop\n**\\# Abstract:** Learn how to identify vulnerabilities through effective manual security code reviews. In this workshop, we’ll analyze real-world code examples, uncover common flaws like injections and authentication issues, and explore how to leverage built-in security features. You’ll gain practical skills to complement automated tools and confidently tackle security challenges in real codebases. Ideal for developers, AppSec engineers, and code reviewers, this session focuses on practical techniques and real-world impact.\n\n\\# Speaker short bio\nLouis Nyffenegger is a seasoned security engineer and the founder of PentesterLab, a platform dedicated to teaching web penetration testing and security code review. With over a decade of experience in cybersecurity, Louis has focused on penetration testing, architecture analysis, and code reviews."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "January Meet",
        "date": "2025-01-22",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/305583898",
        "timezone": "America/Los_Angeles",
        "description": "Join us on **Wed, Jan 22, 2025** at **5:30 PM** at **Blackhawk Network** for an evening of networking and learning. This in-person event is a great opportunity to connect with fellow professionals in the cybersecurity field. Don't miss out on the chance to engage with industry experts and expand your knowledge. See you there! This meetup is in collaboration with CSA-SF\n\n5.30 PM :- Gates open\n6 PM- 6.45 PM :- In a GenAI World, Only Identity Matters.\n6.45PM-7.15 PM :- Significance of IAM in Application Security\n\n**Talk#1** In a GenAI World, Only Identity Matters.\nSpeaker :- Caleb Sima\n\n**Talk#2 :** Significance of IAM in Application Security\n**Description:** The Significance of IAM in Application Security\nExplore how attack paths have evolved, highlighting common factors that contribute to identity-related risks.Understand the unique security challenges posed by evolving attacks, and discover new strategies to safeguard your workforce, IT administrators, developers, and machines.best practices to safeguard sensitive information.\n\nSpeaker :- Rohan Singla CISO Chargepoint\nMahantesh W , Staff Security Engineer, Chargepoint"
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém Açai com Dados.",
        "date": "2025-01-25",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/305591726",
        "timezone": "America/Boa_Vista",
        "description": "No dia 25 de janeiro, a **OWASP Belém** que é um dos capítulos brasileiros entre os mais de 200 capítulos ativos em todo o mundo.\n\nRealizara o primeiro meetup em conjunto com Açai com Dados , onde o tema será Dados e Inteligência Artificial, onde exploraremos insights, desafios e inovações no mundo da tecnologia. Será uma oportunidade incrível para conhecer os desafios e oportunidades no uso de dados no universo da IA, com muita troca de conhecimento, conexões e networking.\n\nNosso objetivo é disseminar a missão da OWASP, tornando a segurança das aplicações visível, para que as pessoas e organizações possam tomar decisões conscientes sobre os verdadeiros riscos de segurança das aplicações.\n\n**Data:** 25/01/2025\n\n* **Horário:** 8h30m.\n* **Local:** Estácio FAP\n* **Endereço**: R. Municipalidade, 839, Belém, PA.\n\nConfira a programação:\n**08h30m:** Abertura\n**09h00:** Apresentação OWASP\n**09h15 - 09h45:** Em breve.\n**10h - 10h45:** Em breve\\*\\*.\\*\\*\n**10h45 - 11h00:** Intervalo / Networking\n**11h15 - 11h45:** Em breve."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Jan 2k25 Chapter Meet-up with Mini CTF",
        "date": "2025-01-31",
        "time": "11:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/305453272",
        "timezone": "Asia/Kolkata",
        "description": "Join us for the OWASP Bhopal Chapter Meetup to explore the latest trends in Cybersecurity. Our event will focus on topics such as Computer Security, Application Security, Penetration Testing, and Web Application Security. Dive deep into discussions on Software Security and Web Technology, while staying updated on Information Security best practices.\n\nThis meetup will also include interactive sessions on Capture the Flag challenges and Machine Learning applications in cybersecurity. Whether you are a seasoned professional or a newbie in the field, this event is a great opportunity to network with fellow enthusiasts and learn from industry experts. Don't miss out on this chance to enhance your knowledge and skills in the ever-evolving realm of cybersecurity."
    },
    {
        "group": "Bogota",
        "repo": "www-chapter-bogota",
        "name": "Asado Owasp Bogota - Inicio 2025",
        "date": "2025-01-25",
        "time": "13:30-05:00",
        "link": "https://www.meetup.com/owasp-bogota-meetup-group/events/305717888",
        "timezone": "America/Bogota",
        "description": "Encuentro inicial para arrancar el 2025\nNetworking, beber, comer, planear lo que viene para el grupo este 2025 y hablar de Hacking.\nIncluye Carne + Papas + 2 Cervezas\nCharla de **Juan Wilches** (Pwn de un dummy para dummies)\nPara confirmar su asistencia es necesario consignar el valor de 40.000:\nNequi\n3057067139\nConserve el pantallazo de su transferencia"
    },
    {
        "group": "Boulder",
        "repo": "www-chapter-boulder",
        "name": "Boulder OWASP January 2025 Meetup: A Web CTF for Everyone",
        "date": "2025-01-22",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-boulder/events/305589815",
        "timezone": "America/Denver",
        "description": "Boulder OWASP is back for 2025 and looking forward to welcoming everyone! We’ll be changing our format this month to a more hands-on approach to Application Security with a Capture the Flag event. Whether you’re an experienced Application Penetration Tester or brand new for the AppSec world, there will be something for everyone.\n\nOWASP Boulder’s own Mark Hoopes has found a truly insecure CRM application ready to be exploited. Entry level participants can explore a poorly designed authorization system and mid-level hackers will have plenty of opportunities to run SQL and JavaScript Injection attacks. For the experts, there is even a pathway to shell, but it will take some real dedication to get there.\n\nTo ensure everyone has a good time, we'll be encouraging experienced participants to team up with those who are new to web exploitation. On top of that, a walkthrough document will be available and exploit demos will be given gradually throughout the evening.\n\nBring your own laptop with an intercepting proxy (Burp, ZAP, etc.) installed to participate as an attacker, but if you’re not comfortable at that level, feel free to just bring yourself and plan to shadow, watch, and learn.\n\nInstallation instructions can be found here:\n[https://www.meristeminfosec.com/resources/boulder-ctf](https://www.meristeminfosec.com/resources/boulder-ctf)\n\nTo make sure everyone comes prepared, a Q&A session will be held on the Monday before the event at 7pm: [https://meet.google.com/ddn-zozh-ysv](https://meet.google.com/ddn-zozh-ysv)\n\nSpecial thanks to the Rule4 Team for hosting and sponsoring, we couldn't do these events without our sponsors. If you're interested in sponsoring the #1 AppSec organization and our Boulder Chapter meetings, please reach out to alex.brown@owasp.org.\n\nPlease follow us on LinkedIn: https://www.linkedin.com/company/owasp-boulder\n\nAnd join our Slack: https://join.slack.com/t/boulder-owasp/shared_invite/zt-2qnxnmmts-IQDaobNC1rcUbpaH1ip8Lg\n\n**AGENDA**\n6:00 - 6:30 Food, Drinks, Networking\n6:30 - 7:30ish CTF Time\n7:30 - 8:00 More Networking"
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland: Contrast Security Demonstration",
        "date": "2025-02-18",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/305067809",
        "timezone": "America/New_York",
        "description": "Join us on Tuesday, February 18th at Market Avenue Wine Bar for a hands-on lab demonstration with Contrast Security. The presentation will go over features and limitations of Contrasts RAST tool. This session is designed for everyone, whether you decide to participate or not.\n\nContrast is an Application Security solution used by companies like AARP, InfoSys, Citizens Bank, Snap Finance, and more."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP January Meetup",
        "date": "2025-01-23",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/305637101",
        "timezone": "America/Denver",
        "description": "Main event at 6pm will be a 1/2 an hour to an hour talk by Ishan Brown. He is a rising star at in the cyber security world and will be talking about his experiencee getting his 1st CVE late last year.\n\nAfter the talk we will have general networking and discussions until 9pm."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Authentication Demystified: Basic Auth to Web Tokens in 60 minutes",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/305318149",
        "timezone": "America/New_York",
        "description": "Welcome to 2025! Both the speaker and I are off at CodeMash in January, so we are going to start our EVERY MONTH transition in February!\n\nWe'll start off with a few highlights related to what is new in the world of appsec, and have a good-of-the-order style chat about the year, and then ... Have you ever searched for \"how to authenticate an API call\" and been confused by the dizzying array of techniques, terminology, jargon, and acronyms that come back?\n\nThis session is designed for anyone that's struggling to make sense of modern authentication options. You'll learn the differences between OAuth, API Keys, HMAC, JSON Web Tokens (JWT), SAML, OpenID Connect, and passkeys using Webauthn. Each technique will be explained in a clear, practical, easy-to-understand way.\n\nThis session focuses on core concepts, not code, and is accessible to anyone that works with technology."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Janvier 2025",
        "date": "2025-01-23",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/305516216",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **Renault Digital** que nous remercions chaleureusement de leur soutien.\n\nPour des raisons de sécurité, une ***pièce d'identité*** vous sera demandée pour accéder à l'évènement.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Meeting ",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242794",
        "timezone": "America/New_York",
        "description": "Introduction to OWASP projects. New Members drive."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Meeting ",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242793",
        "timezone": "America/New_York",
        "description": "Monthly local meetup to discuss security related topics."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "API Security Meetup",
        "date": "2025-01-24",
        "time": "15:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/305627312",
        "timezone": "Asia/Jakarta",
        "description": "\"API Security Meetup\"\nSession type : Online/zoom\nTime : 2 Hour\n\n1\\. Topic: \"Unlock the Secrets of API Security: APIs Hacking Session You Can't Miss\\!\"\nTime: Jan 24, 2025 15:00 - 16:00 PM Jakarta\nAbstract :\nAPIs are the backbone of modern applications, but are they secure? In this session, we’ll explore how hackers exploit API vulnerabilities and learn key techniques to safeguard them. Whether you're a developer, tester, or security enthusiast, this session will give you practical insights into API hacking and protection strategies.\nnotes : Deliver in English\n\nConnect with Speaker:\n\nFadi Al-Aswadi\nWith over 15 years of experience in penetration testing and ethical hacking, I specialize in securing web, mobile, and API applications. Since 2009, I have been providing advanced cybersecurity solutions to clients across various industries. I am also the co-founder of PT Dynamic Solutions Group Indonesia, where we deliver innovative IT governance and cybersecurity services, helping organizations strengthen their digital defenses and achieve operational excellence.\n\n2\\. Strengthening API Security: Exploring Vulnerabilities\\, Risks\\, and Best Practices\nTime: Jan 24, 2025 16:00 - 17:00 PM Jakarta\nAbstract:\nAPIs are essential to modern software, but they also introduce security risks if not properly protected. This seminar will discuss the API Security Scanner, a research project designed to identify and fix vulnerabilities in APIs. It will also cover the OWASP Top 10 API Security Risks, highlighting common issues like broken authentication and excessive data exposure. Lastly, participants will learn Secure Coding Best Practices to create safer APIs, such as proper input validation and strong authentication. This session aims to help developers and security teams build secure APIs and protect their applications from threats.\n\nConnect with Speaker:\nDr. Semi Yulianto, S.E, M. Kom, CISSP, CSSLP, CISA, CISM, SecurityX\nShort Bio:\nhttps://drive.google.com/file/d/135b2REZ3QpRen1bUzzoTIhrFeJlZNV7h/view?usp=sharing\nLinkedin :\nhttps://www.linkedin.com/in/semiyulianto\n\nJoin Zoom Meeting\nhttps://us06web.zoom.us/j/81911856693?pwd=Zzs0enbXCep9gQLSKbve7yxb9Qynz3.1\n\nMeeting ID: 819 1185 6693\nPasscode: 686805"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Um hacker no seu bolso",
        "date": "2025-01-29",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/305527548",
        "timezone": "America/Fortaleza",
        "description": "Marcos Tulio e Anderson Peixoto irão apresentar uma análise detalhada do OWASP Top 10 Mobile, explorando os principais riscos associados a aplicações móveis. Durante a exposição, farão uma abordagem mais aprofundada em tópicos específicos, destacando os cenários mais críticos. Ao final, realizarão uma demonstração prática de análise de segurança em aplicações móveis, ilustrando como atacantes exploram vulnerabilidades para obter privilégios na aplicação e até mesmo no sistema operacional. Por fim, compartilharão as melhores práticas e recomendações para mitigar as vulnerabilidades identificadas, promovendo a segurança no desenvolvimento de aplicativos móveis."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JAN 29, 2025",
        "date": "2025-01-29",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/305489048",
        "timezone": "America/Los_Angeles",
        "description": "**/\\*\\* Updated Meeting Date \\*\\*/**\n**TOPIC**: TBA\nJoin us for great networking, dinner and drinks, and see a presentation by\n\n**ABSTRACT**:\nTBA\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Secure Coding Tournament with Security Journey",
        "date": "2025-01-22",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885971",
        "timezone": "America/Chicago",
        "description": "We'll have a coding game to play from Security Journey! Supported languages are:\n\n* Ruby\n* Python\n* Java\n* Javascript\n* C#"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "February 2025 OWASP Chapter Netherlands Meetup",
        "date": "2025-02-13",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/305251997",
        "timezone": "Europe/Amsterdam",
        "description": "See [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **The AI Who Shagged Me!** by **Ali Abdollahi**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Behind the Breach: Understanding and Preventing Web Vulnerabilities** by **Mitchel Koster**\n\n**The AI Who Shagged Me!**\n*Abstract:*\nIn today’s ever-changing world of cybersecurity, bringing AI into red teaming exercises is an exciting way to boost how we assess our organizational defenses. This approach fits well with frameworks like TIBER, which focus on creating realistic simulations of cyber threats. It’s all about making our defenses stronger and more effective! AI algorithms effectively analyze large datasets to identify emerging threats and tactics, aiding in realistic attack simulations. AI-driven tools help replicate complex attacks, providing red teams with thorough assessments of security measures. Using AI-generated anomalies enhances detection capabilities and strengthens incident response plans. However, the integration of AI into red teaming is not without challenges. This discussion aims to provide a nuanced overview of the application of AI in red teaming exercises, examining its potential benefits and limitations within established frameworks like TIBER. By critically evaluating this integration, we can better understand how to harness AI’s capabilities to strengthen cybersecurity offense and defense.\n*Bio:*\nAli is a cybersecurity researcher with over 12 years of experience. Currently, he is the application and offensive security manager at Canon EMEA. He studied computer engineering, published articles, and holds several professional certificates. Ali is a Microsoft MVP and regular speaker or trainer at industry conferences and events.\n\n**Behind the Breach: Understanding and Preventing Web Vulnerabilities**\n*Abstract:*\n“Behind the Breach: Understanding and Preventing Web Vulnerabilities delves into the transformation of modern web applications and architecture, showcasing how advancements in frameworks and browser technologies have revolutionized security. Yet, even with these innovations, attackers persist in uncovering and exploiting vulnerabilities. Drawing from real-world case studies across industries—from agile startups to global enterprises—this presentation not only demonstrates how a deeper understanding of security can thwart these threats, but also highlights how effectively conveying the potential impact of vulnerabilities is key to prioritizing security efforts.”\n*Bio:*\nMitchel Koster is the Chief Security Researcher at Breachlock, where he leads the development of new security products and conducts research and engagements for high-profile clients. His work includes Red and Purple Team exercises and addressing custom security requirements across diverse sectors, including Aviation and Healthcare. With a background in computer science, embedded systems, and programming, Mitchel bridges the gap between modern software development practices and robust security measures.\n\nFor parking, there’s a (paid) parking space less than 5 minutes away at the Q-Park Hermitage. ([ https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88](https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88) )\n\nAlso a 5 minute walk is the Zaandam station. ([ https://maps.app.goo.gl/3emKrp4ygx41SoN67](https://maps.app.goo.gl/3emKrp4ygx41SoN67) )"
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle February 2025",
        "date": "2025-02-19",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/305613479",
        "timezone": "Europe/London",
        "description": "We're back with our first event of 2025! We’ll be doing our usual two talks and pizza format.\n\nLocation: Opencast Software, Unit 2, The Kiln, Hoults Yard, Newcastle‑upon‑Tyne NE6 1AB.\nThere is free onsite registered parking. To register, attendees must enter their details into an iPad upon entering the Opencast office otherwise a parking fine may be issued.\nNeither OWASP Newcastle or Opencast can assist with or be responsible for parking issues, you do so at your own risk.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1830 OWASP Newcastle Welcome\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk one\n**Title:** Harassed by Hamas: Israel’s Cyberwar\n**Speaker:** Andy Pannell\n**Speaker Bio:** Andy Pannell is an accomplished application security lead with a keen focus on safeguarding product and cloud security for a prominent mobile ride-hailing company. His expertise lies in identifying vulnerabilities, implementing robust security measures, and ensuring the integrity of critical systems.\nOutside the digital realm, Andy indulges in a passion that balances the binary code: endurance racing. Andy spends hours at racetracks, appreciating the symphony of precision engineering and adrenaline-fueled competition.\n**Talk Synopsis:** This presentation examines (in my opinion) one of the most recently overused phrases in the media “cyber war”, and what it actually means in reality for us cyber security practitioners.\nWe will start by examining warfare, and review previous nation states attacks that have crossed the boundary into offensive cyber operations.\nWe will then focus on October 2023 and the tactics deployed by both Hamas and the IDF during the war, from a cyber perspective. To do this we will discuss reverse engineering malware samples, API security and DDoS attacks in detail.\nLastly we will conclude by looking at what the future of cyber warfare looks like, and what we can do to best protect ourselves / our organisations in such events.\n\nTalk two\n**Title:** Scaling Security Through Collaboration: The Role of Security Champions in Modern Organisations.\n**Speaker:** Kimberley Graham\n**Speaker Bio:** Kimberley is the Manager of People-Centered Security at Sage, headquartered in Newcastle. She is responsible for promoting and championing security within Sage.\n**Talk Synopsis:** TBC\n\nThere is a capacity limit on the venue so ticket numbers for the event have been restricted so please cancel your ticket if you are unable to attend.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The State of Secure Coding: Talk + Hands-On Tournament",
        "date": "2025-01-30",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/305300856",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, January 27th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**The State of Secure Coding: Talk + Hands-On Tournament**\nIn this talk, we will explore the current state of secure coding, focusing on common vulnerabilities and pitfalls developers face today. Drawing from the OWASP Top 10, the session highlights real-world examples of flawed code and their potential risks. Attendees will gain practical insights into better coding standards and participate in a hands-on workshop to learn how to identify and fix these issues effectively. By the end, participants will be equipped with actionable techniques to create more secure and resilient applications.\n\n**Thanks to our Sponsor Cycode!**\nCycode enables companies to deliver software fast without compromising on security. Cycode delivers a complete Application Security Posture Management (ASPM) platform that can replace existing testing tools or integrate with them while providing visibility, prioritization, and remediation of vulnerabilities at scale.\n\nCheck them out at: https://cycode.com"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-02-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181943",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2025-01-30",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/304844725",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "OWASP Philly 2025 Bootstrap",
        "date": "2025-01-28",
        "time": "19:30-05:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/305684772",
        "timezone": "America/New_York",
        "description": "Dear Friends -\n\nNew year, new OWASP Philly? Well yes, but don’t worry - a lot of things will stay the same (and be better!). 2024 was foundational for us, and affirmed how great of a community we have, which we love to be a part of.\n\nSo please join us in this first meeting of 2025, as we chart our course for new horizons and evaluate our place and role in the community. This meeting will be our first social, along with a \\~30min discussion of OWASP projects and structure, with lots of opportunity for input and feedback. We’ll also have an intro for some of our new leadership members, discuss the great benefits of OWASP and membership, and look at the volunteer roles and opportunities we have coming up.\n\nAnd if nothing else, come warm your bones and talk security-shop with some old friends and new! Lite refreshments with heavy good times will be provided at the place we meet - upstairs at the Black Sheep - 730PM.\n\nSee you there!\nHiggs"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - In-person Meetup (@HealthEquity)",
        "date": "2025-01-22",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/305384600",
        "timezone": "America/Denver",
        "description": "Hi All, first Wasatch AppSec/ OWASP-SLC event of the year!\n\nWe'll be meeting in person at the **HealthEquity** Office building in Draper for lunch. We'll discuss one of the great books on the topic of Application Security.\n\nHelp us plan for food via RSVP.\nSee you there!\n\n**Agenda**:\n\n1. Introductions/Admin\n2. Discussion Topic: Alice and Bob Learn Application Security, By: Tanya Janca -- Discussion Lead: [@Derek McGhie](https://wasatchappsec.slack.com/team/U05G9FYQ415)\n\n**Location:**\nHealthEquity\n[121 W Scenic Pointe Dr](https://www.google.com/maps/search/?api=1&query=40.479885%2C%20-111.89508)\nHow to find us\nThe building closest to the freeway. Come to the front desk and let them know you're attending the OWASP Meetup. They'll direct you to the conference room."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-02-12",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349991",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sofia",
        "repo": "www-chapter-sofia",
        "name": "OWASP Sofia - January 2025 Meetup",
        "date": "2025-01-31",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-sofia-chapter/events/305741781",
        "timezone": "Europe/Sofia",
        "description": "Добре дошли в месечната ни сбирка на OWASP Sofia!\n\nWelcome back to the OWASP Sofia Meetup! This event will also be in Bulgarian. We will do English-speaking events as soon as we have some international speakers.\n\nЗапочваме новата година с първото събитие на живо, на което колегите и приятелите от [Amatas](https://amatas.com/) ще ни запознаят с иновативни и интересни методи и подходи за тестване и експлоатиране на активна директория и мрежови протоколи. Домакини на събитието ще бъдат [ЕЦИХ Тракия](https://dihtrakia.org/) и Тех Парк София.\n\n**Програма за 31 Януари 2025**\n\n* 19:00 - Начало и въведение - Миглен Евлогиев @ [Payhawk](https://payhawk.com/trust)\n* 19:10 - Кратко представяне на [ЕЦИХ Тракия](https://dihtrakia.org/) - [Христиан Даскалов](https://www.linkedin.com/in/hristian/)\n* 19:15 - [Петър Джалев](https://www.linkedin.com/in/pdjalaliev/) @ [Amatas](https://amatas.com/) \\- Exploiting and Pentesting SNMP\n* 20:00 - [Любен Петров](https://www.linkedin.com/in/lyuben-petrov-b287bb236/) @ [Amatas](https://amatas.com/) \\- Active Directory Exploitation\n* 20:45 - Q&A / Networking\n* 22:00 - Закриване\n\nСъбитието ще се проведе на живо в зала [The Venue в Тех Парк София](https://sofiatech.bg/en/venue/the-venue-incubator/). Ако желаете да споделите нещо интересно свързани с Уеб Сигурност, моля изпратете ни вашата сесия на [https://sessionize.com/owasp-sofia/](https://sessionize.com/owasp-sofia/)\n\nЗа следващите ни събития планираме да ги организираме на място, за целта си търсим желаещи хост компании, пишете ни ако имате интерес!"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "4th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-02-11",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584148",
        "timezone": "Europe/Berlin",
        "description": "**AI Security & Insights into OWASP Top 10 LLM**\n\nAs artificial intelligence systems become increasingly integrated into our daily lives, the importance of securing these systems grows exponentially. This keynote introduces the core principles of AI security, highlighting the unique challenges and risks posed by large language models (LLMs). Explore the recently introduced OWASP Top 10 for LLMs—a comprehensive framework that identifies the most critical vulnerabilities and provides actionable guidance for securing AI applications. We'll finish with an oversight of all the initiatives at the OWASP Top 10 LLM community.\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "OWASP Switzerland Community Meetup, February 2025",
        "date": "2025-02-19",
        "time": "17:10+01:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/305296964",
        "timezone": "Europe/Zurich",
        "description": "Join us at the OWASP Switzerland Community Meetup to kick off the year 2025! This meetup will feature two exciting talks on application security. It’s a fantastic opportunity to network with like-minded professionals, exchange ideas, and expand your knowledge in a friendly and collaborative environment.\n\n**Program:**\n**17:10** - **Doors open**: Grab a drink, meet old and new friends from the OWASP Switzerland community\n\n**17:35** - **Uninstallable by Design**: The Role of Pre-installed Apps in Android’s Security Landscape - (Thomas Sutter, PhD Student @ University of Bern)\n\n**18:30** - **Coffee Break**\n\n**18:45** - **Continuous Security with DevSecOps**: How Platform Engineering Transforms Modern Application Security​ - (Romano Roth, Chief of DevOps / Partner @ Zühlke)\n\n**19:40 - 20:10 - Drinks, Fingerfood and Networking:** Grab a bite and chat with old and new friends\n\n**Talk details:**\n\n* **Uninstallable by Design - by Thomas Sutter**: The competitive smartphone market is keen to prevent its intellectual property from being analysed by competitors and the public. As a result, most smartphones are locked when distributed, and anti-reversing techniques are widely used. Consequently, millions of users use smartphones daily without a clear understanding of the software’s functionality and purpose. To lower the bar for security researcher to analyze Android firmware, we developed a novel framework, called FirmwareDroid. In this talk, we discuss the challenges to automate the process of analyzing Android firmware and showcase how we use FirmwareDroid to analyse pre-installed Android apps in academia.\n* **Continuous Security with DevSecOps - by Romano Roth:** Security must be seamlessly integrated into every stage of the software development lifecycle. This talk explores how combining DevSecOps principles with Platform Engineering empowers teams through automation, standardized environments, and reduced complexity. Learn how these approaches transform application security into a proactive, scalable, and collaborative enabler for delivering secure, high-quality software at speed."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-Jan Lunch and Learn",
        "date": "2025-01-24",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/305346191",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-Jan Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\\- 11:00am \\- Registration and Lunch\n\\- 12:00pm \\- Speaker \\- Eaton Zveare \\- API Security Blunders: Tales from the Cyber Trenches\n\\- 1:00pm \\- Depart\n\n**Speaker**:\nEaton is a security researcher at Traceable. As a member of Traceable's ASPEN Labs team, he has contributed to the security of some of the world's largest organizations by finding and responsibly disclosing many critical vulnerabilities. He is best known for his high-profile security disclosures in the automotive space.\n\n**Abstract**:\n**API Security Blunders: Tales from the Cyber Trenches**\nDive into API Security by dissecting real-world API vulnerabilities that have caused security breaches. We'll guide you through the process of hunting for such vulnerabilities, and provide insights to effectively defend against such attacks.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W,\nSTE 600\nTampa, FL\n33607\n\n**Sponsors**:\nTraceable - [https://www.traceable.ai/](https://www.traceable.ai/)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Modern AppSec Requires a Modern Approach",
        "date": "2025-01-22",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-toronto/events/305601912",
        "timezone": "America/Toronto",
        "description": "**Format**:\nHybrid (in-person and online)\n\n**In-person location**:\n123 Edward St, Suite 205 (2nd Floor), Toronto, ON, Toronto, ON M5G 1E2\n\n**Talk**:\n**Modern AppSec Requires a Modern Approach**\n\nAs organizations increasingly adopt microservices and serverless architectures, understanding and securing their environments becomes more complex. AppSec teams navigating distributed environments often are dealing with disjointed efforts—developers rushing to patch but not knowing where to start, detection teams crafting exploit rules that could be passed, and threat hunters investigating past compromises—potentially leaving current critical vulnerabilities unaddressed. Teams need a way to connect the dots from when an application is launched to when it’s being attacked. Enter tracing. Tracing requests, enables organizations to quickly identify the source of an attack, mitigate its impact, and enforce necessary measures to prevent additional impact, and provide the needed context to patch. Incorporating tracing can remove the challenges found in distributed applications. In this session, you'll learn:\n\n* What application traces are and how to use them\n* How tracing can be used to investigate and detect attacks\n* Why tracing enhances application security efforts"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-02-20",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510162",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Extra OWASP SAMM community call Europe - Asia",
        "date": "2025-02-14",
        "time": "08:00-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/305496638",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call on 10th January @ 14.00 CET. This is not a replacement of the regular community call, but an extra one we’ve scheduled during a more friendly time for users in EU and Asia. Bring your SAMM questions and we’ll discuss them! We'll also share project updates."
    }
]