[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - August",
        "date": "2025-08-19",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/303407308",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with Stibo Systems. By signing up, you consent to us sharing your name with Stibo Systems solely for the purpose of visitor pass registration.\n\n**Agenda:**\n19:00 – 19:10 Welcome by Stibo Systems and OWASP Aarhus\n\n19:15 – 19:45 To be announced later\n\n19:45 – 20:30 Networking break including light food and soft drinks\n\n20:30 – 21:25 \"Rejsen i OS2-fællesskabet (os2.eu) fra leverandørstyret og tillidsbaserede leverancemønstre, til ønsket om en øget ensartet og datadrevet transparens og automatisering på produkternes sikkerhed\" af Enterprise Arkitekt i OS2-fællesskabet Jan Maack Kjerbye og Sekretariatschef Rasmus Frey\n\nPlease, note that this presentation is in Danish."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2025 (Online)",
        "date": "2025-08-26",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489310",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n(To Be updated)"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "August 2025 OWASP Happy Hour sponsored by IriusRisk",
        "date": "2025-08-14",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/309774138",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, August 14th , 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** IriusRisk\n[iriusrisk.com](http://iriusrisk.com/)\n*We make secure design the standard, scalable practice for all digital teams. IriusRisk makes secure design fast, reliable and accessible, even to non-security users, thanks to our automated and intelligent Threat Modeling Solution*"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "Threat Modeling and Agentic AI Security",
        "date": "2025-08-09",
        "time": "12:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/310335503",
        "timezone": "Africa/Cairo",
        "description": "We’re excited to invite you to our next meetup, where we’ll explore how to design secure systems and navigate the risks of emerging AI technologies. Two speakers, two practical talks, and plenty of insights to take away.\n\n‍ Speakers & Sessions\n\n Khaled Alaa Battah\nTalk: Threat Modeling: Thinking How to Secure Your App from the Start\nWhat it’s about:\nKhaled will share how to approach application security from the ground up using threat modeling. You’ll learn how to think like an attacker, identify risks early in the design phase, and build more secure systems before any code is written.\n\n Ahmed Abdallah\nTalk: Agentic AI — Threats and Mitigations Guide\nWhat it’s about:\nAhmed will break down the unique risks posed by Agentic AI systems and walk us through practical ways to mitigate them. From misuse scenarios to safeguards and design tips, this session will help you stay ahead of the challenges shaping the future of autonomous AI.\n\n Event Details\n Date: Saturday, August 10, 2025\n Time: 12:00 PM\n Location: TBA\n\nWhether you’re working in development, security, or AI research, this session is packed with relevant insights.\nBring your questions, join the discussion, and let’s learn together.\n\n#OWASPCairo #CyberSecurity #ThreatModeling #AgenticAI #SecureDesign #AIandSecurity #LLMSecurity"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Patch Management 101: The Basics",
        "date": "2025-08-21",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/308650622",
        "timezone": "America/New_York",
        "description": "End of summer is the best time to get your systems updated before the busy season! Even better if use this time to organize the process of Patch Management for continuous improvement. This August, we discuss:\n\n\\- How to organize Patch Management\n\\- The Risk/Reward ratio of Patch Management\n\\- How hackers exploit issues related to Patch Management\n\\- How to effectively gather data for Patch Management using AI\n\nJoin us at OWASP Columbus to realistically discuss the methods to decrease the technical debt of Patch Management that most of us are responsible for."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP August In-Person Meet - Vibe Coding Meets AppSec",
        "date": "2025-08-28",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/310414265",
        "timezone": "America/Chicago",
        "description": "With the era of “vibe coding” taking off, where speed and fluidity drive software delivery, Static Application Security Testing (SAST) faces a rising challenge: managing false positives without slowing the pace. Striking the right balance between catching real vulnerabilities and avoiding wasted time on non-issues is key.\n\nIn this session, we’ll explore why false positives occur, the trade-offs that cause them, and how context shapes what’s truly risky—especially when rapid, iterative coding styles are in play.\n\nThrough practical, real-world scenarios, we’ll cover:\n\n\\- The FP/FN trade\\-off and why chasing zero false positives can introduce other risks\\.\n\\- The three core drivers of false positives: algorithms\\, rules\\, and context\\.\n\\- How risk appetite and environmental context change the definition of a vulnerability\\.\n\\- Strategies for prioritizing\\, triaging\\, and reducing noise without slowing momentum\\.\n\nBy the end of the session, you’ll have a clearer perspective on why fully eliminating false positives is rarely practical - and how to manage them so SAST remains a trusted safeguard in fast-moving development workflows."
    },
    {
        "group": "Dhaka",
        "repo": "www-chapter-dhaka",
        "name": "Secure Coding Practices: Building Security into Every Line of Code",
        "date": "2025-08-16",
        "time": "19:30+06:00",
        "link": "https://www.meetup.com/owasp-dhaka-chapter/events/310368415",
        "timezone": "Asia/Dhaka",
        "description": "**Join us for an engaging session hosted by OWASP Dhaka Chapter, titled *\"Secure Coding Practices: Building Security into Every Line of Code.\"***\n\nIn this meetup, we’ll explore how developers, testers, and security professionals can embed security directly into the software development lifecycle. Moving beyond theory, this session will cover essential secure coding principles, real-world coding flaws, and practical approaches aligned with the OWASP Top 10 and ASVS standards.\nBuilding on the success of past events like *“OWASP Mobile Application Security Risk”* and *“Strengthening Software Quality Assurance for Robust Software Security,”* this session is designed to empower attendees with actionable insights and hands-on techniques to prevent common vulnerabilities at the source.\nWhether you're a software developer, security engineer, QA professional, or simply passionate about building secure systems, this event is a great opportunity to:\n\n* Learn secure coding techniques from real-world examples\n* Understand how to integrate security into your SDLC\n* Explore open-source tools and automation practices for secure development\n* Network with cybersecurity professionals and OWASP community members\n\n**Don’t miss this opportunity to strengthen your coding practices, secure your applications, and be part of the OWASP Dhaka Chapter’s mission to build a safer digital world—one line of code at a time.**"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston TX Chapter Study Group - Power up with PowerShell",
        "date": "2025-08-27",
        "time": "19:15-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/309131427",
        "timezone": "America/Chicago",
        "description": "This weekly one hour study group series is designed to help you learn how to use Windows PowerShell 5.1 and cross-platform PowerShell 7.x.\n\nThe focus will be on real world scenarios and learning by doing. The first sessions will focus on Windows but later sessions will cover 7.x on Linux.\n\nSince 5.1 is the default on Windows servers, we will start there. The primary IDE will be VS Code as it is the officially supported current PowerShell editor. Since you can't normally install it on production servers, though, running and debugging scripts in it will also be covered as it overcomes the \"it works on my system\" issue."
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston TX Chapter Study Group - Power up with PowerShell",
        "date": "2025-08-20",
        "time": "19:15-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/309131426",
        "timezone": "America/Chicago",
        "description": "This weekly one hour study group series is designed to help you learn how to use Windows PowerShell 5.1 and cross-platform PowerShell 7.x.\n\nThe focus will be on real world scenarios and learning by doing. The first sessions will focus on Windows but later sessions will cover 7.x on Linux.\n\nSince 5.1 is the default on Windows servers, we will start there. The primary IDE will be VS Code as it is the officially supported current PowerShell editor. Since you can't normally install it on production servers, though, running and debugging scripts in it will also be covered as it overcomes the \"it works on my system\" issue."
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston TX Chapter Study Group - Power up with PowerShell",
        "date": "2025-08-13",
        "time": "19:15-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/309131424",
        "timezone": "America/Chicago",
        "description": "This weekly one hour study group series is designed to help you learn how to use Windows PowerShell 5.1 and cross-platform PowerShell 7.x.\n\nThe focus will be on real world scenarios and learning by doing. The first sessions will focus on Windows but later sessions will cover 7.x on Linux.\n\nSince 5.1 is the default on Windows servers, we will start there. The primary IDE will be VS Code as it is the officially supported current PowerShell editor. Since you can't normally install it on production servers, though, running and debugging scripts in it will also be covered as it overcomes the \"it works on my system\" issue."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Jax Monthly Meetup",
        "date": "2025-08-18",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/309788238",
        "timezone": "America/New_York",
        "description": "This is a placeholder event while we confirm this month's speaker. Stay tuned for updates, we'll share details as soon as they're locked in!\n\nInterested in presenting or know someone who might be? Reach out, we're always looking for speakers!"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Explorando APPSEC Com Debian",
        "date": "2025-08-15",
        "time": "18:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/310406103",
        "timezone": "America/Fortaleza",
        "description": "Explorando APPSEC com Debian: Um guia prático usando os laboratórios Open Source da OWASP.\n\nPara mais informações:\n[https://www.debiandayjp.org/](https://www.debiandayjp.org/)\n\nInscrições do evento:\n[https://www.sympla.com.br/evento/debian-day-joao-pessoa-2025/3043291](https://www.sympla.com.br/evento/debian-day-joao-pessoa-2025/3043291/)"
    },
    {
        "group": "Klagenfurt",
        "repo": "www-chapter-klagenfurt",
        "name": "OWASP Klagenfurt Chapter Meetup #5",
        "date": "2025-08-14",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-klagenfurt-chapter/events/309980703",
        "timezone": "Europe/Vienna",
        "description": "**OWASP Klagenfurt – Summer Edition Meetup** \n\n**Location: TBC (Makerspace or Business Beach @ Strandbad Loretto)**\n\nJoin us for a relaxed summer meetup with fresh insights and great discussions!\n\n**Topics:**\n\"**Consolidating Access in the Cloud”**\nLessons learned from taming a jungle of user IDs, API keys & service accounts – with a focus on access control in IBM Cloud.\n\n**“Introduction to Pentesting”**\nA practical look into penetration testing: what it is, why it matters, and how to get started.\n\n Stay tuned for the final location – either the Makerspace or right by the lake at Strandbad Loretto!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Aug 27, 2025",
        "date": "2025-08-27",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091958",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Conquering Castle Envy – The Flawed Mindset That’s Holding Application Security Back\nJoin us for great networking, dinner and drinks, and see a presentation by **Jeff Willams,** Co-Founder and CTO, **Contrast Security**\n\n**ABSTRACT:** Application security has spent 25 years stuck in the wrong mindset — treating software like a castle that can be fortified, inspected, and declared secure. That mental model leads to confident failure: endless scanning, training, and compliance rituals that rarely stop real threats. In this talk, we’ll re-examine AppSec’s go-to tools — threat modeling, scanning, pentesting, firewalling — through a new lens, so you can see why they keep falling short. The problem isn’t effort. It’s context. You’re trying to secure a living, breathing software city using a blueprint for a castle.\n\nWe’ll introduce a new model: Runtime Security. This isn’t theory — it’s about observing real production environments, with real users, data, connections, and threats. We’re not trying to secure a castle. Your application ecosystem is a massive, dynamic city — alive, interconnected, and always under construction. It needs monitoring, coordination, fast response, and resilience — not moats and silos. We’ll show how teams are using runtime visibility and feedback loops to focus on what matters, adapt quickly, and prove they’re making a difference. The most serious AppSec threat isn’t in your code — it’s in your head. Shift your thinking, and everything else starts to fall into place.\n\n**Thanks to our SPONSOR**: *[Contrast Security](https://www.contrastsecurity.com/)*\n*You can't stop what you can't see*\n*Application Detection and Response for Modern Enterprises*\n*Stop attacks in your applications and APIs from development to production*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP Community Room Demos & Roundtables at DEFCON 33",
        "date": "2025-08-08",
        "time": "10:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/310120193",
        "timezone": "America/Los_Angeles",
        "description": "The OWASP Community Room Demos & Roundtables at **#DEFCON33** are where the magic happens—live demos, real talk, and next-level insights\n\nCome embrace the social awkwardness in a safe space where everyone's just as nervous as you are - but also just as excited to connect in the OWASP Community room at [#defcon33](https://infosec.exchange/tags/defcon33)\nCurious? Pull up, learn, share, and connect.\nSee you in Vegas!\n\nHere are some of the highlights:\n\n**Friday Aug 8, 2025**\n10:00AM-10:30AM Access Everywhere with InfosecMap\n\n**Saturday Aug 9, 2025**\n12:00PM-1:00PM Let's Play! OWASP Cornucopia Engineers & Exploits the quest for security\n4:30PM-5:00PM Access Everywhere with InfosecMap\n5:00PM-6:00PM Secure SDLC Roundtable: Scratch the Duct Tape\n\n**Sunday Aug 10,2025**\n11:00AM-12:00PM Vibe Coding: Security Crisis or Opportunity\n\n**Pro tip**: If you’re not yet part of the [OWASP® Foundation](https://www.owasp.org) this is the perfect time to plug into one of the most active open source application security communities in the world. Local chapters like [OWASP Los Angeles](https://www.meetup.com/owasp-los-angeles/) are on the front lines of securing modern software through meetups, projects, and events like this conference. Learn more or become a member: [OWASP Membership](https://owasp.glueup.com/organization/6727/memberships/)"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "It Doesn't Have to Be That Hard: Battle of the Hardware Hacking ",
        "date": "2025-09-04",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/310249355",
        "timezone": "Europe/London",
        "description": "This September, OWASP Manchester welcomes you to two talks that smell faintly of solder, tofu, and the quiet hum of rebellion. You’re about to hear from two giants in the world of hardware hacking, people who void warranties not by accident, but as an art form: Jay Harris and Andrew Tierney.\n\nPresenting @JayHarris_Sec (aka Jahmel Harris), former ringmaster of the Manchester Grey Hats, returning to his old stomping grounds with circuits to fry and stories to tell. Alongside him, the inimitable @Cybergibbons (aka Andrew Tierney), a name whispered in reverence across teardown forums and embedded firmware Slack channels.\n\nAway from the crumbling ruins of Twitter, old legends rise again: Heroes of Hardware, Titans of Tinkering, Overlords of the Open-port. Join us as we plug in, pry open, and peer deep into the guts of the machines around us… or, you know, just learn how the masters break them?\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name when signing up to the event **AND** show photo ID when checking in to the event on the night.\n\n**As we're still dealing with a large number of no-shows, if you don't attend without releasing your ticket, we may remove you from future events.**\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**Agenda:**\n**6:00 - Open doors & networking & drinks**\n**6:30 - Talk 1**\n**7:15 - Refreshments (Food & Drinks & Networking)**\n**8:00 - Talk 2**\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBooking.com\n6 Goods Yard Street Manchester\nM3 3BG\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Jay Harris & Andrew Tierney**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Booking.com** \\- Venue Sponsor AND Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "The Dark Side of AI: Developing insecure applications in minutes!",
        "date": "2025-08-20",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/306404720",
        "timezone": "America/Chicago",
        "description": "AI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand Day",
        "date": "2025-09-02",
        "time": "08:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/304552659",
        "timezone": "Pacific/Auckland",
        "description": "In 2025, in place of our usual OWASP New Zealand Day conference event, OWASP New Zealand will be hosting the world AppSec community at **OWASP Global AppSec-New Zealand**.\n\nThis event includes a two-day conference on Thursday and Friday, preceded by a mix of half-, one-, and two--day training classes Tuesday - Wednesday.\n\nRegistration for the main conference opens on 1st April and is just $25 per person. Student registration is, as always, FREE. Training registration fees have not increased from last year, and registration will open by 1st May.\n\nThe conference's **Call for Training (CFT),** **Call for Presenters (CFP),** and **Call for Sponsors** are now open.\n\n* Call for Training: https://www.papercall.io/owaspnz25-training\n* Call for Presenters: https://www.papercall.io/owaspnz2025\n* Call for Sponsors: https://appsec.org.nz/conference/sponsorship.html"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Why you should hack your own APIs",
        "date": "2025-08-28",
        "time": "19:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/310385035",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, August 25th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Abstract**\nAPIs power virtually every web and mobile application, accounting for over 80% of all Internet traffic. And APIs are under attack. Gartner states APIs have become the “most frequent attack vector,\" resulting in hundreds of highly successful, high profile breaches. This API security presentation covers 1) why attackers love APIs, 2) real-world breaches (and how they map to the OWASP API Security Top 10), and 3) best practices to keep APIs secure.\n\n**Bio**\nDan brings over 20 years of cybersecurity experience with executive leadership roles at APIsec, Qualys, Anomali, ArcSight and others. He’s led Product Development, Sales teams, and Marketing at startups and publicly traded companies. Dan is the co-founder of APIsec University - a site that offers high quality, no cost courses on API security risks and best practices. APIsec University now has over 120,000 students, covering over 80% of the Fortune 100. Dan has earned engineering degrees from Rensselaer Polytechnic and Cornell University, and an MBA from University of Michigan."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa August 20th 2025: Fraud Detection & Security for AI Integrations",
        "date": "2025-08-20",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/310273515",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in-Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **\"Doing More with Less: An Adaptive, Label-Efficient Approach to Fraud Detection from Day One\" with Bahar Afshar**\n3. \"**Beyond APIs: MCP Security for AI Integrations\" with Harsh Makwana**\n\n**Abstracts:**\n\n***Doing More with Less: An Adaptive, Label-Efficient Approach to Fraud Detection from Day One with Bahar Afshar.***\nDetecting fraud in financial systems is like finding a needle in a haystack; fraudulent transactions are rare, labeling them is expensive, and sometimes, we don’t have any labels at all. In this talk, I’ll present a new approach that tackles these challenges by combining different learning strategies in an adaptive way. We’ll explore how to start detecting fraud even when labeled examples are extremely limited and how we can prioritize the most suspicious cases using smart, explainable tools. The goal is to make fraud detection not just more accurate but also more efficient and easier to understand for human experts. Whether you're working in cybersecurity, finance, or just curious about the future of AI-powered decision-making, this talk will offer insights into how we can do more with less when fighting financial crime.\n\n***Beyond APIs: MCP Security for AI Integrations with Harsh Makwana****.*\nThe Model Context Protocol (MCP) is rapidly becoming the standard for LLM integration with external tools and data. However, this accelerated adoption has often sidelined crucial security hardening. This talk will directly address the inherent security challenges within MCP implementations, providing essential strategies to build robust, secure AI agents.\n\n**Speakers:**\n**Bahar Emami Afshar** is in the process of completing their Master’s in Computer Science at the University of Ottawa, specializing in AI. During this time they worked under the supervision of Dr. Paula Branco and completed a research internship at H3M Analytics Inc. Their research focuses on explainable AI, anomaly detection, and label-efficient learning, with a particular emphasis on fraud detection and financial crime. Over the past year, Bahar has published several first-author papers exploring adaptive and efficient strategies for detecting fraud in low-label and imbalanced scenarios. Bahar is passionate about building intelligent systems that are more transparent, trustworthy, and impactful in real-world settings.\n\n**Harsh Makwana**, M.Eng, is an Application Security Consultant at Software Secured with over 3 years of experience in penetration testing. An alumnus of the University of Ottawa, Harsh is a general technologist with a strong interest in the advancements of both cybersecurity and industrial robotics. Outside of work, he enjoys exploring photography and illustration as creative pursuits."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Peterborough Beer Festival! ",
        "date": "2025-08-21",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916307",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Social Drinks @ The Peterborough Beer Festival!\n\n**When?**\n\n* \\- Thursday 26th August\n\nEverybody welcome! You will be required to buy your own ticket for entry. See https://pborobeerfest.camra.org.uk/.\n\nThank you,\nRyan & Mark"
    },
    {
        "group": "Reading",
        "repo": "www-chapter-reading",
        "name": "The Great British Hack Off",
        "date": "2025-08-14",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-reading-chapter/events/310271517",
        "timezone": "Europe/London",
        "description": "Put the kettle on and fire up your browser—The Great British Hack Off is here! Join OWASP Reading for an evening of hands-on hacking in the Shadow Bank cyber range, where you’ll face off against a vulnerable financial application packed with real-world exploits.\n\nWhether you’re a developer curious about appsec, a red teamer looking to sharpen your skills, or just fancy a bit of friendly competition, this event is open to all experience levels.\n\nNew to cyber ranges? No worries—guidance will be available, and the environment is designed to be safe, legal, and fun to explore.\nFeeling confident? Compete in the Gold Standard track to prove you’re top of the leaderboard.\n\nDon't forget to register in advance to secure your spot and get access to the cyber range."
    },
    {
        "group": "Ruhrpott",
        "repo": "www-chapter-ruhrpott",
        "name": "OWASP Ruhrpott Chapter Meeting - Save The Date",
        "date": "2025-09-04",
        "time": "18:30+02:00",
        "link": "https://www.meetup.com/owasp-ruhrpott-chapter/events/308971811",
        "timezone": "Europe/Berlin",
        "description": "OWASP Ruhrpott Chapter Meeting - Save The Date"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP Summer Campout",
        "date": "2025-08-15",
        "time": "16:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/308463391",
        "timezone": "America/Denver",
        "description": "Join us for our third annual campout! This time we will be in the beautiful High Uintas on the Mirror Lake Highway. This is a **chill, agenda-free campout**—just a chance to relax, connect, and enjoy the outdoors. We will be swapping our best security stories around the campfire which is much scarier than ghost stories.\n\n### What to Expect:\n\n* No presentations. No pressure. Just good company.\n* Bring your own camping gear, food, and drinks.\n* Fire pit and picnic tables available.\n* Family and kids are welcome!\n* You *won’t* have cell service, so enjoy the digital detox.\n* We will be close to both Washington and Trial lake so bring your rod and reel if you want to catch some mountain trout.\n* We will be at the tail end of the Perseid meteor shower, if it is a clear night we should have an amazing night of stargazing and shooting stars.\n\n### Logistics:\n\n* **Location:** The Washington Lake *Group Site* (not the main campground). We are at the Hoover camp site\n* There are no fees required for you, it is all paid for as part of the reservation for the campsite. You will drive past a fee station entering the national forest on the Mirror Lake Highway, but you do not need to stop.\n* Get off of the Mirror Lake Highway for Washington Lake. Follow the signs to the large group sites. There will be a gate in the road separating it from the normal campsites. You will need to open and close the gate behind you.\n* Pit toilets are available; however, there is **no water** on-site—bring what you need!\n* The road is paved all the way—no high-clearance needed.\n* We have space for 10 cars and room for room for **1 RV (max 20 feet)**.\n\nBring your hammock and marshmallows, and we’ll see you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Vibe Coding for Security",
        "date": "2025-08-21",
        "time": "15:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/310283671",
        "timezone": "America/Los_Angeles",
        "description": "Please register on the event website:\nSpace is limited!\n\nhttps://seattlesecuritymeetup.com/"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Reducing Application Security Risk with ASPM: Future-Proofing for 2025 & Beyond",
        "date": "2025-08-21",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/310318996",
        "timezone": "America/Toronto",
        "description": "**Format**:\nHybrid (in-person and online) event\n\n**In-person location**:\n**BDO Canada LLP**\n20 Wellington Street East, 5th Floor\nToronto, ON\nM5E 1C5\n\n**Note:** In-person attendance is limited to **70 people**, in a **first-come, first-serve basis**.\nDoors will open at **6:00 PM**, with the event will start at **6:30 PM** (EDT).\nFor those who cannot attend in person, please join us virtually via the livestream!\n\n**Presentation Title: Reducing Application Security Risk with ASPM: Future-Proofing for 2025 & Beyond**\nIn an era of increasingly sophisticated threat actors, application security has become a critical concern for most organizations. This talk, \"Reducing Application Security Risk with ASPM (Application Security Posture Management),\" will explore the emerging role of ASPM in fortifying application security and accelerating DevSecOps and cloud native adoption by focusing on how to future-proof your approach for 2025 and beyond.\nSoftware development has undergone seismic shifts over the last 20 years: the Agile movement, the rise of DevOps and cloud native practices, and now the AI and generative development era. With AI code assistants and “vibe coding” on the rise, we’re seeing faster delivery, along with new and complex risks. Over the last 10 years of the DevSecOps journey, shift-left has also achieved little success. Application Security needs a fundamental reset for the future. In this talk, we will discuss how modern approaches and technology innovations that are built to solve three of the biggest challenges in application security that must evolve for the AI Era – Speed, Coverage & Scale, and Context. We will explore three common scenarios:\n\n1\\. Inventory and Secure net new applications\n2\\. Reduce risk and volume of existing security backlog by prioritizing and fixing what matters\n3\\. Expand coverage to address emerging blind spots in AI\\-assisted application development\\."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "ISACA + OWASP Vancouver Social",
        "date": "2025-08-27",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510822",
        "timezone": "America/Vancouver",
        "description": "We are pleased to announce ISACA + OWASP Vancouver joint social event.\n\n**Registration here: [https://lu.ma/CyberBBQ](https://lu.ma/CyberBBQ)**\n\nOWASP members get a discounted rate. If you are an OWASP member, use your @owasp.org email address when registering. If you are not an OWASP member, consider joining: [https://owasp.glueup.com/organization/6727/memberships/](https://owasp.glueup.com/organization/6727/memberships/)"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "From Reinforcement Learning to LLMs to Reinforce",
        "date": "2025-08-20",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/309892428",
        "timezone": "America/New_York",
        "description": "**From Reinforcement Learning to LLMs to Reinforcement Fine Tuning: A Pragmatist’s Guide to AI in Application Security**\n\nAI is everywhere in marketing decks and company OKRs, but which flavors of AI actually move the needle in application security? This talk dissects how modern AI paradigms—transformers (LLMs), agents, reinforcement learning (RL), RLHF (Reinforcement Learning with Human Feedback), and the emerging RFT (Reinforcement Fine-Tuning)—map to real AppSec problems. We’ll explore which areas benefit from transformer-based reasoning, why RL has failed to disrupt AppSec, and how newer approaches may be able to improve human workflows without sacrificing explainability or trust. Leaders will walk away with a sharper mental model of which AI tools are production-ready for AppSec use cases."
    }
]