[
    {
        "group": "Abu Dhabi",
        "repo": "www-chapter-abu-dhabi",
        "name": "hello world!",
        "date": "2021-10-02",
        "time": "09:30",
        "link": "https://www.meetup.com/owasp-abu-dhabi/events/280509539/",
        "timezone": "Asia/Dubai",
        "description": "<p>Our inaugural meetup!</p> <p>We're very excited to introduce ourselves and share the vision of the chapter.</p> <p>We're also on route to have 2 highly respected industry leaders (DefCon veterans) take us though some of their latest AppSec research.</p> <p>Full schedule will be announced soon.</p> <p>Hope to see you there.</p> <p>Happy hacking!</p> <p>Ps. We're starting early to accommodate some of our awesome speakers in located all over the world.</p> "
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Variant Analysis & The Adventures of Root Cause Analysis",
        "date": "2021-10-07",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Atlanta/events/280861805/",
        "timezone": "US/Eastern",
        "description": "<p>In this talk, we'll cover the importance of Variant analysis and its impact when applied alongside Root Cause Analysis. We'll understand how improper Root Cause Analysis and Remediation, can lead to rediscovery of vulnerable code paths to supposedly remediated code. We'll also investigate the positive impact that Variant Analysis can play in an attempt to eliminate as many vulnerabilities as possible of the same class, within a given product.</p> <p>Speaker Name &amp; Title: Robert Hawes, Director of Research VS-Labs - VerSprite Security Research Team Focused on Exploit Dev.</p> <p>Speaker email: goblin@versprite.com</p> "
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Monthly Meet 09th October 2021",
        "date": "2021-10-09",
        "time": "19:00",
        "link": "https://www.meetup.com/bangalore-owasp-meetup-group/events/280751618/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Hi Everyone</p> <p>#security stay safe</p> <p>OWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.</p> <p>Sessions:<br/>Date: Saturday 09th October 2021</p> <p>Talk title:<br/>TBD</p> <p>Speaker Details:-<br/>TBD</p> "
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE - Component Analysis vs SCA (by Steven Springett)",
        "date": "2021-10-21",
        "time": "17:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/280073211/",
        "timezone": "Europe/Brussels",
        "description": "<p>On October 21st, we have scheduled Steven Springett with Component Analysis vs SCA - How SBOMs are the driving force for change.</p> <p>This chapter meeting is part of a series of virtual chapter meetings (every 3rd Thursday of the month).</p> <p>Our chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed. Registered attendees can join via Zoom, and ask questions to the speakers.</p> <p>More info on this series of chapter meetings or on the Belgium OWASP chapter can be found at <a href=\"https://owasp.org/www-chapter-belgium/\" class=\"linkified\">https://owasp.org/www-chapter-belgium/</a> .</p> "
    },
    {
        "group": "Bolivia",
        "repo": "www-chapter-bolivia",
        "name": "GRUPOS DE ESTUDIO OWASP - Burp Suite Training 2da Parte",
        "date": "2021-10-02",
        "time": "14:00",
        "link": "https://www.meetup.com/OWASP-Bolivia-Meetup-Group/events/281057691/",
        "timezone": "America/La_Paz",
        "description": "<p>Training paso a paso de BurpSuite, la herramienta más popular de pentesting web. Segunda Parte práctica con laboratorio.</p> "
    },
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "OWASP Monthly Meeting",
        "date": "2021-10-05",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Bonita-Springs-Chapter/events/280349243/",
        "timezone": "US/Eastern",
        "description": "<p>We generally review security related happenings, share tips and tricks for configuring software and hardware, and chat about various topics such as security, privacy, exploitation, vulnerabilities, pen testing, web app security, CTFs, IoT security, mobile security and anything else members wish to discuss.</p> "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC",
        "date": "2021-10-14",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/279155585/",
        "timezone": "Europe/London",
        "description": "<p>We are looking to publish on @YouTube the recordings of our meetups. If you would like to be notified when we a new video is published, please feel free to subscribe on our channel at:<br/><a href=\"https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ\" class=\"embedded\">https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ</a></p> "
    },
    {
        "group": "Charlotte",
        "repo": "www-chapter-charlotte",
        "name": "October 2021 Meetup - Topic TBA",
        "date": "2021-10-21",
        "time": "19:00",
        "link": "https://www.meetup.com/owaspCLT/events/274988455/",
        "timezone": "US/Eastern",
        "description": "<p>Topic is TBA.</p> "
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Web Socket Penetration Testing",
        "date": "2021-10-02",
        "time": "18:30",
        "link": "https://www.meetup.com/Chennai-OWASP-Meetup-Group/events/281025770/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Seasoned Security professional with 8+ years of experience in and around Managed security services, with a lot to offer. I have a passion and a knack for security mindset and constantly improving my skills on APT trends and Security Incidents. Along with an expertise in Ethical hacking, I would like to invest my time in learning International business acumen and consulting if an opportunity arises, well I believe in a constant cycle of learning and evolving</p> <p>Registration Link: <a href=\"https://forms.gle/Y9Wkf77NA3Urej7X6\" class=\"linkified\">https://forms.gle/Y9Wkf77NA3Urej7X6</a></p> "
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "Improhound Workshop + Talk",
        "date": "2021-10-05",
        "time": "17:00",
        "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/280774265/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>After almost two years we are excited to announce our first physical/hybrid event! For this evening we plan to have a workshop and a talk, and plenty of time for socializing/networking. Please reserve your seats as the space is limited and only RSVP if you are physically showing up, so we know how much pizza we should buy :)<br/>The virtual streaming will be anyways accessible to YouTube without the need to RSVP.</p> <p>17:00 - 17:10: Intro<br/>17:10 - 17:50: Talk: \"Did you just assume your product is secure?\" by Dmitry<br/>17:50 - 18:10: Talk: \"Protect your Domain Admins with tiering\" by Jonas<br/>18:10 - 18:30: Pizza and drinks will be served at ITU/ScrollBar<br/>18:30 - 20:30: ImproHound workshop, bring your own device with VMWare or VirtualBox to try the tool as described down below.</p> <p>1. Talk: Did you just assume your product is secure?<br/>People tend to assume things. I know I do. It's perfectly normal, it's how our brains evolved to work. Join me in exploring the role of assumptions in our everyday life and how that impacts the security of products we build. Or did I just assume that they do?.. Hmm.</p> <p>Dmitry started as a software engineer building a promising AAA title at an unknown game studio, and continued to be a firmware QA automation engineer and then a firmware developer. Despite that, he spent a lot of free time doing reverse engineering. All that equipped him well with knowledge and skills to start his infosec career almost 10 years ago. Now a senior consultant with the product security team at F-Secure Consulting, he provides advice on security topics to tier-1 automotive, aerospace, maritime, and industrial customers worldwide.</p> <p>2. ImproHound Workshop: Protect your Domain Admins with tiering<br/>It is not viable for system administrators and defenders in a large Active Directory (AD) environment to ensure all AD objects have only the exact permissions they need. It is too big of a task, why many organizations are vulnerable to AD attacks due to too loose or wrong permissions. At the same time, credential theft may lead to privileges AD users having their password stolen when they login to compromised computers. These vulnerabilities are chainable, why you in many AD environments can escalate your rights to Domain Admin no matter what computer or user you have.</p> <p>Microsoft realised this issue, and recommended organizations to implement the AD tier model: Split the AD into three tiers and focus on preventing attack paths leading from one tier to a more business critical tier. The concept is great, but it turns out to be rather difficult to implement the tiering concept in AD, why most organizations fail it and end up leaving security gaps..</p> <p>After this workshop, you will be able to help those organizations! And probably p0wn them..<br/>The workshop is part talk and part workshop and you will need to bring a computer with VMWare/VirtualBox to try out ImproHound. Experience with Active Directory is an advantage, but not a requirement.</p> <p>Jonas Bülow Knudsen is an Active Directory (AD) security advisor. Jonas has spent the past two years helping organizations implement technical countermeasures and remediate vulnerabilities in and around AD, including implementation of the AD tier model. Working closely together with penetration testers and having a strong interest in offensive security enables Jonas to focus on security measures that matter and not just best practice.</p> "
    },
    {
        "group": "Croatia",
        "repo": "www-chapter-croatia",
        "name": "Chapter Croatia Virtual Meetup - Typosquatting & ECSC",
        "date": "2021-10-07",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Croatia-Meetup-Group/events/281065020/",
        "timezone": "Europe/Zagreb",
        "description": "<p>Hello Everyone,</p> <p>For this quarter's OWASP Croatia meetup, we have 2 topics that will be delivered virtually (Over Google Meet):</p> <p>* Matej Lazarević: What is Typosquatting and what can we do about it?<br/>* Miroslav Štampar: ECSC (European Cyber Security Challenge)<br/>* Chill and Chat - Stay a while and chat with others from OWASP Croatia</p> <p>See you!<br/>Talk abstracts and bios follow:</p> <p>------------------<br/>Matej Lazarević: What is Typosquatting and what can we do about it?</p> <p># Summary<br/>Typosquatting is an simple and effective attack vector that relies on intentional misspelling the URL or misusing the top-level domain, often with the goal of phishing the visitor. Those URLs can be found in spam emails and forums, received via messaging apps or manually misspelled in the address bar. Although being a simple idea, typosquatting goes hand-in-hand with (spear)phishing attacks that evolved and became more efficient and harder to detect. We will analyze some tools for discovering typo squatted websites and potential malicious domains that can target our organisation or product.</p> <p># Bio<br/>Matej works as a Frontend Developer in Barrage. Besides the passion for frontend, he is interested in AppSec, often can be found poking around TryHackMe or in his room making lazy bash scripts that sometimes save 15 seconds of his life.</p> <p>------------------<br/>Miroslav Štampar: ECSC (European Cyber Security Challenge)</p> <p># Summary<br/>As a member of the organization, the speaker would like to talk about the European Cyber Security Challenge, an annual event for young cyber security talents across Europe, powered by the EU Agency for Cybersecurity. This year is taking place in Prague, Czech Republic, from 28 September to 1st October, therefore first-hand impressions will be presented, gathered at the venue. Joint national goal should be the gathering, training and sending of the young Croatian cyber security team to a competition in the not so distant future.</p> <p># Bio<br/>Miroslav Stampar is an information security expert who lives and works in Zagreb. His scientific and professional interests include research and development of systems from the vast domain of information security. He has given talks at numerous domestic and international expert conventions on information security and programming. He is author of several world-renowned free and open source applications (sqlmap, Maltrail, etc.) In free time, an active CTF player, member of an international top-tier team Super Guesser.</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP October Meeting",
        "date": "2021-10-19",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/268956961/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>Financial-grade API (FAPI)</p> <p>Description:</p> <p>Financial-grade API (FAPI) is a security framework devised by the OpenID foundation for securely using APIs specifically in the finance industry. The framework introduces more stringent security controls and strengthens the existing OAuth2 and OpenID Connect specifications. In this session Vinod will discuss various aspects of the framework and how they will address specific weaknesses in the traditional OAuth flows.</p> <p>Bio:</p> <p>Vinod Kannan is a seasoned cybersecurity professional with over 19 years of experience in cybersecurity with special interest in DevSecOps, Identity and Access Management, and Application Security. He has currently taken up the role as a Principal Consultant with Synopsys in its Software Integrity Group (SIG) and is focusing on managed security services offerings. Prior to this he has worked with Ernst &amp; Young and HPE and various financial services firms such as JPMC and Bank of America. He is passionate in learning about new developments in the cybersecurity space that enables him in presenting the right solutions to clients.</p> "
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Q4 Meetup (Placeholder)",
        "date": "2021-10-28",
        "time": "19:00",
        "link": "https://www.meetup.com/indyowasp/events/280097107/",
        "timezone": "US/Eastern",
        "description": "<p>We'll share more details closer to the event, but I'll say I'm _very_ excited about the topic!</p> "
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Online meeting ",
        "date": "2021-10-11",
        "time": "18:45",
        "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/nnccjsyccnbpb/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Writing an Effective Penetration Testing Report: An Executive View",
        "date": "2021-10-04",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/280589400/",
        "timezone": "Asia/Jakarta",
        "description": "<p>Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…<br/>• Tool dan standar keamanan aplikasi<br/>• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan<br/>• Kendali keamanan dan pustaka standar<br/>• Cabang lokal di seluruh dunia<br/>• Riset terkini<br/>• Konferensi lengkap di seluruh dunia<br/>• Mailing list<br/>• Dan banyak lagi … di www.owasp.org</p> <p>Kali ini Pak Semi Yulianto akan membahas :</p> <p>Writing an Effective Penetration Testing Report: An Executive View</p> <p>Abstract:<br/>Penetration test or pentest is a typical security assessment which is the process to gain access to specific information assets (eq. computer systems, network infrastructure, or application). Penetration test simulates the attack performed internally or externally by the attackers which have the intention to find security weaknesses or vulnerabilities and validate the potential impacts and risks should those vulnerabilities being exploited.</p> <p>Security issues found through penetration test are presented to the system’s owner, data owner or risk owner. An effective penetration test will support this information with an accurate assessment of the potential impacts to the organization and range of technical and procedural safeguards should be planned and executed to mitigate risks.</p> <p>Many penetration testers are in fact very good in technical since they have skills needed to perform all of the tests, but they are lack of report writing methodology and approach which create a very big gap in penetration testing cycle. A penetration test is useless without something tangible to give to a client or senior management. Report writing is a crucial part of any service providers (eq. IT service/advisory). A report should detail the outcome of the test and, if you are making recommendations, document the recommendations to secure any high-risk systems.</p> <p>The target audience of a penetration testing report will vary, the technical report will be read by IT or any responsible information security people while executive summary will definitely be read by the senior management.<br/>Writing an effective penetration testing report is an art that needs to be learned and to make sure that the report will deliver the right information to the targeted audience.<br/>After reading the book, you will be able to: understand on how to create a good and effective penetration testing report; understand the mechanism to provide effective deliverables; apply risk management knowledge &amp; skills and blend them in your deliverables.<br/>---<br/>Short bio :</p> <p>Semi Yulianto<br/>BSc. (Accounting), M.IT (IT Security &amp; Governance)<br/>MCT, MCDBA, MCTS, MCITP, MCSA, MCSE, MCT, CCNP, CWNA, CEH, ECSA, CHFI, ECSP, EDRP, CND, CEI, SSCP, CISSP, CSSLP, CISA, CISM, Security+, CySA+, Pentest+, CASP+, OSSA, CASE Java<br/>Co-Founder &amp; CEO, Chief Hacking Officer (CHO) of PT. Systech Global Informasi (SGI Asia).<br/>Information Security Consultant / Subject Matter Expert (SME) /Advisor at PT. Trinusa Travelindo<br/>(Traveloka.com) - until April 2019 and PT. Tiga Inti Utama (Triv.co.id) – Present.<br/>Approved InfoSec/Cybersecurity Instructor (Saudi Aramco &amp; US Military in South Korea).<br/>Information Security/Cyber Security Practitioner, Consultant &amp; Senior Technical Trainer.<br/>Email: semi.yulianto2009 [at] gmail.com<br/>linkedin : <a href=\"https://www.linkedin.com/in/semiyulianto\" class=\"linkified\">https://www.linkedin.com/in/semiyulianto</a></p> <p>Venue :<br/>Online by zoom</p> <p>Catatan :<br/>Acara Ini Free for Everyone<br/>Profil Trainer bisa di liat lebih detail di Linkedin<br/>Acara ini Di deliver dengan Bahasa Indonesia</p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-10-25",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccnbhc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Kyiv",
        "repo": "www-chapter-kyiv",
        "name": "OWASP Kyiv Fall 2021 ONLINE Meetup",
        "date": "2021-10-30",
        "time": "10:00",
        "link": "https://www.meetup.com/kyiv-meetup-group/events/279752085/",
        "timezone": "Europe/Kiev",
        "description": "<p>The fourth OWASP Kyiv chapter meetup in 2021 will be held on October 30 in the online format. The attendance is free of charge.<br/>If you want to be a speaker or present your workshop, please feel free to fill the form here: <a href=\"https://cfp.owaspukraine.org/okfall2021/cfp\" class=\"linkified\">https://cfp.owaspukraine.org/okfall2021/cfp</a></p> "
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London [ONLINE] Chapter Meeting",
        "date": "2021-10-07",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-London/events/280827238/",
        "timezone": "Europe/London",
        "description": "<p>The next OWASP London Chapter Meeting will be online. We will be Live-Streaming the event on the OWASP London YouTube Channel: <a href=\"https://www.youtube.com/OWASPLondon\" class=\"embedded\">https://www.youtube.com/OWASPLondon</a></p> <p>- please [SUBSCRIBE] to our YouTube Channel to be notified when we are Live/new videos are published.</p> <p>You can ask questions using YouTube Q&amp;A tool and <a href=\"https://sli.do/OWASP\" class=\"linkified\">https://sli.do/OWASP</a></p> <p>AGENDA:</p> <p>- Introduction, OWASP News &amp; Updates - Sam Stepanyan</p> <p>- Talk 1 : \"\"What the Log?! So Many Events, So Little Time!\" - Miriam Wiesner (@MiriamXyra)<br/>- - Talk 1 Q &amp; A</p> <p>- Talk 2 : \"OWASP Top Ten 2021\" - Andrew van der Stock (@OWASPED)<br/>- - Talk 2 Q &amp; A</p> <p>TALK ABSTRACTS:</p> <p>\"What the Log?! So Many Events, So Little Time!\" - Miriam Wiesner</p> <p>Detecting adversaries is not always easy - especially when it comes to correlating Windows Event Logs to real-world attack patterns and techniques. This talk is about EventList - a free and open-source tool which helps to match Windows Event Log IDs with the MITRE ATT&amp;CK framework (and vice-versa) and offers methods to simplify the detection in corporate environments worldwide.</p> <p>\"Introducing OWASP Top Ten 2021\" - Andrew van der Stock</p> <p>Welcome to the latest instalment of the OWASP Top 10. In this talk you will learn about the brand new OWASP Top Ten 2021, the methodology behind it, the categories, the data collection and analysis process and of course how to start an AppSec Program with the OWASP Top 10.</p> <p>SPEAKERS:</p> <p>MIRIAM WIESNER (@miriamxyra)</p> <p>Miriam Wiesner is a Senior Security Program Manager for Microsoft Defender ATP. Besides MDATP, she has a focus on Secure Infrastructure, Windows Event Logs, Active Directory Security, Just Enough Administration, and PowerShell, and many more. In her spare time, she enjoys writing articles for her private blog (miriamxyra.com), also she enjoys developing open-source tools to help the community and speaks on international conferences and events. She's a life-long learner, always excited about new technologies, and empowering others.</p> <p>ANDREW VAN DER STOCK (@OWASPED / @VANDERAJ)</p> <p>Andrew van der Stock is an acknowledged leader of the application security field, with nearly 20 years application security experience in Australia and the USA, and over 25 years' experience in the IT and System Administration fields. Andrew joined OWASP in 2002 (!) and served as OWASP Sydney Chapter Leader and OWASP Melbourne Chapter co-leader. Over the years Andrew was involved in leading and working on many OWASP Projects such as OWASP Developer Guide 2.0, OWASP Top 10, ESAPI for PHP, OWASP Application Security Verification Standard(ASVS) as well as starting the OWASP Proactive Controls project. Andrew's corporate world experience includes directorship role at KPMG Australia and Senior Principal Consultant role at Synopsys Inc. Currently Andrew is the Executive Director at OWASP, taking the Foundation through organisational change and taking our mission to the next level</p> "
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly Virtual Meeting - OCT 27, 2021",
        "date": "2021-10-27",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Los-Angeles/events/278725579/",
        "timezone": "US/Pacific",
        "description": "<p>Come join us as we hear the monthly presentation by Aaron Guzman, Head of Product &amp; Application Security with Cisco Meraki</p> <p>TOPIC: OWASP &amp; CSA IoT: Impacting Medical Security</p> <p>ABSTRACT: The Open Web Application Security Project (OWASP) IoT Project is designed to help manufacturers, developers, and consumers better understand the security issues associated with the Internet of Things as well as enable users in any context to make better security decisions when building, deploying, or assessing IoT technologies. Similarly, CSA's IoT Working group is dedicated to understanding IoT deployments and defining actionable guidance to secure ecosystems. Their efforts are often used to develop medical security guidelines for developers and manufacturers alike but also to influence IoT security assessment methodologies for later use on commercial IoT certification schemes. This session will provide insights into current project initiatives, including those that directly impact medical devices and how you can save lives by getting involved.</p> <p>BIO: Aaron Guzman is a published author and a technical reviewer for several security books. He is the Head of Product &amp; Application Security with Cisco Meraki where he focuses on building security into enterprise IoT products and crafting designs that keep users safe from compromise. Aaron spearheads many open-source initiatives, raising awareness about IoT hacking and proactive defensive strategies under OWASP’s IoT and Embedded Application Security projects. A co-chair of Cloud Security Alliance’s IoT Working Group, he has extensive public speaking experience delivering conference presentations, training, and workshops globally. Follow Aaron on Twitter @scriptingxss.</p> <p>Meeting info will be available on meetup - BE SURE TO RSVP to access the link</p> <p>ATTENTION SPONSORS: YOUR NAME COULD BE HERE<br/>Check out sponsorship opportunities here<br/><a href=\"https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471\" class=\"linkified\">https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471</a></p> "
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "(Alert Level 1 permitting) The new OWASP Top 10 Web Application Security Risks",
        "date": "2021-10-27",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-Zealand-Chapter-Christchurch/events/281034378/",
        "timezone": "Pacific/Auckland",
        "description": "<p>Important! Traction on Demand (formerly Trineo) is not hosting events under Alert Level 2, so this is a tentative placeholder for the next meetup. Details to be added soon…</p> "
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Insiders Guide to Mobile AppSec with OWASP MASVS",
        "date": "2021-10-07",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/280695585/",
        "timezone": "US/Eastern",
        "description": "<p>Abstract:<br/>From the birth of MASVS and MSTG in January 2018 to the most recent updates, the OWASP Mobile Security Project has advanced the state of mobile app security testing dramatically. As supporters and contributors to the Mobile Security Project at OWASP, we have pen tested thousands of mobile apps and scanned millions of commercial apps in the app stores over the years… and have identified the most common security issues that plague developers and security teams. Whether you are new to mobile pen testing or a veteran looking for the latest tools and tactics, join this session to learn 10 keys to mobile appsec leveraging OWASP MASVS and practical real-world experience.</p> <p>Brian Reed Bio:<br/>As Chief Mobility Officer, Brian Reed leads the mobile standards and mobile DevSecOps charge at NowSecure helping orgs deliver secure mobile apps faster. He brings decades of experience in mobile, apps, security, dev, and testing helping Fortune 2000 global customers, federal agencies and mobile innovators. Brian is a compelling storyteller, speaker and writer including OWASP, AllDayDevOps, DevOpsWorld, DevOps Days, RSA, Droidcon, Mobile World Congress, FS-ISAC, and more. Brian is a graduate of Duke University.</p> "
    },
    {
        "group": "Oklahoma City",
        "repo": "www-chapter-oklahoma-city",
        "name": "Information Warfare Summit",
        "date": "2021-10-06",
        "time": "08:30",
        "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/281104557/",
        "timezone": "US/Central",
        "description": "<p>The Oklahoma City OWASP chapter will have a table at Information Warfare Summit! Come check out the conference and grab some of the free merchandise we will have on hand.</p> <p>Register at: <a href=\"https://www.eventbrite.com/e/information-warfare-summit-iws-14-registration-165425007651?aff=iwsokc\" class=\"linkified\">https://www.eventbrite.com/e/information-warfare-summit-iws-14-registration-165425007651?aff=iwsokc</a></p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The beauty of runtime AppSec done right",
        "date": "2021-10-21",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-OC/events/281070205/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Daniel Blazquez, Technical Product Marketing Lead, Hdiv Security</p> <p>Topic: The beauty of runtime AppSec done right</p> <p>Live stream: <a href=\"https://www.twitch.tv/owaspoc\" class=\"linkified\">https://www.twitch.tv/owaspoc</a></p> <p>Abstract:<br/>Traditionally, application security practices oscillate between static activities (code scans, code reviews, threat modeling, etc.) and runtime activities (penetration testing, scanners, and WAFs). Static activities have context and depth, but lack visibility on the true behavior of the software. On the other hand, runtime activities have no direct access to the internals of the application because they follow an external approach.</p> <p>DevOps teams are demanding a more complete picture of the security of the applications, combining static and dynamic activities. In this practical talk, I want to propose a new approach based on runtime observability, that provides not only vulnerabilities and attacks, but also app deployment intelligence, sensitive data visibility, and API discovery capabilities.</p> <p>Speaker Bio:<br/>Daniel Blazquez leads the technical marketing and developer advocacy practice at Hdiv Security, a VC-funded application security company focused on application security automation. As an ex-Java programmer and recovering corporate strategy professional, Daniel brings a holistic view to the S-SDLC practice: from coding to product management, all the way to growth strategy. His education includes a Computer Science master's and undergrad, and an MBA at UCLA Anderson.</p> <p>Our meeting sponsor, Shiftleft, will provide a $40 Amazon gift card to all attendees who fill out our survey during the meeting. The URL for the survey will be given out during the meeting.</p> <p>--------------------------------------------------------------------------------------<br/>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Pittsburgh",
        "repo": "www-chapter-pittsburgh",
        "name": "2021 - Q4 OWASP Chapter Meetup",
        "date": "2021-10-07",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Pittsburgh-Chapter/events/280916384/",
        "timezone": "US/Eastern",
        "description": "<p>Title: Using SIEM &amp; Log Analysis to Hack Web Applications</p> <p>Abstract: By using a SIEM and log analysis, you can map a website, find vulnerabilities, and assist with purple teaming. We’ll discuss using SIEM and Log Analysis to improve Site Mapping and Identifying specific vulnerabilities. We will also talk about the value it is to Purple Teaming exercises. We’ll show a few examples of Splunk log searches with sample output.</p> <p>Speaker: James Jones</p> <p>Bio: My (new) current role at PNC is the Dynamic Application Security Testing Manager and I absolutely love the opportunity. Working at PNC is challenging, fast paced, and extremely rewarding. I’ve worked in IT for over 20 years with a focus on Information Security. I’ve had roles in Active Directory design and implementation, Patch Management, Computer Forensics, Incident Response, Vulnerability Scanning/Remediation, Defense in Depth implementation and management, SOC Management and Application Security Testing.</p> "
    },
    {
        "group": "Saint Louis",
        "repo": "www-chapter-saint-louis",
        "name": "OWASP Meetup - CTF",
        "date": "2021-10-18",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-STL/events/277429716/",
        "timezone": "US/Central",
        "description": "<p>Capture the Flag (CTF) is a computer security competition. CTF contests are usually designed to serve as an educational exercise to give participants experience in securing a machine, as well as conducting and reacting to the sort of attacks found in the real world. Reverse-engineering, network sniffing, protocol analysis, system administration, programming, and cryptanalysis.</p> <p>* This will be an open CTF which means this is open book. You may use any tool or internet accessible resource: Burpsuite, IDE, Metasploit, etc.</p> <p>* Work in single or 2 person teams</p> <p>* Be the person/team with the most challenges completed to win (time will determine a tie)</p> <p>This CTF will run from October 18th-21st.<br/>* October 18th Kickoff @ 7PM<br/>* October 21st Finish &amp; Demo @ 7PM</p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "Monthly Meeting",
        "date": "2021-10-21",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccnbcc/",
        "timezone": "US/Pacific",
        "description": "<p>Monthly OWASP meeting</p> "
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Virtual Seattle OWASP Networking and Social Hour",
        "date": "2021-10-08",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Seattle-Chapter/events/280786436/",
        "timezone": "US/Pacific",
        "description": "<p>Hello All,</p> <p>Come and join your fellow security practitioners at an informal virtual networking event on Friday October 8th, 2021 at noon. We will discuss upcoming plans for the Seattle Chapter, OWASP news &amp; topics, and have an open forum discussion on what you, the members, would like to focus on in the coming months.</p> <p>Thanks,</p> <p>OWASP Seattle Leadership</p> "
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": "OWASP Seoul Chapter Online(Zoom) Meeting",
        "date": "2021-10-01",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Seoul/events/281132616/",
        "timezone": "Asia/Seoul",
        "description": "<p>OWASP Seoul Conference 2021           .    .</p> <p> : OWASP Seoul Chapter Online(Zoom) Meeting<br/> : 2021.10.01(Fri) 20:00 ~ 21:00, KST<br/> : Online(Zoom) <a href=\"https://zoom.us/j/97765597424?pwd=VXYxYmxrOUhNbktCMkp2U0FVYWd1QT09\" class=\"linkified\">https://zoom.us/j/97765597424?pwd=VXYxYmxrOUhNbktCMkp2U0FVYWd1QT09</a></p> <p> ID: 977 6559 7424<br/>: owasp@2021</p> "
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Securing Cloud-Native Supply Chain - Notary based on The Update Framework (TUI)",
        "date": "2021-10-05",
        "time": "19:30",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/280590027/",
        "timezone": "Asia/Singapore",
        "description": "<p>With the significant increased adoption in cloud-native technologies and against the backdrop of supply chain attacks (Solarwinds hack), what can all of us do to ensure what we build and deploy to Production is indeed secure? In this session, Nathan Aw will expound on the need for a Secure Software Factory (SSF), share some useful cloud-native security checklists and finally demo some security and compliance tools that can help to secure our cloud-native supply chain.</p> <p>Speaker: Nathan Aw<br/>A hands-on microservices developer turned AppSec architect and practitioner, Nathan Aw unyielding passion lies in building and deploying secure and scalable software that can run anywhere. Through the actual hands-on setup of a Secure Software Factory (SSF), Nathan understands intimately the importance of setting up a first-class secure software factory that is able to quickly deliver trusted and secure digital services to its customers. More on Nathan can be found at <a href=\"https://sg.linkedin.com/in/awnathan\" class=\"linkified\">https://sg.linkedin.com/in/awnathan</a></p> "
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Owasp Stockholm DevOps and security & Benefits of Cloud Thinking",
        "date": "2021-10-21",
        "time": "17:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/281022013/",
        "timezone": "Europe/Stockholm",
        "description": "<p>Welcome to a OWASP Stockholm event!</p> <p>Finally we can meet IRL again and we will fire off with a Secure Development event hosted by Omegapoint at their new office site.</p> <p>Location: Jakobsbergsgatan 24, Auditorium.<br/>Time: October 21, 17.00 – 20.00<br/>Lighter food &amp; drinks will be served. The talks will begin at 17.30.</p> <p>Session 1. DevOps and security<br/>A presentation of a development lifecycle inspired by the DevOps loop with activities related to modern development and security with a discussion at the end.</p> <p>Bio<br/>Mats Persson, Consultant @ Omegapoint, passionate about Secure Development, Modern Ways of Working and Security in the Cloud</p> <p>Session 2. Benefits of Cloud Thinking<br/>Are Advanced Persistent Threats (APT) becoming the new normal? Should we get used to businesses getting pawned and having sensitive data leaked? Absolutely not! In this talk, we will present how designs often used in the cloud not only reduces risk of APTs, but also improve overall quality of your application – regardless if you’re running in the cloud or not.</p> <p>Bio<br/>Daniel Deogun &amp; Dan Bergh Johnsson are authors of the book Secure by Design and have collectively been working with security and development for several decades. They are developers at heart and understand that security is often a side-concern. They’ve also evolved work habits that enable them to develop systems in a way that promotes security while focusing on high-quality design habits – something that’s easier for developers to keep in mind during their daily work. Both are established international speakers and often present at conferences on topics regarding high-quality development and security.</p> "
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Application Security best practices",
        "date": "2021-10-13",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASPSwitzerland/events/280935287/",
        "timezone": "Europe/Zurich",
        "description": "<p>Trends, such as \"Everything as Code\", moving to the Cloud and zero-trust do confirm that application security is already enormously important today. The fact that new data breaches, security vulnerabilities, ransomware and physical impacts of cyber-attacks are published daily in the news underlines the fact even more.</p> <p>This talk explains why it is crucial to have security skills in every IT engineering team and why you cannot solely rely on a centralized security department - especially not in the agile world. Next to personal skills, this talk focuses on security best practices in software development. The speaker will highlight topics such as automated security testing methods and give recommendations on invaluable manual periodic security assessments.</p> <p>This presentation is based on the speaker's personal experience and includes many learning's and tips from throughout his career. For example, how-to decide where it is absolutely necessary to invest 100% security effort and where the 80/20 principle is more than enough. Or also, why it is crucial to have a security baseline established, before thinking about a Bug-Bounty program.</p> <p>About Manuel Cianci<br/>Manuel has been a security enthusiast forever. Manuel started his technical security journey when he was 16 years old. His professional security career started some years later as a Security Software Engineer. In order to learn as many technical basics as possible, Manuel worked within different Security Software Engineering positions for more than eight years. Afterwards, he moved to a role as Security Engineer and Security Consultant.</p> <p>For the last three years, Manuel was managing and leading the Security Delivery team of Swisscom. Manuel and his team were responsible for security engineering, consulting, and coaching services for the entire company. During his time at Swisscom, Manuel has been working on many subject areas in the security field. Introducing DevSecOps at Swisscom was one of his main achievements.</p> <p>Just recently, Manuel decided to join cy//ective (cyllective AG) as Managing Partner. cy//ective is a Swiss IT security company, specialized in holistic security services.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Sydney OWASP Night -  Interview Tips & Tricks",
        "date": "2021-10-19",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/280634417/",
        "timezone": "Australia/Sydney",
        "description": "<p>Say welcome to our guest Mon Siv who wants to help you become more confident in yourself when you next interview for a job, whether it’s in cybersecurity or in any other industry. His tips and tricks will ensure you establish the right skills to understand the interview process, what’s expected of yourself, and how to be ready to smash your goals.</p> <p>Her top tips are:<br/>Having the right mindset - Focus on the things you can control.<br/>Research and preparation - The role and audience you will be presenting to.<br/>Etiquette - Do’s and don’ts in an interview.</p> <p>Mon Siv has spent 15 years working in the recruitment industry, recently moving to a new role with Fortian to help build and mature their internal recruitment function on their growth journey.</p> <p>He has also worked in the agency world, specialising in the cybersecurity domain, helping candidates at various levels navigate through the recruitment process to secure their next role on their career path.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney - Fun with Hack the Box",
        "date": "2021-10-14",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/279765791/",
        "timezone": "Australia/Sydney",
        "description": "<p>Please join us to play/train in Hack The Box (HTB), what you need is a Hack the Box account, free is cool, join us in discord (link <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a>) - FC-Announcements-Voice Channel, please ensure, after registration in Discord you go to the Bot and accept the Code of Conduct, otherwise, you won't be able to access the channels.</p> <p>There is no format to this night, we just want to get together to have some fun playing some battlegrounds, doing some of the machines or challenges; having fun overall!</p> <p>Please make sure you know the basics about HTB, eg. how to connect to the HTB VPN and that you have a valid account.</p> "
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "Taller: #TechTalk: API con NestJS y las Maravillas de TS",
        "date": "2021-10-02",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Tegucigalpa-Chapter/events/280834015/",
        "timezone": "America/Tegucigalpa",
        "description": "<p>Taller: API con NestJS y las Maravillas de TS</p> "
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto - October Event - OpenShift Container Platform | Damn GraphQL",
        "date": "2021-10-06",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Toronto/events/280934584/",
        "timezone": "Canada/Eastern",
        "description": "<p>** APOLOGIES - Event starts at 6:00 PM instead of the usual 6:30 PM!! **</p> <p>TALK #1<br/>----------</p> <p>Damn GraphQL - Defending and Attacking APIs</p> <p>Summary:</p> <p>With the uprising of GraphQL as a technology, a query language made by Facebook, security professionals must be ready for the day GraphQL hits their company’s networks.<br/>In this talk, we will walk through GraphQL basics, followed by a deep dive into the various GraphQL attack vectors, from Information Gathering to Denial of Service and Injections.<br/>Additionally, we will discuss a recent security platform release - Damn Vulnerable GraphQL Application (DVGA), a platform made for security practitioners to learn GraphQL and its various weaknesses in a safe testing environment.</p> <p>Presenter:</p> <p>Dolev Farhi</p> <p>Dolev Farhi is the Principal Security Engineer at Wealthsimple. Previously, he was the security engineering lead at Paytm, the world’s fastest-growing mobile payment and commerce ecosystem.<br/>Dolev has worked for several security firms, such as CyberArk and F5 Networks, and provided training for official Linux certification tracks. He specializes in Linux/UNIX security, web application security, and offensive security automation. He is the founder of DEFCON Toronto, a popular Toronto-based hacker group and enjoys researching weird IoT devices.</p> <p>TALK #2<br/>----------</p> <p>OpenShift Container Platform – Security Features</p> <p>Summary:</p> <p>This talk will introduce the OpenShift Container Platform and it's architecture. As well as a variety of security features including:<br/>* RHCOS Hardening, Signature - Machine Config Operator &amp; FIPS<br/>* Immutable Containers, Image Types – S2I, UBI<br/>* Security context constraints, Etcd Encryption Operator – Compliance<br/>* File Integrity &amp; Container Security Operator, ServiceMesh - Jaeger</p> <p>Presenter:</p> <p>Arvin Monie</p> <p>Arvin Monie is a professional with 15 years of security experience with a focus on Container Security, DevSecOps, Cloud Security and Application Security. Arvin has also worked in security architecture, as well as cybersecurity plans and strategies.</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2021-10-28",
        "time": "18:30",
        "link": "https://www.meetup.com/owasptriangle/events/pqfzhsyccnblc/",
        "timezone": "US/Eastern",
        "description": "<p>TBA</p> "
    },
    {
        "group": "Yerevan",
        "repo": "www-chapter-yerevan",
        "name": "OWASP monthly meetup (October)",
        "date": "2021-10-01",
        "time": "20:00",
        "link": "https://www.meetup.com/owasp-yerevan/events/281053655/",
        "timezone": "Asia/Yerevan",
        "description": "<p>AGENDA:<br/>- BinSide: Static Analysis Framework for Defects Detection in Binary Code - Hayk Aslanyan<br/>- OWASP Top 10 2021 draft breakdown - Hrant Haroyan<br/>- Deserialization Attacks on Java Applications - Hayk Andriasyan</p> "
    },
    {
        "group": "Wia",
        "repo": "www-committee-wia",
        "name": "Deveeshree Nayak",
        "date": "2021-10-02",
        "time": "13:00",
        "link": "https://www.meetup.com/womeninappsec/events/279258252/",
        "timezone": "US/Eastern",
        "description": "<p>Deveeshree Nayak will present on \"Getting Started With PenTesting, Intro to OSINT, Creating a D &amp; I Cyber Security Team\".</p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "How to Analyze Code for Vulnerabilities using Joern",
        "date": "2021-10-15",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/280834756/",
        "timezone": "Canada/Eastern",
        "description": "<p>Code analysis is the process of analyzing the code of a program to find security vulnerabilities. It is the most effective way to identify many types of security issues, from injection vulnerabilities to issues like leaked secrets and vulnerable dependencies. But the process of manually analyzing code for vulnerabilities can be very time-consuming. Is there a better way to do this?</p> <p>In this talk, Vickie and Suchakra will demonstrate how to use open-sourced code analysis tool Joern to make code analysis more efficient. How do you effectively trace user input in code? How can you efficiently link bug sources to sensitive sink functions? This is the second edition of How to analyze code for vulnerabilities (<a href=\"https://www.youtube.com/watch?v=A8CNysN-lOM\" class=\"embedded\">https://www.youtube.com/watch?v=A8CNysN-lOM</a>), this time, we’ll talk about how to do it efficiently using Joern.</p> <p>VICKIE LI<br/>Vickie Li is the resident developer evangelist at ShiftLeft. She is an experienced web developer with an avid interest in security research. She can be found on <a href=\"https://vickieli.dev\" class=\"linkified\">https://vickieli.dev</a>, where she blogs about security news, techniques, and her latest bug bounty findings. She also hosts “Security Simplified”, a developer education series focusing on web security: <a href=\"https://www.youtube.com/c/vickielidev\" class=\"embedded\">https://www.youtube.com/c/vickielidev</a>.</p> <p>SUCHAKRA SHARMA<br/>Suchakra Sharma is Staff Scientist at ShiftLeft Inc. where he builds code analysis tools and hunts security bugs. He completed his Ph.D. in Computer Engineering from Polytechnique Montréal where he worked on eBPF technology and hardware-assisted tracing techniques for OS analysis. As part of his research, he also developed one of the first hardware-trace based virtual machine analysis techniques. He has delivered talks and trainings at venues such as RSA, USENIX LISA, SCALE, Papers We Love, Tracing Summit, etc. When not playing with computers, he hikes and writes poems.</p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Vulnerability Writeups: The Magical 5 Minute Formula",
        "date": "2021-10-03",
        "time": "10:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/280786174/",
        "timezone": "Canada/Eastern",
        "description": "<p>Whether you're an elite security researcher or just starting out in security, odds are that you're terrible at effectively explaining vulnerabilities. Sorry, that's just a fact.</p> <p>It's hard to find security vulnerabilities, but it's really difficult to establish trust, clearly and concisely explain the risk, and compel action all while being great to work with and not bruising any egos.</p> <p>You have to be a great team player and absolutely resist the urge to blame. Otherwise you'll undermine your entire security program and culture -- which is really the whole point of finding vulnerabilities in the first place.</p> <p>So, in this talk, I'm going to share the approach I developed over 15 years of consulting with the world’s largest companies. With some practice, you should be able to create a fantastic, compelling vulnerability writeup in less than five minutes.</p> <p>Of course, you have to really understand the vulnerability first, but that's not what this paper is about. This is about what you do after you find something awesome.</p> <p>JEFF WILLIAMS<br/>Jeff brings more than 20 years of security leadership experience as co-founder and Chief Technology Officer of Contrast Security. Previously, Jeff was co-founder and CEO of Aspect Security, a successful and innovative application security consulting company acquired by EY. Jeff is also a founder and major contributor to OWASP, where he served as Global Chairman for 10 years, and created the OWASP Top 10, OWASP Enterprise Security API, OWASP Application Security Verification Standard, XSS Prevention Cheat Sheet, and many more popular open source projects. Jeff has a BA from Virginia, an MA from George Mason, and a JD from Georgetown. Please connect on LinkedIn: <a href=\"https://www.linkedin.com/in/planetlevel/\" class=\"linkified\">https://www.linkedin.com/in/planetlevel/</a></p> "
    }
]