[
    {
        "group": "Www Chapter Space Coast",
        "repo": "www-chapter-space-coast",
        "name": "New Members and 2021 Goals Virtual Meeting",
        "date": "2021-03-22",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Space-Coast-Chapter/events/276633831/",
        "timezone": "US/Eastern",
        "description": "<p>OWASP SpaceCoast Virtual event. Agenda includes:<br/>1 - Event schedule for 2021<br/>2 - Topics and CTF interests for 2021<br/>3 - Call for Speakers</p> "
    },
    {
        "group": "Www Chapter Ghana",
        "repo": "www-chapter-ghana",
        "name": "How to turn your cybersecurity hobby into career- An Introduction to Bugbounties",
        "date": "2021-03-15",
        "time": "16:00",
        "link": "https://www.meetup.com/OWASP-Ghana-Chapter/events/276327753/",
        "timezone": "Africa/Accra",
        "description": "<p>The event is organized by OWASP Foundation.</p> <p>How to turn your cybersecurity hobby into a career - An Introduction to Bugbounties</p> <p>The most common question I get asked. Is: “How do I get started in bug bounties” So In this presentation, I'm going to guide you and share my personal experiences on how you can get started in hunting for security bugs. We are going to dig into what tools and skills you need, what to expect, and how to avoid hunters burnout. All while trying to iron out misconceptions and avoiding common pitfalls. So join me in this inspirational presentation on how you can too turn your passion for cybersecurity into a profitable career or side business.</p> <p>Stoke can be found on Twitter: <a href=\"https://twitter.com/stokfredrik\" class=\"linkified\">https://twitter.com/stokfredrik</a></p> <p>Original event page:<br/><a href=\"https://www.eventbrite.com/e/how-to-turn-your-cybersecurity-hobby-into-a-career-an-intro-to-bugbounties-tickets-137621959987?aff=OWASPghana\" class=\"linkified\">https://www.eventbrite.com/e/how-to-turn-your-cybersecurity-hobby-into-a-career-an-intro-to-bugbounties-tickets-137621959987?aff=OWASPghana</a></p> <p>Event Sponsor, Invicti:<br/><a href=\"https://www.invicti.com/products/?utm_medium=events&amp;utm_source=tradeshow&amp;utm_campaign=i-owaspevents&amp;utm_content=210209-websitevisit-virtualevent&amp;utm_term=brand\" class=\"linkified\">https://www.invicti.com/products/?utm_medium=events&amp;utm_source=tradeshow&amp;utm_campaign=i-owaspevents&amp;utm_content=210209-websitevisit-virtualevent&amp;utm_term=brand</a></p> "
    },
    {
        "group": "Www Chapter Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa: Introduction to OWASP ZAP Scripting",
        "date": "2021-03-25",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Ottawa/events/276862835/",
        "timezone": "Canada/Eastern",
        "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=sB_nAx5Cm90\" class=\"embedded\">https://www.youtube.com/watch?v=sB_nAx5Cm90</a></p> <p>7:00 EDT PM: Technical Talks</p> <p>1. Announcements</p> <p>2. Introduction to OWASP ZAP Scripting</p> <p>Abstract:<br/>1 hour presentation about incoming course on OWASP ZAP. In this session we are going to talk about:<br/>- OWASP ZAP project overview<br/>- OWASP ZAP features<br/>- Compare OWASP ZAP with other tools<br/>- OWASP ZAP Advantages<br/>- Introducing the incoming workshop and importance of OWASP ZAP scripting</p> <p>Bio:<br/>Ali Abdollahi is a technologist with 9 years of experience working in a variety of fields. Ali is a full-time consultant helping clients with product testing, reverse engineering, penetration testing, exploit developing, red-teaming, secure coding, and more, giving him ample opportunity to use his skills in a diversity of ways. In addition, He is an instructor, author and board of review at Hakin9 company. Ali is a self-confessed bug hunter, publisher of many vulnerabilities and CVEs. Ali is a regular speaker and trainer at industry conferences like: DEFCON (Aerospace, Red Team and AppSec villages), OWASP AppSec Days, c0c0n XII, Confidence Conference 2020, BSides Budapest, BSides Toronto, Texas Cyber Summit, TyphoonCon (SSD Secure Disclosure), YASCon, NoNameCon 20, COUNTERMEASURE|2020, DragonCon, etc…</p> "
    },
    {
        "group": "Www Chapter Toronto",
        "repo": "www-chapter-toronto",
        "name": "Cybersecurity Through the Eyes of Psychology | Technical Writing 101",
        "date": "2021-03-17",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Toronto/events/276463557/",
        "timezone": "Canada/Eastern",
        "description": "<p>** EDIT - Apologies everyone. The date is now *WEDNESDAY 17th* not Thursday **</p> <p>TALK #1<br/>-----------</p> <p>Technical Writing 101: A Pentester's Perspective</p> <p>Summary:</p> <p>This presentation is derived from my experience as an OffSec SME at KPMG. I’ve lead numerous pentest engagements, and when it comes down to doing QA on reports, I notice that a lot of people who are technically gifted are sometimes not able to communicate their amazing findings through a convincing and easy-to understand report that will be presented to people who are less technically inclined.</p> <p>The focus of the talk is that, I hope to be able to help inform others on “good” vs “bad” writing language, format, and delivery from the offensive security stand point. Target audience is new grads, students, professionals, and pretty much anyone else including those at the executives level who are interested in creating impactful and easy-to-understand reports, as well as reading them and understanding the process of creating a pentest report.</p> <p>Presenter:</p> <p>Ignatius Michael</p> <p>I’m security enthusiast, passionate in all things security specifically within offensive security. Currently serving my second year at KPMG as a penetration tester (mobile, web app, and network). Pretty much a glorified script kiddie with OSCP who is currently enrolled in OSEP.</p> <p>TALK #2<br/>-----------</p> <p>Cybersecurity Through the Eyes of Psychology</p> <p>Summary:</p> <p>This presentation takes a look at how social engineering attacks work from a psychology perspective. Many cybersecurity issues are human problems, and human behaviour has been studied for longer than cybersecurity has existed as an industry. By understanding and explaining the drivers behind human behaviour, people and organizations can learn how to better protect themselves from attacks.</p> <p>Presenter:</p> <p>Victoria Granova (ISC2)</p> <p>Victoria is the President of the (ISC)² Toronto Chapter board, where she works to create professional education opportunities and connects security groups across the GTA to advance the industry together. In industry, she is a Senior Information Security Consultant at a Big 5 Bank specializing in cybersecurity incident management and governance. Victoria also contributes as an occasional Instructor at York University in the Cybersecurity Certificate Program.</p> "
    },
    {
        "group": "Www Chapter Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "Práticas da OWASP para Testes em Segurança Web",
        "date": "2021-03-24",
        "time": "19:30",
        "link": "https://www.meetup.com/owasp-capixaba/events/276843450/",
        "timezone": "America/Sao_Paulo",
        "description": "<p>Título: Praticas da OWASP para Teste de Segurança Web<br/>Nome: Luiz Gustavo Corrêa Filho<br/>Descrição: Mostrar a utilização de recursos da OWASP para testar a segurança em aplicações WEB.</p> "
    },
    {
        "group": "Www Chapter Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Getting API security right",
        "date": "2021-03-27",
        "time": "14:00",
        "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/276846828/",
        "timezone": "Asia/Jakarta",
        "description": "<p>Title :</p> <p>Getting API security right</p> <p>Long Abstract</p> <p>The shift towards an API landscape indicates a significant evolution in the way we build applications. The rise of JavaScript and mobile applications have sparked an explosion of easily-accessible REST APIs. But does the rise of APIs result in the downfall of security? Why are there so many vulnerabilities and incidents involving APIs? How can you ensure that your APIs are secure?</p> <p> </p> <p>In this session, we use real-world cases to dive into best practices for securing your APIs. We discuss the attack surface of an API, common authorization problems, and best practice techniques to avoid these problems. At the end of this session, you will have an actionable set of guidelines to assess and improve the security of your own APIs.</p> <p>Name and title</p> <p>Dr. Philippe De Ryck</p> <p>Web Security Expert, Founder of Pragmatic Web Security</p> <p>Bio</p> <p>Philippe De Ryck helps developers protect companies through better web security. His Ph.D. in web security from KU Leuven lies at the basis of his exceptional knowledge of the security landscape. As the founder of Pragmatic Web Security, Philippe delivers security training and security consulting to companies worldwide. His online course platform allows anyone to learn complex security topics at their own pace. Philippe is a Google Developer Expert and an Auth0 Ambassador/Expert for his community contributions on the security of web applications and APIs.</p> <p>Social media profiles</p> <p>Twitter: <a href=\"https://twitter.com/PhilippeDeRyck\" class=\"linkified\">https://twitter.com/PhilippeDeRyck</a></p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/PhilippeDeRyck/\" class=\"linkified\">https://www.linkedin.com/in/PhilippeDeRyck/</a></p> <p>Github: <a href=\"https://github.com/philippederyck/\" class=\"linkified\">https://github.com/philippederyck/</a></p> <p>join by zoom</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/97993014788?pwd=UkI3bDRDRkNTd2hDeGpna1hNR3I4dz09\" class=\"linkified\">https://zoom.us/j/97993014788?pwd=UkI3bDRDRkNTd2hDeGpna1hNR3I4dz09</a></p> <p>Meeting ID: 979 9301 4788<br/>Passcode: owaspjkt21</p> "
    },
    {
        "group": "Www Chapter Tulsa",
        "repo": "www-chapter-tulsa",
        "name": "OWASP Tulsa break-out at Tulsa Web Devs; Free child care provided by LTFF",
        "date": "2021-03-15",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Tulsa-Chapter/events/nbdvmryccfbtb/",
        "timezone": "US/Central",
        "description": "<p>OWASP Tulsa has a break-out talk at every Tulsa Web Devs meetup. Tulsa Web Devs &amp; Techlahoma provide free food &amp; child-care!</p> <p>6pm - 6:30pm: Eat, mingle, announcements &amp; presentation pitches (5 minutes each)<br/>6:30pm - 8pm: Break out into OWASP Tulsa talk<br/>8pm: Leave to another venue, Typically Prairie Brewpub (<a href=\"https://www.yelp.com/biz/prairie-brewpub-tulsa\" class=\"linkified\">https://www.yelp.com/biz/prairie-brewpub-tulsa</a>)</p> <p>(Right next door to 36°N)</p> "
    },
    {
        "group": "Www Chapter Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "DISCOUNT PHISH BURN BETTER and  USER MODE API HOOKS AND BYPASSES",
        "date": "2021-03-25",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276419652/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>Note: THIS IS AN ONLINE EVENT! Link to stream will be released here prior to the event.</p> <p>THE SPEAKER</p> <p>Magnus Stubman, Security Advisor at Improsec and former security consultant at F-Secure and Zacco.<br/><a href=\"https://www.linkedin.com/in/magnusstubman/\" class=\"linkified\">https://www.linkedin.com/in/magnusstubman/</a></p> <p>Magnus started his career as a software developer and later turned his attention to Cyber Security, specifically attack and penetration testing, both digital and physical. Today Magnus specialize in Red Teaming.</p> <p>Magnus will do something we haven't facilited in OWASP CPH before - He will do a double-presentation - to take you on a technical security ride.. Keep reading to learn more...</p> <p>THE TALKS</p> <p>TALK 1 : DISCOUNT PHISH BURN BETTER</p> <p>- Did my e-mail provider detect my malicious intent?</p> <p>- Was there an e-mail gateway that saw my malware?</p> <p>- Did it land in the junk/spam folder?</p> <p>- Has the victim even seen it or read it yet?</p> <p>- Did he/she click the link or did it seem suspicious?</p> <p>- Did the malware download properly?</p> <p>- Was it analysed in a sandbox?</p> <p>- Did the Anti-Virus detect it? What about EDR?</p> <p>- Maybe the SOC is torturing my malware in a lab environment right now?</p> <p>- Maybe it executed fine, but just stopped working due to a bug?</p> <p>- Was the outbound C2 traffic blocked or even worse, detected?</p> <p>Have you ever asked yourself one of the above questions, or just wonder how life is as an attacker seeking to conduct a successful (spear) phishing campaign? \"Discount Phish Burn Better\" is a talk about how an attacker can improve his odds of successfully phishing a victim by reducing the cost of payload/malware development.</p> <p>TALK 2 : USER MODE API HOOKS AND BYPASSES</p> <p>- Can I upload my tools to the compromised workstation without being detected or do I have to stay in-memory?</p> <p>- Will the EDR detect if I use process injection to migrate to e.g. explorer.exe?</p> <p>- Can I dump LSASS and steal NTLM hashes?</p> <p>- Can I backdoor an application, e.g. Citrix Receiver to escalate privileges when another user logs in?</p> <p> <br/>On-host security products such as Anti-Virus (AV) and Endpoint Detection and Response (EDR) products aim to have sufficient surveillance of the host to ensure that attackers can't operate without being detected. One of the techniques such products use is known as Win32 API hooking in user mode. However, as the user-mode component of APIs are loaded and owned by the current process, the process itself can inspect, overwrite or simply just not use them and use its own implementation of the API functionality, to avoid messing with the hooks altogether. This talk will give an introduction to Win32 APIs, modules, API hooks and different bypass techniques that may be essential to avoiding detection.</p> <p>WHO CAN PARTICIPATE?<br/>The event is open for everyone - but it is highly technical.</p> <p>Photo: Blake Connally, Unsplash.com</p> "
    },
    {
        "group": "Www Chapter Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "Workshop: Elastic SIEM (4 hr) (NEW DATE WILL BE FINAL 1ST WEEK OF MARCH)",
        "date": "2021-03-20",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276244555/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>NEW DATE WILL BE FINALLY DECIDED IN THE WEEK FIRST WEEK OF MARCH</p> <p>This time around OWASP Copenhagen will host a free 4hr workshop on Elastic SIEM courtesy of David Thejl-Clayton - SOC leader of JN Data.</p> <p>The workshop is designed to get you started using it and provide you with hands-on experience with that along with MISP and TheHive, two accompaning tools which, just as Elastic, are free to use.</p> <p>Everything will be held virtually. We will provide each student with their own virtual environment. Due to practical reasons we have limited seats to this so sign up before it's too late!</p> <p>We will include a high-level description of the workshop later.</p> "
    },
    {
        "group": "Www Chapter Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Eradicate Vulnerability Classes with Secure Defaults + Lightweight Enforcement",
        "date": "2021-03-30",
        "time": "17:45",
        "link": "https://www.meetup.com/Santa-Barbara-OWASP-Chapter/events/276857915/",
        "timezone": "US/Pacific",
        "description": "<p>NOTE: You need to RSVP in order to get the link the day of the event.</p> <p>### Event Agenda (PST timezone) ###<br/>05.45 pm -- Event Kickoff &amp; Announcements, by Walter Martín Villalba, OWASP SB Leader -- <a href=\"https://twitter.com/act1vand0\" class=\"linkified\">https://twitter.com/act1vand0</a><br/>06.00 pm -- Presentation: Eradicate Vulnerability Classes with Secure Defaults + Lightweight Enforcement, by Clint Gibler -- <a href=\"https://twitter.com/clintgibler\" class=\"linkified\">https://twitter.com/clintgibler</a><br/>07.00 pm -- Closing Remarks</p> <p>### Abstract ###<br/>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time.</p> <p>Rather than investing in finding more bugs, many modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks can enable organizations to solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole.</p> <p>In this talk, we’ll present a practical step-by-step methodology for:<br/>Choosing what to focus your AppSec resources on<br/>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes<br/>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers<br/>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>### Bio###<br/>Clint Gibler (@clintgibler) is the Head of Security Research for r2c, a startup working on giving security tools directly to developers. Previously, Clint was a Research Director at NCC Group, a global security consulting firm, where he helped companies implement security automation and DevSecOps best practices as well as performed penetration tests for companies ranging from large enterprises to new startups. Clint has previously spoken at conferences including BlackHat USA, AppSec USA/EU/Cali, BSidesSF, and many DevSecCons. Clint holds a Ph.D. in Computer Science from the University of California, Davis. Want to keep up with security research? Check out *tl;dr sec*, Clint’s newsletter that contains summaries of artisanally curated, top talks and useful security links and resources from around the web. <a href=\"https://tldrsec.com/\" class=\"linkified\">https://tldrsec.com/</a></p> "
    },
    {
        "group": "Www Chapter Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Limiting Supply Chain Risk with Dependency-Track ",
        "date": "2021-03-18",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/276682068/",
        "timezone": "US/Eastern",
        "description": "<p>Abstract:<br/>Dependency-Track is an intelligent Component Analysis platform that allows organizations to identify and reduce risk in the software supply chain. Dependency-Track takes a unique and highly beneficial approach by leveraging the capabilities of Software Bill of Materials (SBOM). This approach provides capabilities that traditional Software Composition Analysis (SCA) solutions cannot achieve.</p> <p>Discover the benefits of leveraging CycloneDX Software Bill of Materials along with OWASP Dependency-Track to identyify risk across a wider range of use cases.</p> <p>About Steve Springett:<br/>Steve educates teams on the strategy and specifics of developing secure software.</p> <p>He practices security at every stage of the development lifecycle by leading sessions on threat modeling, secure architecture and design, static/dynamic/component analysis, offensive research, and defensive programming techniques.</p> <p>Steve's passionate about helping organizations identify and reduce risk from the use of third-party and open source components. He is an open source advocate and leads the OWASP Dependency-Track project, OWASP Software Component Verification Standard (SCVS) project, CycloneDX software bill of material standard, and participates in several related projects and working groups.</p> "
    },
    {
        "group": "Www Chapter Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "OWASP Meetup - TBA",
        "date": "2021-03-25",
        "time": "19:00",
        "link": "https://www.meetup.com/Brisbane-OWASP-Meetup-Group/events/274794211/",
        "timezone": "Australia/Brisbane",
        "description": "<p>Our next meeting is planned for March. Speaker and date to be confirmed!</p> "
    },
    {
        "group": "Www Chapter Sydney",
        "repo": "www-chapter-sydney",
        "name": "Sydney OWASP Night - Bridging The Cybersecurity Skill Gap",
        "date": "2021-03-25",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/276706828/",
        "timezone": "Australia/Sydney",
        "description": "<p>Sydney OWASP Chapter is proudly introducing our first presentation of the year with special guest speaker Yenni Tim!</p> <p>Tune in on the 25th March at 6 PM where Yenni will discuss the myths of the cybersecurity skill gap and why stronger collaboration is needed between higher education and the industry. She will also demonstrate an overview of a real-life example where collaboration will lead to a successful outcome in both students beginning their career and organisations hunting for talent.</p> <p>Yenni Tim is an educator and researcher at UNSW’s School of Information Systems and Technology Management. She believes in career-focused education and is committed to working with students to develop the skills sets they need to enter a rapidly changing digital environment. Yenni’s research focuses on digital resilience, with her work including the design and use of technology for pandemics and disaster response, and the building of cyber resilience amidst persistent security threats.</p> <p>This is a free event so we invite everyone to join in on the 25th where you will be free to make comments and ask any questions you have for Yenni! Hope to see you all there!</p> "
    },
    {
        "group": "Www Chapter Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - March 2021",
        "date": "2021-03-30",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/276781839/",
        "timezone": "US/Central",
        "description": "<p>Chapter information and a presentation --</p> <p>Successful Customer Engagements using the OWASP Mobile Application Security Verification Standard</p> <p>Abstract:</p> <p>The team will be discussing Mobile Application Penetration Testing from the perspectives of original scoping and testing using OWASP’s Mobile Application Security Verification Standard including the various tools and resources available on both Android and IOS. We will be discussing not just the OWASP standard, but also give advice on lessons learned through our engagements highlighting several key issues and obstacles to consider for ensuring a successful experience for both the customer and your team.</p> <p>Speakers:</p> <p>-Mark Spears, Solis Security - Sr. Security Consultant &amp; Red Team Lead<br/>-Sam Danna, Solis Security - Security Consultant<br/>-Jon Adderholt, Solis Security - Security Consultant<br/>-Angela Lane, Solis Security – Project Manager</p> <p>Bio:<br/>Mark, Sam, and Jon comprise the Offensive Security Operations (aka Red Team) at Solis Security performing all sorts of engagements including Network, Web Application (+Mobile, APIs, and etc), Spearphishing, Wifi, Hardware Hacking, and more.</p> "
    },
    {
        "group": "Www Chapter Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "BOLA, IDOR, MA, BFLA. Welcome to the OWASP API Top 10!",
        "date": "2021-03-16",
        "time": "17:30",
        "link": "https://www.meetup.com/Bay-Area-OWASP/events/276893017/",
        "timezone": "US/Pacific",
        "description": "<p>In this presentation, Adam will introduce the audience to the OWASP API TOP 10 Security Threats. Adam will highlight the unique attack vectors that API Applications face, review specific breach examples, and why OWASP felt it necessary to specifically highlight these vulnerabilities in a new Top 10 list. We will also explore various efforts by the security industry to secure API Applications and what businesses should expect as they evaluate an API security solution.</p> <p>Bio: Adam Fisher is an Enterprise Security Expert whose qualifications include a Bachelor of Science in Information Systems, Master of Business in Information Technology Management, and maintains a number of certifications, CISSP, CCSP, AWS Security Associate, Azure MCP. Adam has a detailed knowledge of Enterprise Security best practices and technologies and has been focused on the creation and deployment of solutions protecting networks, systems, and information assets for Fortune 500 companies and Government Agencies. Adam has worked on Secret level clearance projects for the United States Government and the United Kingdom. Deploying security solutions and network technologies while protecting key government data and assets. In addition, Adam is a respected blogger and thought leader on Enterprise Security.</p> "
    },
    {
        "group": "Www Chapter Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland Chapter - March Meeting",
        "date": "2021-03-26",
        "time": "18:30",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/276777304/",
        "timezone": "US/Eastern",
        "description": "<p>Join the OWASP Cleveland Chapter for our March 2021 meeting where we will review the t-shirt design contest, expand on the OWASP Top 10, Zed Attack Proxy ZAP, Honeypots, and more.</p> "
    },
    {
        "group": "Www Chapter Columbus",
        "repo": "www-chapter-columbus",
        "name": "Lessons learned from recent Supply Chain attacks",
        "date": "2021-03-25",
        "time": "12:00",
        "link": "https://www.meetup.com/Columbus-OWASP/events/276714213/",
        "timezone": "US/Eastern",
        "description": "<p>Hi everyone! We will start out with news and notes (virtually) and then talk about the Software Supply Chain.</p> <p>Description: Overview of lessons learned and key takeaways from recent Supply Chain attacks. Key takeaways:<br/>- Multiple vulnerabilities in target infrastructures can lead to build pipeline compromise<br/>- Potentially detailed internal working knowledge can be leveraged<br/>- Care was taken to avoid potential warnings and build failures<br/>- Unintended functionality deployed as part of signed update<br/>- Similar common weaknesses in typical information security blocking and tackling at victim sites were exploited to avoid detection<br/>- In all, there is no preventative or detective control domain within the Cyber Security realm that is unaffected by overall failures or weaknesses as part of an attack of this nature, from legal frameworks to advanced threat detection.</p> <p>Bio:<br/>Michael Fabian<br/>- Principal Consultant in Atlanta, GA<br/>- BS – Political Science<br/>- MS – information Systems – Information Security<br/>- MS – Systems Engineering<br/>Prior to Synopsys<br/>- 20 Years professional experience<br/>- 11 years in non-IT Systems Security<br/>- Experience from end user analysis to vendor product design<br/>- Industry Participation – From Medical Devices to Weapon Systems<br/>- Smart Grid Working Group (SGIP)<br/>- IEC/ISA TC65 – IEC 62443</p> "
    },
    {
        "group": "Www Chapter Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP Dallas March Meeting",
        "date": "2021-03-23",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/276136637/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>Penetration Test at Scale: A Data-focused Approach</p> <p>Description:</p> <p>Managing a global application penetration testing program across the Enterprise poses operational challenges. Extracting and leverage meaningful data can minimize those challenges. We’ll look at some key components to consider for a successful program.</p> <p>Bio:</p> <p>Phillip Pham is an experienced cybersecurity professional with more than a decade of experience​ working in Big Four Consulting​, healthcare, financial​, and online services​ industries. Phillip has led offensive security programs and large-scale pen test engagements​. He is an Offensive Security Certified Professional (OSCP)​ and a SANS AppSec Fighter contributor​ (LinkedIn open-redirect disclosure​; DOM-based XSS in the wild).</p> "
    },
    {
        "group": "Www Chapter Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-03-22",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccfbdc/",
        "timezone": "US/Central",
        "description": "<p>Hello, all!</p> <p>Spring 2021 and COVID vaccines are finally here, and we need to figure out what the future of OWASP-KC looks like. This meeting will be a general social and planning virtual meetup to try to get some idea of where things stand going forward. If you are new to to the group and want to know what's up, or if you've been around for a while and want to help plan for our next chapter, please join us!</p> "
    },
    {
        "group": "Www Chapter Omaha",
        "repo": "www-chapter-omaha",
        "name": "OWASP Omaha Q1 Chapter Meeting",
        "date": "2021-03-24",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspomaha-meetup-group/events/276733743/",
        "timezone": "US/Central",
        "description": "<p>This is the Q1 Chapter Meeting to catch up with the chapter members, solicit speakers for the year, and generally check in with everyone. This will be a fairly casual meeting and designed to share updates about cool projects in which anyone is currently engaged, any job openings to make the chapter aware of, and general input for what the members would like to see in 2021 from OWASP Omaha.</p> "
    },
    {
        "group": "Www Chapter Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Virtual Meeting: Kubernetes Security 101: Best Practices to Secure your Cluster",
        "date": "2021-03-25",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-OC/events/276858588/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Magno Logan, Information Security Specialist, Trend Micro</p> <p>Topic: Kubernetes Security 101: Best Practices to Secure your Cluster</p> <p>Abstract:<br/>This talk aims to give an overview about how Kubernetes works and provide some best practices to secure your cluster whenever you are deploying a new cluster on your own or via managed services such as GKE, EKS or AKS. We are going to cover everything from the Control Plane or the Master Node, starting with the API server, including etcd, RBAC and network policies. Then, we’ll cover the worker nodes, kubelet, audit logs and pods best practices. We'll talk about the CIS Benchmarks for Kubernetes and the default configurations you need to worry about when deploying a new cluster. We'll show how to use RBAC and assign roles and permissions to your cluster users. We'll demonstrate how to enable audit logs for better visibility and later we'll set up some network policies to avoid communication between pods and prevent any lateral movement from attackers.</p> <p>Speaker Bio:<br/>Magno Logan works as an Information Security Specialist for Trend Micro. He specializes in Cloud, Container and Application Security Research, Threat Modelling and Red Teaming. He has been tapped as a resource speaker for numerous security conferences around the globe. He is also a member of the CNCF SIG-Security team.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/magnologan/\" class=\"linkified\">https://www.linkedin.com/in/magnologan/</a><br/>Twitter: <a href=\"https://twitter.com/magnologan\" class=\"linkified\">https://twitter.com/magnologan</a><br/>Github: <a href=\"https://github.com/magnologan\" class=\"linkified\">https://github.com/magnologan</a></p> <p>Schedule:<br/>5:30 pm: Introduction<br/>5:35 pm: Kubernetes Security 101: Best Practices to Secure your Cluster</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Www Chapter Portland",
        "repo": "www-chapter-portland",
        "name": "Brian Myers - XXE for Dummies (or How to Make an XML Parser Send You Files)",
        "date": "2021-04-07",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Portland-Chapter/events/276673932/",
        "timezone": "US/Pacific",
        "description": "<p>Description: A short, slow introduction to XML External Entity vulnerabilities. This talk grew out of an internal training for developers where I work. I'll explain what XXEs are, demonstrate how to exploit them, and review the standard defenses.</p> <p>Bio: Brian Myers is Director of Information Security at WebMD Health Services in Portland. He's spent over 25 years in software development, including time at Borland and Netscape.</p> "
    },
    {
        "group": "Www Chapter Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2021-03-25",
        "time": "18:30",
        "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccfbhc/",
        "timezone": "US/Eastern",
        "description": "<p>TBA</p> "
    },
    {
        "group": "Www Chapter Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "March 2021 Chapter Meeting",
        "date": "2021-03-25",
        "time": "12:00",
        "link": "https://www.meetup.com/owasp-slc/events/276763741/",
        "timezone": "US/Mountain",
        "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA</a>) to suggest any additional topics.</p> <p>---------------------------------------------<br/>Agenda:<br/>12 - 12:50pm<br/>- Guest: Clint Gibler (@clintgibler), moderator of tldr;sec, will be joining us to talk about SemGrep</p> <p>Title: Semgrep: lightweight static analysis built for modern development</p> <p>Abstract: How we write software has changed, and many security tools have failed to keep up.</p> <p>This talk will introduce Semgrep, an open source, lightweight static analysis tool that’s fast (scans in minutes, not hours or days), easy to integrate into any CI system, and provides high signal results. Semgrep provides feedback wherever you want it - as GitHub PR comments, via Slack messages, or even in your IDE.</p> <p>We’ll provide an overview of how Semgrep works, how to roll it out to all of your repos in just a few minutes, and even how to write custom Semgrep rules unique to your company, without having to learn a painful DSL.</p> <p>12:50 - 1pm<br/>- Open Forum, Admin Items, Upcoming Events<br/>- Determine topic for next month<br/>---------------------------------------------</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC March 2021 Chapter Meeting<br/>Time: Mar 25, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/95489098638?pwd=cGVuWGJ1L0RrQ2RVbXZTOEx2V2lkUT09\" class=\"linkified\">https://zoom.us/j/95489098638?pwd=cGVuWGJ1L0RrQ2RVbXZTOEx2V2lkUT09</a></p> <p>Meeting ID: 954 8909 8638<br/>Passcode: 396952<br/>One tap mobile<br/>+16699006833,,95489098638# US (San Jose)<br/>+12532158782,,95489098638# US (Tacoma)</p> <p>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 301 715 8592 US (Washington DC)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 954 8909 8638<br/>Find your local number: <a href=\"https://zoom.us/u/aun59cFDS\" class=\"linkified\">https://zoom.us/u/aun59cFDS</a></p> "
    },
    {
        "group": "Www Chapter Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "[ONLINE]OWASP Suffolk Chapter - Security for Managers",
        "date": "2021-03-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/276874058/",
        "timezone": "Europe/London",
        "description": "<p>AGENDA:<br/>* Introduction<br/>* Security for Managers<br/>* Networking<br/>* Open discussion<br/>* Virtual Beer</p> <p>\"Security For Managers\"’ is intended as a wake-up call for people who assume that IT security doesn’t apply to them or their company. Think of it as a visit from a consultant who spends a lot of time with you, and then says: ‘This is what you need to do’, and then doesn’t charge you a penny!</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "
    },
    {
        "group": "Www Chapter Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Birmingham Chapter Meetup March 2021",
        "date": "2021-03-18",
        "time": "18:00",
        "link": "https://www.meetup.com/meetup-group-PDvbIQzf/events/276273495/",
        "timezone": "Europe/London",
        "description": "<p>Welcome from OWASP Birmingham to our first Meetup event of 2021 (still virtual I'm afraid).</p> <p>Our first talk of 2021 is a returning speaker to OWASP Birmingham and a great supporter of what we do. The second speaker is TBC.</p> <p>Agenda:</p> <p>5.45pm - Doors to manual</p> <p>6.00pm – Welcome, Introduction, thank yous and grab yourself a beverage of choice</p> <p>6.15pm – First talk: “TLS Telemetry: Probing and testing HTTPS configurations for a more secure web” – David Warburton</p> <p>6.45-7.00pm - Break and chance to grab another drink</p> <p>7.00pm – Second talk: Threat Modeling - Jum Gumblet</p> <p>7.45pm – Any questions?</p> <p>8.00pm - Close</p> <p>Here are details of the talks!</p> <p>--<br/>“TLS Telemetry: Probing and testing HTTPS configurations for a more secure web”</p> <p>David Warburton is an information security threat researcher and evangelist for F5 Labs. His focus areas of research are on SSL/TLS and other cryptographic protocols and certificates, digital identity, web application security, information risk management and compliance &amp; regulation.</p> <p>Talk Synopsis:</p> <p>The web is slowly approaching 100% encryption but the quality of your HTTPS configuration can says a lot to the world about your overall security posture.</p> <p>In this talk we will present the results of the global HTTPS survey by F5 Labs and uncover how malware is increasingly using encrypted protocols to hide its activities. We’ll offer advice and best practices for configuring TLS and supporting protocols such as DNS, certificate transparency and app-layer headers.</p> <p>We also introduce our new tool Cryptonice which aims to make HTTPS testing and evaluation easy. We cover the use cases for Cryptonice and show how it can be used</p> <p>to perform simple ad-hoc command line scans or be fully integrated in to CI/CD pipelines to automate security testing as part of new software deployments.</p> <p>In this talk you will learn about:</p> <p>· The rapidly changing encryption landscape and how it has improved privacy and security<br/>· How the world’s most popular websites are configuring HTTPS<br/>· The risks of encryption, including misconfiguration and misuse by attackers<br/>· The new F5 Labs Cryptonice tool</p> <p>See you (virtually) all there. Can't wait.</p> <p>Nathan + Jim</p> "
    },
    {
        "group": "Www Chapter Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Virtual Discussion: Stopping injection vulnerabilities with is_literal()",
        "date": "2021-03-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/276564621/",
        "timezone": "Europe/London",
        "description": "<p>Programming languages would ideally stop us from making mistakes. The biggest mistakes lead to injection vulnerabilities, where safe strings (defined by the programmer), are mixed with unsafe values (e.g. from the user).</p> <p>The is_literal() check is an ongoing project by Craig Francis and Dan Ackroyd, building on Google’s Christoph Kern’s work, as a way to check if a variable (e.g. an SQL string) is safe, to make sure there are no mistakes.</p> <p>We will start the evening with a quick talk about the idea, and the justification for why this check needs to exist - also available at:</p> <p><a href=\"https://github.com/craigfrancis/php-is-literal-rfc/blob/main/justification.md\" class=\"linkified\">https://github.com/craigfrancis/php-is-literal-rfc/blob/main/justification.md</a></p> <p>Then we will discuss any issues you can find, as well as our plan on how to get this proposal added to the PHP language:</p> <p><a href=\"https://wiki.php.net/rfc/is_literal\" class=\"linkified\">https://wiki.php.net/rfc/is_literal</a></p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/93248737850?pwd=ZkN4ZnhnR0pISkhoNlMreWcwV0t0Zz09\" class=\"linkified\">https://zoom.us/j/93248737850?pwd=ZkN4ZnhnR0pISkhoNlMreWcwV0t0Zz09</a></p> <p>Meeting ID: 932 4873 7850<br/>Passcode: 338085<br/>One tap mobile<br/>+442080806592,,93248737850# United Kingdom<br/>+443300885830,,93248737850# United Kingdom</p> <p>Dial by your location<br/>+44 208 080 6592 United Kingdom<br/>+44 330 088 5830 United Kingdom<br/>+44 131 460 1196 United Kingdom<br/>+44 203 481 5237 United Kingdom<br/>+44 203 481 5240 United Kingdom<br/>+44 203 901 7895 United Kingdom<br/>+44 208 080 6591 United Kingdom<br/>Meeting ID: 932 4873 7850<br/>Find your local number: <a href=\"https://zoom.us/u/acGnAxw02x\" class=\"linkified\">https://zoom.us/u/acGnAxw02x</a></p> "
    },
    {
        "group": "Www Chapter Germany",
        "repo": "www-chapter-germany",
        "name": "Content Security Policy - The Past, The Present, The Future?",
        "date": "2021-03-16",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Hamburg-Stammtisch/events/276707139/",
        "timezone": "Europe/Berlin",
        "description": "<p>Hi all,</p> <p>we'll have our next online event in less than two weeks. Presenting language will be English again.</p> <p>Happy to welcome Ben and Marius talking about their interesting research with respect to Content Security Policy!</p> <p>TLDR:<br/>======<br/>Title: \"Content Security Policy - The Past, The Present, The Future?\"<br/>Speaker: Ben Stock / Marius Steffens<br/>Location: Online, please check the link the day before<br/>Start: 16th of March 2021, 6:30 pm (CET)<br/>Networking: Stick around afterwards if you like.</p> <p>Abstract :<br/>=========<br/>Content Security Policy has been around for 10 years and still only a fraction of sites on the Web leverage its full potential to mitigate XSS and other flaws. In this talk, we will discuss the evolution of CSP over time and how sites could leverage it to secure against three attacks classes. This is based on our NDSS 2020 paper (<a href=\"https://swag.cispa.saarland/papers/roth2020csp.pdf\" class=\"linkified\">https://swag.cispa.saarland/papers/roth2020csp.pdf</a>), which sheds light on the usage of CSP on 10,000 sites over a period of six years. In addition, we will discuss how seemingly irrelevant choices when allowing sites can lead to catastrophic consequences for the security of CSP. Finally, we will discuss insights from our most recent study (NDSS 2021, <a href=\"https://swag.cispa.saarland/papers/steffens2021blockparty.pdf\" class=\"linkified\">https://swag.cispa.saarland/papers/steffens2021blockparty.pdf</a>), which shows that CSP’s success is in large parts blocked by third parties, and cannot be blamed on developers. With this, we’ll give our personal outlook on where CSP can be going from here, and what needs to happen for it to succeed.</p> <p>Bios:<br/>=====<br/>Ben Stock is a Tenure-Track Faculty at the CISPA-Helmholtz Center for Information Security in Saarbrücken, where he currently supervises four PhD students. In his PhD, Ben focussed on the detection and mitigation of Client-Side Cross-Site Scripting. During his PhD, he worked closely with SAP Research and interned with Microsoft Research. After his PhD, he joined CISPA as a postdoc, focussing on both Web Security as well as Usable Security research. He currently heads the Secure Web Applications Group at CISPA, is a regular speaker at academic and non-academic venues like CCS, USENIX Security, NDSS, Blackhat, and OWASP AppSec.</p> <p>Marius Steffens is a third-year PhD student in the Secure Web Applications Group at the CISPA-Helmholtz Center for Information Security, supervised by Ben Stock. Marius is interested in finding emerging vulnerabilities in client-side Web applications at a large scale, leveraging dynamic program analysis techniques. Besides automatically exploiting sites, he is also interested in understanding the pitfalls associated with deployments of Web security mechanisms, which are currently hampering widespread adoption.</p> <p>How to participate<br/>==================<br/>OWASP Hamburg Meetup members who RSVP'd for the event will see the Google Meet invite URL at the RHS and can join the video conference directly. I'll update the invite URL ~ a day before. Please make sure when joining you are muted by default.</p> <p>Our OWASP \"Stammtisch\"<br/>=========================<br/>Our meeting is about web applications and their (in)security and/or about IT security in general. People come together who care as a hobby or in their job about information security: developers, managers, pentesters and everybody else who's interested. The atmosphere is open and relaxed. Who's coming to sell products or services: Move on, this is not the right place. OWASP is about education and sharing (mostly) technical information.</p> <p>Feel free to forward our meetup URL to your colleagues or friends. They are welcome, too. Participation is free and open -- as the O in OWASP.</p> <p>Cheers, Dirk</p> "
    },
    {
        "group": "Www Chapter Norway",
        "repo": "www-chapter-norway",
        "name": "Google's Differential Privacy Library – Mirac Vuslat Basaran (Google)",
        "date": "2021-03-17",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Norway/events/276469937/",
        "timezone": "Europe/Oslo",
        "description": "<p>Differential privacy helps organizations derive insights from data while simultaneously ensuring that those results do not allow any individual's data to be distinguished or re-identified. Sound interesting?<br/>Come hear Mirac Vuslat Basaran (Google) talk about Google's Differential Privacy Library!</p> <p>We will start with a brief introduction to differential privacy and why it might be useful for you. Then, we will go through what kind of tools and functionalities Google's Differential Privacy Library supports such as secure noise implementations, different aggregations, end-to-end systems that require only minimal knowledge of differential privacy, etc.<br/>Finally, we'll talk about future plans for the library.</p> <p>We'll finish with a short Q&amp;A.</p> <p>Mirac is a Software Engineer in the area of anonymization and differential privacy at Google. Before joining Google, he studied Computer Engineering (and Economics) at Bilkent University. Currently, he helps build and open source infrastructure for product teams to anonymize their data. He also consults product teams on anonymization and differential privacy.</p> <p>URL to Google's Differential Privacy Library:<br/><a href=\"https://github.com/google/differential-privacy\" class=\"linkified\">https://github.com/google/differential-privacy</a></p> "
    },
    {
        "group": "Www Chapter Poland",
        "repo": "www-chapter-poland",
        "name": "8. OWASP Poland Meetup Online",
        "date": "2021-03-31",
        "time": "18:00",
        "link": "https://www.meetup.com/owasp-poland/events/276886134/",
        "timezone": "Europe/Warsaw",
        "description": "<p>Serdecznie zapraszam na kolejne zdalne spotkanie OWASP, które odbędzie się 31 marca 2021. Zaczniemy od omówienia interesującej podatności HTTP Request Smuggling a zakończymy ogólną dyskusją na temat najczęściej spotykanych podatności w minionym roku (prezentacja w języku angielskim).</p> <p>---</p> <p>18:00 – 18:05 – Powitanie i otwarcie spotkania, Daniel Krasnokucki, Michał Kurek</p> <p>18:05 – 18:50 – Przemytnicy żądań, czyli HTTP Request Smuggling, Justyna Bojar, Krzysztof Cąderek</p> <p>Podczas prezentacji przedstawiona zostanie nietypowa podatność HTTP Request Smuggling, która wynika z różnic w przetwarzaniu żądań HTTP przez poszczególne urządzenia. Pozwala ona na \"przemycenie\" dowolnego żądania jako części innego, nieszkodliwego żądania HTTP, co może nieść za sobą poważne skutki. Omówione zostanie z czego wynika ta podatność oraz zaprezentowane będą przykłady jej wykorzystania podczas rzeczywistych testów penetracyjnych.</p> <p>Justyna zajmuje się testami penetracyjnymi aplikacji webowych, API oraz audytami bezpieczeństwa w zespole Cyber Security KPMG, interesuje się również wykorzystaniem sztucznej inteligencji w cyberbezpieczeństwie. Jej największą pasją są podróże, a w czasie pandemii gra na ukulele, czyta książki i planuje przyszłe wyjazdy.</p> <p>Krzysztof pracuje w KPMG jako konsultant bezpieczeństwa. Najczęściej przeprowadza testy penetracyjne aplikacji webowych oraz API. Dodatkowo wykonuje również projekty z zakresu reakcji na incydenty. Poza projektami zajmuje się również monitorowaniem bezpieczeństwa sieci oraz administracją. W czasie wolnym często gra w gry planszowe ze znajomymi.</p> <p>18:50 – 19:35 – Most frequent critical vulnerabilities in 2020, Andriy Varusha</p> <p>Andriy lives in Krakow and runs an AppSec company. In his presentation, he will share some conclusions from his team's experience in 2020. Andriy will show what were the top critical vulnerabilities identified, demonstrating some of the examples (anonymous of course) and consequences to the business. Also, he will share an overview of the statistics related to vulnerabilities revealed and how customers tend to treat them.</p> <p>19:35 – 20:00 – Q&amp;A, otwarta dyskusja</p> "
    },
    {
        "group": "Www Chapter Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #18 - Security Automation, Code Patterns (Online)",
        "date": "2021-03-18",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Timisoara-Chapter/events/276604009/",
        "timezone": "Europe/Bucharest",
        "description": "<p>The next OWASP Timisoara Chapter Meeting will be online.</p> <p>&gt; Spring sessions - Theme: Security Automation &amp; Intelligence, Code Patters</p> <p>&gt; Schedule:<br/>Introduction, OWASP News &amp; Updates - Catalin Curelaru</p> <p>Surface Security - Security Intelligence Automation Platform - Teofil Cojocariu (Paddy Power Betfair)</p> <p>Detect complex code patterns using semantic grep - Bence Nagy (Semgrep)</p> <p>Time: 18:30 to 20:30</p> <p>&gt;&gt;Abstract - Surface Security:<br/>Our external attack surface is constantly growing, which gives external attackers the opportunity to continuously search for new attack vectors. In order to successfully respond to Security incidents we needed a centralized platform which aggregates all the data about our premises in a single place.</p> <p>Surface Security (Security Intelligence Automation Platform) is an internally built tool which assists our internal Security teams to gain a holistic view about our externally exposed assets. More than that, it facilitates faster incident response based on the information correlated by it. Surface started as a small project in which we tried to close the gaps identified in our security controls. The platform's core is built in Django which is a Python-based open-source framework which has a fast learning curve. Besides Django, we're using technologies like Ansible (automation), Dkron (fault-tolerant jobs), Elasticsearch (Security metrics storage) and Grafana (reporting). During the whole period it gained a lot of traction in our company determining people to contribute to its success by implementing and suggesting new features. We're currently utilizing it for reporting the Security gaps to other areas of key business areas and for Security controls like: monitoring our externally exposed assets, vulnerability management, security incidents, bug bounty reports and penetration testing.</p> <p>Bio:<br/>I'm focused on Application Security Engineering &amp; Penetration Testing combined with CAMS mindset (Culture, Automation, Measurement, Sharing - DevSecOps) and I reported security bugs to Google, Facebook, Uber, Bitdefender, ING Bank, Yahoo or other companies. One of the most interesting thing is that I built a platform \"Surface - Security Intelligence Automation Platform\" which is being used by more than 900 people in Paddy Power Betfair, Flutter and I was the Security SME for a Private Cloud based on OpenStack with environments as code.</p> <p>&gt;&gt;Abstract - Detect complex code patterns using semantic grep<br/>We’ll discuss a program analysis tool we’re developing called Semgrep. It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle, for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c. Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.<br/>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Bio:<br/>Bence Nagy is a software engineer at r2c, working on Semgrep, an open-source syntax-aware code search tool. At r2c, his responsibilities tend towards building various interfaces atop the core semgrep CLI. These include CI integrations, editor extensions, and the semgrep.dev web app. He previously led a developer experience team at Kiwi.com, the Czech Republic’s top startup at the time of its acquisition in 2019. You should totally ask him for video game recommendations after the talk.</p> "
    },
    {
        "group": "Www Chapter Cork",
        "repo": "www-chapter-cork",
        "name": "OWASP Cork - Adversarial machine learning",
        "date": "2021-03-23",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cork/events/276818788/",
        "timezone": "Europe/Dublin",
        "description": "<p>**** Meeting link will be added closer to the date and accessible to those who RSVP only ****</p> <p>Talk 1: Deep malware obfuscation<br/>Speaker: Saeid Rezaei - Machine learning researcher at University College Cork</p> <p>Deep learning has been widely utilized in many practical applications and achieved remarkable commercial success. It can be used in malware obfuscation engines which are used to secure digital rights management against hackers, and bypass anti-malware programs. In the real world scenarios, there are some constraints that should be considered during malware obfuscation. Using deep learning can help to select the best samples which are satisfying these constraints. In this presentation, we will show how can we use deep learning techniques to improve the performance of obfuscator engines against malware detection techniques.</p> <p>Talk 2: Adversarial machine learning (AML)<br/>Speakers: Dr. Sorcha Healy Principal Engineer, Lead Data Scientist at McAfee and Dr. Catherine Huang - Principal Engineer and Senior Staff Data Scientist at McAfee</p> <p>In this talk Sorcha and Catherine will review the general attack landscape against ML and ML security providers. Understanding the fundamentals behind what a machine learning model does and how it works in combination with the Mitre Adversarial Matrix can provide some sensible MLOps practices to protect the components of a ML system. We will review adversarial machine learning (AML) use cases and demonstrate McAfee’s applied research in AML in protecting our customers against this hostile landscape.</p> "
    },
    {
        "group": "Www Project Devslop",
        "repo": "www-project-devslop",
        "name": "Cloud Security and IAM for Developers",
        "date": "2021-03-21",
        "time": "13:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/276119941/",
        "timezone": "Canada/Eastern",
        "description": "<p>Everyone talks to us about identity as a perimeter and shifting security left, but before we implement new security tools to help us master that, we should get back to basics and learn about the IAM mechanism, how should it be used in a cloud-native application, how to make sure our data and infrastructure are well secured, and then how to scale all of that easily. This talk is for junior and senior developers, who feel like they need a better understanding of the cloud security fundamentals.</p> <p>OUR GUEST: David Hendri</p> <p>David has over 15 years of experience in delivering enterprise software and leading development teams. Prior to co-founding Solvo, David was one of the first R&amp;D employees at Dome9 Security (acq. by CheckPoint in 2018), leading the development of key features and helping users uphold compliance in the cloud. David is a graduate of \"MAMRAM\", the elite military programming training, and served as an officer in the Intelligence Corps.</p> "
    },
    {
        "group": "Www Project Devslop",
        "repo": "www-project-devslop",
        "name": "Secrets Management: A Developer’s View",
        "date": "2021-03-14",
        "time": "13:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/276119934/",
        "timezone": "Canada/Eastern",
        "description": "<p>In this session, we will look at some of the challenges that developers face when their code meets secrets. From Database connection strings and API tokens to encrypting sensitive data that your applications handle. With this context, we will also look at how we can implement simple API-driven workflows into applications to overcome these challenges.</p> <p>OUR GUEST: Rob Barnes<br/>Robert, also known as DevOps Rob, is a Senior Developer Advocate at HashiCorp. His focus is primarily on Cloud security. He comes from a Network engineering background and more recently in his career, he has been working as a Cloud Consultant, helping customers extract maximum value from the Cloud. His experience spans multiple sectors, from Banking and Fintech to Transport, Charities and Cyber Security. He is a strong advocate for open-source, security best practices and building diverse communities.</p> "
    },
    {
        "group": "Www Chapter Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "OWASP Monthly Meeting",
        "date": "2021-04-06",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Bonita-Springs-Chapter/events/276036837/",
        "timezone": "US/Eastern",
        "description": "<p>This meeting will be held virtually only and will continue on our coverage of vulnerable web application issues and the OWASP Top 10. Given time, examples may be provided as well.</p> <p>We generally review security related happenings, share tips and tricks for configuring software and hardware, and chat about various topics such as security, privacy, exploitation, vulnerabilities, pen testing, web app security, CTFs, IoT security, mobile security and anything else members wish to discuss.</p> "
    }
]