[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - Virtual - November",
        "date": "2023-11-21",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/296374615",
        "timezone": "Europe/Copenhagen",
        "description": "Notice that this is a virtual event running on Zoom. Please reach out if the event gets packed, and I will add room for more people.\n\nOWASP Aarhus will be joined by Simon Bennetts, project-lead for ZAP, and Liz Keogh, who will talk about human nature and behaviour and how that impacts software development.\n\nWe will update this event with more details when we get closer to the event."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "LASCON 2023 - OWASP Top-10 Training (Free)",
        "date": "2023-10-25",
        "time": "2:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/296691055",
        "timezone": "America/Chicago",
        "description": "Welcome to this beginner course on the OWASP Top 10!\n\nThis course has no technical prerequisites, it is truly meant for everyone. Whether you are a software developer, engineering manager, security/risk analyst, auditor, security professional, or simply curious on application security and looking for an introduction to the OWASP Top 10; This course is for you!\n\nIn this course you will learn a little bit about the OWASP Foundation and how you can be part of this opensource community. We are going to learn about the OWASP Top 10 risks and how they get periodically updated.\n\nFor each of the OWASP Top 10 risks, we are going to look at the key information security concepts, so that you better understand the definition of each risk. Then we are going to – together – define each risk – and we are going to do this in layman’s terms, so that you really understand each risk.\n\nWe are also going to look at the main challenges that developers and others face that cause each risk. Finally, we are going to give examples of good and bad code using pseudocode and we are going to conclude with some of the best protection practices to help you and your team avoid each risk from materializing.\n\n**Who this course is for:**\n\n* This course has no technical prerequisites, it is truly meant for everyone\n* Web application, API, and mobile developers\n* Risk managers and auditor looking to understand the OWASP Top 10 risks\n* Cybersecurity professionals looking for an introduction to the OWASP Top 10, or a refresher\n\n**Timing:**\n\n* 12:30-1pm - Check-in & arrival\n* 1pm - Session start\n* 2:45-3pm - break\n* 5pm - Session end\n\n**Please note:** Lunch is **not** provided, and you will not be able to bring food into Norris Conference Center. There are several places within walking distance where you may eat before the session."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker days:- Integrating Automated Security Checks into the CI/CD Pipeline",
        "date": "2023-10-24",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/296670889",
        "timezone": "America/Los_Angeles",
        "description": "We are thrilled to announce a Hands-on Hacker Days session, courtesy our Hosts Akto.io . We also thank them for arranging awesome food and drinks.\n\nTopic: Integrating Automated Security Checks into the CI/CD Pipeline for DevSecOps\n\nThis workshop will equip participants with the knowledge and hands-on skills to integrate Static (SAST), Dynamic (DAST) and Interactive (IAST) Application Security Testing into their GitHub DevSecOps pipelines.\n\nPre-requisites:\n\nA GitHub account.\n\nBasic understanding of application security.\n\nAttendees are required to bring their laptops with internet connectivity\n\nAgenda:\n\nIntroduction (15 minutes)\n\nThe DevSecOps paradigm and its importance.\n\nUnderstanding GitHub Actions.\n\nThe relevance of SAST and DAST in the CI/CD pipeline.\n\nOverview of GitHub Actions for CI/CD (10 minutes)\n\nBasic components: workflows, runners, actions.\n\nDemonstration: A simple CI pipeline with GitHub Actions.\n\nHands-on: Integrating SAST with GitHub Actions (20 minutes)\n\nIntroduction to Static Application Security Testing.\n\nPopular SAST tools and choosing one for demonstration.\n\nHands-on activity: a. Setting up the SAST tool on a sample GitHub repository. b. Writing a GitHub Actions workflow to automate SAST scans on every pull request or push. c. Analyzing and understanding the SAST report in the GitHub interface.\n\nHands-on: Integrating DAST and IAST with GitHub Actions (60 minutes)\n\nIntroduction to Dynamic Application Security Testing and Interactive application security testing.\n\nCommon DAST and IAST tools suitable for CI/CD integration.\n\nHands-on activity: a. Setting up a test environment (ideally a deployed version of the app). b. Configuring the DAST tool to scan the deployed application. c. Writing a GitHub Actions workflow to trigger DAST scans post-deployment. d. Analyzing and responding to DAST findings within GitHub.\n\nWhat's in it for Participants?\n\nSkill Enhancement: Mastery of integrating key security tools within the popular GitHub Actions CI/CD framework.\n\nHands-on Experience: Directly apply workshop teachings to real-world scenarios.\n\nCollaboration: Network and collaborate with peers facing similar challenges.\n\nSpeaker Bios:\n\nAnkush Jain: Ankush is the co-founder & CTO at Akto (https://www.akto.io) - The open source API Security product. Prior to starting Akto he worked at CleverTap as VP of Engineering. He has also worked for 5 years as a Quant at Morgan Stanley. He holds Bachelors in Technology from IIT Bombay. He is also a speaker at Black Hat and Defcon.\n\nAnkita Gupta: She is the co-founder and CEO of Akto.io - The open source API Security product. Prior to Akto she has experience working in VMware, LinkedIn and JP Morgan. She holds MBA from Dartmouth College and Bachelors in Technology from IIT Roorkee. She is also a speaker at Black Hat and Defcon."
    },
    {
        "group": "Beja",
        "repo": "www-chapter-beja",
        "name": "0x00 Kickoff",
        "date": "2023-11-08",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-beja-chapter/events/296880579",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Beja chapter kickoff meetup.\n\nJoin us and seize the opportunity to **win** a ticket to the premier technical information security conference in Portugal: BSides Lisbon!\n\n**Schedule**\n\n18:00 - **OWASP Beja: Five Ws and How** by OWASP Beja chapter leadership team\n18:30 - **OWASP API Security Top 10** by Paulo A. Silva\n19:20 - **Snacks & Drinks**\n\n**Talks**\n\n**OWASP Beja: Five Ws and How**\nby OWASP Beja chapter leadership team\n\nA warm welcome message from the OWASP Beja chapter leadership team that aims to provide a comprehensive understanding of the chapter's purpose, inception, and future plans.\n\nYou're invited to join us in this momentous launch event and, together, help establish OWASP Beja as a dynamic community in the realm of application security.\n\n\\-\\-\\-\n\n**OWASP API Security Top 10**\nby Paulo A. Silva, OWASP API Security Project co-Leader\n\nIn today's app-crazy universe, APIs are the secret sauce behind the magic. Think of them as the superheroes of tech, from banking to retail, transport to smart cities, they're the unsung heroes revealing the secrets of business logic and access to the treasure trove of sensitive data. But hold on to your cyberhats because where there's treasure, there are pirates!\n\nAPIs have become the gold mine for attackers. They're the common thread weaving through those notorious data breaches we've all heard about. Now, how do you turn the tables on these cyber scoundrels? Well, the answer is simple: learn their tricks, and you'll become the ultimate API security hero! We're here to take you on a thrilling, rollercoaster ride into the heart of API security: a hands-on deep dive into the OWASP API Security Top 10!\n\n**About the Speaker**\nPaulo is the Principal Security Researcher and Pentester at Char49. Since his first OWASP local event back in 2010, he has been an active community member contributing to several OWASP projects. He has co-authored the OWASP API Security Top 10 and co-leads the OWASP API Security Project."
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Bham November Meetup!",
        "date": "2023-11-16",
        "time": "8:00Z",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/296510816",
        "timezone": "Europe/London",
        "description": "Greetings OWASP Birmingham members!\n\nWe are excited to announce our second Meetup of 2023 on Thursday, November 16th once again at Hays in One Colmore Square.\n\nThis in-person Meetup will feature two fantastic infosec talks from our knowledgeable speakers. We have a great community of over 500 members and we can't wait to reconnect and learn together.\n\nMore details to come soon!\n\nPlease mark your calendars for Thursday, November 16th for what is sure to be an engaging and educational evening. We hope to see many of you there!\n\nRSVP when you get a chance so we can plan accordingly. We look forward to catching up with you all next month!"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter November 2023 Meetup",
        "date": "2023-11-08",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owaspboston/events/295661584",
        "timezone": "America/New_York",
        "description": "Join us at the OWASP Boston Meetup this month to get a hands-on lesson about IAST from Pranoy De and Tony Quadros. During the session Pranoy and Tony, will answer the questions, what is IAST, and how can it make your developer’s lives easier.\n\n**\\*\\*Attendees must bring their own laptop and be in-person to participate in the hands-on workshop portion of this event**\n\n**\\*\\*Attendees must provide their name and email addresses (*please place in \"Current Role\" box*) information at time of registration to participate in the hands-on workshop portion of this event.**\n\nThis session will give you a foundational understanding of IAST (Interactive Application Security Testing), what it is, how it works, and provide you, as a security engineer or software developer, with the knowledge of how it can make your lives easier when it comes to doing security analysis of your applications and code. You will then be able to get **hands on** experience with IAST, using it to find vulnerabilities in a sample application then be able to go in and actually remediate the findings.\n\nAfter attending this session, you will understand the fundamentals of IAST (Interactive Application Security Testing) and have actual hands-on experience with the testing methodology.\n\nTony Quadros based in southern New Hampshire is a 10+ year veteran of the cyber security vendor landscape and specifically focused on the application security side of Cyber Security and software development. Having experience helping numerous enterprises from the largest social media companies in the world to the largest insurance companies with ever improving their application security programs to ensure the software we use every day is as secure as possible. More recently Tony has helped lead and revive OWASP Maine, a OWASP chapter focused on rallying the software development and security community in northern New England with providing great educational talks, networking events, and a safe outlet for sharing new job opportunities for northern New Englanders interested in advancing their software development and security careers.\n\nPranoy De is a 10+ year veteran of software engineering and application security based in Toronto Canada, getting his start as a DB2 Software Developer for IBM, full stack python developer, and more recently working with enterprises worldwide with ever improving their application security programs with a focus on threat modeling and now runtime application security testing. Pranoy has a deep passion for helping with establishing critical integrations for his customers to ensure all solutions work seamlessly within their application security stack and ensuring seamless workflows for software developers looking to ever improve their DevSecOps and appsec processes."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "CSRF and CORS: $num.toString() Facts and a Lie.",
        "date": "2023-10-25",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/296322658",
        "timezone": "Australia/Brisbane",
        "description": "Watch Colin’s gradual decent into insanity as he attempts to unpack all the idiosyncratic behaviours of web that lead to Cross-Site Request Forgery and Cross-Origin Resource Sharing vulnerabilities within modern Web Applications.\nDon’t know CSRF and CORS? After this talk, you’ll understand the fundamentals.\nThink you know CSRF and CORS? By the end of the talk, you’ll probably conclude that nobody \\*knows\\* CSRF and CORS."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS October 2023",
        "date": "2023-10-26",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/296793555",
        "timezone": "America/Denver",
        "description": "Speaker: Ezra Ortiz: \"The Art & Science of Cyber Analytics One Fold At A Time\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\n\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Every risk is not a CVE - Bolster up against software supply chain attacks",
        "date": "2023-11-16",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295118628",
        "timezone": "America/New_York",
        "description": "3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\n\nWe will present a comprehensive, comprehensible and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy, available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\n\nMantium AI will be providing snax."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP Oct Meet - In person",
        "date": "2023-10-24",
        "time": "7:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/296587433",
        "timezone": "America/Chicago",
        "description": "OWASP Dallas is ready to host in-person meets.\n\n\"**AppSec 2.0: Reimagine AppSec with Runtime Analysis**\n\nSCA tools (container and dependency scans) generate too much noise. Runtime security tools don’t understand SCA findings, and don’t come in until production. What if you could marry SCA with runtime analysis during dev, test, and prod?\n\nIn this session, Kiran Kamity, Founder and CEO of Deepfactor, will discuss how the next generation of AppSec needs to go beyond just integrating static SCA into your CI pipeline, to analyzing insecure behaviors inside running apps and correlating that back to SCA to understand which vulnerable components are actually loaded into memory and used by your application. This new approach to AppSec will detect both known vulnerabilities/CVEs with SCA scans and unknown vulnerabilities with runtime analysis. It will then prioritize known vulnerabilities with runtime correlation of SCA findings. End result: you catch most of the key risks in your app, prioritize the key items your devs need to work on without flooding them with alerts, and remove unused components from your containers to burn down your CVE debt rapidly. And achieve the true mission of AppSec…to empower engineering and security teams to create secure applications."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "CSA Colorado  Fall Summit 2023",
        "date": "2023-10-25",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/296253810",
        "timezone": "America/Denver",
        "description": "OWASP Denver wanted to help promote a great upcoming conference put on by our sister organization in Denver on October 25:\n\n**The Cloud Security Alliance (CSA) - Colorado Chapter** is holding a unique event this year\n\n**AI and Cybersecurity: Revolution and Risks**\n\nAll sessions, speakers and content are dedicated to exploring AI's impact on the future of cybersecurity.\n\nCome be part of this all-day conversation. Registration includes:- Access to all sessions\n\n\\- Breakfast\n\\- Lunch\n\\- Networking happy hour\n\\- 6 Continuing education Credits\n**\\- An \"All\\-AI Panel\"\\, where the audience will be able to interact and ask questions of AI personalities representing experts in various fields\\.**\n\nThe full agenda is available now, including information about our keynote, speakers and topics:\n\nRegister now: [https://iplanit.swoogo.com/csacofall2023/](https://iplanit.swoogo.com/csacofall2023/)"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "Security Pub (SäkPub)",
        "date": "2023-11-07",
        "time": "7:30+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/296558368",
        "timezone": "Europe/Stockholm",
        "description": "**OWASP Gothenborg Chapter invites you to an evening of security and entertainment!**\n\nCome hang out, grab a beer, and play arcade games with other security minded people!\n\nWhen: Tuesday 7/11 17:30 - 21:30\nWhere: Zamenhof, Esperantoplatsen 5, 411 19 Göteborg"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "OWASP Houston Chapter API Security Study Group - Lab Setup",
        "date": "2023-11-06",
        "time": "8:30-06:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/296859686",
        "timezone": "America/Chicago",
        "description": "This session covers lab setup, is aimed for novices, and will be recorded.\n\nWe will setup the following tools\n\n* Kali Linux\n* Postman\n* Burp Suite Community Edition\n* Zed Attack Proxy (ZAP) with Postman Add-On\n* crAPI\n\nWe will be installing and configuring Kali Linux on VMware Workstation Player since it is free for personal, non-commercial use. For full functionality and free training, you will want to create accounts for Postman and PortSwigger. Please review all license agreements and terms of usage for all of the products listed below.\n\n[VMware Workstation Player](https://www.vmware.com/content/vmware/vmware-published-sites/us/products/workstation-player.html.html)\n\n[Get Kali](https://www.kali.org/get-kali/)\n[Kali Virtual Machines](https://www.kali.org/get-kali/#kali-virtual-machines)\n\n[Postman](https://www.postman.com/)\n[Create Postman Account](https://identity.getpostman.com/signup)\n\n[Burp Suite Community Edition](https://portswigger.net/burp/communitydownload)\n[PortSwigger Web Security Academy](https://portswigger.net/web-security)\n\n[Zed Attack Proxy (ZAP)](https://www.zaproxy.org/)\n[ZAP Getting Started](https://www.zaproxy.org/getting-started/)\n\n[completely ridiculous API (crAPI)](https://owasp.org/crAPI/)"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#05 The Cake",
        "date": "2023-11-15",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/296853686",
        "timezone": "Europe/Lisbon",
        "description": "Join us for an evening of celebration and preparation as OWASP Lisbon marks its one-year anniversary! As we reflect on the past year's achievements, we're excited to kick off a series of meetups that will lead us into the highly anticipated OWASP Global AppSec Lisbon Event. This first meetup of the series will set the stage for an incredible journey towards building more secure applications and connecting with fellow appsec enthusiasts.\n\nThe meetup takes place on November 15th, 2023, at 18:00, at the OLX office, and is **sponsored by OLX and AP2SI**.\n\nThe schedule is the following:\n18:00 - **The Cake** by the OWASP Lisboa chapter leadership team\n18:15 - **Seeing What’s Wrong Just Right** by Jasvir Nagra\n19:10 - **Why everyone in your cyber security team needs to be an AI expert** by Dinis Cruz\n20:00 - **Drinks & Dinner** by OLX\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Seeing What’s Wrong Just Right**\n\nSpeaker: **Jasvir Nagra**\n\nAbstract:\nWriting web applications is hard. Debugging them is harder. Security bugs are even harder because not only does an application have to work, it has to stop working when the input is malicious. One approach web developers have taken to managing the complexity of writing large web programs is to make it harder to write incorrect programs. Static type checkers, linters, tests and testing frameworks have all made it easier to write correct code. Nevertheless, incorrect and vulnerable programs still exist. In fact, the very success of these tools in avoiding common errors has meant developers spend increasing amounts of time debugging only subtle bugs. In distributed systems, the challenge is even harder because debugging tools give you glimpses into the program state—some on the server, some on the client—without giving you a coherent view of the entire system. Not only are web programs inherently distributed between the server and the client, any one web page in the browser is itself made up of different iframes, events and event handlers, and sometimes service workers all communicating asynchronously. In this talk, I will share a few painful distributed web app debugging anecdotes and an alternate approach to get a holistic view of a program to track down elusive bugs. This approach uses virtualization to create complete traces of just those aspects of the program we suspect are buggy without having to model all program state. Virtualization allows us to momentarily ignore incidental bugs discovered while hunting the core one without it getting in the way, and visualization of the collected traces to build up causal diagrams to inform our intuition when our mental models deviate from reality. I will demonstrate how to recognize and tackle debugging problems with this approach and cover pitfalls you may run into with virtualization.\n\nBio:\nJasvir Nagra is widely recognized as a thought leader in software protection. He is co-author of Surreptitious Software, the definitive textbook on software protection, and an early researcher in obfuscation, software watermarking, and fingerprinting. With more than 12 years of experience, his professional path includes companies such as Instart, Dropbox and Google - where he led the Caja project. As an advisor to Jscrambler, he is helping cybersecurity startups address key technological challenges.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Why everyone in your cyber security team needs to be an AI expert**\n\nSpeaker: **Dinis Cruz**\n\nAbstract:\nSimilar to how electricity revolutionised our lives and is now ubiquitous, Gen AI is poised to become an integral part of everything Cyber Security teams do everyday. Therefore, there is an increasing need to deepen our understanding and expertise in this transformative technology. It's time to embrace the opportunities AI presents and equip ourselves with the knowledge to thrive in this rapidly evolving landscape.\n\nBio:\nDinis Cruz is the Chief Scientist of Glasswall and the CISO of Holland & Barrett, who brings a unique blend of Security and Engineering expertise with 20+ years experience in Cyber Security and Software Development. Dinis is focused on creating Gen AI powered teams and environments where engineering and security are enablers and accelerators for the business, with a big focus on the productisation and commercialisation of advanced technologies."
    },
    {
        "group": "Ljubljana",
        "repo": "www-chapter-ljubljana",
        "name": "Opening session OWASP Ljubljana - Post quantum cryptography",
        "date": "2023-11-09",
        "time": "6:30+01:00",
        "link": "https://www.meetup.com/owasp-ljubljana-chapter/events/296853307",
        "timezone": "Europe/Belgrade",
        "description": "Kriptografija je učinkovit način za zaščito zaupnosti in celovitosti informacij ter zaščito informacijskih sistemov pred kibernetskimi grožnjami. Kvantno računalništvo grozi, da bo razbilo večino današnje kriptografske zaščite. Čeprav že prihajajo poročila o prvih poskusih zloma uveljavljenih kriptografskih algoritmov, kvantni računalniki, ki so na voljo ta trenutek, v splošnem še niso dovolj zmogljivi, da bi jih razbili. Vendar bo v prihodnosti možno izkoristiti dovolj zmogljiv kvantni računalnik za dešifriranje, branje ali dostop do občutljivih informacij.\nSpreminjanje miselnosti in načina dela, ki ga zahtevajo kvantni računalniki in algoritmi, je dolgotrajno in zahtevno, saj gre za popolnoma drugačen pristop od klasičnih računalnikov in algoritmov. Prehodi na nove kriptografske algoritme so dragi, motijo poslovanje in običajno trajajo veliko dlje od predvidenega. Prav zdaj je pred nami eden najpomembnejših kriptografskih prehodov: od klasične kriptografije z javnim ključem do kvantno varne, post-kvantne kriptografije (PQC – post quantum cryptography). Pri PQC gre za oblikovanje kriptografskih rešitev, ki jih lahko uporabljajo današnji nekvantni računalniki in za katere smo prepričani, da so odporne tako na klasično kot na prihodnjo kvantno kriptoanalizo."
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Secure Coding Tournament CTF [IN-PERSON]",
        "date": "2023-10-24",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/296523070",
        "timezone": "Europe/London",
        "description": "**OWASP London Chapter** is pleased to announce the OWASP London CTF Tournament for Software Developers kindly sponsored by **Monzo** and **SecureFlag**. Discover vulnerabilities, capture flags, win real prizes!\n\nThis event is kindly hosted and sponsored by: **Monzo**\nThe CTF Tournament platform is kindly provided by: **SecureFlag**\n\n**Venue Location**: Monzo, 5 Appold St, London, EC2A 2AG\n**Nearest Tube:** Liverpool Street - 4 min walk\n**Doors open and registration**: 6:00pm (grab some food & drink and connect your laptop)\n**CTF starts**: 6:30pm (we start on time)\n**Expected CTF finish and Prize Giving Ceremony**: 8:45pm-9:00pm\n\nCTF (Capture The Flag) is a type of computer security competition. Contestants are presented with a set of challenges and puzzles which test their creativity, technical skills, vulnerability-finding skills and problem-solving ability. The challenges usually cover a number of categories of vulnerabilities in source code and when solved, each yields a “flag” which is submitted to a real-time scoring service. The difficulty levels are from beginner to advanced.\n\n**IMPORTANT**: Please **bring your own** **LAPTOP** and a **CHARGER** for it.\n\n**The Top 3 scorers** will win exciting prizes generously provided by the OWASP London Chapter sponsors.\n\nParticipation is FREE, but the **number of seats is strictly limited** and **registration is required** to attend.\n\n**Please remember to bring your own laptop!**\n\nHOW TO FIND THE VENUE:\nThe event will take place in the Monzo event space which is at the back of the Boardwalk House, 5 Appold Street, London EC2A 2DA. Once you get to the Boardwalk House, please do not try to use the main circular-shaped entrance - instead please keep walking along Appold Street towards the back of the building and you will see the glowing neon \"monzo\" logo through the glass double-doors - this is the venue!\n\nPhoto of the correct entrance attached.\n\n**IMPORTANT**: By participating in this activity you agree to abide by the **OWASP Code of Conduct**\n\n**CODE OF CONDUCT**\nWe hope you enjoy our events, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback or would like to speak to us, we take these matters very seriously. You can find the full text of the OWASP Code of Conduct Policy here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on API Security Workshop w/ OWASP API Security Top 10",
        "date": "2023-10-27",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/296440656",
        "timezone": "America/Los_Angeles",
        "description": "**Hands on API Security Workshop: Integrating API Security Checks into the CI/CD Pipeline**\n\nHello AppSec teams and tech enthusiasts! We're thrilled to roll out an exceptional DevSecOps workshop in collaboration with OWASP LA and offered by [Akto](https://akto.io). This workshop will equip participants with the knowledge and hands-on skills to integrate API Security Testing into their GitHub DevSecOps pipelines, using [OWASP API Security Top 10](https://owasp.org/API-Security/).\n\n## **Pre-requisites:**\n\n· A GitHub account.\n· Basic understanding of application security.\n· Attendees are required to bring their laptops with internet connectivity\n\n## **Agenda:**\n\n### Introduction (15 minutes)\n\n1. The DevSecOps paradigm and its importance.\n2. Understanding GitHub Actions.\n3. The relevance of API Security testing in the CI/CD pipeline.\n\n### Overview of GitHub Actions for CI/CD (10 minutes)\n\n1. Basic components: workflows, runners, actions.\n2. Demonstration: A simple CI pipeline with GitHub Actions.\n\n### Hands-on: Integrating API Security testing with GitHub Actions (60 minutes)\n\n1. Introduction to API Security Testing.\n2. Overview of OWASP Top 10 for API Security\n3. Hands-on activity:\n4. a) Setting up a test environment (ideally a deployed version of the app)\nb) Configuring the API Security tool to scan the deployed application\nc) Writing a GitHub Actions workflow to trigger API Security scans post-deployment\nd) Analyzing and responding to API Security findings within GitHub\n\n## **What's in it for Participants?**\n\n1. **Skill Enhancement:** Mastery of integrating API Security checks within the popular GitHub Actions CI/CD framework.\n2. **Hands-on Experience:** Directly apply workshop teachings to real-world scenarios.\n3. **Collaboration:** Network and collaborate with peers facing similar challenges.\n\n**Food and drinks** will be provided and there's a free 90 minute **parking** available across the street.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - OCT 25, 2023",
        "date": "2023-10-25",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294467794",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: How Can DevSecOps Improve Security?\n\nJoin us for dinner, drinks, networking and a great talk by **Mary Wang**, Software Engineering Manager at Northrop Grumman Space Systems\n\n**NOTE**: New Location!! \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n**ABSTRACT**: DevSecOps is the new buzzword that has been around for a while now. DevOps, DevSecOps, Agile, CI/CD pipeline, etc., and chances are you have heard these terms when discussing the software development life cycle. What do those terms mean? With the recent increasing cyber-attacks on software such as in-house developed code or software supply chain (open source software), the traditional ways of decreasing the attack surface on software applications no longer work effectively. Moreover, organizations are pressured to develop code faster and cheaper to meet customer demands. Mary will explain what DevSecOps is and how this practice is better than DevOps in security. In addition, how CI/CD fits in DevSecOps. Lastly, the popular tools are used in DevSecOps practices. She will provide the real-world experience challenges that she encountered.\n\n**Thanks to our Sponsor**: *[SAFEBASE](https://safebase.io/)*\n*SafeBase is the customer-facing Trust Center that automates B2B security reviews. Companies like LinkedIn, Asana, OpenAI, and Snyk use SafeBase to reduce security questionnaires, create a better buying experience, accelerate sales velocity, and position security as a revenue driver.*\n\n**SPONSORSHIP Opportunities Available** *Vendors interested in sponsoring please send an email to* *sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Madison",
        "repo": "www-chapter-madison",
        "name": "October Meeting",
        "date": "2023-10-24",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-madison/events/296510809",
        "timezone": "America/Chicago",
        "description": "https://guidedconversations.org/\n\nDiscussion Topics\n\n1. [LLM Top 10](https://www.llmtop10.com/)\n2. “The Bogus CVE Problem”: [https://lwn.net/Articles/944209/](https://lwn.net/Articles/944209/)\n3. (your topic here)\n\nTool Spotlights\n\n1. [Checkmarx KICS](https://docs.kics.io/)\n2. https://github.com/guacsec/guac"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Cybersecurity of Critical SAP Apps at Rising Tide Brewery",
        "date": "2023-10-26",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/296600794",
        "timezone": "America/New_York",
        "description": "**OWASP Maine: Addressing Cybersecurity on Business Critical SAP Applications**\n\nApplication and software security are so vitally important in all aspects of the business especially with every company becoming a software company as they navigate through digital transformations.\n\nWith that being said ERP systems are some of **THE MOST** critical applications within enterprises today and come with their own unique set of security challenges.\n\nThe fine folks at Onapsis who 100% specialize in SAP and ERP application security will be on site to dive deep into these specific challenges. They will also review real world attacks on SAP ERP environments and discuss the best in class strategies and measures you can do to mitigate the risk of exploitation of your ERP environments.\n\nAnyone who is involved in SAP ERP environments from both a software development and security perspective would gain a tremendous amount of knowledge attending this meetup.\n\n\\*Food and drinks will be provided by Onapsis\n\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "(Hybrid) Gamifying Tabletop Exercises",
        "date": "2023-10-24",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/296499717",
        "timezone": "America/Chicago",
        "description": "**Doors open at 5:30! Join us before the talk for pizza!**\n\n**Andrew Carlson -- Gamifying Tabletop Exercises**\n\nHave you wondered whether there is a fun way to examine how prepared teams are for an incident?\n\nAndrew will give an overview of a game he developed and uses to do tabletop exercises for incident response at his company. He will walk through the set up of the game and walk attendees through a round of the game.\n\nThe game doesn't require deep security knowledge from the teams going through the exercise.\n\nFood and drink provided by Concord.\n\n**Agenda**\n5:30 - Doors open for pizza, socializing, and connecting!\n6:10 - Online call opens; OWASP announcements\n6:15 - Presentation\nThere will be time for socializing after the presentation/game as well.\n\nIf needed, the code for the on-line portion will be 972403.\n\nConcord is a proud supporter of cyber security efforts, including providing food, drink, and locale for OWASP-MSP -- thank you!"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-11-21",
        "time": "8:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721034",
        "timezone": "Pacific/Auckland",
        "description": "For November, we're shifting our Meetup by one week, to work around several other events going on in the region - the NZITF Conference is taking place in Wellington Monday and Tuesday, 13-14 November; the ISANZ Awards Dinner is on the evening of 14 November; and John will be in Melbourne for the OT Cyber Resilience Summit on the 14th.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for November will be **A10:2021 - Server-Side Request Forgery (SSRF).**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make.\n\nThe Auckland-area OWASP Meetup usually takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Training Day - Dunedin",
        "date": "2023-11-11",
        "time": "8:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/296507998",
        "timezone": "Pacific/Auckland",
        "description": "We're pleased to announce that we'll be holding an OWASP Training Day event in Dunedin, on Saturday, 11th November.\n\nClasses will run 8:45 a.m. - 5:30 p.m. Tea breaks and lunch will be provided.\n\nRegistration Fee: $99 per attendee (plus GST and booking fees)\n\nWe're in the process of confirming our classes and trainers, so we'll update this description with registration information as soon as those are confirmed."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Global AppSec - DC",
        "date": "2023-10-30",
        "time": "0:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721118",
        "timezone": "Pacific/Auckland",
        "description": "**Global AppSec DC returns October 30 - November 3!**\n\nDesigned for private- and public-sector InfoSec professionals, the two-day OWASP conferences equip developers, defenders, and advocates to build a more secure web.\nWe are offering educational 1-day, 2-day, and 3-day training courses immediately following the conference.\n\n**Conference dates:** Monday and Tuesday, October 30-31\n**Training dates:** Wednesday to Friday, November 1-3.\n\nJoin us for leading application security technologies, speakers, prospects, and community, in a unique event that will build on everything you already know to expect from an OWASP Global Conference.\n\nConference Site: [https://dc.globalappsec.org/](https://dc.globalappsec.org/)\nRegistration: [EventBrite](https://www.eventbrite.com/e/owasp-global-appsec-washington-dc-2023-tickets-519195877847)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Hands-on API Security Workshop with OWASP JuiceShop and other vulnerable apps",
        "date": "2023-10-26",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/296608425",
        "timezone": "America/Los_Angeles",
        "description": "Step into the world of API Security with our immersive two-hour hands-on training event at the OWASP meetup!\n\nWe’re excited to announce this opportunity for appsec teams to enhance their skills in API Security and writing business logic tests. We will have a hands-on workshop focused on creating and running business logic tests using Akto. You will learn to write ten different business logic tests, which will then be executed against Juice Shop and other vulnerable apps. The goal of the workshop is to give a hands-on experience in writing and automating custom API security tests related to authentication, authorization and access control issues. The workshop aims to be interactive, engaging, and an enriching learning experience. You will learn the fundamentals of writing, automating, and executing business logic tests. By the end of this training, participants will be able to automate 10 business logic tests, a key skill in the realm of API security.\n\n**What to Expect?**\n\n* By the end of the workshop participants will be able to write 10 business logic tests focused on authentication, authorization and access control issues.\n* Networking opportunity with fellow security professional.\n* Ask absolutely any questions about securing APIs\n\n**Requirements:**\n\n* Attendees are required to bring their laptops with internet connectivity\n\n**Note**\nParticipants are encouraged to bring their own API projects or sample APIs they are trying to test to receive personalized guidance and recommendations during the workshop. We will help everyone write their own custom tests during the workshop itself so you can test your own APIs. If not, we will be using Juiceshop or other vulnerable apps for demo purposes."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter 3: Cyber Peterborough MeetUp",
        "date": "2023-11-01",
        "time": "9:30Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/295240302",
        "timezone": "Europe/London",
        "description": "**We're evolving!**\n\nListening to our member feedback, we've moved towards '**Cyber Peterborough**', have a new lick of paint and are still focussing on all things cyber security.\n\n**'Powered by OWASP'** means we still practice, share and discuss content amongst peers in our global network, now with a local feel closer to our community.\n\n**Making Cyber Security Accessible.**\n\nCyber Peterborough is for everyone. Come along, bring a friend, share with your colleagues. You don't need to be a security professional, each session will break down topics to ensure everybody can take something away.\n\n**Agenda**\n\n1. **Ben Mackereth** \\| A working title of a mysterious nature\n2. **Speaker TBC**\n3. **Sign up to Cyber Peterborough's first ever Capture the Flag!** Suitable for all experiences and abilities, join us over food and drink and learn whilst doing in our CTF event.\n\n**When is it?**\n\n* Wednesday 1st November\n* **Start** from 7:30PM\n* **Finish** around 11:00PM\n\n**Where is it?**\n\n* The Brewery Tap, Peterborough\n\n**How can you get involved?**\n\n* Respond \"I'm Coming!\" to this group\n\nWe look forward to seeing you!"
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Cybersecurity of Critical SAP Apps at Rising Tide Brewery",
        "date": "2023-10-26",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/296600794",
        "timezone": "America/New_York",
        "description": "**OWASP Maine: Addressing Cybersecurity on Business Critical SAP Applications**\n\nApplication and software security are so vitally important in all aspects of the business especially with every company becoming a software company as they navigate through digital transformations.\n\nWith that being said ERP systems are some of **THE MOST** critical applications within enterprises today and come with their own unique set of security challenges.\n\nThe fine folks at Onapsis who 100% specialize in SAP and ERP application security will be on site to dive deep into these specific challenges. They will also review real world attacks on SAP ERP environments and discuss the best in class strategies and measures you can do to mitigate the risk of exploitation of your ERP environments.\n\nAnyone who is involved in SAP ERP environments from both a software development and security perspective would gain a tremendous amount of knowledge attending this meetup.\n\n\\*Food and drinks will be provided by Onapsis\n\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-11-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296626035",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #23: Secure Coding Tournament [IN-PERSON]",
        "date": "2023-10-26",
        "time": "8:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/296120016",
        "timezone": "Europe/Bucharest",
        "description": "## Details\n\nThe next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\nTheme sessions - Theme: Secure Coding Tournament\n\n\\`Schedule\\` **\\`Time:\\`**\\` 18:00 to 21:00\\`\n\n18:00 - 18:20 - Welcome participants - Lucian Patian (Haufe)\n18:20 - 18:30 - Introduction, OWASP News & Updates - Catalin Curelaru\nSecure code\n18:30 - 19:45 - Secure Coding Tournament\n19:45 - 20:00 - Prizes\n\nLocation of the event: UBC0, et 15, Sediu Haufe.Group, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by **Haufe**.Group & **Secure Code Warrior**\n\nMore about the event:\n[Secure Code Warrior](https://www.securecodewarrior.com/) brings you a defensive security-based tournament from a developer's perspective. *The tournament allows you to test your skill in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability.*\n\n*You don’t need extensive programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but is also secure.*\n\nYou can find the tournament step-by-step guide here: [https://youtu.be/o8XhKK_eOOs](https://youtu.be/o8XhKK_eOOs)\n\nThe tournament is hosted physically by **Haufe**.Group and you can join through your laptop. The tournament it should take only a 1.5 hours, drop-in as you see fit during the duration of the event to complete all the challenges and win prizes!"
    },
    {
        "group": "Tiruvallur",
        "repo": "www-chapter-tiruvallur",
        "name": "Null and OWASP combined meetup",
        "date": "2023-10-28",
        "time": "4:30+05:30",
        "link": "https://www.meetup.com/tiruvallur-owasp-meetup-group/events/296618490",
        "timezone": "Asia/Kolkata",
        "description": "* Hacking Companies on Mails - Deep Dive into Email Security by **Sriram**\n* AI and ML in CyberSecurity by **PradeepKumar P**\n* You can be a Human Decompiler by **Ravi Rajput**\n* Cloud Security 101 by **Chandresh Gupta**"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Drink Your Own Champagne: How to Threat Model Your Threat Modeling Program",
        "date": "2023-11-15",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasptriangle/events/296265774",
        "timezone": "America/New_York",
        "description": "We threat model our technology to ensure strong, resilient designs. As a critical control, our practice of threat modeling demands the same rigor. Learn to drink your own champagne by threat modeling your program's weaknesses to design better strategies and unlock more business value from your threat models."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup: Developer mode",
        "date": "2023-10-24",
        "time": "8:30-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/296685550",
        "timezone": "America/Montevideo",
        "description": "¿Te interesa una práctica de ciberseguridad pensada **exclusivamente para desarrolladores**?\n\nEn esta Meetup, utilizando el proyecto [OWASP Secure Coding Dojo](https://owasp.org/www-project-secure-coding-dojo/) tendremos una sesión de ejercicios que incluyen **revisión de código** y **detección de vulnerabilidades**. Los desafíos son guiados y se cuenta con el apoyo de expertos en seguridad de aplicaciones.\n\nSolo precisas **llevar una notebook** para participar, sin descarga de materiales o herramientas. Solo se utilizará un navegador.\n\nEn esta instancia la Meetup será en las oficinas de Geocom (Dionisio Oribe 3071).\n\n**IMPORTANTE**: *Las medidas de seguridad del host requieren que los asistentes provean de antemano **nombre** y **documento de identidad**. Al ingresar a las oficinas además se pedirá el **número de teléfono**. Estos datos se pedirán a los asistentes confirmados **el día previo al evento**. Dejamos a criterio de los asistentes si quieren ofrecer tal información o desistir de atender. **Habrá lista de espera** para incluir a quienes en esta instancia no entren en el cupo.*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "LLM and NLP APIs: A Journey to Avoiding Data Breaches",
        "date": "2023-11-16",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248521",
        "timezone": "America/Vancouver",
        "description": "**Ads Dawson**, v1.1 Technical Release Lead & Entry Lead for the OWASP Top 10 for Large Language Model Applications and a seasoned security engineer at Cohere, will take us on an insightful journey through the challenges and solutions involved in securing large language models and natural language programming APIs. With his extensive experience, Ads will shed light on how to avoid data breaches, fortify against attacks, and enhance the security of these crucial technologies through the use of tools like OWASP Top 10 for LLMs. Don't miss this opportunity to learn from a true expert in the field!"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | From Basics to Burp: Navigating PortSwigger Academy",
        "date": "2023-11-16",
        "time": "8:30-08:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/296919377",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria chapter is pleased to present a workshop hosted by Wyatt Harvey and Sebastian Bethell titled \"From Basics to Burp: Navigating PortSwigger Academy\".\n\nThe event will be held on November 16, 2023 from 6:30 PM to 8:30 PM at Fort Tectoria (doors open at 6 PM).\n\nThe event will feature the workshop including an introduction to PortSwigger Academy as well as working through five of the labs. Snacks, networking, and fun will also be included.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in web application hacking. If you would like to attend, please click the RSVP button to reserve your spot as we have limited seats available.\n\nBring your laptop with BurpSuite installed and join us for a hands-on evening of application security fun!\n\nWe would also like to give a special thanks to First West Credit Union for sponsoring this event."
    },
    {
        "group": "Yerevan",
        "repo": "www-chapter-yerevan",
        "name": "OWASP Yerevan October meetup - Tigran Avanesyan",
        "date": "2023-10-25",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/owasp-yerevan/events/296918134",
        "timezone": "Asia/Yerevan",
        "description": "OWASP Yerevan October meetup agenda:\n\n1. Unlocking Barriers: Bypassing Security Checks & SDK Protection - Tigran Avanesyan\n\nRoom number will be announced later."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-11-08",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889868",
        "timezone": "America/New_York",
        "description": "Welcome to our monthly SAMM community call Wednesday 8th November, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EST.\n\nJoin Zoom Meeting: [Zoom link](https://zoom.us/j/96866048960?pwd=TmZkTSs3ZmlWU09DbHJoSnVZWmdiUT09)."
    }
]