[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Atlanta Cybersecurity Holiday Party",
        "date": "2024-12-17",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304447788",
        "timezone": "America/New_York",
        "description": "Free with RSVP, 21+ with valid ID\n\nJoin the Atlanta Cybersecurity Engineers Holiday Party sponsored by OWASP Atlanta Chapter in partnership with BlackHat Society, DC404, and Cyber Breakfast Club. We will celebrate our vibrant community with fresh tunes from local DJs, and play video games from gaming pop-up CartridgeATL. The winner of the gaming tournament will receive a $100 prize! Arrive on time so you can sign up.\nEvening festivities will be from 7PM - 11PM on Tuesday, December 17th, 2024.\n\nIf you're interested in donating to the evening so we can provide complimentary food and drinks, please email [atlanta-leaders@owasp.org](mailto:atlanta-leaders@owasp.org). They will provide you details on your tax deductible donation. Thank you!\n\nPlease RSVP directly with the venue here:\n[https://smithsoldebar.freshtix.com/events/owasp-foundation-holiday-party](https://smithsoldebar.freshtix.com/events/owasp-foundation-holiday-party)"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "January 2025 OWASP Happy Hour sponsored by Cequence",
        "date": "2025-01-09",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/304571321",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, January 9th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Baku",
        "repo": "www-chapter-baku",
        "name": "OWASP Baku Chapter: Securing the final bytes of 2024!",
        "date": "2024-12-26",
        "time": "19:00+04:00",
        "link": "https://www.meetup.com/owasp-baku-chapter/events/305050046",
        "timezone": "Asia/Baku",
        "description": " Bütün kibertəhlükəsizlik həvəskarlarını səsləyirik! \n\n2024-cü ilin yekun OWASP Bakı Chapter-inin görüşü üçün bizə qoşulun! \n\n Tarix: 26 dekabr 2024-cü il\n Saat: 19:00 (Bakı vaxtı ilə GMT+4)\n Məkan: Onlayn\n\nİli aşağıdakılarla dolu maraqlı sessiya ilə yekunlaşdırırıq:\n Maraqlı texniki mövzular\n Sənaye ekspertləri ilə A.M.A və sual-cavab sessiyaları\n Öyrənmək, paylaşmaq və peşəkar yoldaşlarla əlaqə qurmaq imkanları\n\nGəlin bunu yadda qalan görüş edək! \n\nSuallarınız var? Mütəxəssislərimiz sessiya zamanı onlara müraciət edə bilməsi üçün əvvəlcədən onlardan soruşmaqdan çəkinməyin.\n\nGəlin 2024-cü ili birlikdə güclü şəkildə başa vuraq! \n\n#OWASP #CyberSecurity #BakuChapter #ApplicationSecurity #TechMeetup #CyberSecCommunity #InfoSec #AMA"
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Q4 Meeting - Social with IndyHackers",
        "date": "2024-12-14",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/indyowasp/events/303813178",
        "timezone": "America/New_York",
        "description": "Hi everyone -\n\nLet's plan to meet up at the Indy Hackers Holiday Social as our final meeting of the year!\n\n**\\*\\* Important \\*\\***\nRSVP'ing to this meetup event doesn't register you for the Indy Hackers Holiday Social.\n\nPlease register for the event at -\n\nhttps://www.eventbrite.com/e/2024-indy-hackers-holiday-social-tickets-1063326240409?aff=ebdssbdestsearch"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-12-16",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242792",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Klagenfurt",
        "repo": "www-chapter-klagenfurt",
        "name": "QWASP Klagenfurt Meetup #x-mas-edition",
        "date": "2024-12-18",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-klagenfurt-chapter/events/302811934",
        "timezone": "Europe/Vienna",
        "description": "** Willkommen zu unserem zweiten OWASP-Meetup in Klagenfurt!**\n\n Thema: 10 Proactive Controls\nIn unserem Hauptvortrag gibt Andreas Happe spannende Einblicke, wie Entwickler und Teams proaktiv Sicherheitsrisiken minimieren können – ein Muss für alle, die sichere Anwendungen und Websites bauen wollen.\n\nWir sind jedoch nicht nur auf diese Themen beschränkt und freuen uns, auch über andere Bereiche der Sicherheit zu diskutieren, die Euch interessieren.\n\n Agenda:\nBegrüßung und Vorstellung (15 Minuten)\nVortrag: \"10 Proactive Controls\" (30 Minuten) by Andreas Happe\nOffener Austausch (30min)\n\n‍ **Für wen ist das Meetup?**\n\u2028Dieses Treffen ist für alle gedacht, die sich für die Sicherheit von Anwendungen und Web interessieren – vom Anfänger bis zum Experten. Egal, ob Ihr Entwickler, IT-Sicherheitsexperten oder einfach nur an Sicherheitsthemen interessiert seid, Ihr seid herzlich willkommen.\n\nWir freuen uns darauf, eine offene und engagierte Gemeinschaft zu bilden, in der Wissen und Erfahrungen zum Thema Sicherheit geteilt werden.\n\nBringt Eure Fragen, Euer Wissen und Eure Neugier mit – gemeinsam machen wir das Internet ein Stück sicherer.\u2029Wir freuen uns auf Euch!\n\n **Let us know if you are an English speaker, as we are open to hosting this event in English too.**\n\nJoin us for our second OWASP Meetup in Klagenfurt, focused on **\"10 Proactive Controls\"** by Andreas Happe. Learn how to proactively secure your apps and websites!\n\nOpen to everyone: developers, security pros, or anyone interested in security – from beginners to experts."
    },
    {
        "group": "Lima",
        "repo": "www-chapter-lima",
        "name": "OWASP Meeting ",
        "date": "2024-12-17",
        "time": "19:30-05:00",
        "link": "https://www.meetup.com/owasp-lima-meetup-group/events/305027183",
        "timezone": "America/Lima",
        "description": "**OWASP Meeting 2024**\n\nOWASP Lima Chapter Meeting (VIA ZOOM)\n\n**PRESENTACIÓN:**\n**OWASP Projects: A Path to a Secure SDLC**\n\nExplora los principales proyectos de OWASP y cómo integrarlos en cada etapa del Ciclo de Vida de Desarrollo de Software (SDLC) para garantizar la seguridad desde el diseño hasta la implementación. Conoce herramientas y estándares como OWASP Top 10, ASVS y ZAP, y su impacto en la construcción de software seguro y eficiente. Una oportunidad para profundizar en las mejores prácticas respaldadas por la comunidad global de OWASP."
    },
    {
        "group": "Maribor",
        "repo": "www-chapter-maribor",
        "name": "Threat modeling",
        "date": "2024-12-16",
        "time": "20:00+01:00",
        "link": "https://www.meetup.com/maribor-owasp-meetup-group/events/305019860",
        "timezone": "Europe/Belgrade",
        "description": "Pridružite se nam na zadnjem letošnjem pred prazničnem dogodku, ki ga organizira OWASP Maribor. Gosta dogodka bosta:\n\n* g. **Marjan Kavčič** iz Urada Republike Slovenije za informacijsko varnost, ki bo predstavil letošnji načrt priprave na mednarodno vajo;\n* g. **Aleš Brelih** iz podjetja 3fs, ki bo predstavil **threat modeling** kot sistematičen pristop k prepoznavanju in obvladovanju varnostnih tveganj v aplikacijah in povezanih sistemih. Na predavanju bomo raziskali, zakaj je ta praksa pomembna, kako jo izvajamo, in si ogledali konkreten primer iz prakse."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Capture the Flag [Placeholder]",
        "date": "2025-01-01",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296181595",
        "timezone": "Europe/London",
        "description": "**Cyber Peterborough are hosting a CTF!**\n\nWe're working out the details, in the meantime - please sign up to watch out for updates!\n\n**What?**\n\n* A hosted capture the flag event\n\n**Where?**\n\n* TBD\n\n**When?**\n\n* TBD\n\n**Who for?**\n\n* All ages and abilities will be catered for!"
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Web Pentesting Workshop and CTF (with prizes!)",
        "date": "2024-12-19",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/santa-barbara-owasp-chapter/events/305043977",
        "timezone": "America/Los_Angeles",
        "description": "NOTE: You need to RSVP here in the OWASP SB group and also register on [CMD+CTRL's tournament page](https://web.cmdnctrlsecurity.com/owasp-sb) in order to participate and be eligible for prizes. See details below.\n\n**Event Agenda**\n05.30pm -- Event kickoff & announcements, by W. Martín Villalba (OWASP SB).\n05.45pm -- Web Pentesting Workshop and CTF kickoff, by CMD+CTRL Security.\n06.45pm -- Tips and techniques #1: Parameter Tampering.\n07.45pm -- Tips and techniques #2: Cross-Site Scripting (XSS).\n08.45pm -- CTF end / announcement of prize winners.\n09.00pm -- Event end.\n\n**Web Pentesting Workshop and CTF**\n[CMD+CTRL's gamified Cyber Ranges](https://www.cmdnctrlsecurity.com/training/cyber-range/) take engagement to a new level. Designed to provide insight into how connected software functions and fails with respect to security, each realistic Cyber Range environment presents an array of vulnerabilities to challenge the learner. Shadow Bank is a classic web application that challenges participants to find vulnerabilities through account creation, fund transfers, stock & currency trading, forum posting, loan requesting, past transaction viewing, and more.\n\nPlease make sure to RSVP here in this group and also register on [CMD+CTRL's tournament page](https://web.cmdnctrlsecurity.com/owasp-sb) in order to participate and be eligible for prizes. Event code: **OWASPHacksTheBank**\n\n**Prizes, courtesy of CMD+CTRL Security**\nWinners will receive Amazon gift cards as prizes.\n\n1. $125\n2. $75\n3. $50\n\nLooking forward to seeing you all online!\n\nMartín\nOWASP SB Leader"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-01-08",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349987",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    }
]