[
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 25 November 2023 ",
        "date": "2023-11-25",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/297194585",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 25 November 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* Reconnaissance techniques by **Nimish Dudhe**\n* Dissecting stealer malware by **Pavan Karthick M**\n* Snapshot fuzzing with WTF(what the fuzz) by **Micky Thongam**\n* USing DArk Web to strengthen your Security skills by **Mudit Bansal**\n* Automation testing for complex API scenarios using ATOR by **Suchith Narayan**\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BeNeLux Days 2023",
        "date": "2023-11-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/296033531",
        "timezone": "Europe/Brussels",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2023\" edition on November 23rd-24th in Hasselt, Belgium. \n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter December 2023 Meetup",
        "date": "2023-12-13",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owaspboston/events/297520132",
        "timezone": "America/New_York",
        "description": "Please join us for OWASP Boston's December meetup! For those attending in-person, the doors open at 6pm, and those joining us virtually the presentation will start at 6:30pm.\n\nWe are finalizing a great talk from some of the Boston community members, stay tuned for an update!"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "November Meetup - Threat modelling",
        "date": "2023-11-28",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/296990209",
        "timezone": "Europe/London",
        "description": "Robin Fewster is going to start with a talk on **Threat modelling**,\n\nAfter the break, we will have a semi-structured **discussion** on **Threat Modeling in Practice**. the intention is to draw on the experiences of everyone in the room to learn more about the subject.\n\n\\-\\-\\-\n\nDrawing on some client experiences, Robin will discuss different threat modelling approaches and tools available, and how they went down with development teams.\n\nRobin Fewster has spent the last 21 years working in cyber security. His current role is Senior Security Testing Manager at Hargreaves Lansdown. Robin has spoken at various OWASP chapter events over the years, and used to be a chapter leader for OWASP Newcastle. Current interests are application security, specifically AI and threat modeling."
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "Securing National Cyberspace:De-globalization, Trust&Social Media Responsibility",
        "date": "2023-11-25",
        "time": "1:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/297521138",
        "timezone": "Africa/Cairo",
        "description": "The event will bring together experts, professionals, and community members to address crucial aspects of cybersecurity and trusted technologies.\nParticipants will gain valuable knowledge on effectively dealing with cyber attack news in a professional manner on social media and communication platforms. Additionally, they will delve into the impact of adopting Global technologies entrusted technologies within local organizations and critical infrastructure, with a specific focus on security implications. The event aims to foster awareness, collaboration, and risk-informed decision-making to safeguard the nation's digital landscape.\n\nPanel Discussion 1:\nTitle: Empowering Communities: Navigating Cybersecurity News and Social Media Responsibly\n\nSpeakers:\nMaha Abdelnasser - MP & ICT Expert\nAhmed Shosha - Senior Security Researcher @ Microsoft and Adjunct professor at Nile University\n\nDescription: This panel discussion will focus on educating the community about effectively and responsibly dealing with news related to cyber attacks on national organizations. Panelists will discuss strategies to promote professional and responsible behavior on social media and other communication platforms when handling such cases and discuss risks and implications of irrisposible dissemination of news. The session aims to empower individuals with the knowledge and skills necessary to contribute to a more informed and secure digital society.\n\nPanel Discussion 2:\nTitle: Technologies Trustworthiness: The Impact on De-globalization on Organizations' Security\n\nSpeakers:\nAhmed Saafan - Chief Security Officer, Thndr\nAdel Abdelmonim - IFSEC Cyber Security & thought leadership Global Influencer\nSherif Eldeeb - Information Security Expert\n\nDescription: In this panel discussion, the focus will be on exploring the implications of adopting Global technologies and entrusting entrusted technologies within local country organizations and national critical infrastructure, particularly in the field of security. The panelists will engage in a comprehensive conversation about the benefits, challenges, and potential risks associated with the use of such technologies. The session aims to provide valuable insights into the opportunities and considerations involved in leveraging trusted technologies for enhanced security measures within local organizations."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A night of Backdoors & Breaches with a virtual touch of John Strand",
        "date": "2023-12-05",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/297344292",
        "timezone": "Europe/Copenhagen",
        "description": "*Following our return from hibernation in September, OWASP Copenhagen invites you, to join us for a night of Backdoors & Breaches!*\n\nJohn Strand from Black Hills Information Security (BHIS) will join us online and tell us about their incident response game; Backdoors & Breaches, why you should use it and how it can help you raise awareness among your peers\n\nAfterwards Jon Bevers (also from BHIS) will show us how to play Backdoors & Breaches. Jon will also join us online.\n\nJon is one of BHIS' European community ambassadors and travels Europe from his home in Krakow, Poland. Jon was in Copenhagen recently as part of BSides København where he also had the opportunity to talk to you about Backboors & Breaches and he might even have given you a deck already. If not, fear not as we will have plenty of decks to share with you (and keep).\n\nAfter the talk and demo from John and Jon it's time for pizza, drinks and the opportunity to get some hands on experience and try to game for yourself.\n\nWe hope to see you there!"
    },
    {
        "group": "Croatia",
        "repo": "www-chapter-croatia",
        "name": "Chapter Croatia Physical Meetup (SRCE, Zagreb)",
        "date": "2023-11-30",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-croatia-meetup-group/events/297498017",
        "timezone": "Europe/Belgrade",
        "description": "Hello everyone, it’s time for our OWASP Croatia meetup. This time, we will meet in person.\n\n**Location:** Public Lecture Room inside the SRCE/CARNet building on floor -1 (Ul. Josipa Marohnića 5, 10000, Zagreb). Thursday, 30.11.2023 @ 18:00.\n\n***Huge thanks to the National CERT (cert.hr) and SRCE (srce.hr) for providing the venue!***\n\nWe have two topics for this meetup:\n\n* Luka Matetić: Modern web attack scenarios\n* Hrvoje Prgeša: Breaking the Chain of Insecurity: Why Your Vendor Needs (S)SDLC\n\n**Talk abstracts and biographies follow:**\n\n**Luka Matetić: Modern web attack scenarios**\n\nAbstract:\nThere is a growing misconception about old vulnerabilities such as XSS and assumed decline of the real threat it represents while at the same time there is a growing fascination with modern technologies such as GraphQL. By using modern web attack scenarios on technologies such as JWT or GraphQL it is possible to compare popular attacks and defenses while giving XSS a well deserved place as an end goal within everchanging offensive security landscape.\n\nBio:\nLuka Matetić is a Senior Information Security Consultant with experience in the field of software development, base systems, and integration of Oracle components and several years of experience in Information security. He holds information security related certificates such as Offensive Security Certified Professional (OSCP) and has a master's degree in software engineering and information systems at the Faculty of Electrical Engineering and Computing in Zagreb.\n\n**Hrvoje Prgeša: Breaking the Chain of Insecurity: Why Your Vendor Needs (S)SDLC**\n\nSažetak:\nGovoriti ćemo o supply chain securityu, uključenim rizicima, i kako ih mitigirati putem koraka uključenih u secure development life-cycle proces, zajedno s preporučenim i najčešće korištenim praksama i alatima. Osvrnut ćemo se i na iskustva u implementaciji jednog takvog procesa.\n\nBiografija:\nHrvoje je development manager u tvrtci ASEE unutar Security & Compliance odjela gdje se bavi isporukom sigurnosno orjentiranog softwera, primarno za fintech industriju, kao i implementacijom (S)SDLCa unutar odjela. S više od 15 godina u struci, Hrvoje je u karijeri bio zadužen za Salesforce Security Review 50+ SalesForce aplikacija i implementaciju SDLCa u više navrata."
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Dorset November In Person Meetup",
        "date": "2023-11-29",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/297354538",
        "timezone": "Europe/London",
        "description": "OWASP Dorset are proud to bring out latest in-person event, hosted with Hays Recruitment Bournemouth.\n\nThis time, we bring you talks from 4 different speakers!\n\n**Talks**\n\n**Shruti Kulkarni**\nWe live in a \"speed-to-market\" era. Including security controls in applications sometimes may be considered an overhead. However, if security controls are not added to applications during development, it may be challenging to add them later on. In this presentation, we will see how code can be written insecurely and really how simple it is to include the required security controls in the application.\n\nShruti is a cyber security / enterprise security architect with experience in ISO27001, PCI-DSS, policies, standards, security tools, threat modelling, risk assessments. Shruti works on security strategies and collaborates with cross-functional groups to implement information security controls in software development life-cycle, service operations, service delivery such that security controls support business requirements.\n\n**Ross Brown of the SWCRC (South West Cyber Resilience Centre)**\nI am a retired Detective officer who during my service carried out numerous roles, although primarily operating within mainstream Criminal investigations. As a trainer with Dorset Police I led a team who implemented training for a new force wide Records Management System as well as devising and writing the supervisors course. During a number of career breaks I have experience of running large scale engineering projects in the middle east.\n\nI joined the South West Cyber Resilience Centre as a Detective Inspector and head of cyber and innovation and served in that post until my retirement. I have subsequently taken on the same role as a member of Police staff.\n\nThe Cyber Resilience Centre for the South West supports and helps protect SMEs and supply chain businesses and third sector organisations in the region against cyber crime.\nWorking with local Universities and Police forces in the South West provides access to the latest local as well as national information on emerging cyber threats, criminal trends, best practice for cyber resilience and new technology to provide timely advice to prepare and protect business.\n\n**James Walsh**\nJames Walsh of Hays recruitment will be giving us an insight into the latest salary guide for the cyber security industry.\n\n**Dylan Collins**\n\"A system's biggest vulnerability is the user. With frequent software patches becoming more and more necessary to maintain security standards, does the urge to protect a system actually make people more exposed? Naïve users jumping at sudden update prompts may be jumping through hoops for an attacker.\" - A research question from local software developer, Dylan Collins.\n\n**Event and Venue**\nWe will be joining Hays Recruitment in Bournemouth for this event, there is a limit on numbers, so signup is essential. Names will be required upon arrival to enter the building.\n\nThere will be food and drink provided for this event, so please let us know of any dietary requirements or allergies."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Decembre 2023",
        "date": "2023-12-04",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/297473423",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **Alan** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #63 - GenAI Security",
        "date": "2023-11-29",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/296455863",
        "timezone": "Europe/Berlin",
        "description": "Hi all, we are delighted to host the next in-person event in Frankfurt! This time we have a special focus on GenAI security, where will we have a range of talks delivered by leaders within the AI security space. There will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup with a strong focus in Security in Generative AI hosted by **CHECK24**.\n\n_What are we going to talk about?\n**Talk 1 - The Dark Side Of Large Language Models: Uncovering And Overcoming Of Code Vulnerabilities**\n\n*Javan Rasokat* *\\- Senior Security Specialist at Sage\\, Researcher and Lecturer at DHBW\\, Germany*\n\nIn his talk, Javan will discuss the role of large language models in cybersecurity, highlighting both their potential and pitfalls. Using GitHub Copilot as a case study, he'll emphasize the importance of secure coding practices and manual code reviews in AI-driven development.\n\n**Talk 2 - Seeing is Not Always Believing: The Rise, Detection, and Evasion of Deepfakes**\n\n*Niklas Bunzel, PhD student at TU-Darmstadt and research scientist at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\n*Raphael Antonius Frick, research fellow at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\nIn an era where digital information dominates, the saying “seeing is believing” has been cast into doubt with the emergence of deepfakes — AI-generated media that manipulates reality. This talk delves into the sophisticated technologies behind the creation of these deceptive videos and images. We’ll explore cutting-edge methods for detecting such manipulations, ensuring the authenticity of digital content. However, as detection techniques advance, so too do evasion strategies, including adversarial attacks and prompt injection methods. This poses the question: Can we still believe everything that we see?\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24**.\n\n_When?\nOur Meetup takes place on 29.11.2023 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg OAuth2 and Offensive Security",
        "date": "2023-12-06",
        "time": "7:15+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/297221787",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Omegapoint's office for an awesome evening with food and drinks, and talks about OAuth2 pitfalls and Pentest war stories!**\n\n**Where:** Omegapoint, Rosenlundsgatan 3, 411 20 Göteborg\n\n**Agenda:**\n**17:00 - 17:30:** Welcome to Omegapoint\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n**17:45 - 18:30:** *How to f\\*ck up at OAuth2 while following BCPs*\nBest current practices (BCPs) for implementing OAuth2 and OIDC have undergone many changes over the years. In this presentation we highlight the risks of staying with the ancient (roughly 2019-2021) “current” best practices. The current (circa 2022) BCPs bring many changes, such as deprecation of the implicit flow, required usage of PKCE and the BFF pattern which mitigates some of the previous attack vectors. It takes time for new concepts to fully mature and secure defaults emerge. While following the latest BCPs it’s still possible to make mistakes and end up with a broken implementation. This presentation will show some common OAuth2/OIDC security pitfalls and why it is bad practice to use reverse proxy catch-all routing in your BFF, an OAuth2 client with access to many scopes, together with APIs that do authorization based on just a valid token and scopes. Does your BFF enable authenticated SSRF as a Service? During the presentation we will demonstrate both attacks and defences for a OAuth2/OIDC application running locally.\n**Pontus Hanssen** in an experienced security researcher and penetration tester. He loves to hack everything that blinks or has an IP address. Pontus performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security.\n**Tobias Ahnoff** is an experienced developer and architect with focus on application security. He specializes in implementing authentication flows and authorization for web applications and APIs that manage sensitive data. Tobias performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security. He also gives courses in application security and is an appreciated speaker in OAuth2 and OpenID Connect areas.\n\n**18:30 - 19:15:** Food\n\n**19:15 - 20:00:** *Pentesting War Stories*\nWorking in penetration testing generates quite a few interesting stories\nabout spectacular vulnerabilities found in tested systems.\nOften these stories are not shared outside of a small circle of people.\nThis presentation goes through a selection of vulnerabilities found\nduring assignments in the recent years. The titles of the stories are:\n“The omnipotent client cert” (automotive app), “Next level XSS“ (web),\nNo route to boat” (network), and ”Having a conversation with a door\nhandle\" (embedded).\n**Emilie Barse** is an experienced IT security consultant with a deep\ninterest in security testing and log analysis. She has worked in IT\nsecurity since 2005 and has worked in numerous different industries, and has tested applications, networks, cloud environments, IoT systems, and cars. Emilie has a PhD in computer security from Chalmers University of Technology.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston AppSec Happy Hour sponsored by Checkmarx and Orasi Saltworks",
        "date": "2023-11-30",
        "time": "6:00-06:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/297237891",
        "timezone": "America/Chicago",
        "description": "Please join us for the Houston AppSec Happy Hour from 4-6 PM on Thursday November 30th at Kirby Ice House located at 1015 Gessner Rd, Houston, TX 77055.\n\nThis happy hour event is sponsored by Checkmarx and Orasi Saltworks who will be providing the drinks.\n\nWe hope to see you there."
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy November 2023 Online Meetup ",
        "date": "2023-11-24",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/297256302",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy online Meetup is a 2 hours conference focused on web application and software security, application security testing tools and technologies.\n\nNext 24th November we will 2 exceptional speakers:\n\n* **Luca Compagna** \\- Senior Scientist / Research Architect at SAP Security Research\n* **Claudio Merloni** \\- Security Research Manager at Semgrep\n\nLuca will talk about: \"Testability Patterns for Web Applications – an OWASP project\"\n\nClaudio will focus on: \"Scaling your AppSec program with secure defaults\"\n\nThis Meetup provided a unique opportunity to learn about application security topics and to network with application security professionals/managers, software engineers, software quality engineers/testers and computer science students.\n\nSecure now your spot for the upcoming online event!\n\nMore information and the Agenda at the following URL:\nhttps://owasp.org/www-chapter-italy/events/owaspit-24112023"
    },
    {
        "group": "Kannur",
        "repo": "www-chapter-kannur",
        "name": "OWASP kannur - On the Hunt : Bug Bounty Reconnaissance Demystified",
        "date": "2023-11-26",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-kannur/events/297438540",
        "timezone": "Asia/Kolkata",
        "description": "Dive into the world of Bug Bounty programs with \"On the Hunt: Bug Bounty Reconnaissance Demystified.\" This talk will break down effective strategies for finding vulnerabilities, arming you with the tools to navigate the cybersecurity landscape. Whether you're new to ethical hacking or a seasoned pro, join us to uncover the secrets of successful bug hunting. Explore the ins and outs of reconnaissance and boost your chances of success in the realm of cybersecurity.\n\nMeeting Invitation Details:\n\nJoin Zoom Meeting\n[https://us06web.zoom.us/j/89088394399?pwd=CwcZgQpXRVLMRapYGriWraLgOSh6ot.1](https://us06web.zoom.us/j/89088394399?pwd=CwcZgQpXRVLMRapYGriWraLgOSh6ot.1)\nMeeting ID: 890 8839 4399\nPasscode: 446195"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "New Year's OWASP Chapter Limassol meetup.",
        "date": "2023-12-15",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/297479557",
        "timezone": "Asia/Nicosia",
        "description": "[Location](https://www.google.com/maps/place/BrainRocket/@34.6979542,33.0460735,20z/data=!4m6!3m5!1s0x14e733f291b01fad:0x5ff57bb6ed3f9838!8m2!3d34.6979152!4d33.0461381!16s%2Fg%2F11q_08mvzb?entry=ttu) is the restaurant at the Brain Rocket office.\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the second meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/)! We cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19:00 — TBA\n19:55 — 20:05 A short break\n20:05 — 20:30 TBA\n22:00 — 23:00 — Eat, drink, networking!\n\nWe'll have catering, a cocktail bar, a DJ, and a shisha zone all set up to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2023-12-05",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-london/events/297445289",
        "timezone": "Europe/London",
        "description": "**This event is kindly sponsored and hosted by Thought Machine. There is limited seating available for in-person attendees. Registration required. Please note that all our events are live-streamed on YouTube for the online audience. Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Thought Machine, 7 Herbrand St, London WC1N 1EX\n**Nearest Tube:** Russell Square (Piccadilly Line) - 2 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\n\n**\"E2E Detection Testing\"** \\- George Gilligan\n\nHow do you make sure your detections work in a cloud native organisation? Software engineers have integration tests, reliability engineers have chaos engineering frameworks. Detection engineers lack an equivalent standardised approach to E2E testing. A natural approach is a binary that generates a suspicious event, validates that a suitable alert is generated in your SIEM, closes it, and reports the result. An open source Datadog tool named Threatest does just this. We are working on extending this to work with Elasticsearch, with the hope of automating a huge portion of the work of the red team, and providing constant validation for our detections.\n\n**\"5 Open Source Security Tools All Developers Should Know About\"** \\- Raz Probstein\n\nThe minimum viable security (MVS) approach, enables us to easily bake security into our config files, apps, and CI/CD processes with a few simple controls - and the great part? It’s easily achievable through open-source tooling. In this talk we will focus on five critical security controls that will be integrated as part of the CI/CD pipeline by leveraging some excellent open source tools in addition to custom controls to ensure proper enforcement of MFA via Github Security. These controls will provide a foundational framework for securing your applications from the first line of code, which will make it possible to continuously iterate and evolve your security maturity all the way through advanced layers of security that come with time, as well as increased experience with your deployments, stacks, and security posture. Code examples & demos will be showcased as part of this session.\n\n**Christmas Raffle** \\- some prizes to be won\\!\n\n**SPEAKERS**\n\n**George Gilligan (@ggilligan12)**\nGeorge Gilligan is a security engineer at Thought Machine, where his work includes securing Kubernetes clusters, container security, intrusion detection, security testing, and implementing security policies. George participates in various CTF competitions and his CTF achievements include the Deloitte CTF Qualifier, Scottish Universities Cybersecurity Challenge and Hack Harvard 2018.\nGeorge holds an Offensive Security Certified Professional (OSCP) certification and a BSc (Honours) degree in Computer Science and Mathematics from the University of Edinburg. George is now studying part-time for a MSc in Software and Systems Security at the University of Oxford.\n\n**Raz Probstein (@RazProbstein)**\nRaz comes with years of experience in both leadership and technology, having served not only as Young Ambassador to the state of Israel, as well as headhunted and selected as Young Researcher at the prestigious Weizmann Institute for multi-disciplinary scientific research. Today she serves as a Solution Engineer at Jit, coming to the role with years of experience as a FullStack Engineer and years of experience in a diversity of programming languages from Python, to Javascript and C/C#, from the elite IDF unit 81 - where she was not only one of a handful of women serving in a cybersecurity role, she also mentored women to help drive more gender diversity in the unit. Today she is studying Biotechnology at the Open University, and is passionate about building cloud native security tooling developers will love\n\n**TICKETS**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST book your place to be admitted to the event by the building security - your name will be checked against the guest list.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: https://owasp.org/www-policy/operational/code-of-conduct"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA, ISSA-LA, AITP, & Women's Society of Cyberjutsu Holiday Celebration",
        "date": "2023-12-13",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297433279",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA, ISSA-LA,** **AITP LA**, and **Women's Society of Cyberjutsu Holiday Celebration**\nDec 13, 2023 in Downtown Los Angeles!\n\n**Keynote**: **Laz**\n\n**\\*\\*\\* NOTE: This is a paid event - Registration is Required \\*\\*\\***\n*[https://www.eventbrite.com/e/issa-la-december-holiday-dinner-celebration-tickets-715667048407ISSA-LA 2023 Holiday Dinner Celebration](https://www.eventbrite.com/e/issa-la-december-holiday-dinner-celebration-tickets-715667048407)*\n\n**OWASP LA**, **ISSA-LA,** **AITP**, and **Women's Society of Cyberjutsu** will celebrate the culmination of an event-filled 2023 together and in-person. The gathering brings together hundreds of managers and practitioners in the private sector, public sector, and academia to discuss challenges and innovative strategies in risk management, security, privacy, and trust in our rapidly changing society.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - NOV 29, 2023",
        "date": "2023-11-29",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294514939",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Github Copilot 101\nJoin us for dinner, drinks, networking and a great talk by **Sophia Orlando**, Cybersecurity Solutions Engineer at GitHub\n***\\*\\*\\*\\*\\* NOTE***: New Date due to Thanksgiving Holiday! **\\*\\*\\*\\*\\*\\***\n\n**ABSTRACT**: Learn how GitHub Copliot is built and foundations of GitHub Copilot in your IDE with live examples, plus get an inside look into the future of GitHub Copilot.\n\n**Thanks to our Sponsor**: *[VIRTIS](https://virtis-us.com/)*\n*Providing today's leading organizations peace of mind that their entire digital network perimeter is safe from hackers and data breach. Our singular focus on information security delivers unparalleled solutions and services. We are revolutionizing web application & API protection and modernizing vulnerability management. VIRTIS solves the toughest web application challenges faced by organizations in all industries across all verticals in an ever-evolving digital threat landscape.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai November Meet 2023",
        "date": "2023-11-25",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/297212098",
        "timezone": "Asia/Kolkata",
        "description": "Introduction to OWASP Mumbai\n\n**Session:** Lessons Learned from past Cyber Ransomware Incident Pharma Sector\n**Speaker**: Ravindra\n\nQnA and FeedBack"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "OWASP BeNeLux Days 2023",
        "date": "2023-11-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/295925893",
        "timezone": "Europe/Amsterdam",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2023\" edition on November 23rd-24th in Hasselt, Belgium. \n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "The Dark Side of Open Source Productivity",
        "date": "2023-11-30",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/297414000",
        "timezone": "America/New_York",
        "description": "**There is a dark side to productivity with open source. In modern applications, the majority of code on which an application is built isn’t code written by your team. Modern applications are built on the backs of volunteer communities and open-source software. These volunteers and their software delivery practices all become potential attack vectors.**\n\n**The truth is that most organizations do not factor open-source supply chain attacks into their organization’s threat models today. Security incidents such as the CodeCov bash uploader script, the npm colors, and faker intentionally introduced malicious commits, and the recent PyPi backdoors targeting AWS credentials highlight the impact of supply chain attacks as a scalable attack pattern. To spread awareness on supply chain attacks so that organizations can scalably handle them we propose baking supply chain attacks into existing threat modeling procedures and software development culture so that organizations can champion supply chain management of open source in the places where they are most impactful, at development time.**\n\n**We will present a comprehensive, comprehensible, and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents and validated by experts in the domain. Following, we will discuss the types of defenses you can put in place to detect and respond to such modern day attacks and how you can work these defenses in based on your program’s maturity.**"
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "The ML(Ops) Security Landscape",
        "date": "2023-11-28",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-oslo/events/297278006",
        "timezone": "Europe/Oslo",
        "description": "Welcome to OWASP Oslo's November meetup, hosted by Ardoq!\n\nYou are welcome to arrive anytime between 17:00 and 17:30. We plan to kick off the talk around 17:30.\n\n**More Tools Mean More Misconfigurations - The ML(Ops) Security Landscape**\nIn this talk, we will cover some of the issues related to the emerging field of Machine Learning and AI security. We will cover some low hanging fruits related to ML security - we will show how attackers can get access to victims' secrets, source codes and API keys. We will also talk about OWASP's initiatives for AI security, such as the OWASP Top10 for ML, the OWASP Top10 for LLM, and the OWASP AI Security Guide."
    },
    {
        "group": "Patna",
        "repo": "www-chapter-patna",
        "name": "Session 06 - Behind the Scenes of SSRF: A Comprehensive Exploration",
        "date": "2023-11-25",
        "time": "4:30+05:30",
        "link": "https://www.meetup.com/owasp-patna-chapter/events/297498712",
        "timezone": "Asia/Kolkata",
        "description": "Introducing **OWASP Patna's** new online session by **Rajveer**! Join us as we dive deep into the world of **Server-Side Request Forgery (SSRF)** and explore its insights, misconceptions, real-world impact, types, practical examples, live exploitation, and bypasses. This session will be led by Rajveer, who will share his expertise and guide you through the entire process."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social [Glo Golf]",
        "date": "2023-11-30",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296056636",
        "timezone": "Europe/London",
        "description": "Christmas Social Special!\n\n**What?**\n\n* Mini Golf, bring your best putting game!\n\n**Where?**\n\n* Putt Stars Golf Peterborough (Town Center)\n\n**When?**\n\n* Thursdsay 30th November\n\nSign up by responding to this event! (Note, this is a self-funded social, entry is £8.50)"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - November Meetup-In person @Slapfish (Lehi)",
        "date": "2023-11-30",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/297244046",
        "timezone": "America/Denver",
        "description": "Casual event, we'll meet at Slapfish for lunch.\n\nWe'll discuss:\n\n1. Wins & Lessons learned from SaintCon-AppSec Community last month.\n2. (time permitting) LLMs and using them in the AppSec space\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-12-13",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296623321",
        "timezone": "America/Los_Angeles",
        "description": ""
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Dec 2023 Meetup: 2 speakers on mobile app security and API security",
        "date": "2023-11-28",
        "time": "9:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/297472949",
        "timezone": "Asia/Singapore",
        "description": "We have 2 awesome speakers for our last meetup of 2023!\n\n**First topic**: \"Fortifying the Front Lines: Safeguarding Mobile Applications Against Layer 7 Threats and Exploits.\"\n\n**Synopsis**:\nIn an era dominated by mobile technology, the security of mobile applications is paramount. With the banking industry implementing new measures, such that restricting users from having certain applications on their devices which they use for sensitive transactions, we explore if these are viable solutions or just a stop-gap measure until the next round of attacks show up on victim's devices.\n\nThis presentation delves into the intricate landscape of advanced mobile security attacks that pose significant risks to mobile platforms. We explore the evolving nature of mobile malware, emphasizing the need for proactive measures to fortify applications against advanced attacks.\n\n**1st Presenter**: Pishu Mahtani, Ex-DART\n\n**Second topic**: \"Understanding API Security problems\"\n\n**Synopsis**: It’s no surprise that API adoption is growing rapidly. The reality is that new business innovation and services are powered by APIs. But the rush to innovate is leaving security teams struggling to understand the very real security risks that APIs pose. Today, APIs carry vast amounts of data and are increasingly targets in data breaches.\n\nThis talk delves into common API security concerns and the importance of API Discovery. It highlights the key needs for an API security tool to detect API abuses and the importance of having a data lake for threat hunting.\n\n**2nd Presenter**: Chao Yin Loong, Senior Solutions Engineer at Akamai Technologies\n\nMany thanks to Akamai for sponsoring the venue and pizzas! Come early, enjoy free pizzas and inter-mingle with AppSec enthusiasts."
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Cybersecurity Careers: Insights from a Panel of Security Leaders",
        "date": "2023-12-14",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/296891549",
        "timezone": "America/New_York",
        "description": "Come join a panel of leaders in the Cybersecurity field talk about their career journey, and offer advice."
    },
    {
        "group": "Taiwan",
        "repo": "www-chapter-taiwan",
        "name": "OWASP Taiwan Meetup (NOV, 2023)",
        "date": "2023-11-24",
        "time": "3:20+08:00",
        "link": "https://www.meetup.com/taipei-owasp-meetup-group/events/297397035",
        "timezone": "Asia/Taipei",
        "description": "The Open Worldwide Application Security Project® (OWASP) is a nonprofit foundation that works to improve the security of software. Through community-led open-source software projects, hundreds of local chapters worldwide, tens of thousands of members, and leading educational and training conferences, the OWASP Foundation is the source for developers and technologists to secure the web.\n\nOWASP Taiwan Chapter Meetup  OWASP \n\n\n\n\n→ [https://csa.kktix.cc/events/owasp202311](https://csa.kktix.cc/events/owasp202311?fbclid=IwAR07kA-Wh9FhBWicCLOGrRsVF9HEqrED_ID9ynrm6dLvaeyLRJnBuUTKz_g)\n→ [https://csa.kktix.cc/events/owasp202311online](https://csa.kktix.cc/events/owasp202311online?fbclid=IwAR1mNx8O8HlUzsYSZglinHye63OML1IzTvWtTqlzuLwotZ60AO9MTI3X6LI)"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "ISSA / OWASP Tampa Chapters Q4 Year-end Minicon",
        "date": "2023-12-06",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/296916076",
        "timezone": "America/New_York",
        "description": "**Welcome to our joint ISSA & OWASP End of Year Minicon!**\n\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This half day minicon will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda:**\n\n* 8:30am - Registration\n* 9:00am - First Talk\n* 10:00am - Second Talk: Tony Cook, Sr. Dir, DFIR & Threat Intel\n* 11:00am - Third Talk: Jadee Hanson, CISO Code42\n* 12:00pm - Lunch\n\n**Speakers:**\n\n* Tony Cook is the Sr. Director of DFIR & Threat Intelligence on GuidePoint Security’s consulting team, where he manages digital forensics and incident response engagements on behalf of the firm’s clients. His career background includes high-level national security activities in cybersecurity operations for several clients over various verticals.\n* Jadee Hanson is the Chief Information Security Officer at Code42, where she is responsible for business technology strategy and purchasing, as well as leading global risk and compliance, security operations, incident response, and insider threat monitoring and investigations.\n\n**Location:**\n3030 N Rocky Point Drive W\nSte 600\nTampa, FL\n\n**Sponsors:**\n[Code42](https://www.code42.com/)\n[GuidePoint Security](https://www.guidepointsecurity.com/)"
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "Charla sobre: Introducción a OWAPS ZAP (Zed Attack Proxy)",
        "date": "2023-11-25",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-tegucigalpa-chapter/events/296929802",
        "timezone": "America/Tegucigalpa",
        "description": "Charla sobre: Introducción a OWAPS ZAP (Zed Attack Proxy) El escáner de aplicaciones web más utilizado del mundo. Libre y de código abierto. Mantuvo activamente a un equipo internacional dedicado de voluntarios. Un proyecto de GitHub Top 1000."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver - December 2023",
        "date": "2023-12-21",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248523",
        "timezone": "America/Vancouver",
        "description": "OWASP Vancouver monthly meetup"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-12-13",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889913",
        "timezone": "America/New_York",
        "description": "Welcome to our final 2023 monthly SAMM community call Wednesday 13th December, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EST.\n\nJoin Zoom Meeting: [Zoom link.](https://zoom.us/j/96866048960?pwd=TmZkTSs3ZmlWU09DbHJoSnVZWmdiUT09)"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #63 - GenAI Security",
        "date": "2023-11-29",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/296455863",
        "timezone": "Europe/Berlin",
        "description": "Hi all, we are delighted to host the next in-person event in Frankfurt! This time we have a special focus on GenAI security, where will we have a range of talks delivered by leaders within the AI security space. There will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup with a strong focus in Security in Generative AI hosted by **CHECK24**.\n\n_What are we going to talk about?\n**Talk 1 - The Dark Side Of Large Language Models: Uncovering And Overcoming Of Code Vulnerabilities**\n\n*Javan Rasokat* *\\- Senior Security Specialist at Sage\\, Researcher and Lecturer at DHBW\\, Germany*\n\nIn his talk, Javan will discuss the role of large language models in cybersecurity, highlighting both their potential and pitfalls. Using GitHub Copilot as a case study, he'll emphasize the importance of secure coding practices and manual code reviews in AI-driven development.\n\n**Talk 2 - Seeing is Not Always Believing: The Rise, Detection, and Evasion of Deepfakes**\n\n*Niklas Bunzel, PhD student at TU-Darmstadt and research scientist at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\n*Raphael Antonius Frick, research fellow at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\nIn an era where digital information dominates, the saying “seeing is believing” has been cast into doubt with the emergence of deepfakes — AI-generated media that manipulates reality. This talk delves into the sophisticated technologies behind the creation of these deceptive videos and images. We’ll explore cutting-edge methods for detecting such manipulations, ensuring the authenticity of digital content. However, as detection techniques advance, so too do evasion strategies, including adversarial attacks and prompt injection methods. This poses the question: Can we still believe everything that we see?\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24**.\n\n_When?\nOur Meetup takes place on 29.11.2023 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]