[
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "6. OWASP Augsburg Stammtisch",
        "date": "2024-11-27",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/304187062",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda tbd**\nDu hast einen Vortrag? Melde dich! Wir sind immer auf der Suche nach interessanten Inhalten!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BeNeLux Days 2024",
        "date": "2024-11-28",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/304003498",
        "timezone": "Europe/Brussels",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2024\" edition on November 28th and 29th in Utrecht, the Netherlands.\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE chapter meeting (14/11/2024, Mechelen)",
        "date": "2024-11-14",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/303275189",
        "timezone": "Europe/Brussels",
        "description": "On November 14th, we organize our next OWASP Belgium chapter meeting in Lamot (Mechelen).\n\nThis event is co-located with the [CyberSecurity event \"Strategic Research and Industry Impact\"](https://cybersecurity-bites.be/cybersecurity-strategic-research-industry-impact-2nd-edition/).\n\n**Agenda**:\n\n* 17h30-19h: networking drink\n* 19h-19h10: **OWASP update**\n* 19u10-19h50: **TBD**\n* 19h50-20h30: **TBD**\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Let's Talk ML Security",
        "date": "2024-11-10",
        "time": "12:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/304220240",
        "timezone": "Asia/Kolkata",
        "description": "Dive into the essentials of securing machine learning systems! This event explores key challenges in ML security, including model vulnerabilities, adversarial attacks, and best practices for robust protection. Perfect for developers, data scientists, and security pros, this session equips you with practical insights to safeguard ML applications against evolving threats."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - November 2024",
        "date": "2024-11-13",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/owaspboston/events/304305085",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Jim Manico, a form OWASP Global Board Member and long time project contributor, to our meetup. Doors open at 6:30pm and the presentation starts at 7pm. Pizza and soda will be provided.\n\nJim will be presenting as part of our \"Learn about OWASP Projects\" series on his project team's project, the OWASP ASVS & Cheat Sheet Series . In this session you will learn:\n\n1) How was the project started?\n2) About the project and goals\n3) How can one help, volunteer /sponsor?\n4) Existing Team\n\nJim Manico is the founder of Manicode Security, where he trains software developers on secure coding and security engineering. He is also an investor/advisor for 10Security, Aiya, MergeBase, Nucleus Security, KSOC, and Inspectiv. Jim is a frequent speaker on secure software practices, is a member of the Java Champion community, and is the author of “Iron-Clad Java: Building Secure Web Applications” from Oracle Press. Jim also volunteers for the OWASP foundation as the project lead for the OWASP Application Security Verification Standard and the OWASP Cheatsheet Series. For more information, see [https://www.linkedin.com/in/jmanico](https://www.linkedin.com/in/jmanico)."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "API Security Workshop with OWASP crAPI (hands-on)",
        "date": "2024-11-12",
        "time": "17:30+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/304354630",
        "timezone": "Australia/Brisbane",
        "description": "In today's rapidly digitalizing world, Application Programming Interfaces (APIs) are the backbone of communication in the vast landscape of web services, cloud applications, and microservices.\nWith this increased usage comes the inevitable rise of security threats targeting APIs. This workshop aims to arm participants with practical knowledge and hands-on experience to secure APIs effectively.\nIn this workshop, we will be using OWASP crAPI (completely ridiculous API), a purposely insecure API, to demonstrate common API vulnerabilities and their mitigations. We will discuss the 'Shift Left' approach in API security, emphasizing the importance of integrating security measures early in the development lifecycle. Participants will learn to identify, exploit, and secure API vulnerabilities, equipping them with the necessary skills to build more secure\napplications.\n\n**Requirements**:\n1\\. Active Participation: The workshop will be highly interactive\\. Questions\\, comments\\, and sharing of experiences are strongly encouraged\\.\n2\\. Laptop: As this is an in\\-person workshop\\, please bring along your laptop with any API testing tool installed\\.\n3\\. Pre\\-workshop Material: On confirmation of your attendance\\, you will receive some pre\\-workshop reading materials\\. We recommend reviewing these before the event to maximize your learning experience\\."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Security Journey CTF",
        "date": "2024-11-21",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301084006",
        "timezone": "America/New_York",
        "description": "*This will be at the new location, as shown below! Don't go to the wrong place!*\n\nHands-on hacking time! Security Journey has graciously allowed us to borrow their CTF for the evening to see and fix coding flaws that lead to security vulnerabilities. It's all web based, so bring your laptop! (There really isn't anything to install, so bring your work laptop.) But be there!\n\nWe'll start off with a few highlights related to what is new in the world of appsec, and have a good-of-the-order style chat about the near, they we will dig into finding and fixing some stuff."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP November Meet - In person",
        "date": "2024-11-12",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/304180205",
        "timezone": "America/Chicago",
        "description": "Mobile App Pentesting for Fun and Profit\n\nWelcome to the thrilling world of mobile app pentesting! This session will equip you with the skills to uncover vulnerabilities in mobile applications. Whether you’re a seasoned pro or a curious newcomer, prepare for an adventure in cybersecurity."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Novembre 2024",
        "date": "2024-11-04",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/304124138",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **Escape** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #69 - Software Maturity Model and Security Champions",
        "date": "2024-11-27",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/303263383",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #69! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n**DSOMM and AppSec Program:** We are excited to welcome Timo Pagel, Cloud and Web Security Architect at PagelShield, a core member of the OWASP Germany Chapter, and contributor to various OWASP projects. Timo will discuss the DevSecOps Maturity Model (DSOMM) and how it can help kick-start your application security program. We will also have another speaker joining us for this event—details to be announced soon!\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **27.11.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 AG, located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "German OWASP Day 2024",
        "date": "2024-11-12",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/304040492",
        "timezone": "Europe/Berlin",
        "description": "**\\*\\*This is a paid event\\*\\***\n\nDear all,\n\nWe're proud to present a cool lineup of talks for the German OWASP Day in Leipzig on November 13th! The program committee got a solid amount of high quality submissions and thus the agony of choice.\n\n\\* Frederik Braun will present \"Modern solutions against Cross-Site Leaks (xs-leaks) and CSRF“\n\\* Thomas Barber will give us insights into the project Foxhound, a taint tracking project using a patched Firefox\n\\* Malte Wessels will display results of his research on SSRF\n\\* Shubham Agarwal will raise his voice against \"Double-Edged Crime: How Browser Extension Fingerprinting Might Endanger Users and Extensions Alike\"\n\\* Björn Kimminich is celebrating the \"OWASP Juice Shop 10th anniversary\"\n\\* While Dr. Daniel Fett will be talking about \"How (Not) to Use OAuth in 2024“,\n\\* Kristina Yasuda will tell you \"The Crucial Role of Web Protocols and Standards in Digital Wallet Ecosystems\" (EUDI Wallet)\n\\* Tim Philipp Schäfers will demystify NIS2 and hopefully NIS2UmsuCG\n\\* Diana Calderón will explore strategies for creating and implementing Security Champion programs in organisations\n\\* Hanno Böck will tell not-so-good stories about private keys\n\\* Stephan Pinto Spindler will share his experiences wrt \"Network Fingerprinting for Securing User Accounts\"\n\\* Behnaz Karimi will give us an overview of the OWASP AI Exchange project\n\\* Niklas Bunzel and Raphael Antonius Frick will explore the security challenges and opportunities posed by GenAI\n\\* Clemens Hübner will amend that showing how GenAI can help identifying threats\n\\* Florian Hantke and Sebastian Roth will show how to scan for Vulnerabilities Without Getting Into Trouble\n\\* Nicolas Schickert, Ole Wagner and Matthias Göhring will tackle most companies problem child \"SAP from an Attacker’s Perspective – Common Vulnerabilities and Pitfalls\"\n\nThe full program is on the web site [https://god.owasp.de/](https://god.owasp.de/) .\n\n**Registration is open. [Reserve your spot](https://god.owasp.de/2024/#tickets)! \\*\\*This is a paid event\\*\\***\n\nOn the 12th of November we also offer three trainings — those have to be booked separately:\n\\* OWASP Juice Shop: Advanced Demos & For-fun CTF by Björn Kimminich + Jannik Hollenbach\n\\* Getting started for establishing your Security Champions Program by Juliane Reimann + Michael Bernhardt\n\\* Building Secure Software: A Hands-On OWASP SAMM Training by Daniel Kefer.\n\nAs usual on the evening before the conference day (November 12th) there’s a get-together with food and drinks.\n\n**\\*\\*THIS IS A PAID EVENT\\*\\***"
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Indy OWASP November 2024 Meetup",
        "date": "2024-11-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/indyowasp/events/303946344",
        "timezone": "America/New_York",
        "description": "**Talk 1**\n\n**Title:** Prompt Injection with Damn Vulnerable LLM\n\n**Synopsis:** Join us for an insightful OWASP event dedicated to exploring the OWASP Top 10 for Large Language Model Applications! Dive into the latest vulnerabilities impacting GenAI-driven systems, focusing on prompt injection attacks. We'll also showcase the Damn Vulnerable LLM, a hands-on tool designed to illustrate prompt injection in real-time specifically. This meetup is perfect for developers, security professionals, and anyone interested in safeguarding GenAI applications. Don't miss this opportunity to enhance your understanding of LLM security and network with fellow enthusiasts!\n\n**Speaker:** Justin Baxtron\n\n**Bio:** Bio: Justin Baxtron has worked in the information security field for over 10 years as a consultant and engineer. He holds a GIAC Web Application Penetration Tester (GWAPT) certification and focuses on application security assessments, as well as software engineering.\n\n**Talk 2**\n\n**Title:** I Hope No One Finds Out I'm a Fraud: Dealing with Imposter Syndrome\n\n**Synopsis:**\nImposter syndrome is a real issue in professional life. It can seriously impact mental health and professional growth—especially in the security industry, surrounded by ever-changing technologies and other super-smart people. I will discuss the aspects of this issue, its impacts, and some strategies to overcome it, both for yourself and others.\n\n**Speaker:** Damian (@integrisec) Profancik\n\n**Bio:** Damian Profancik has worked as a server/network infrastructure and security consultant for more than 24 years with over the last 14+ years solely focused on information security as an Application Security Manager at Match Group, Technical Director at Optiv Security, Inc. focused on Application Security, Global Security Associate Partner and North American Regional Lead at IBM X- Force Red, Director of Application Security at Lares Consulting, Director of Security Services at iLAB, and a Principal Security Consultant at both NCC Group (formerly iSEC Partners) and Trustwave SpiderLabs.\n\nHis main focus has been on application security and vulnerability research. He has worked in this capacity both independently and for numerous companies ranging from small businesses to Fortune 100 enterprises. His work has included application penetration testing, network penetration testing, design review, and code review in 28 different computer languages.\n\nHe is actively involved in the Information Security community through speaking engagements at events such as DerbyCon, ShmooCon, CircleCityCon, OWASP, and ISSA, and he is a co-leader for the local OWASP chapter, one of the organizers for CircleCityCon, and co-founder for BSides Bloomington.\n\nVenue, food, and refreshments provided by Guidepoint."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-11-18",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242791",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "The 2024 Los Angeles Cybersecurity Summit",
        "date": "2024-11-21",
        "time": "07:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/304037309",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** has organized \\***ANOTHER**\\* exceptional offer for our meetup membership to participate in ***Ninth Annual Los Angeles Cybersecurity Summit*** on November 21st, in Los Angeles, CA. Join us for deep insight in new tools and technology, training, and take advantage of this great opportunity to network with industry professionals.\n\n[Register ](https://cybersecuritysummit.com/register/losangeles24/)now using code **CSS24-OWASPLA** for your **complimentary** pass! Space is limited so act now to secure your place.\nCheck the full schedule at [2024 California Technology Summit Agenda](https://cybersecuritysummit.com/summit/losangeles24/)\n\nThe **Ninth Annual Los Angeles Cybersecurity Summit** connects C-Suite & Senior Executives responsible for protecting their companies’ critical infrastructures with innovative solution providers and renowned information security experts. Admission gives you access to all Interactive Panels, Discussions, Catered Breakfast, Lunch & Cocktail Reception.\n\n**Conference Highlights:**\n\n### Interactive Panel Discussions\n\n**Defining Cybersecurity-Readiness: How do you evaluate yours?**\nWhen looking at how to best protect your business, cybersecurity readiness should be top priority, but what is it? Let’s discuss GRC & the best steps to take when quantifying cyber risk, developing your incident response plan, creating a data security policy & more.\n**2024 & The Biggest Threats to Your Business**\nOn this panel our lineup of industry experts will discuss the most dangerous and emerging threats to your organization as well as the solutions that go beyond anti-malware/anti-virus to include endpoint security, vulnerability management, Active Directory monitoring, credential protection, DNS security tools, SIEM, DLP and encryption.\n**Conceptualizing Cloud Security & Why it Matters Today**\nCloud computing solves many problems like flexibility, cost-efficiency & scalability, so it’s no surprise that use of the cloud is consistently growing. Our experts will look at hybrid and multi-cloud environments, adopting the concept of cybersecurity mesh & Zero Trust, the Secure Access Service Edge (SASE) framework, cloud-native tools & platforms, as well as why the future of network security is in the Cloud.\n\n### Top 8 Reasons to Attend the Cybersecurity Summit\n\n1\\. Learn\n2\\. Evaluate Demonstrations\n3\\. Time\\, Travel and Money Savings\n4\\. Engage\\, Network\\, Socialize & Share\n5\\. CEUs / CPE Credits\n6\\. Investment\n7\\. Atmosphere\n8\\. Reality Check\n\n### [Questions](mailto:Samantha@CyberSummitUSA.com)\n\nFor any questions, please contact **[Samantha@CyberSummitUSA.com](mailto:Samantha@CyberSummitUSA.com)** or call **212.655.4505 ext. 225**\n\nAnd finally **don't forget** to visit us at the OWASP Los Angeles booth!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Data Con LA 2024",
        "date": "2024-11-16",
        "time": "09:00-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/304290127",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** has organized an exceptional offer for our meetup membership to participate in ***[12th Annual Data Con LA ](https://www.dataconla.com/events/dcla-2024/)***on November 16th, in the campus of CSU Long Beach, CA. Join us for deep insight in new tools and technology, training. Whether you’re an industry veteran, a data science newbie, or somewhere in between, Data Con LA offers a unique opportunity to dive deep into the world of data.\n\n[Register](https://www.tickettailor.com/events/dataconla/1356949) now using discount code **OWASPLAxDCLA2024** for **33%** off the ticket price. Check the full schedule at [Data Con LA 2024 Sessions](https://www.dataconla.com/events/dcla-2024/sessions/).\n\nThis year, we’re bringing you three dynamic tracks designed to cover the full spectrum of the data universe:\n\n* **AI, ML and Data Science**: Explore the cutting-edge advancements in artificial intelligence, machine learning, and data science. From groundbreaking research to practical applications, this track is your gateway to understanding how these technologies are shaping the future.\n* **Data Engineering and Ops**: Discover the backbone of the data ecosystem. This track will delve into the best practices, tools, and platforms that power data-driven organizations. Learn how to build, scale, and maintain robust data infrastructures that can handle today’s complex challenges.\n* **Data Analytics and BI**: Uncover the insights that drive decision-making. This track focuses on the latest trends in data analytics and business intelligence, helping you transform raw data into actionable insights that can propel your organization forward.\n\nIn addition to these tracks, we’re excited to feature a series of **expert panels** that will bring together thought leaders from across the industry to discuss the most pressing issues and future trends in data.\nFor more details on the sessions planned visit the [Sessions page](https://www.dataconla.com/events/dcla-2024/sessions/) on our website and for speaker the speaker lineup, check out the [Speakers page](https://www.dataconla.com/events/dcla-2024/speakers/).\n\nWhile the final schedule is still being perfected, rest assured that each session will be packed with valuable content, hands-on learning, and opportunities to network with peers and leaders in the field.\nOne last thing we are making happen this year is Match & Mingle, a chance to connect with another attendee. Those participating will be matched and introduced in to one other attendee based on background and interests, giving you a chance to meet someone new and make a deeper connection within the community. Look out for the opt-in question during the checkout!\nDon’t miss your chance to be part of this incredible event. Stay tuned for updates on the agenda, and secure your ticket today to ensure your spot at Data Con LA 2024!\n\nAnd finally **don't forget** to visit us at the OWASP Los Angeles booth!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - NOV 12, 2024",
        "date": "2024-11-12",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300687868",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: State of Pentesting 2024\nJoin us for great networking, dinner and drinks, and see a presentation by **Carolyn Wang**, Chief Strategy Officer at Cobalt.\n/\\*\\* check back for potential date change \\*\\*/\n\n**ABSTRACT**:\nIn the sixth annual installment of State of Pentesting 2024, Cobalt shares data and insights from more than 4000 manual pentest engagements performed in 2023, resulting in more than 39,000 security vulnerability findings. Caroline will present the data as well as commentary on artificial intelligence and offensive security.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Patients at Risk: Investigating The Healthcare Cybersecurity Crisis",
        "date": "2024-11-13",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885957",
        "timezone": "America/Chicago",
        "description": "Want to learn more about the most successfully attacked industry in the world? Here’s your chance!\n\nHealthcare organizations are facing a digital storm. Cyberattacks are increasingly successful, targeting sensitive patient data, disrupting critical services, and putting lives at risk. Facing a growing threat landscape due to increasing reliance on interconnected technologies (including IoT, IoMT, OT and IT systems), many hospitals are struggling to recover from decades of accumulated cybersecurity debt.\n\nThis presentation will explore the root causes of healthcare cyberattacks, providing real-world examples and discussing the technical vulnerabilities that make organizations prime targets. Attendees will gain insights into the emerging guidance and strategies for improving healthcare cybersecurity, as well as the debate surrounding the need for regulation in this critical sector. We will also examine the significant financial and reputational costs associated with cyberattacks and delve into the motivations and tactics of the attackers themselves.\n\nJoin OWASP Nashville and Chad Holmes as we dive deep into the world of healthcare cybersecurity. We'll explore the root causes of cyberattacks, examine real-world examples, and discuss the technical vulnerabilities that make hospitals prime targets."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "OWASP BeNeLux Days 2024",
        "date": "2024-11-28",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/303987709",
        "timezone": "Europe/Amsterdam",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2024\" edition on November 28th and 29th in Utrecht, the Netherlands.\n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-11-19",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297786624",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for November will be **A05:2021 - Security Misconfiguration**.\n\n**Technical Topic Speaker:** Jagan Boda (Jay)\n**Talk Title:** How scary is a Post-Quantum Computing Crypto World?\n\nIn my presentation, I will explore the transformative potential and security challenges of quantum computing. I will try to explain key quantum concepts like superposition and entanglement, contrasting them with classical computing principles.\n\nI will address security concerns by discussing the vulnerability of current cryptographic algorithms and infrastructure to quantum attacks. A brief history of cryptography and solutions to the challenges from quantum computing. Then we will outline ongoing efforts to develop quantum-resistant cryptography and the standardization processes from organizations such as NIST.\n\nOpportunities for adoption of post-quantum computing safe algorithms exist today and can be planned for and budgeted. Education and awareness will be crucial, ensuring stakeholders understand the implications of quantum computing on cybersecurity.\n\nBy the end of the presentation, attendees will gain a foundational understanding of quantum computing's impact on security and practical steps to protect sensitive data in a quantum-enabled future.\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The Defender's Advantage: A guide to activating cyber defense / Developing an Ap",
        "date": "2024-11-21",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/303770736",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, November 18th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Talk 1**\n**The Defender's Advantage: A guide to activating cyber defense**\nOrganizations today face relentless cyberattacks that can compromise their critical assets. The Defender’s Advantage is the concept that organizations have the upper hand in defending against attacks on their own environments. The overview will guide you through understanding the threat landscape, detecting and investigating malicious activity, testing and validating the effectiveness of controls and operations, hunting for active threats. The book goes into detail about each of these concepts to help organizations take control and galvanize their defender’s advantage.\n\n**Speaker 1 Bio**\nGursev Singh, Sr. Information Security Consultant at Google.\n\nA seasoned cybersecurity professional with over 16 years of experience in the field. He has a strong track record of success, leading and managing cybersecurity projects for major customers.Gursev's expertise in cloud security (Google, AWS & Azure), SIEM, and data protection. His deep understanding of infrastructure security and cyber threat and vulnerability management further enhances his ability to analyze threats, identify vulnerabilities, and respond to security incidents.Currently, he's a Sr. Information Security Consultant at Google.\n\n**Talk 2**\n**Developing an Application Security Champions Program**\nApplication security focuses on a specific set of issues which incur risk. Software security in general may cover everything from IT to cloud to access, to authentication, etc. What we are addressing in this discussion is a security program designed to surface and mitigate risk found within applications.\nAgenda\n\n* Remote Code Execution – an infamous example\n* The recurring cycle of scan, assess, mitigate\n* Update, Update, Update!\n* Ownership is essential\n\n**Speaker 2 Bio**\nRich Newman, Technical Account Manager at Black Duck Software, Inc.\n\nRich was a developer for 13 years in the embedded space, primarily embedded C and assembly code. He then transitioned to field engineering for Wind River, Intel, Coverity and Synopsys for the past 26 years. The technologies he supported covered a wide range of embedded operating systems and tools, live patching, static analysis and security tools and services. He has an active CISSP certification."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2024-11-07",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181930",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-11-28",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/303254411",
        "timezone": "Europe/London",
        "description": "It's music night! Come join us for live music and great chat. \n\nThirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Rewa",
        "repo": "www-chapter-rewa",
        "name": "Biometric Authentication in Fintech: Enhancing Security in Digital Banking",
        "date": "2024-11-05",
        "time": "16:00+05:30",
        "link": "https://www.meetup.com/owasp-rewa-chapter/events/304159235",
        "timezone": "Asia/Kolkata",
        "description": "Biometric authentication uses unique biological traits like fingerprints, facial recognition, or iris scans to verify a user’s identity, offering a highly secure alternative to traditional passwords. In fintech, this technology is increasingly adopted by digital banking platforms to enhance security, reduce fraud, and streamline user experience. By leveraging biometrics, fintech companies can offer faster, more reliable authentication methods, reducing the risk of hacking or identity theft. However, concerns around data privacy, storage, and potential misuse of biometric data also need to be addressed to ensure trust and compliance."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - In-person Meetup (@Thai Land in Draper)",
        "date": "2024-11-07",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/304282022",
        "timezone": "America/Denver",
        "description": "Hi All, wrapping up the year with a casual event where we'll chat about SaintCon and introduce any new members.\n\nMeeting at ***Thai Land*** in Draper for lunch.\n\n**Agenda**:\n\n1. Introductions\n2. Wins & Lessons learned from SaintCon including:\n1. AppSec Community\n2. AppSec Jeopardy\n\nSee you there!\n\n**Location:**\nThai Land\n126 12300 S, Draper, UT 84020\nhttps://maps.app.goo.gl/pP5AhScSGeXJJcFk9"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-11-13",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539101",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver Monthly Meetup",
        "date": "2024-11-21",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516385",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #69 - Software Maturity Model and Security Champions",
        "date": "2024-11-27",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/303263383",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #69! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n**DSOMM and AppSec Program:** We are excited to welcome Timo Pagel, Cloud and Web Security Architect at PagelShield, a core member of the OWASP Germany Chapter, and contributor to various OWASP projects. Timo will discuss the DevSecOps Maturity Model (DSOMM) and how it can help kick-start your application security program. We will also have another speaker joining us for this event—details to be announced soon!\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **27.11.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 AG, located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "German OWASP Day 2024",
        "date": "2024-11-12",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/304040492",
        "timezone": "Europe/Berlin",
        "description": "**\\*\\*This is a paid event\\*\\***\n\nDear all,\n\nWe're proud to present a cool lineup of talks for the German OWASP Day in Leipzig on November 13th! The program committee got a solid amount of high quality submissions and thus the agony of choice.\n\n\\* Frederik Braun will present \"Modern solutions against Cross-Site Leaks (xs-leaks) and CSRF“\n\\* Thomas Barber will give us insights into the project Foxhound, a taint tracking project using a patched Firefox\n\\* Malte Wessels will display results of his research on SSRF\n\\* Shubham Agarwal will raise his voice against \"Double-Edged Crime: How Browser Extension Fingerprinting Might Endanger Users and Extensions Alike\"\n\\* Björn Kimminich is celebrating the \"OWASP Juice Shop 10th anniversary\"\n\\* While Dr. Daniel Fett will be talking about \"How (Not) to Use OAuth in 2024“,\n\\* Kristina Yasuda will tell you \"The Crucial Role of Web Protocols and Standards in Digital Wallet Ecosystems\" (EUDI Wallet)\n\\* Tim Philipp Schäfers will demystify NIS2 and hopefully NIS2UmsuCG\n\\* Diana Calderón will explore strategies for creating and implementing Security Champion programs in organisations\n\\* Hanno Böck will tell not-so-good stories about private keys\n\\* Stephan Pinto Spindler will share his experiences wrt \"Network Fingerprinting for Securing User Accounts\"\n\\* Behnaz Karimi will give us an overview of the OWASP AI Exchange project\n\\* Niklas Bunzel and Raphael Antonius Frick will explore the security challenges and opportunities posed by GenAI\n\\* Clemens Hübner will amend that showing how GenAI can help identifying threats\n\\* Florian Hantke and Sebastian Roth will show how to scan for Vulnerabilities Without Getting Into Trouble\n\\* Nicolas Schickert, Ole Wagner and Matthias Göhring will tackle most companies problem child \"SAP from an Attacker’s Perspective – Common Vulnerabilities and Pitfalls\"\n\nThe full program is on the web site [https://god.owasp.de/](https://god.owasp.de/) .\n\n**Registration is open. [Reserve your spot](https://god.owasp.de/2024/#tickets)! \\*\\*This is a paid event\\*\\***\n\nOn the 12th of November we also offer three trainings — those have to be booked separately:\n\\* OWASP Juice Shop: Advanced Demos & For-fun CTF by Björn Kimminich + Jannik Hollenbach\n\\* Getting started for establishing your Security Champions Program by Juliane Reimann + Michael Bernhardt\n\\* Building Secure Software: A Hands-On OWASP SAMM Training by Daniel Kefer.\n\nAs usual on the evening before the conference day (November 12th) there’s a get-together with food and drinks.\n\n**\\*\\*THIS IS A PAID EVENT\\*\\***"
    }
]