[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - June 2023 (Online)",
        "date": "2023-06-27",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705746",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- https://owasp\\-austin\\-2023\\-june\\.eventbrite\\.com\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nOWASP Austin Chapter Meeting June 2023\nWhen: Tuesday, June 27th, 2023 @ 11:30 AM - 1:00 PM\n\nPresentation: 2023 AT&T Cybersecurity Insights Report: Edge Ecosystem\n\nWe are poised on the precipice of a new era of computing underpinned by new networks, new apps, and a digital-first experience.\nHear the latest findings from AT&T Cybersecurity research and learn about:\n\\- What high\\-priority edge computing use cases are across seven industry markets\n\\- How to secure and work with the edge ecosystem\n\\- How the attack surface is changing\n\\- How endpoints are diversifying\nThe data from this research helps audiences understand challenges and opportunities of the future and examines:\n\\- Balanced investment strategies\n\\- Collaboration and communication needs\n\\- Building with dynamic cyber resilience in mind\nSecurity is now a critical part of business - learn how to move your team to the future!\n\nSpeaker: Theresa Lanowitz"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Top 10 V2021 Awareness - A6 - A10",
        "date": "2023-07-15",
        "time": "2:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/292302183",
        "timezone": "Africa/Cairo",
        "description": "OWASP Top 10 Awareness Program\n\nThe OWASP Top 10 is a powerful awareness document for web application security. It represents a broad consensus about the most critical security risks to web applications.\n\nThe second day of the awareness program includes three sessions covering the risks from 6 to 10 of OWASP top 10 risks and Mitigations,\n\nLocation: Online Event, we will have a live streaming for the event through chapter Youtube channel:\nhttps://www.youtube.com/channel/UCOmffRRYZSpYOiJQp15NHQA\n\nDate: 18 Feb 2023\n\nAgenda:\n\n1- A06:2021-Vulnerable and Outdated Components\n2- A07:2021-Identification and Authentication Failures\n3- A08:2021-Software and Data Integrity Failures\n4- A09:2021-Security Logging and Monitoring Failures\n5- A10:2021-Server-Side Request Forgery"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "And we're back!",
        "date": "2023-07-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/294216909",
        "timezone": "America/New_York",
        "description": "We are BACK folks. Been .. a minute. But we have a great meeting coming together. Jeff Williams is our speaker, and Black Hills Security will be providing the snac. Here's what Jeff will be covering:\n\nAfter over 20 years, achieving app and API security still requires Herculean effort by smart and dedicated people. Fortunately, we can look to history and see a path forward. In the mid-2000s we changed the curve on kernel exploits by adding ASLR and DEP to operating systems. Imagine hardening your web app and web API stacks against all the major classes of vulnerability. You could instantly notify developers if they introduce a vulnerability and you could stop vulnerable software from being exploited. How would it change your appsec program if you could dramatically reduce the risk of all the common classes of vulnerability? In this talk, we’ll explain how runtime protection works and how you can streamline vulnerability management and ensure your software doesn’t get exploited… at the same time."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP July Meet - In person",
        "date": "2023-07-20",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/294141225",
        "timezone": "America/Chicago",
        "description": "OWASP Dallas is ready to host in-person meets.\n\n\"The Monsters in Your Software Supply Chain that SCA Can't Find\"\n\nThere are excellent SCA tools and excellent SSDLs out there, so why did the 3cx breach feel so much like GroundHog Day? This talk will discuss root cause, attack vectors, adversaries, and countermeasures for Software Supply Chain Security attacks."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #61 ",
        "date": "2023-07-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291813603",
        "timezone": "Europe/Berlin",
        "description": "Hi all, after the [German OWASP Day 2023](https://god.owasp.de/2023/) we want to dive into our regular OWASP Frankfurt Chapter meetings again. We are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within AppSec & Cyber Security. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **NVISO.**\n\n_What are we going to talk about?\nTo be announced!\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **NVISO**.\n\n_When?\nOur Meetup takes place on the last Wednesday before the summer break in July, namely on 19.07.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nNVISO GmbH, Holzgraben 5, 60313 Frankfurt\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "[on-prem] Rust: Eine moderne Alternative zu C und C++ ",
        "date": "2023-07-06",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/294347212",
        "timezone": "Europe/Berlin",
        "description": "Moin / Hi,\n\nnext talk will be in German.\n\nWir haben in zwei Wochen einen interessanten Vortrag von Damian Poddebniak zur gehypten Programmiersprache Rust. Dem können wir uns natürlich nicht verschließen ;-) und freuen uns auf die Einsichten von Damian!\n\nWir sind zu Gast bei Check24 am Anfang der Außenalster (Nähe Hotel Atlantic) In Fußmarschentfernung vom Hauptbahnhof.\n\nAus planungstechnischen Gründen unseres Hosts sag mir bitte per Mail oder hier bei Meetup Bescheid, wenn du dazustoßen möchtest.\n\nGeplant ist, den Vortrag auch zu streamen. In dem Fall bitte NICHT auf \"RSVP: ja\" drücken, da das sonst die Planung unseres Gastgebers durcheinander bringt (Stream-URL folgt)\n\n**TL;DR**\n===\n\nTitel: \"[on-prem] Rust: Eine moderne Alternative zu C und C++ \"\nSprecher: Damian Poddebniak\nLokation: Check24, An der Alster 64, 20099 Hamburg\nStart: 6.7.2023, 18:30 Uhr, Einlass ab 18 Uhr\nNetworking danach: TBD\n\n**Abstract**\n===\n\nC und C++ haben sich durch ihre hohe Leistung und Kontrolle über Hardware als wichtigste systemnahe Programmiersprachen etabliert. Allerdings sind sie auch bekannt für ihre subtil schwierige Anwendung und die damit verbundenen Sicherheitslücken.\n\nRust tritt hier als vielversprechende Alternative auf: Es bietet die gleichen Vorteile in Bezug auf Leistung und Kontrolle, bringt jedoch auch Speichersicherheit und Threadsicherheit mit. Zudem löst es weitere gesamte Klassen an Fehlern wie z.B. NULL-Pointer-Dereferenzierung auf.\n\nRust ist bereits jetzt fester Bestandteil des Linux- und Windows-Kernels und wird für neue Komponenten in Android eingesetzt.\n\nDie Kombination aus Leistung, Sicherheit und nicht zuletzt einer tollen Community mit hohen sozialen Standards macht Rust zur Sprache der Wahl für moderne Programmierung.\n\nDer Vortrag gibt einen kurzen Überblick über die Programmiersprache Rust und soll zum Auszuprobieren anregen. Dazu gibt es einen größeren Live-Coding Anteil um zu zeigen wie die Arbeit mit Rust aussieht und welche Konzepte die Sprache so besonders machen.\n\n**Generelles zum OWASP-Stammtisch**\n===\n\nBei unseren offenen Treffen geht es um Software und deren Sicherheit im Internet und/oder IT-Security allgemein. Es treffen sich Leute, die sich beruflich oder privat damit auseinandersetzen: Entwickler, Manager, \"Pentester\" und alle an (Web)sicherheit interessierte. Die Atmosphäre ist offen und locker. Uns geht's um den Erfahrungsaustausch, Technikschnack und ums Netzwerken. Wer Produkte oder Dienstleistungen verkaufen will, ist hier falsch. Ihr seid herzlich willkommen Kollegen oder Bekannte den Hinweis auf unser Treffen weiterzuleiten. Alle Treffen sind frei, für jeden offen und kostenlos.\n\nSchönen Gruß, Björn / Dirk"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-07-10",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/294138407",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kathmandu",
        "repo": "www-chapter-kathmandu",
        "name": "OWASP Kathmandu Meetup - 0x04",
        "date": "2023-07-08",
        "time": "0:00+05:45",
        "link": "https://www.meetup.com/owasp-kathmandu-chapter/events/294300182",
        "timezone": "Asia/Kathmandu",
        "description": "The 0x04 Meetup for OWASP Kathmandu is ecstatically set to take place on the 8th of July, 2023. We are deeply honored to have the illustrious TechKraft Inc. as our esteemed sponsor.\n\nTalks will encompass a diverse range of topics including Organizational Cybersecurity, Bug Bounties, Network Security, Compliance, and much more. Please note that this time we have implemented a strict RSVP policy, so ensure to confirm your attendance in advance."
    },
    {
        "group": "Kolkata",
        "repo": "www-chapter-kolkata",
        "name": "OWASP KOLKATA MEETUP #6",
        "date": "2023-07-01",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-kolkata/events/294304662",
        "timezone": "Asia/Kolkata",
        "description": "#### Proposed sessions for this event:\n\n* Exploit Writing 101 – Beyond Just Reporting Bugs by **Soummya Mukhopadhyay**\n* Hack Wireless Networks with IOT by **Aninda Saha**\n* Web Application Hunting Approach by **Souvik**\n* Incident Response Fundamentals by **Sudipta Pramanik**"
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "OWASP Community Day",
        "date": "2023-07-22",
        "time": "0:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/294165322",
        "timezone": "Asia/Karachi",
        "description": "**OWASP Community Day Lahore**\n\nJoin us for the highly anticipated OWASP (Open Web Application Security Project) Community Day in Lahore! This event is a gathering of cybersecurity enthusiasts, professionals, students, and experts who are passionate about web application security and its importance in today's digital landscape.\n\nDuring this day-long event, you will have the opportunity to engage with like-minded individuals, learn from industry leaders, and expand your knowledge in the field of web application security. The OWASP Community Day Lahore aims to promote collaboration, knowledge sharing, and awareness of the latest trends and best practices in securing web applications.\n\n_**Highlights of the OWASP Community Day Lahore:_**\n\n1. Expert Talks: Listen to renowned cybersecurity experts and thought leaders as they share their insights and experiences in web application security. Gain valuable knowledge about emerging threats, vulnerabilities, and effective countermeasures.\n\n2. Hands-on Workshops: Participate in interactive workshops conducted by industry professionals where you can enhance your practical skills in areas such as secure coding, penetration testing, threat modeling, and secure software development.\n\n3. Networking Opportunities: Connect with fellow cybersecurity enthusiasts, professionals, and students in a collaborative and engaging environment. Expand your professional network, share ideas, and forge valuable connections with individuals who share your passion for web application security.\n\n4. Capture The Flag (CTF) Challenges: Test your skills and compete in exciting Capture The Flag challenges designed to simulate real-world scenarios. Solve security puzzles, find vulnerabilities, and demonstrate your expertise to win attractive prizes.\n\n5. Lightning Talks and Demos: Engage in quick-paced lightning talks and live demonstrations, where participants showcase innovative tools, techniques, and research findings related to web application security. Discover new solutions and gain inspiration from cutting-edge projects.\n\n6. Community Projects and Initiatives: Learn about ongoing OWASP projects and initiatives, and find out how you can contribute to the community. Explore opportunities to collaborate on open-source security tools, research papers, and resources that benefit the broader cybersecurity ecosystem.\n\nDon't miss out on this incredible opportunity to be part of the OWASP Community Day Lahore! Mark your calendars and join us for a day filled with knowledge sharing, skill-building, and networking in the vibrant world of web application security. Together, let's make the web a safer place for everyone.\n\n**Note: Please stay tuned for updates on speakers, workshops, and additional event details on our official website and social media channels.**\n\nWe look forward to welcoming you to the OWASP Community Day Lahore!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUN 28, 2023",
        "date": "2023-06-28",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/292955470",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Security Architecture - What is it? How to Deploy it\nJoin us for great networking, dinner and drinks, and see a presentation by President and Founder of iSecurePrivacy, LLC.\n\n**ABSTRACT**: Security Architecture is a security design that addresses the technology goals, approaches, controls, and potential for the enterprise. It also specifies when and where to apply security controls. This discussion starts from the enterprise perspective using SABSA (Sherwood Applied Business Security Architecture). It then introduces COBIT, from ISACA, which is a framework that focuses on the governance and management of enterprise IT. TOGAF (The Open Group Architecture Framework) aligns security with business needs. Then there is the OWASP SAMM (Software Assurance Maturity Model) that is a framework for helping organizations analyze their current software security practices in the development of new applications. Within these four security architectures, we will also talk about some software secure coding standards such as (PCI Software Security Framework, SEI CERT Coding Standards, NIST SSDF, Microsoft Secure Coding Guidelines , and OWASP Secure Coding Practices). These standards are important, but they need to be based on meeting the business strategic objectives, business model, and business needs. That is what security architectures provide.\n\n**Thanks to our Sponsor**: *[Prisma Cloud](https://www.paloaltonetworks.com/prisma/cloud)*\n*The Most Complete Cloud-Native Application Protection Platform (CNAPP). Prisma Cloud secures applications from code to cloud, enabling security and DevOps teams to effectively collaborate to accelerate secure cloud-native application development and deployment.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "Secure File Location Handling - Build.Attack.Fix Games",
        "date": "2023-06-29",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/294138476",
        "timezone": "Australia/Melbourne",
        "description": "Hello OWASP Melbourne,\nFollowing our last challenge being well received, we're back with another challenge and ramped up the stakes. Brought to you in collaboration with Dr. Pedram from SecDim, this time a King of the Hill style challenge. Build your app, attack other's apps, and iterate on improving your defences.\n\nHow will this work?\n\nThis is a battle challenge. You have limited time to address the security vulnerabilities in your code. Once you push your code, you enter the battle page where you can hack other players app. Anytime you successfully hack a player's app, you need to extract the flag. You then submit the flag to get the score. The earlier you defend your app or hack another player's, the higher will be your ranking.\n\nNOTE: If a player hacks your app, you will lose the score and get kicked out of the battle page. You may try again.\n\nNo presentation, no lecture. This is a hands-on session to up-skill in secure programming. Please bring your laptop with your development environment set up and ready to go, so that you can jump right into the action.\n\n**We will explore these weaknesses**:\n\n* CWE-35 and CWE-23\n\n**Agenda**:\n\n* 6:00-6:10 Welcome\n* 6:10-7:30 Let the battle begin.\n\nThis event is not catered, but you're welcomed to bring your own food along.\n\n**Prepare**:\nIf you are a first timer, **get your workstation setup** by completing any of the \"Start Here\" levels on [https://play.secdim.com](https://play.secdim.com/) (SecDim Play is a training game for secure programming)\n\n**Contribute**: Help to foster the community by **contributing a secure programming challenge**. Follow the guide at [https://github.com/secdim/play-sdk](https://github.com/secdim/play-sdk).\n\n**Keep in-touch**:\nKeep the conversation going. OWASP Melbourne is on the [AppSec ANZ Discord ( https://discord.gg/uAWze2B )](https://discord.gg/uAWze2B) where you can meet up with others interested in AppSec and secure development.\n\n**Hybrid event**:\nIf you're attending in-person, please RSVP (and update if you no longer are able to go) as the venue is very limited. We will update this listing here with the video conference link closer to the event:\n< virtual attendance link coming soon >\n\n**Required Equipment**\nPlease bring your own laptop along to the event that has been setup as described above. There is free wifi, but without your own laptop, you won't be able to participate.\n\n**PS. This is a joint community event with SecDim.**\n\n**Other Information**\n**What is OWASP?**\nThe Open Worldwide Application Security Project® (OWASP) is a volunteer-run, nonprofit foundation that works to improve the security of software. Through community-led open source software projects, hundreds of local chapters worldwide, tens of thousands of members, and leading educational and training conferences, the OWASP Foundation is the source for developers and technologists to secure the web.\n\n**Find out more?**\nMeetup.com Page: https://www.meetup.com/Application-Security-OWASP-Melbourne/\nAbout the Chapter: https://owasp.org/www-chapter-melbourne/\nJoin the AppSec ANZ Discord: https://discord.gg/uAWze2B"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP NZ - Auckland Meetup - July 2023",
        "date": "2023-07-11",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721004",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for July will be **A08:2021 - Software and Data Integrity Failures.**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand Day 2023",
        "date": "2023-07-04",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/287977420",
        "timezone": "Pacific/Auckland",
        "description": "**Important Links:**\n\n* [Conference Website](https://appsec.org.nz/conference/)\n* [Conference Registration](https://events.humanitix.com/owaspnz2023) (Humanitix)\n* [Pre-Conference Training Registration](https://events.humanitix.com/owaspnz2023-training) (Humanitix) - Closes 23 June\n\nWe are proud to present the 13th OWASP New Zealand Day conference, to be held at the Auckland University of Technology (AUT) City Campus on Thursday and Friday, July 6th and 7th, 2023. OWASP New Zealand Day is a two-day conference dedicated to web and application security, with an emphasis on secure architecture and development techniques to help Kiwi developers build more secure applications. The conference is presented by the [OWASP New Zealand Chapter](https://owasp.org/www-chapter-new-zealand/) and organised by [AppSec New Zealand Incorporated](https://appsec.org.nz/).\n\nThere will be two presentation streams throughout the conference. The first stream will include introductory talks on application and information security topics, as well as on policy, compliance, and risk management. The second stream will primarily address deeper technical topics. Talks featuring OWASP projects and tools are particularly encouraged, as are talks by members of under-represented communities.\n\nIn addition to these principal streams, there will be a third, smaller “stream,” supporting sponsor presentations, demos of OWASP tools, and interest/user group meetings. Diamond, Platinum, and Gold Sponsors will be given priority for time slots in this “stream.” Further details will be published closer to the date, regarding opportunities for other groups to present.\n\nWho is the Conference for?\n\n* Web Developers\n* Security Professionals and Enthusiasts\n* Program and Project Managers\n* Business Analysts\n* Requirements Analysts\n* Software Testers"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Mobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-07-20",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/294045639",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in mobile AppSec vs. web AppSec and how to put OWASP MAS project, tools, and resources to work. In this session, we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources, and how to build your own toolkit. Along the way, we will hit the latest privacy and security updates with iOS and Android. The Web Rocks… but Mobile Rules - Come join us!"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "The State of the Security Industry in 2023: Round Table",
        "date": "2023-06-29",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/294226355",
        "timezone": "America/New_York",
        "description": "This month, the OWASP NoVA team is hosting a group of leading security professionals to discuss the latest challenges we are all facing.\n\nBring your best and most challenging questions and join us for a mid-year roundup with Abdullah Munawar, Sean Poris, and Rich Wickersham.\n\nBios:\nAbdullah Munawar is currently the Director of Product Security at Appian and has previously been a consultant for a number of years helping various federal and financial clients build and mature security programs. He has been running the Northern Virginia Chapter of OWASP for the past 8 years and was also one of the lead organizers for AppSec USA 2016 and Global AppSec DC in 2019.\n\nRich Wickersham is a highly experienced Cyber Security expert, researcher and executive with over two decades of experience in defining and guiding cybersecurity vision, strategy, and execution for major organizations in the public and private sectors. Wickersham is currently the Chief Security Architect for Voya Financial and has previous security leadership experience with AIG, Fannie Mae, The United States House of Representatives, and The Department of Homeland Security. Rich is a recognized researcher with past speaking engagements at CSA, DEFCON, Voice of America and BSIDES.\n\nSean Poris\nSean Poris leads the Cyber Resilience pillar inside Yahoo's information security organization, affectionately dubbed \"The Paranoids.\"\nHe's passionate about providing the bedrock of security solutions that ensure the protection of the company's critical consumer and company data that nearly one billion people around the world entrust to Yahoo.\nSean's team — which includes Vulnerability Management Operations and Engineering; Product Security; Cloud Security; and Bug Bounty, among half a dozen other functions — builds solutions that drive the delivery of resilient products and infrastructure.\nPrior to Yahoo, Sean was the Senior Director of Software Security at The College Board, which enables students in their collegiate journeys throughout the world.\nThere, his team equipped software development groups with the critical training, tools, and processes needed to address information security holistically throughout the development lifecycle.\nSean currently serves on the Board of the Northern Virginia Chapter of OWASP. And in that capacity, he worked as the 2019 Global OWASP AppSec DC conference's co-chair."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Anatomy of a Breach: Dissecting Cloud Security",
        "date": "2023-06-29",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/293621833",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\nCloud security presents unique challenges. As enterprises continue to move to the cloud, security practitioners face new threats and paradigms. In this session, we’ll forensically reconstruct major cloud-centric breaches and step through them, building an understanding of what happened, how it happened, and developing key takeaways to help secure our own infrastructure, especially in AWS, Azure, and GCP.\n\n**Code of Conduct:**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**Sponsorship:**\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "June meetup",
        "date": "2023-06-29",
        "time": "7:00+02:00",
        "link": "https://www.meetup.com/owasp-oslo/events/294176472",
        "timezone": "Europe/Oslo",
        "description": "**Blank** is the sponsor of this meetup! Thank you!\n\n**Agenda:**\n\n* 17:00-17:30 : Food\n* 17:30-17:50 : How to get pwned by npm packages and weak settings in GitHub Actions - Erlend Åmdal\n* 18:00-18:45 : Open Policy Agent in-depth - Anders Eknert\n\n**How to get pwned by npm packages and weak settings in GitHub Actions**\nDo you know if your GitHub Actions workflows are secure? I will demonstrate a proof of concept of a supply chain attack that exploits weak security settings in a typical GitHub Actions workflow to do things you might not expect an npm package to be able to do, followed by a presentation of simple methods to prevent this kind of attack. Due to Action's tight integration with the rest of the GitHub platform, the attack can easily target a repository's contents and metadata, including the issue tracker, pull requests and GitHub Packages. If you value the content on your issue tracker or publish to GitHub Packages and are curious about the security of GitHub Actions, this presentation might prove interesting and useful.\n**Erlend Åmdal** is a software development consultant at Blank with a few years of industry experience. He is a passionate developer who strives for secure software. Having worked with various customers ranging from reMarkable to Autodesk, Erlend has been involved with several organizations depending on GitHub Actions and npm packages for their CI/CD, and knows a thing or two about securing this dependency.\n\n**Open Policy Agent in-depth**\nShould user Alice be allowed to read credit reports? Should a cloud compute instance be deployable without basic security configuration in place? Should service X be allowed to query the database?\nPolicy defines the rules of our systems, but how do we ensure our policies are enforced consistently in increasingly distributed and diverse tech stacks?\nIn this technical talk we’ll explore the benefits of decoupling policy from our applications, deployment pipelines and platforms, and how Open Policy Agent (OPA) and its policy language Rego works to unify policy enforcement across the whole stack.\n**Anders Eknert** is a developer advocate at Styra with a long background in software development, security and identity systems in primarily distributed environments. When not in front of his computer he enjoys watching football, cooking and Belgian beers."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter 2: OWASP Meet Up",
        "date": "2023-07-05",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/292660571",
        "timezone": "Europe/London",
        "description": "**OWASP JULY!**\nWe're back for our 2nd Cyber catch up! July's focus is on cloud security, trends and behaviours.\n\n**Who is it for?**\nEverybody! Come along, bring a friend, share with your colleagues.\nA principle of the chapter is to ensure **cyber security is accessible** for everyone. You don't need to be a security professional, each session will break down topics to ensure everybody can take something away.\n\n**Agenda**\n\n* **Xavi Garcia** & **David Greenwood** (of Prisma Security origin) share their insights into cloud security trends and behaviours.\n* **Ashley Fleet** hosts a round-table discussing the latest cyber trends (think AI, secure coding, recent breaches)\n* **Networking & Drinks**\n\n**When is it?**\n\n* Wednesday 5th July\n* **Start** from 7:30pm\n* **Finish** around 11:00pm\n\n**Where is it?**\n\n* The Brewery Tap, Peterborough\n\n**How can you get involved?**\n\n* Respond **'I'm coming!'** to this group\n* Check out our OWASP Chapter [page](https://owasp.org/www-chapter-peterborough/)\n\nWe look forward to seeing you there!"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-06-29",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/293991357",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-07-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/294356460",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - June Encore 2023",
        "date": "2023-06-27",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/293587120",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge.\n\nWe are the only OWASP chapter in the world that runs fight clubs. And it's 100% online so you can join from wherever you are."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Residential Proxies Unmasked: Navigating the Hidden Threat",
        "date": "2023-07-11",
        "time": "7:30+10:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/294359924",
        "timezone": "Australia/Sydney",
        "description": "Join us at the second OWASP Sydney event featuring a talk by [Adam Cassar](https://www.linkedin.com/in/adamcassarac/) from [Peakhour.io](http://peakhour.io/) who will delve into the world of residential proxies. In this talk, Adam will dive into residential proxies, tools that allow for requests from residential IP addresses. He'll clarify what these proxies are, who relies on them, and the possibilities they unlock. Additionally, he'll go over the process of how these large-scale proxy networks come to life.\n\nAdam will discuss the potential implications of these services on IP threat intelligence, the complications of carrier-grade NAT, and questions our reliance on geo-IP databases. He'll also shed light on how your internet use at home, school, or work might be effected by these services.\n\nFinally, Adam will touch on ongoing legal cases involving these services and reveal that some state actors are setting up their own proxy networks for data extraction purposes. The goal is to equip you with a comprehensive understanding of residential proxies, enabling you to make informed decisions within the field of internet security.\n\n**Here are the details of the event:**\n**Date:** July 11th 2023, 5:30pm\n**Venue**: Talenza, Level 3, Macquarie Place, Sydney\n\n**Schedule:**\n\n* 5.30 pm: Arrive, grab a drink, and meet your fellow attendees.\n* 6.00 pm: Residential Proxies Talk.\n* 6:30 pm: Q&A.\n* 7:00 pm: Networking.\n\n* 8:00 pm: Event ends\n\nRSVP now, and we'll see you there!\n\nBest regards,\nOWASP Sydney Chapter Committee"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2023-06-29",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/293768575",
        "timezone": "America/New_York",
        "description": "TBA"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver - July 2023",
        "date": "2023-07-20",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248508",
        "timezone": "America/Vancouver",
        "description": "OWASP Vancouver monthly meetup"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #61 ",
        "date": "2023-07-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291813603",
        "timezone": "Europe/Berlin",
        "description": "Hi all, after the [German OWASP Day 2023](https://god.owasp.de/2023/) we want to dive into our regular OWASP Frankfurt Chapter meetings again. We are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within AppSec & Cyber Security. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **NVISO.**\n\n_What are we going to talk about?\nTo be announced!\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **NVISO**.\n\n_When?\nOur Meetup takes place on the last Wednesday before the summer break in July, namely on 19.07.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nNVISO GmbH, Holzgraben 5, 60313 Frankfurt\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]