[
    {
        "group": "Tunisia",
        "repo": "www-chapter-tunisia",
        "name": "Practical Workshop - Static Analysis Security Testing (SAST) in CI/CD",
        "date": "2021-05-20",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Tunis-Meetup-Group/events/277851439/",
        "timezone": "Africa/Tunis",
        "description": "<p>Welcome to our OWASP Tunisia OPEN Live Event!</p> <p>A practical Workshop on SAST in CI/CD</p> <p>Is your Source Code secure ? How to automate security check in Devops pipeline</p> <p>We will use Jenkins and SonarQube on Docker to run a SAST scan against the source code of a web app.</p> <p>Meet our Guest and ask your questions!</p> <p>Raouf Mnif is Devops architect at Baaz. He spent 10 years developing the skills to increase velocity, reliability, and quality with a high focus on security.<br/>Good experience with AWS, Docker, Kubernetes, and ArgoCD, helping organizations instill Devops for the modern age</p> <p>Gest your ticket Now: <a href=\"https://www.eventbrite.co.uk/e/static-analysis-security-testing-sast-in-cicd-tickets-152685106263\" class=\"linkified\">https://www.eventbrite.co.uk/e/static-analysis-security-testing-sast-in-cicd-tickets-152685106263</a></p> "
    },
    {
        "group": "Las Vegas",
        "repo": "www-chapter-las-vegas",
        "name": "Let's Catch Up! Current Updates, Trends, Certifications and Open Discussions",
        "date": "2021-05-12",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/277473163/",
        "timezone": "US/Pacific",
        "description": "<p>Welcome Notes from the Chapter Leaders to talk about OWASP udpates, current trends and education/certification tips with Q&amp;A Sessions open for anything under the sun.</p> <p>Everyone is welcome, looking forward to meeting you all.</p> "
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa: 5 Shifts to Eliminate Burnout",
        "date": "2021-05-19",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Ottawa/events/277611103/",
        "timezone": "Canada/Eastern",
        "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=jUYig72O37M\" class=\"embedded\">https://www.youtube.com/watch?v=jUYig72O37M</a></p> <p>7:00 PM EDT Technical Talks</p> <p>1. Announcements</p> <p>2. Rescheduled! - Using OWASP Nettacker For Recon and Vulnerability Scanning = Rescheduled!!!</p> <p>UPDATE!!<br/>Due to a family emergency Sam has cancelled his speaking meetups. We will reschedule Sam when he is ready. We apologize for any inconvenience and look forward to when Sam is available to speak with OWASP Ottawa.</p> <p>3. 5 Shifts to Eliminate Burnout, Reconnect To Your Purpose, &amp; Jump Out Of Bed Feeling Excited Again</p> <p>Abstract:<br/>Most IT professionals seem to believe that burning out and being exhausted all the time is normal. Most of them bust their butts working 60+ hour weeks. They have no social lives. They're constantly exhausted. They roll around at night unable to sleep. And worse, every time they wake up there's always some fire they have to put out.</p> <p>It doesn't have to be that way.</p> <p>This session shows you the strategy that allows you to absolutely eliminate burnout, kick stress to the curb, reconnect to your purpose, and actually enjoy your work again.</p> <p>Bio:<br/>Edwin Sarmientois the Managing Director of 15C, a consulting and training company that specializes in designing, implementing and supporting SQL Server infrastructures. He is a 12-year former Microsoft Data Platform MVP and Microsoft Certified Master from Ottawa, Canada (but he’s originally from the Philippines) specializing in high availability, disaster recovery and system infrastructures running on the Microsoft server technology stack. His background in Unix has taken him to the world of DevOps and Docker to containerize SQL Server. He is very passionate about technology but has interests in music, neuroscience, social psychology, professional and organizational development, leadership and management matters when not working with databases.</p> <p>Edwin lives up to his primary mission statement: \"To help people and organizations grow and develop their full potential.\"</p> "
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Automate Security Testing *and* Security for Microservices",
        "date": "2021-05-20",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Vancouver-Chapter/events/277598475/",
        "timezone": "Canada/Pacific",
        "description": "<p>This is a double header edition of the OWASP Vancouver meet-up series, with intermission and opportunity to socialize and network!</p> <p>----------------------------------------------------------------------------------------</p> <p>How to Build Awesome Security Instrumentation to Automate AppSec Testing and Protection (6:00-7:00pm)<br/>By: Jeff Williams</p> <p>Modern software demands velocity, and traditional “outside in” scanning and firewalling are creating bottlenecks and slowing things down. In this talk, Jeff will approach application security from the “inside out”. We will show you how to create simple agents that get inside a running application (like a profiler or debugger) and give you access to everything you might want to know. We’ll demonstrate real agents that identify vulnerabilities without changing any code, scanning, or extra steps. We’ll identify vulnerabilities, analyze access control, and even prevent RCE attacks. Unlike scanning and firewalling, this approach establishes a safe and powerful way for development, security, and operations teams to collaborate. We’ll discuss how software security instrumentation works, how it’s being used in many organizations, and the implications for the practice of application security.</p> <p>Bio: Jeff brings more than 20 years of security leadership experience as co-founder and Chief Technology Officer of Contrast Security. He recently authored the DZone DevSecOps, IAST, and RASP refcards and speaks frequently at conferences including JavaOne (Java Rockstar), BlackHat, QCon, RSA, OWASP, Velocity, and PivotalOne. Jeff is also a founder and major contributor to OWASP, where he served as Global Chairman for 9 years, and created the OWASP Top 10, OWASPEnterprise Security API, OWASP Application Security Verification Standard, XSS Prevention Cheat Sheet, and many more popular open source projects. Jeff has a BA from Virginia, an MA from George Mason, and a JD from Georgetown. <a href=\"https://www.linkedin.com/in/planetlevel/\" class=\"linkified\">https://www.linkedin.com/in/planetlevel/</a></p> <p>----------------------------------------------------------------------------------------</p> <p>Microservices - Applying Security Pragmatically (7:00-8:00pm)<br/>By: Bipin Kalawade</p> <p>The Federal Trade Commission (FTC) estimates that as many as 9 million Americans have had their identities stolen each year.</p> <p>Modern world wide web applications are rushing to dismantle the monolithic architecture by adopting microservices. Most of the times these applications apply single security solution that they think can fit across the organizations.</p> <p>The aim of this presentation is to talk about different API security patterns that applications can think based on the data they are protecting and applying security solution pragmatically<br/>as one security solution cannot and should not fit for all the needs.<br/>The presentation will also cover different types of security tokens that applications can apply with the real-life scenarios and finally concluding that there is no single solution is better vs another.</p> <p>Learning Objectives:<br/>• Discuss monolithic applications vs microservices and its pros and cons.<br/>• Different types of tokens, SAML vs JWT vs OAuth2.<br/>• Role of Identity Provider and Service Provider.</p> "
    },
    {
        "group": "Guatemala",
        "repo": "www-chapter-guatemala",
        "name": "Explotar SQLi",
        "date": "2021-05-13",
        "time": "19:00",
        "link": "https://www.meetup.com/owasp-guatemala-meetup-group/events/277817208/",
        "timezone": "America/Guatemala",
        "description": "<p>Introducción a SQLi</p> "
    },
    {
        "group": "Rio De Janeiro",
        "repo": "www-chapter-rio-de-janeiro",
        "name": "OWASP Chapter RJ - 2º Biweekly Meeting",
        "date": "2021-05-12",
        "time": "19:30",
        "link": "https://www.meetup.com/owasp-rio-de-janeiro/events/277958595/",
        "timezone": "America/Sao_Paulo",
        "description": "<p>Esse é o segundo encontro do capítulo no RJ da OWASP em 2021. Veja nossa agenda a seguir:</p> <p>1. Warm-up (10min)<br/>2. Privacy Risks e o OWASP Top 10 Privacy Risks 2.0 (25min)<br/>3. Discussão, cases e exemplos (20min)<br/>4. Agenda de eventos no BR (5 min)</p> <p>Confira mais sobre o capítulo em <a href=\"https://owasp.org/www-chapter-rio-de-janeiro/\" class=\"linkified\">https://owasp.org/www-chapter-rio-de-janeiro/</a>.</p> "
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "How I hacked the largest bank in Norway using a 1-page paper form",
        "date": "2021-05-20",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/277996588/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>TBA</p> "
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP Top 10 2021 Progress Update",
        "date": "2021-05-18",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Colorado-Springs-Meetup/events/277899154/",
        "timezone": "US/Mountain",
        "description": "<p>At the May Colorado Springs meeting, we will be meeting for the first time in a while. We are actively seeking additional leaders from our community. We want to discuss with you the direction of the chapter. Through the chapter re-activation program Terry Bradley and Andrew van der Stock have stepped up as leaders. As Andrew is the Executive Director, it makes sense that we add at least one more person from our local community to lead the chapter. If you have an interest in leading the chapter, please email Terry or Andrew (see the chapter home page) or discuss it at the meeting. We can have a maximum of five chapter leaders.</p> <p>Featured Speaker for May. Andrew van der Stock (and any of the other co-leaders he can rustle up), will go through the current progress of the OWASP Top 10 2021. We will go through our data collection process, analysis, challenges, and when the first drafts will be released. We'd love for you to get involved in OWASP's most famous project, so learn how you can contribute.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Sydney OWASP Night - Threat Modelling 101 presentation",
        "date": "2021-05-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/277817235/",
        "timezone": "Australia/Sydney",
        "description": "<p>Join us in the month of May for OWASP Chapter Sydney’s Threat Modelling 101 presentation. Threat modelling is one of the biggest semi-understood concepts of Cyber Security. We all have different ways of interpretation in the way we identify threats. During this talk, the speaker will try to present the generic human vision of understanding threats and compare them against how Cyber Security folks should probably understand them.</p> <p>Special guest Abhijeth Dugginapeddi will demonstrate technical and non-technical approaches to understanding threat modelling so that everyone, even with varying levels of skill will be able to participate and deepen their knowledge.</p> <p>Abhijeth Dugginapeddi currently Heads a security team at BigCommerce, Lectures at UNSW and Mentors Strobes a Security orchestration startup. He also spoke at several international conferences like Defcon, Blackhat, OWASP AppSec USA and B-sides. Abhijeth is also an active researcher and has found vulns in major tech companies like Google, Facebook, Yahoo and eBay. He is also interested in Digital Marketing, Product Design and Growth Hacking.</p> "
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2021",
        "date": "2021-05-25",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/277867382/",
        "timezone": "US/Central",
        "description": "<p>Chapter information and a presentation --</p> <p>Scale Your Security by Embracing Secure Defaults &amp; Eliminating Bug Classes</p> <p>\"We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time.</p> <p>Historically, as an industry, we’ve focused on building tools to identify vulnerabilities. While we’ve built impressive tools, these approaches have failed to address the challenges of modern engineering teams.</p> <p>Specifically, these tools often are too slow, require a prohibitive amount of security engineer time and domain expertise to tune, overwhelm users with false positives, and most importantly, do not ultimately raise a company’s security bar.</p> <p>But there’s another way.</p> <p>Rather than investing in finding more bugs, some modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks that enforce invariants (properties that must always hold), organizations can solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole.</p> <p>In this talk, we’ll present a practical step-by-step methodology for:<br/>Choosing what to focus your AppSec resources on<br/>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes<br/>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers<br/>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company\".</p> <p>Speaker:<br/>Emma Jin is a software engineer at r2c, the company that maintains Semgrep, an open-source syntax-aware code search tool. At r2c, she has added features to Semgrep, such as typed metavariables. Emma recently received her B.S. in Computer Science from Carnegie Mellon University, where she picked up her belief in code guarantees. In her free time, she likes to read, write, and relearn her abandoned childhood skills. She is perpetually working on a novel.</p> "
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Bay Area May '21 Meetup",
        "date": "2021-05-12",
        "time": "10:00",
        "link": "https://www.meetup.com/Bay-Area-OWASP/events/277964247/",
        "timezone": "US/Pacific",
        "description": "<p>Get ready for a set of 3 new exciting talks brought by experienced speakers in the security industry!</p> <p>We'd also love to connect with you on Slack:\u2028<br/>1. Please request an invite to OWASP Slack here: <a href=\"https://owasp-slack.herokuapp.com/\" class=\"linkified\">https://owasp-slack.herokuapp.com/</a>. You should do this ahead of time to give yourself time to join.\u2028\u2028<br/>2. Join us in #bayarea\u2028\u2028</p> <p>• 10:00 - Welcome\u2028<br/>•10:05 - 10:40 - The Tangled Web and Its Same Origin Policy (Pankaj Mouriya)<br/>\u2028• 10:40 - 11:15 - Understanding the new NIST Security and Privacy Framework additions around RASP and IAST (Timothy Chiu)\u2028<br/>• 11:15 - 11:50 - What's a data vault? And why do you need it? (Manish Ahluwalia)</p> <p>Talk 1: The Tangled Web and Its Same Origin Policy</p> <p>Same Origin Policy is the Fundamental Security Model of the web, it's been very long that I have been struggling around Same Origin Policy and to overcome this struggle, I did some google and went through some books, watched some boring yet fruitful videos and ended up giving this talk. Having a deep understanding of the Same Origin Policy model is important especially if you are a Security Analyst or developer for secure web development.</p> <p>In this talk I will try to make it easy to understand and will keep your brains engaged so that it does not turn into a boring lecture. We will learn about Same Origin Policy with DOM, browser tabs, iframes, importance of SOP and how it is applied to web storage, images, CSS, JS, etc. I will also talk about Same Origin Policy exceptions and ways to get around Same Origin Policy with detailed explanation to postMessage API, URI fragment and CORS etc.</p> <p>Speaker Bio -<br/>Pankaj is Security Analyst at Appsecco. Pankaj is a Web Security and Cloud Security enthusiast with a strong passion for Information Security. Pankaj has extensive experience in Web Application, Network and Mobile Application security assessments. Pankaj is community manager at null –The Open Security community and an active speaker and contributor at various security communities.</p> <p>Talk 2: Understanding the new NIST Security and Privacy Framework additions around RASP and IAST (Timothy Chiu)</p> <p>Join us for a discussion on the new NIST SP800-53 Application Security Framework Requirements for RASP and IAST. You'll learn about the final release of revision 5 to this version of SP800-53, which now includes RASP and IAST. The new framework was released by NIST on September 23, 2020.</p> <p>The presentation will cover: the state of application security, new additions, compliance timing requirements, overview of RASP, and overview of IAST.</p> <p>Speaker Bio:</p> <p>Timothy Chiu is the VP of Marketing for K2 Cyber Security, Inc. Prior to joining K2, Tim served as a product marketing executive for Symantec (through the acquisition of Blue Coat). At Symantec, Tim drove product launches, analyst relations and product evangelism for Symantec’s web security products. Tim has an MBA from Santa Clara University, a BSEE from the University of Pennsylvania and BS from the Wharton School of Business.</p> <p>Talk 3: What's a data vault? And why do you need it? (Manish Ahluwalia)</p> <p>The complexity of hybrid data center infrastructures and the rise of<br/>compliance risk today has led to the creation of the data vault. These data vaults have been created by organizations of all sizes, from healthcare startups to digital-first financial services firms to solve the problem of governance for privacy data, such as your data of birth, your doctor’s name and other PII. We will explore architectural patterns and best practices to create a privacy data vault that lets you store and easily govern sensitive data based on your needs.</p> <p>What you’ll take away: what is data vault, how to adopt a data vault pattern, special considerations, and access controls.</p> <p>Speaker Bio:<br/>Manish has over 2 decades of experience in the software industry, with over 10 years in information-security. He currently works at Skyflow as Head of Customer Security and Privacy. Previously, he was running Security at NerdWallet.</p> "
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston May 2021 Meetup",
        "date": "2021-05-12",
        "time": "17:30",
        "link": "https://www.meetup.com/owaspboston/events/277774099/",
        "timezone": "US/Eastern",
        "description": "<p>OWASP Boston's May 2021 Meetup welcomes an exciting speaker to the lineup. This month along with our normal OWASP &amp; AppSec News updates, Jim Manico will join us to talk about Request Forgery on the Web - SSRF, CSRF and Clickjacking!</p> <p>This technical talk on various forms of request forgery is meant for the software developer who needs to build secure software. Cross-Site Request Forgery, or CSRF, will allow an attacker to trick a user into submitting a transaction they never intended to submit. This attack-type requires very specialized defense. We will discuss various historical CSRF attacks and investigate a wide range of defensive strategies such as nonce tokens, SameSite cookies, and the double-cookie submit pattern. SSFF is a direct attacker category meant to trick your servers into making additional requests than never intended to. Clickjacking is a way to trick users into taking actions and entering data into one site while another is collecting those events. We will be helping developers stop forgery on the web in this talk!</p> <p>Jim Manico is the founder of Manicode Security where he trains software developers on secure coding and security engineering. He is also an investor/advisor for Nucleus Security, BitDiscovery, Secure Circle and Inspectiv. Jim is a frequent speaker on secure software practices, is a member of the Java Champion community, and is the author of \"Iron-Clad Java: Building Secure Web Applications\" from Oracle Press. Jim also volunteers for the OWASP foundation as the project lead for the OWASP Application Security Verification Standard and the OWASP Cheatsheet Series. For more information, see <a href=\"https://www.linkedin.com/in/jmanico\" class=\"linkified\">https://www.linkedin.com/in/jmanico</a>.</p> <p>We look forward to seeing all of you!</p> "
    },
    {
        "group": "Boulder",
        "repo": "www-chapter-boulder",
        "name": "Join us (virtually) for Boulder/Denver OWASP's May Meeting!!!",
        "date": "2021-05-19",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Boulder/events/278027391/",
        "timezone": "US/Mountain",
        "description": "<p>Zoom info will be updated week of the event<br/>================================================================<br/>Scale Your Security by Embracing Secure Defaults &amp; Eliminating Bug Classes<br/>================================================================<br/>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time. Historically, as an industry, we’ve focused on building tools to identify vulnerabilities. While we’ve built impressive tools, these approaches have failed to address the challenges of modern engineering teams. Specifically, these tools often are too slow, require a prohibitive amount of security engineer time and domain expertise to tune, overwhelm users with false positives, and most importantly, do not ultimately raise a company’s security bar. But there’s another way. Rather than investing in finding more bugs, some modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks that enforce invariants (properties that must always hold), organizations can solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole. In this talk, we’ll present a practical step-by-step methodology for:</p> <p>Choosing what to focus your AppSec resources on</p> <p>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes</p> <p>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers</p> <p>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>================================================================<br/>Speaker: Adam Berman<br/>================================================================<br/>Adam Berman is lead product engineer for r2c. In this role, he focuses on building and scaling the semgrep application in order to make it intuitive, easy to use, and reliable. Previous to r2c, Adam led the engineering team for Meraki Insight at Cisco Meraki, using ML and AI techniques to identify and solve performance problems in networked applications. Adam holds an MS in Computer Science from the Georgia Institute of Technology and a BA in Philosophy from Dickinson College.</p> "
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "Zero Trust Cryptography for Healthcare and Industrial Control Systems",
        "date": "2021-05-28",
        "time": "19:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/278031511/",
        "timezone": "US/Eastern",
        "description": "<p>In the first of a three part series, Princeton Brooke will review his research on Zero Trust Cryptography for Healthcare and Industrial Control Systems. Princeton will also lay foundations for taking a proactive approach to securing medical and patient data that can also be adapted to SCADA supervisory for increased security posture in ICS.</p> <p>An optional YouTube live-stream link will be provided at time of meeting for attendees who are unable to join via Zoom.</p> <p>OWASP 2021 with the Cleveland Chapter - May Meeting<br/>Please join our chapter member roster by becoming a member of OWASP today at <a href=\"https://owasp.org/membership/\" class=\"linkified\">https://owasp.org/membership/</a></p> "
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Health: The Most Important Tech Tool",
        "date": "2021-05-27",
        "time": "12:00",
        "link": "https://www.meetup.com/Columbus-OWASP/events/277444023/",
        "timezone": "US/Eastern",
        "description": "<p>This needed to be rescheduled. See you next month!</p> <p>Hi everyone! We will start out with news and notes (virtually) and then talk about health and IT. Working in the tech industry often involves spending long hours sitting down, staring at a screen, consuming copious amounts of pizza and caffeine. The work is mentally demanding and can be stressful. In the rush to get everything done, it can be easy to neglect our health. But a healthy body and mind are necessary for effective performance. Based on HR training, research, and personal experience, this session provides realistic suggestions for managing your well-being at work. It covers the connection between physical and mental health, as well as how to discuss these topics with your employer. You’ll leave with a better idea of how to take care of yourself and be a happier, healthier, and more productive person.</p> <p>Bio: Cassandra Faris is passionate about the human side of technology. She is the Tech Community Manager for the Rocket Technology division of Quicken Loans. Her career has focused on supporting tech professionals through training, community outreach, open source initiatives, marketing, hiring, mentoring, and employee engagement. She is an international speaker who specializes in teaching people how to communicate, be more effective team members, and advance their careers. She is President of the Stir Scholarship for women pursuing technology degrees and President Emeritus of the DogFoodCon tech conference. She has an MBA in Organizational Leadership. When she's not busy with the tech community, she is an avid tabletop gamer, corgi lover, and soccer fan who travels as much as possible.</p> "
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Join us (virtually) for Denver/Boulder OWASP's May Meeting!!!",
        "date": "2021-05-19",
        "time": "17:30",
        "link": "https://www.meetup.com/Denver-OWASP/events/278027373/",
        "timezone": "US/Mountain",
        "description": "<p>Zoom info will be updated week of the event<br/>================================================================<br/>Scale Your Security by Embracing Secure Defaults &amp; Eliminating Bug Classes<br/>================================================================<br/>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time. Historically, as an industry, we’ve focused on building tools to identify vulnerabilities. While we’ve built impressive tools, these approaches have failed to address the challenges of modern engineering teams. Specifically, these tools often are too slow, require a prohibitive amount of security engineer time and domain expertise to tune, overwhelm users with false positives, and most importantly, do not ultimately raise a company’s security bar. But there’s another way. Rather than investing in finding more bugs, some modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks that enforce invariants (properties that must always hold), organizations can solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole. In this talk, we’ll present a practical step-by-step methodology for:</p> <p>Choosing what to focus your AppSec resources on</p> <p>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes</p> <p>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers</p> <p>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>================================================================<br/>Speaker: Adam Berman<br/>================================================================<br/>Adam Berman is lead product engineer for r2c. In this role, he focuses on building and scaling the semgrep application in order to make it intuitive, easy to use, and reliable. Previous to r2c, Adam led the engineering team for Meraki Insight at Cisco Meraki, using ML and AI techniques to identify and solve performance problems in networked applications. Adam holds an MS in Computer Science from the Georgia Institute of Technology and a BA in Philosophy from Dickinson College.</p> "
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Online meeting ",
        "date": "2021-05-10",
        "time": "18:45",
        "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/nnccjsycchbnb/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-05-24",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjrycchbgc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Managing Open Source Associated Risk",
        "date": "2021-05-27",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-OC/events/277552711/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Matthew H. Jacobs, Director, Legal Counsel at Synopsys, Inc.</p> <p>Topic: Managing Open Source Associated Risk</p> <p>Abstract:<br/>In the 1 hour session, Matt will begin with general observations about the current state of open source reuse in software development today, calling on data from recent Synopsys studies concerning how open source is used, where it is used, why, and in what amounts. Next, general observations about the most popular open source license and compliance challenges will be addressed. Specific focus will be made on the key permissive and “copyleft” licenses such as the MIT/BSD and GPL/AGPL respectively and touch on the emergence of source available licenses (MongoDB). This will include license interpretation and compliance challenges and enforcement actions.</p> <p>The conversation will then shift to open source and security. The unique challenges posed by open source will be discussed along with some ideas on how to address these challenges. We’ll also spend a few moments analyzing the security breach at Equifax and exploring how mismanaged open source components were the root cause of that breach.</p> <p>Speaker Bio:<br/>Matthew Jacobs was Vice President and General Counsel at Black Duck Software, Inc., recently acquired by Synopsys, Inc. He is now a director with the legal group at Synopsys. Organizations worldwide use Synopsys’s industry-leading products to secure and manage open source software, eliminating the pain related to security vulnerabilities, compliance and operational risk. Matt’s work at Synopsys includes managing licensing and contract negotiation and advising senior management on day-to-day legal affairs. In addition to being a frequent speaker on open source–related topics, Matt routinely advises Synopsys’s customers with respect to leading-edge open source adoption, use and compliance matters.</p> <p>Prior to joining Black Duck in 2009, Matt was with Bernstein Shur, where he counseled companies on a variety of intellectual property matters, including open source compliance. Before that, he held in-house positions with Cabletron Systems and Standex International.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/matthew-h-jacobs-jd-mba-671147/\" class=\"linkified\">https://www.linkedin.com/in/matthew-h-jacobs-jd-mba-671147/</a><br/>Blog: <a href=\"https://synopsys.com/blogs/software-security/author/matt-jacobs/\" class=\"linkified\">https://synopsys.com/blogs/software-security/author/matt-jacobs/</a></p> <p>Schedule:<br/>5:30pm: Presentation &amp; Q&amp;A<br/>6:30pm: Raffle (gift certificates sponsored by Synopsys)</p> <p>Our meeting sponsor, Synopsys, will provide 2 gift cards for $50 each to raffle at the end of the meeting, and $25 Grubhub gift certificates for meeting attendees.</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Using the Threat Modeling Manifesto to Build an Enterprise Program",
        "date": "2021-05-27",
        "time": "12:00",
        "link": "https://www.meetup.com/owasptriangle/events/pqfzhsycchbkc/",
        "timezone": "US/Eastern",
        "description": "<p>The concept of threat modeling, while not new, is more imperative today than ever before. It's a foundational part of building a security culture and uncovers potential security issues before they slip into production.</p> <p>Proactively protecting data from the app to the API requires modeling potential attacks to mitigate weak points before bad actors find them.</p> <p>A team of 15 security veterans and experts, including Chris Romeo, CEO of Security journey, created the Threat Modeling Manifesto. Chris is a veteran security expert focused on developing a security culture through training and education.</p> <p>During this session, he will discuss why a manifesto, how you can use it as a foundational piece of your threat modeling program, and practical application tips for building an Enterprise-class threat modeling program.</p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "Monthly Meeting",
        "date": "2021-05-20",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsycchbbc/",
        "timezone": "US/Pacific",
        "description": "<p>Monthly OWASP meeting</p> "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC",
        "date": "2021-05-20",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/277163169/",
        "timezone": "Europe/London",
        "description": "<p>tbc</p> "
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "ARU CSNRG, OWASP Camb & BCS Forensics “Thumbnail Images on Android/iOS Devices\"",
        "date": "2021-05-13",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/277933066/",
        "timezone": "Europe/London",
        "description": "<p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, BCS Cybercrime Forensics SG &amp; BCS Dorset/Hampshire Branches.</p> <p>Background</p> <p>OWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.</p> <p>The Cyber Security and Networking (CSN) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP &amp; the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment. These will be achieved through the investigation of threats posed to information systems and understanding the impact of attacks and creation of cyber-based warning systems which gathering threat intelligence, automate threat detection, alert users and neutralising attacks. For network security we are researching securing the next generation of software defined infrastructures from the application API and control/data plane attacks. Other key work includes Computer forensic analysis, digital evidence crime scenes and evidence visualisation as well as Cyber educational approaches such as developing Capture the Flag (CTF) resources and application security programs.</p> <p>The BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.</p> <p>Speaker Biographies &amp; Abstracts</p> <p>Kevin Mansell – Control F Ltd, Managing Director – “Thumbnail Images on Android and iOS Devices”</p> <p>Bio: Kevin Mansell – Control F Ltd, Managing Director</p> <p>Kevin Mansell has been teaching mobile forensics since phones had buttons, initially as a course manager within the Centre for National High Tech Training at Wyboston and since 2007 when he founded Control-F. Control-F delivers vendor-neutral mobile forensics and computer forensics training to law enforcement agencies, private sector organisations and academic institutions in the UK and overseas.</p> <p>Prior to teaching digital forensics Kevin cut his teeth developing software within the telecoms industry unaware that the Unix commands, SQL queries and programming skills he was learning would ever be of interest to police officers.</p> <p>Abstract : “Thumbnail Images on Android and iOS Devices”</p> <p>The recovery of thumbnail images from electronic devices is commonplace in digital forensics. We are often able to locate and recover thumbnail versions of images which existed, but have since been deleted, from a computer, mobile phone or tablet.</p> <p>In this session we will explore the possibilities of thumbnail recovery from Android devices and explain why the likelihood of such recovery has been diminished by recent versions of the operating system. We will also take time to introduce the monster which is the Photos.sqlite database on iOS and how it can shed light onto how a media file came to be present in the \"Camera Roll\" on an iOS device.</p> <p>Provisional Agenda</p> <p>18:00 - Webinar waiting lobby opens<br/>18:15 - Presentation followed by Questions and Answers<br/>19:30 - Closing, with virtual networking</p> "
    },
    {
        "group": "Norway",
        "repo": "www-chapter-norway",
        "name": "Generalforsamling + valg av ledere",
        "date": "2021-05-27",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Norway/events/277717277/",
        "timezone": "Europe/Oslo",
        "description": "<p>Dette blir ingen vanlig meetup, men et todelt møte hvor vi først har generalforsamling i OWASP Norway Chapter (org nr. [masked]). Deretter foretar vi valg av ledere og eventuelt en programkomité.</p> <p>--------------------------------------------------------------------------------------------<br/>Del 1: Generalforsamling OWASP Norway Chapter (org nr. [masked])</p> <p>Sak 1: Valg av ordstyrer<br/>Sak 2: Valg av referent<br/>Sak 3: Godkjenning av innkalling<br/>Sak 4: Sletting av OWASP Norway Chapter fra Brønnøysundregisteret<br/>Bakgrunn: OWASP Norway Chapter er i dag registrert i Brønnøysundregisteret med organisasjonsnummer[masked]. Lokale chapters skal i følge OWASP Chapter Policy [1] ikke være egne juridiske enheter. Vi ønsker derfor å slette enheten fra Brønnøysundregisteret i henhold til gjeldene vedtekter[2], vedtatt 28. april 2008. Dette vil ikke ha noen påvirking på møteaktivitet eller den daglige driften av OWASP Norway Chapter, da vi fortsetter å eksistere som før under OWASP Foundation. I henhold til vedtektene krever en oppløsning 2/3 flertall på ordinær generalforsamling.<br/>Forslag til vedtak: OWASP Norway Chapter (org nr:[masked]) oppløses i henhold til vedtektene, og slettes fra Brønnøysundregisteret</p> <p>[1] <a href=\"https://owasp.org/www-policy/operational/chapters\" class=\"linkified\">https://owasp.org/www-policy/operational/chapters</a><br/>[2] <a href=\"https://owasp.org/www-chapter-norway/assets/files/20080428_Norway_chapter_vedtekter.pdf\" class=\"linkified\">https://owasp.org/www-chapter-norway/assets/files/20080428_Norway_chapter_vedtekter.pdf</a></p> <p>--------------------------------------------------------------------------------------------<br/>Del 2: Valg av ledere til OWASP Norway Chapter</p> <p>OWASP Norway Chapter skal ha 2-5 ledere og eventuelt en egen programkomité. Dersom du ønsker å engasjere deg i OWASP Norway Chapter, så ta kontakt med [masked] på forhånd av møtet, så vi har en oversikt over hvor mange som ønsker å være med.<br/>Det er en forventning om at man har hovedansvaret for å arrangere minst én meetup per år. I praksis betyr det å skaffe dyktige foredragsholdere, finne egnet lokale og eventuelt skaffe en matsponsor til meetupen. Du vil få hjelp av mer erfarne ledere om det trengs.</p> <p>Om du ønsker å bidra, anbefales det å lese gjennom Chapter Handbook [1] og Chapters Policy [2].</p> <p>[1] <a href=\"https://owasp.org/www-policy/operational/chapter-handbook-existing.html\" class=\"linkified\">https://owasp.org/www-policy/operational/chapter-handbook-existing.html</a><br/>[2] <a href=\"https://owasp.org/www-policy/operational/chapters.html\" class=\"linkified\">https://owasp.org/www-policy/operational/chapters.html</a></p> "
    },
    {
        "group": "Cork",
        "repo": "www-chapter-cork",
        "name": "Shift Left DevSecOps Paradigm [placeholder]",
        "date": "2021-06-01",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Cork/events/277885990/",
        "timezone": "Europe/Dublin",
        "description": "<p>**** Meeting link will be added closer to the date and accessible to those who RSVP only ****</p> <p>This event will feature talks around the 'shift left' paradigm for security in project workflows.</p> "
    },
    {
        "group": "Oakland County",
        "repo": "www-chapter-oakland-county",
        "name": "OWASP Oakland County Meeting",
        "date": "2021-05-13",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Oakland-County-Chapter/events/277503002/",
        "timezone": "US/Eastern",
        "description": "<p>Speaker and topic are TBA</p> <p>5:30PM EDT- social meetup (show up when ever)<br/>7PM EDT - Talk starts</p> "
    },
    {
        "group": "Harrisburg",
        "repo": "www-chapter-harrisburg",
        "name": "OWASP Harrisburg Virtual Meetup ",
        "date": "2021-05-20",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Harrisburg-Chapter/events/278022957/",
        "timezone": "US/Eastern",
        "description": "<p>We will be having the Absolute AppSec podcasters coming to talk to us.</p> "
    },
    {
        "group": "Canberra",
        "repo": "www-chapter-canberra",
        "name": "Cyber Skill Building with Toby Amodio, CISO Australian Taxation Office",
        "date": "2021-05-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Canberra-Chapter/events/277908236/",
        "timezone": "Australia/Canberra",
        "description": "<p>Event: Online Presentation - Cyber Skill Building with Toby Amodio CISO Australian Taxation Office<br/>Proposed Date: 18th May 2021 - 6:00 pm - 7:00 pm<br/>Link: Join Zoom Meeting <a href=\"https://zoom.us/j/97094568063\" class=\"linkified\">https://zoom.us/j/97094568063</a></p> "
    },
    {
        "group": "Aligarh",
        "repo": "www-chapter-aligarh",
        "name": "Security Issues in Financial World & Handling First in OWASP Top 10 - Injection",
        "date": "2021-06-06",
        "time": "14:00",
        "link": "https://www.meetup.com/OWASP-Aligarh-Meetup-Group/events/277499602/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Security Issues in Financial World &amp; Handling First in OWASP Top 10 - Injection</p> <p>Speakers from Leading Banking Domain, Security researchers, Pen Test specialists</p> <p>Real Time demo</p> <p>OWASP Chapter Meeting</p> "
    }
]