[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "LASCON 2023 - OWASP Top-10 Training (Free)",
        "date": "2023-10-25",
        "time": "2:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/296691055",
        "timezone": "America/Chicago",
        "description": "Welcome to this beginner course on the OWASP Top 10!\n\nThis course has no technical prerequisites, it is truly meant for everyone. Whether you are a software developer, engineering manager, security/risk analyst, auditor, security professional, or simply curious on application security and looking for an introduction to the OWASP Top 10; This course is for you!\n\nIn this course you will learn a little bit about the OWASP Foundation and how you can be part of this opensource community. We are going to learn about the OWASP Top 10 risks and how they get periodically updated.\n\nFor each of the OWASP Top 10 risks, we are going to look at the key information security concepts, so that you better understand the definition of each risk. Then we are going to – together – define each risk – and we are going to do this in layman’s terms, so that you really understand each risk.\n\nWe are also going to look at the main challenges that developers and others face that cause each risk. Finally, we are going to give examples of good and bad code using pseudocode and we are going to conclude with some of the best protection practices to help you and your team avoid each risk from materializing.\n\n**Who this course is for:**\n\n* This course has no technical prerequisites, it is truly meant for everyone\n* Web application, API, and mobile developers\n* Risk managers and auditor looking to understand the OWASP Top 10 risks\n* Cybersecurity professionals looking for an introduction to the OWASP Top 10, or a refresher\n\n**Timing:**\n\n* 12:30-1pm - Check-in & arrival\n* 1pm - Session start\n* 2:45-3pm - break\n* 5pm - Session end\n\n**Please note:** Lunch is **not** provided, and you will not be able to bring food into Norris Conference Center. There are several places within walking distance where you may eat before the session."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker days:- Integrating Automated Security Checks into the CI/CD Pipeline",
        "date": "2023-10-24",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/296670889",
        "timezone": "America/Los_Angeles",
        "description": "We are thrilled to announce a Hands-on Hacker Days session, courtesy our Hosts Akto.io . We also thank them for arranging awesome food and drinks.\n\nTopic: Integrating Automated Security Checks into the CI/CD Pipeline for DevSecOps\n\nThis workshop will equip participants with the knowledge and hands-on skills to integrate Static (SAST), Dynamic (DAST) and Interactive (IAST) Application Security Testing into their GitHub DevSecOps pipelines.\n\nPre-requisites:\n\nA GitHub account.\n\nBasic understanding of application security.\n\nAttendees are required to bring their laptops with internet connectivity\n\nAgenda:\n\nIntroduction (15 minutes)\n\nThe DevSecOps paradigm and its importance.\n\nUnderstanding GitHub Actions.\n\nThe relevance of SAST and DAST in the CI/CD pipeline.\n\nOverview of GitHub Actions for CI/CD (10 minutes)\n\nBasic components: workflows, runners, actions.\n\nDemonstration: A simple CI pipeline with GitHub Actions.\n\nHands-on: Integrating SAST with GitHub Actions (20 minutes)\n\nIntroduction to Static Application Security Testing.\n\nPopular SAST tools and choosing one for demonstration.\n\nHands-on activity: a. Setting up the SAST tool on a sample GitHub repository. b. Writing a GitHub Actions workflow to automate SAST scans on every pull request or push. c. Analyzing and understanding the SAST report in the GitHub interface.\n\nHands-on: Integrating DAST and IAST with GitHub Actions (60 minutes)\n\nIntroduction to Dynamic Application Security Testing and Interactive application security testing.\n\nCommon DAST and IAST tools suitable for CI/CD integration.\n\nHands-on activity: a. Setting up a test environment (ideally a deployed version of the app). b. Configuring the DAST tool to scan the deployed application. c. Writing a GitHub Actions workflow to trigger DAST scans post-deployment. d. Analyzing and responding to DAST findings within GitHub.\n\nWhat's in it for Participants?\n\nSkill Enhancement: Mastery of integrating key security tools within the popular GitHub Actions CI/CD framework.\n\nHands-on Experience: Directly apply workshop teachings to real-world scenarios.\n\nCollaboration: Network and collaborate with peers facing similar challenges.\n\nSpeaker Bios:\n\nAnkush Jain: Ankush is the co-founder & CTO at Akto (https://www.akto.io) - The open source API Security product. Prior to starting Akto he worked at CleverTap as VP of Engineering. He has also worked for 5 years as a Quant at Morgan Stanley. He holds Bachelors in Technology from IIT Bombay. He is also a speaker at Black Hat and Defcon.\n\nAnkita Gupta: She is the co-founder and CEO of Akto.io - The open source API Security product. Prior to Akto she has experience working in VMware, LinkedIn and JP Morgan. She holds MBA from Dartmouth College and Bachelors in Technology from IIT Roorkee. She is also a speaker at Black Hat and Defcon."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "October Meetup",
        "date": "2023-10-19",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/296585044",
        "timezone": "America/Los_Angeles",
        "description": "We're thrilled to announce October month's meetup on 19th, courtesy Semgrep.\n\nGet ready for an great evening of networking, knowledge sharing and awesome food and drinks.\n\nAgenda\n\n5:00 - Check in, grab some food/drinks and network\n\n5:45 - Introductions\n\n6:00 - 6:45 -AI applied to Cybersecurity\n\n6:45 - 7:30 - Roadmap to DevSecOps Adoption with Case Studies\n\n7:30- 8:00 - IAM for the DevSecOps Engineers\n\nTalk #1:\n\nAI applied to Cybersecurity: Current applications and where we’re headed\n\nAbstract\n\nWith the rise of large language models (LLMs), there’s been an explosion of innovation in AI being applied to nearly every domain, from generating beautiful art, to summarizing huge bodies of text, automating sales outreach and customer service, performing scientific research, and more.\n\nI’ve spent hundreds of hours following how AI is being applied to cybersecurity, and in this talk, I’m going to distill the best articles, papers, and talks across cloud security, web security, AppSec, offensive security and more into one talk so you can rapidly understand the lay of the land.\n\nYou’ll leave the talk with a solid understanding of the current landscape, open problems, where things are headed, and tons of links where you can learn more and tools you can immediately start playing with.\n\nSpeaker:\n\nClint Gibler, Who is a passionate, hard-working computer security professional. He has experience working in several types of security-focused companies, from government contractors to security consulting firms and startups.\n\nKeep up with the latest and greatest in security research via Clint's free newsletter: https://tldrsec.com/\n\nTalk 2#\n\nRoadmap to DevSecOps Adoption with Case Studies\n\nBrief on traditional DevOps.\n\nThe rising need for security: Introducing DevSecOps.\n\nThe benefits of integrating security into the CI/CD pipeline.\n\nKey Principles of DevSecOps\n\nDevSecOps vs. traditional security models.\n\nThe continuous nature of DevSecOps: Continuous Integration, Continuous Delivery, Continuous Security.\n\n\"Shift Left\" philosophy: Implementing security in the early stages.\n\nAutomation: Making security checks automated and integral to the pipeline.\n\nCollaboration: Breaking silos between Dev, Ops, and Security teams.\n\nSetting up Your Toolchain\n\nIdentifying the right tools for:\n\nStatic Application Security Testing (SAST)\n\nDynamic Application Security Testing (DAST)\n\nInteractive Application Security Testing (IAST)\n\nIntegrating these tools into the CI/CD pipeline.\n\nContinuous monitoring and real-time feedback loops.\n\nBest Practices\n\nRegularly updating and patching tools and systems.\n\nCollaborative threat modeling.\n\nContinuous feedback loop: Learning from security incidents.\n\nPrioritizing security debts alongside other technical debts.\n\nMeasuring Success\n\nKey Performance Indicators (KPIs) for DevSecOps.\n\nReduced number of security incidents.\n\nFaster incident response time.\n\nNumber of vulnerabilities detected and addressed in the early stages.\n\nSpeakers:\n\nAnkush Jain: Ankush is the co-founder & CTO at Akto (https://www.akto.io) - The open source API Security product. Prior to starting Akto he worked at CleverTap as VP of Engineering. He has also worked for 5 years as a Quant at Morgan Stanley. He holds Bachelors in Technology from IIT Bombay. He is also a speaker at Black Hat and Defcon.\n\nAnkita Gupta: She is the co-founder and CEO of Akto.io - The open source API Security product. Prior to Akto she has experience working in VMware, LinkedIn and JP Morgan. She holds MBA from Dartmouth College and Bachelors in Technology from IIT Roorkee. She is also a speaker at Black Hat and Defcon.\n\nTalk 3#\n\nIAM for the DevSecOps Engineer\n\nIs moving security controls to earlier in the development cycle a good idea? The benefits are already well understood in the context of scanning and testing, but can IAM benefit from this as well? As it turns out – yes! – but not without its trade-offs. To paraphrase from Carl Sagan: If you wish to shift left with IAM from scratch, you must first invent the universe. When it comes to IAM, the DevSecOps engineer needs to make sure what they build is **functional**, **frictionless**, and **repeatable**. In this talk, we'll cover the challenges and technical details around what it means in practice to \"shift left\" for IAM. We'll look at Infrastructure as Code, GitOps, and how their rough edges can make you want to go back to clicking around in a web console. We'll dive into Terraform and how its concurrency, latency, and consistency nuances can make you yell at your CI/CD pipelines.\n\nBio: Jeff Chao is the Co-Founder & CTO at abbey.io, which is taking a unique approach to automating IAM via Terraform. Prior to starting Abbey, he led Change Data Capture at Stripe to make sure $640 Billion went to the right bank accounts. Before that, he was at Netflix trying to make the play button work with 100% uptime."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE chapter meeting (17/10/2023, Mechelen)",
        "date": "2023-10-17",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/296635015",
        "timezone": "Europe/Brussels",
        "description": "On October 17th, we organize our next OWASP Belgium chapter meeting in Lamot (Mechelen).\n\nThis event is co-located with the [CyberSecurity event \"Strategic Research and Industry Impact\"](https://cybersecurity-bites.be/cybersecurity-strategic-research-industry-impact-2nd-edition/).\n\n**Agenda**:\n\n* 17h30-19h: networking drink\n* 19h-19h10: **OWASP update**\n* 19u10-19h50: \"**Leaky Forms: A Study of Email and Password Exfiltration Before Form Submission**\" by Asuman Senol (Privacy Researcher at COSIC, KU Leuven BE)\n* 19h50-20h30: **\"Cyber breaches and how to prevent them**\" by Georges Bolssens (Principal Consultant at Toreon)\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter November 2023 Meetup",
        "date": "2023-11-08",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owaspboston/events/295661584",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person at 5:30pm or online at 6:30pm (link to be provided to attendees).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nPresentation and speaker update coming soon!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "CSRF and CORS: $num.toString() Facts and a Lie.",
        "date": "2023-10-25",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/296322658",
        "timezone": "Australia/Brisbane",
        "description": "Watch Colin’s gradual decent into insanity as he attempts to unpack all the idiosyncratic behaviours of web that lead to Cross-Site Request Forgery and Cross-Origin Resource Sharing vulnerabilities within modern Web Applications.\nDon’t know CSRF and CORS? After this talk, you’ll understand the fundamentals.\nThink you know CSRF and CORS? By the end of the talk, you’ll probably conclude that nobody \\*knows\\* CSRF and CORS."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "October Meetup",
        "date": "2023-10-17",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/295904341",
        "timezone": "Europe/London",
        "description": "We're back, on Tuesday 17th October, at Sage Bristol (near Queen Square).\n\nChris Goff will talk about \"**Secure by Design and by Default**\", and Daniel Billing has a talk on \"**Exploring Security**\".\n\n\\-\\-\\-\n\n**Secure by Design and by Default**\n\nSecure by design is not a new concept. But is it typically done well? What does it mean? To what extent should software producers be required to understand how their products could present security threats to their customers, and how should they mitigate them?\nWe’ll briefly explore this topic, have a discussion about what we think as cyber professionals and engineers, and have a brief look at how we could embed secure design thinking into our daily practices.\n\nChris has over 18 years of experience in technology careers. Having completed a web application development degree at Bournemouth, Chris has worked for various sizes of business, from a small software start up, to CIO for the UK’s largest independent foster care agency, to working for a Big 4 consulting firm as a cybersecurity consultant. Chris is a security generalist who thrives acting as the interface between security and technology teams and the wider business. He now works for Sage, a FTSE 100 software company, as part of the security leadership team. Outside of work, Chris is a husband and father of two girls, enjoys hiking, camping, wine and folk music.\n\n\\-\\-\\-\n\n**Exploring Security**\n\nSecurity is a vital aspect of software development and quality. Without it, we compromise the confidentiality of data, both corporate and personal, the integrity and the availability of our products and services.\n\nUnfortunately, it is a challenge that is not fully understood, or executed on. Software engineers and leaders need to understand the risks and threats to their customers and deliverables. Sometimes these risks are deferred to tooling, consultants and internal security teams. This is often a great way of working for some organizations, but it ignores the fact that engineers need to be able to identify, fix and communicate the security risks to their products.\n\nKey takeaways:\n\n* Understand the key security risks, threats and vulnerabilities to the services that they work on.\n* Understand that security is a whole team problem, which requires thought, planning and honest commitment to take on the challenge.\n* Begin to be able to explore security using a variety of methods, techniques and skills\n\nDan has been working in software testing and quality for over 20 years, in a variety of private and public sector organisations. Over the last 10 years or so he has discovered a passion for security testing and including and encouraging engineering teams to incorporate security processes and skills in their day to day work. Dan has also been a public speaker at a variety of tech and testing conferences across the Europe and the rest of the world. He has been passionately driving interest and skilling up of testers in the security space. Dan currently works at Microsoft Azure for Operators, since 2020. He lives in Bristol, with his family and dog Milo. He can often be found walking Milo around Hanham Common."
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "Le métier de l’auditeur informatique: Défis et Opportunités",
        "date": "2023-10-19",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/295924258",
        "timezone": "Africa/Porto-Novo",
        "description": "**Les normes et standards d’audit de la fonction informatique au sein d’une organisation: Valeurs pratiques.** Après avoir présenté l’importance des normes et standards pour l’audit de la fonction informatique au sein d’une organisation, le conférencier fera la genèse des normes et standards propres au Bénin. Il mettra l’accent sur comment les entreprises béninoises pourront s’approprier ces normes pour leur permettre d’aligner la fonction informatique\navec les besoins métiers. Quelles sont les normes et standards qui s’imposent à une entreprise béninoise? Comment s’approprier ces normes et standards? En quoi la mise en œuvre de normes et standards sont bénéfiques pour une organisation?\n\n**L’importance de l’audit dans la vie d’une organisation: Leçons apprises.**\nLe conférencier de part son expérience d’auditeur au sein des structures publiques et privées de finance présentera les leçons apprises de l’audit. Quelles leçons peut-on apprendre après plus de 10 années d’audit de structures financières? Quels sont les défis? Quelles sont les opportunités?"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP Oct Meet - In person",
        "date": "2023-10-24",
        "time": "7:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/296587433",
        "timezone": "America/Chicago",
        "description": "OWASP Dallas is ready to host in-person meets.\n\n\"**AppSec 2.0: Reimagine AppSec with Runtime Analysis**\n\nSCA tools (container and dependency scans) generate too much noise. Runtime security tools don’t understand SCA findings, and don’t come in until production. What if you could marry SCA with runtime analysis during dev, test, and prod?\n\nIn this session, Kiran Kamity, Founder and CEO of Deepfactor, will discuss how the next generation of AppSec needs to go beyond just integrating static SCA into your CI pipeline, to analyzing insecure behaviors inside running apps and correlating that back to SCA to understand which vulnerable components are actually loaded into memory and used by your application. This new approach to AppSec will detect both known vulnerabilities/CVEs with SCA scans and unknown vulnerabilities with runtime analysis. It will then prioritize known vulnerabilities with runtime correlation of SCA findings. End result: you catch most of the key risks in your app, prioritize the key items your devs need to work on without flooding them with alerts, and remove unused components from your containers to burn down your CVE debt rapidly. And achieve the true mission of AppSec…to empower engineering and security teams to create secure applications."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "CSA Colorado  Fall Summit 2023",
        "date": "2023-10-25",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/296253810",
        "timezone": "America/Denver",
        "description": "OWASP Denver wanted to help promote a great upcoming conference put on by our sister organization in Denver on October 25:\n\n**The Cloud Security Alliance (CSA) - Colorado Chapter** is holding a unique event this year\n\n**AI and Cybersecurity: Revolution and Risks**\n\nAll sessions, speakers and content are dedicated to exploring AI's impact on the future of cybersecurity.\n\nCome be part of this all-day conversation. Registration includes:- Access to all sessions\n\n\\- Breakfast\n\\- Lunch\n\\- Networking happy hour\n\\- 6 Continuing education Credits\n**\\- An \"All\\-AI Panel\"\\, where the audience will be able to interact and ask questions of AI personalities representing experts in various fields\\.**\n\nThe full agenda is available now, including information about our keynote, speakers and topics:\n\nRegister now: [https://iplanit.swoogo.com/csacofall2023/](https://iplanit.swoogo.com/csacofall2023/)"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP October Meetup - Join Us!",
        "date": "2023-10-18",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/296640341",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on October 18th for food, drinks, networking and an exciting and timely presentation on \"**Will it Blend? Questions to ask your Application Security Vendor**\". Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor:** [GitGuardian](https://www.gitguardian.com/)\n\n**Presentation Title:** Will it Blend? Questions to ask your Application Security Vendor\n\n**Presentation Details:** Marketing materials abound with claims of how a particular tool will protect us from all manner of security risks. Sometimes they are highlighting a genuine advantage of their product and sometimes they are glossing over some huge pre-conditions. At this meeting we'll talk about the technology underneath common classes of application security products and what we should and should not expect out of them. Can a particular product exceed expectations? Sure. Knowing the right questions to ask will help us find out before investing our security dollars."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Octobre 2023",
        "date": "2023-10-19",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/296429946",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **GitGuardian** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "Security Pub (SäkPub)",
        "date": "2023-11-07",
        "time": "7:30+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/296558368",
        "timezone": "Europe/Stockholm",
        "description": "**OWASP Gothenborg Chapter invites you to an evening of security and entertainment!**\n\nCome hang out, grab a beer, and play arcade games with other security minded people!\n\nWhen: Tuesday 7/11 17:30 - 21:30\nWhere: Zamenhof, Esperantoplatsen 5, 411 19 Göteborg"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup November 2023",
        "date": "2023-11-15",
        "time": "7:30+02:00",
        "link": "https://www.meetup.com/owasp-israel/events/296398470",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  happy to invite you to our upcoming Meetup!\nJoin us for another AppSec community event and enjoy food, drinks, mingling, and great talks about security.\n\nThe event will be hosted and sponsored by Bright Security!\n\n=====================================================================\n\nThe agenda will be published soon.\n\n=====================================================================\n\nThis event is sponsored by Bright Security in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Jct College Of Engineering And Technology",
        "repo": "www-chapter-jct-college-of-engineering-and-technology",
        "name": "Getting into cybersecurity ",
        "date": "2023-10-18",
        "time": "1:00+05:30",
        "link": "https://www.meetup.com/owasp-jct-college-of-engineering-and-technology/events/296735276",
        "timezone": "Asia/Kolkata",
        "description": "\"We live in a world that has walls and those walls need to be guarded by men with guns.\"\n\nGrowing an application security program is an interesting challenge; one that, with some careful planning and a bit of hard work, can achieve valuable results. Once you overcome the initial hurdle of making it somebody’s job, it can be built up step-by-step to become a valuable capability—potentially even a differentiator to your competitors.\nTopic: Getting into cybersecurity\nSpeaker: Mukesh Sethu , Security Researcher,"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Secure Coding Tournament CTF [IN-PERSON]",
        "date": "2023-10-24",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/296523070",
        "timezone": "Europe/London",
        "description": "**OWASP London Chapter** is pleased to announce the OWASP London CTF Tournament for Software Developers kindly sponsored by **Monzo** and **SecureFlag**. Discover vulnerabilities, capture flags, win real prizes!\n\nThis event is kindly hosted and sponsored by: **Monzo**\nThe CTF Tournament platform is kindly provided by: **SecureFlag**\n\n**Venue Location**: Monzo, 5 Appold St, London, EC2A 2AG\n**Nearest Tube:** Liverpool Street - 4 min walk\n**Doors open and registration**: 6:00pm (grab some food & drink and connect your laptop)\n**CTF starts**: 6:30pm (we start on time)\n**Expected CTF finish and Prize Giving Ceremony**: 8:45pm-9:00pm\n\nCTF (Capture The Flag) is a type of computer security competition. Contestants are presented with a set of challenges and puzzles which test their creativity, technical skills, vulnerability-finding skills and problem-solving ability. The challenges usually cover a number of categories of vulnerabilities in source code and when solved, each yields a “flag” which is submitted to a real-time scoring service. The difficulty levels are from beginner to advanced.\n\n**IMPORTANT**: Please **bring your own** **LAPTOP** and a **CHARGER** for it.\n\n**Top 3 scorers** will win exciting prizes generously provided by OWASP London Chapter sponsors.\n\nParticipation is FREE, but the **number of seats is strictly limited** and **registration is required** to attend.\n\n**Please remember to bring your own laptop!**\n\n**IMPORTANT**: By participating in this activity you agree to abide by the **OWASP Code of Conduct**\n\n**CODE OF CONDUCT**\nWe hope you enjoy our events, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback or would like to speak to us, we take these matters very seriously. You can find the full text of the OWASP Code of Conduct Policy here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on API Security Workshop w/ OWASP API Security Top 10",
        "date": "2023-10-27",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/296440656",
        "timezone": "America/Los_Angeles",
        "description": "**Hands on API Security Workshop: Integrating API Security Checks into the CI/CD Pipeline**\n\nHello AppSec teams and tech enthusiasts! We're thrilled to roll out an exceptional DevSecOps workshop in collaboration with OWASP LA and offered by [Akto](https://akto.io). This workshop will equip participants with the knowledge and hands-on skills to integrate API Security Testing into their GitHub DevSecOps pipelines, using [OWASP API Security Top 10](https://owasp.org/API-Security/).\n\n## **Pre-requisites:**\n\n· A GitHub account.\n· Basic understanding of application security.\n· Attendees are required to bring their laptops with internet connectivity\n\n## **Agenda:**\n\n### Introduction (15 minutes)\n\n1. The DevSecOps paradigm and its importance.\n2. Understanding GitHub Actions.\n3. The relevance of API Security testing in the CI/CD pipeline.\n\n### Overview of GitHub Actions for CI/CD (10 minutes)\n\n1. Basic components: workflows, runners, actions.\n2. Demonstration: A simple CI pipeline with GitHub Actions.\n\n### Hands-on: Integrating API Security testing with GitHub Actions (60 minutes)\n\n1. Introduction to API Security Testing.\n2. Overview of OWASP Top 10 for API Security\n3. Hands-on activity:\n4. a) Setting up a test environment (ideally a deployed version of the app)\nb) Configuring the API Security tool to scan the deployed application\nc) Writing a GitHub Actions workflow to trigger API Security scans post-deployment\nd) Analyzing and responding to API Security findings within GitHub\n\n## **What's in it for Participants?**\n\n1. **Skill Enhancement:** Mastery of integrating API Security checks within the popular GitHub Actions CI/CD framework.\n2. **Hands-on Experience:** Directly apply workshop teachings to real-world scenarios.\n3. **Collaboration:** Network and collaborate with peers facing similar challenges.\n\n**Food and drinks** will be provided and there's a free 90 minute **parking** available across the street.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - OCT 25, 2023",
        "date": "2023-10-25",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294467794",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: How Can DevSecOps Improve Security?\n\nJoin us for dinner, drinks, networking and a great talk by **Mary Wang**, Software Engineering Manager at Northrop Grumman Space Systems\n\n**NOTE**: New Location!! \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n**ABSTRACT**: DevSecOps is the new buzzword that has been around for a while now. DevOps, DevSecOps, Agile, CI/CD pipeline, etc., and chances are you have heard these terms when discussing the software development life cycle. What do those terms mean? With the recent increasing cyber-attacks on software such as in-house developed code or software supply chain (open source software), the traditional ways of decreasing the attack surface on software applications no longer work effectively. Moreover, organizations are pressured to develop code faster and cheaper to meet customer demands. Mary will explain what DevSecOps is and how this practice is better than DevOps in security. In addition, how CI/CD fits in DevSecOps. Lastly, the popular tools are used in DevSecOps practices. She will provide the real-world experience challenges that she encountered.\n\n**Thanks to our Sponsor**: *[SAFEBASE](https://safebase.io/)*\n*SafeBase is the customer-facing Trust Center that automates B2B security reviews. Companies like LinkedIn, Asana, OpenAI, and Snyk use SafeBase to reduce security questionnaires, create a better buying experience, accelerate sales velocity, and position security as a revenue driver.*\n\n**SPONSORSHIP Opportunities Available** *Vendors interested in sponsoring please send an email to* *sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Madison",
        "repo": "www-chapter-madison",
        "name": "October Meeting",
        "date": "2023-10-24",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-madison/events/296510809",
        "timezone": "America/Chicago",
        "description": "https://guidedconversations.org/\n\nDiscussion Topics\n\n1. [LLM Top 10](https://www.llmtop10.com/)\n2. “The Bogus CVE Problem”: [https://lwn.net/Articles/944209/](https://lwn.net/Articles/944209/)\n3. (your topic here)\n\nTool Spotlights\n\n1. [Checkmarx KICS](https://docs.kics.io/)\n2. https://github.com/guacsec/guac"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Cybersecurity of Critical SAP Apps at Rising Tide Brewery",
        "date": "2023-10-26",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/296600794",
        "timezone": "America/New_York",
        "description": "**OWASP Maine: Addressing Cybersecurity on Business Critical SAP Applications**\n\nApplication and software security are so vitally important in all aspects of the business especially with every company becoming a software company as they navigate through digital transformations.\n\nWith that being said ERP systems are some of **THE MOST** critical applications within enterprises today and come with their own unique set of security challenges.\n\nThe fine folks at Onapsis who 100% specialize in SAP and ERP application security will be on site to dive deep into these specific challenges. They will also review real world attacks on SAP ERP environments and discuss the best in class strategies and measures you can do to mitigate the risk of exploitation of your ERP environments.\n\nAnyone who is involved in SAP ERP environments from both a software development and security perspective would gain a tremendous amount of knowledge attending this meetup.\n\n\\*Food and drinks will be provided by Onapsis\n\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "(Hybrid) Gamifying Tabletop Exercises",
        "date": "2023-10-24",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/296499717",
        "timezone": "America/Chicago",
        "description": "**Andrew Carlson -- Gamifying Tabletop Exercises**\n\nHave you wondered whether there is a fun way to examine how prepared teams are for an incident?\n\nAndrew will give an overview of a game he developed and uses to do tabletop exercises for incident response at his company. He will walk through the set up of the game and walk attendees through a round of the game.\n\nThe game doesn't require deep security knowledge from the teams going through the exercise.\n\nHors d'oeuvres will be available.\n\nAgenda:\n6:00 - Socializing/connecting\n6:10 - OWASP announcements\n6:15 - Presentation\nThere will be time for socializing after the presentation/game as well.\n\nIf needed, the code for the on-line portion will be 972403."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "October 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-10-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/296179697",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Radboud University, Huygens building\n**Address:** Heyendaalseweg 135, Nijmegen\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Hacking CI/CD pipelines: a few considerations when attacking a CI/CD orchestrator** by **Mauricio Cano**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Unveiling the secrets in your code: Detecting and Triaging exposed credentials at scale** by **Ingmar Vis**\n\n**Hacking CI/CD Pipelines: Some use cases for hacking CI/CD orchestrators**\n*Abstract:*\nIn this talk, we will discuss the hacking of CI/CD orchestrators, with a focus on GitHub actions and what kind of things can be done from the perspective of a malicious insider. Some of the cases we will discuss are:\n\\- Secret enumeration\\.\n\\- Accessing infrastructure through runners\\.\n\\- Public runners vs Private runners\\.\n\\- Code injection in the pipeline and supply chain\\.\n\\- GitHub commits information\\.\n\\- Secret searching in the repository\\.\nThe goal is to provide a broad view on the attack surface that can be derived from CI/CD orchestrators and their runners, as well as to show a few demos on how this can be done.\n\n*Bio:*\nMauricio Cano is a cloud pentester focused on container technologies. In particular, he focuses on the security of containers and serverless architectures. He has pentested Kubernetes clusters and serverless architectures for several multinational financial institutions. Prior to his security work, he has a background in academia and a Ph.D. in Computer Science from the University of Groningen, focused on programming language design and formal methods to ensure correctness. In his spare time, Cano enjoys reading, cooking, and solving puzzles.\n\n**Unveiling the secrets in your code: Detecting and Triaging exposed credentials at scale**\n*Abstract:*\nSecurity misconfigurations are often easy to exploit but also easy to avoid. How can we raise security awareness and at the same time prevent security misconfigurations (such as leaked credentials) from reaching production? Is there an easy way to scan, triage and follow-up on exposed secrets at enterprise scale? ABN Amro open sourced Repository Scanner and runs Repository Scanner internally at scale, exposing secrets in source code repositories and thereby raising security awareness while at the same time improving the security posture by remediating security misconfigurations.\n\n*Bio:*\nIngmar Vis has been working in CICD for 7 years. In his current role, Ingmar acts as a Product Owner for 2 teams at ABN Amro. 1 team is responsible for delivering the Secure Coding capability for all developers, the 2nd team is responsible for the infrastructure and automation of CICD tooling. Ingmar works on aspects such as Static Analysis, Software Composition Analysis, Container Security, and Secret Detection."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Training Day - Dunedin",
        "date": "2023-11-11",
        "time": "8:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/296507998",
        "timezone": "Pacific/Auckland",
        "description": "We're pleased to announce that we'll be holding an OWASP Training Day event in Dunedin, on Saturday, 11th November.\n\nClasses will run 8:45 a.m. - 5:30 p.m. Tea breaks and lunch will be provided.\n\nRegistration Fee: $99 per attendee (plus GST and booking fees)\n\nWe're in the process of confirming our classes and trainers, so we'll update this description with registration information as soon as those are confirmed."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Global AppSec - DC",
        "date": "2023-10-30",
        "time": "0:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721118",
        "timezone": "Pacific/Auckland",
        "description": "**Global AppSec DC returns October 30 - November 3!**\n\nDesigned for private- and public-sector InfoSec professionals, the two-day OWASP conferences equip developers, defenders, and advocates to build a more secure web.\nWe are offering educational 1-day, 2-day, and 3-day training courses immediately following the conference.\n\n**Conference dates:** Monday and Tuesday, October 30-31\n**Training dates:** Wednesday to Friday, November 1-3.\n\nJoin us for leading application security technologies, speakers, prospects, and community, in a unique event that will build on everything you already know to expect from an OWASP Global Conference.\n\nConference Site: [https://dc.globalappsec.org/](https://dc.globalappsec.org/)\nRegistration: [EventBrite](https://www.eventbrite.com/e/owasp-global-appsec-washington-dc-2023-tickets-519195877847)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Hands-on API Security Workshop with OWASP JuiceShop and other vulnerable apps",
        "date": "2023-10-26",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/296608425",
        "timezone": "America/Los_Angeles",
        "description": "Step into the world of API Security with our immersive two-hour hands-on training event at the OWASP meetup!\n\nWe’re excited to announce this opportunity for appsec teams to enhance their skills in API Security and writing business logic tests. We will have a hands-on workshop focused on creating and running business logic tests using Akto. You will learn to write ten different business logic tests, which will then be executed against Juice Shop and other vulnerable apps. The goal of the workshop is to give a hands-on experience in writing and automating custom API security tests related to authentication, authorization and access control issues. The workshop aims to be interactive, engaging, and an enriching learning experience. You will learn the fundamentals of writing, automating, and executing business logic tests. By the end of this training, participants will be able to automate 10 business logic tests, a key skill in the realm of API security.\n\n**What to Expect?**\n\n* By the end of the workshop participants will be able to write 10 business logic tests focused on authentication, authorization and access control issues.\n* Networking opportunity with fellow security professional.\n* Ask absolutely any questions about securing APIs\n\n**Requirements:**\n\n* Attendees are required to bring their laptops with internet connectivity\n\n**Note**\nParticipants are encouraged to bring their own API projects or sample APIs they are trying to test to receive personalized guidance and recommendations during the workshop. We will help everyone write their own custom tests during the workshop itself so you can test your own APIs. If not, we will be using Juiceshop or other vulnerable apps for demo purposes."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa October 18th 2023: Digital Self Defence-The AI Edition",
        "date": "2023-10-18",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/296581063",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 464 **(Note Room Change)**\n\n**Health Notice:**\n\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=_Mq_HH7PASg\n\n**6:00 PM EDT** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EDT** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **Digital Self Defense: The AI Edition**\n\n**Abstract:**\n\nWith the arrival of AI advances like ChatGPT-4, a heady mixture of doomsday / euphoria talk about AI overtaking humanity has dominated the conversation, with some warning of human extinction risk. Yet we are from from artificial general intelligence. In many cases AI falls laughably short of its promises. Yet overblown claims of AI capability distract us from the real-world harms caused by poorly designed AI being deployed today that either doesn’t work as advertised or that was designed without regard to the harms they can cause. Meanwhile, it also hides the successful AI use cases and the potential for real benefit when used responsibly. In this talk Abigail will dispel AI myths, highlight real-world benefits and harms with AI that exists today, and show how AI privacy can help protect us, and society, from these harms while building better AI. No, this will not be a talk on how to tame your AI overlord. This is Digital Self-Defense: the AI (Privacy) Edition.\n\n**Speaker Bio:**\n\nAbigail Dubiniecki is a lawyer, speaker, writer and educator specialising in privacy. She is passionate about Privacy by Design (PbD), privtech, Data Justice and Indigenous Data Sovereignty, especially in emerging tech and high-risk areas such as biotech, AI, IoT and adtech. As an independent consultant she helps clients of all sizes across a range of industries navigate and implement complex privacy and data protection regimes like GDPR and Quebec’s Law 25 (Bill 64), with a focus on PbD and human-centred design. She has guest lectured at Henley Business School in the UK, OttawaU and U of T’s School of Continuing Education. She’s a Correspondent for Privacy Laws & Business International Report and a Forbes.com Contributor."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter 3: Cyber Peterborough MeetUp",
        "date": "2023-11-01",
        "time": "9:30Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/295240302",
        "timezone": "Europe/London",
        "description": "**We're evolving!**\n\nListening to our member feedback, we've moved towards '**Cyber Peterborough**', have a new lick of paint and are still focussing on all things cyber security.\n\n**'Powered by OWASP'** means we still practice, share and discuss content amongst peers in our global network, now with a local feel closer to our community.\n\n**Making Cyber Security Accessible.**\n\nCyber Peterborough is for everyone. Come along, bring a friend, share with your colleagues. You don't need to be a security professional, each session will break down topics to ensure everybody can take something away.\n\n**Agenda**\n\n1. **Ben Mackereth** \\| A working title of a mysterious nature\n2. **Speaker TBC**\n3. **Sign up to Cyber Peterborough's first ever Capture the Flag!** Suitable for all experiences and abilities, join us over food and drink and learn whilst doing in our CTF event.\n\n**When is it?**\n\n* Wednesday 1st November\n* **Start** from 7:30PM\n* **Finish** around 11:00PM\n\n**Where is it?**\n\n* The Brewery Tap, Peterborough\n\n**How can you get involved?**\n\n* Respond \"I'm Coming!\" to this group\n\nWe look forward to seeing you!"
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "OWASP Incubator Project Spotlight: Penetration Testing Toolkit (PTK)",
        "date": "2023-10-19",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/296567036",
        "timezone": "America/Los_Angeles",
        "description": "Join us at an exclusive industry event as we spotlight the OWASP Incubator Project - Penetration Testing Toolkit (PTK), which has garnered over 20,000 downloads. We'll explore the advantages of browser-based penetration testing with the tool's author, Denis Podgurskiy. Join us for an enlightening session and discover how PTK and PTK+ are transforming the world of penetration testing.\n\nThis meeting of OWASP’s Portland chapter is sponsored by True Positives, LLC., a leading AppSec-focused ally and solutions provider in our region.\n\nDoors open at 5:30 and the presentation will begin about 6pm.\n\nPlease RSVP here on Meetup if you intend to come."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Cybersecurity of Critical SAP Apps at Rising Tide Brewery",
        "date": "2023-10-26",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/296600794",
        "timezone": "America/New_York",
        "description": "**OWASP Maine: Addressing Cybersecurity on Business Critical SAP Applications**\n\nApplication and software security are so vitally important in all aspects of the business especially with every company becoming a software company as they navigate through digital transformations.\n\nWith that being said ERP systems are some of **THE MOST** critical applications within enterprises today and come with their own unique set of security challenges.\n\nThe fine folks at Onapsis who 100% specialize in SAP and ERP application security will be on site to dive deep into these specific challenges. They will also review real world attacks on SAP ERP environments and discuss the best in class strategies and measures you can do to mitigate the risk of exploitation of your ERP environments.\n\nAnyone who is involved in SAP ERP environments from both a software development and security perspective would gain a tremendous amount of knowledge attending this meetup.\n\n\\*Food and drinks will be provided by Onapsis\n\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-11-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296626035",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #23: Secure Coding Tournament [IN-PERSON]",
        "date": "2023-10-26",
        "time": "8:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/296120016",
        "timezone": "Europe/Bucharest",
        "description": "## Details\n\nThe next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\nTheme sessions - Theme: Secure Coding Tournament\n\n\\`Schedule\\` **\\`Time:\\`**\\` 18:00 to 21:00\\`\n\n18:00 - 18:20 - Welcome participants - Lucian Patian (Haufe)\n18:20 - 18:30 - Introduction, OWASP News & Updates - Catalin Curelaru\nSecure code\n18:30 - 19:45 - Secure Coding Tournament\n19:45 - 20:00 - Prizes\n\nLocation of the event: UBC0, et 15, Sediu Haufe.Group, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by **Haufe**.Group & **Secure Code Warrior**\n\nMore about the event:\n[Secure Code Warrior](https://www.securecodewarrior.com/) brings you a defensive security-based tournament from a developer's perspective. *The tournament allows you to test your skill in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability.*\n\n*You don’t need extensive programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but is also secure.*\n\nYou can find the tournament step-by-step guide here: [https://youtu.be/o8XhKK_eOOs](https://youtu.be/o8XhKK_eOOs)\n\nThe tournament is hosted physically by **Haufe**.Group and you can join through your laptop. The tournament it should take only a 1.5 hours, drop-in as you see fit during the duration of the event to complete all the challenges and win prizes!"
    },
    {
        "group": "Tiruvallur",
        "repo": "www-chapter-tiruvallur",
        "name": "Null and OWASP combined meetup",
        "date": "2023-10-28",
        "time": "4:30+05:30",
        "link": "https://www.meetup.com/tiruvallur-owasp-meetup-group/events/296618490",
        "timezone": "Asia/Kolkata",
        "description": "* Hacking Companies on Mails - Deep Dive into Email Security by **Sriram**\n* AI and ML in CyberSecurity by **PradeepKumar P**\n* You can be a Human Decompiler by **Ravi Rajput**\n* Cloud Security 101 by **Chandresh Gupta**"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Drink Your Own Champagne: How to Threat Model Your Threat Modeling Program",
        "date": "2023-11-15",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasptriangle/events/296265774",
        "timezone": "America/New_York",
        "description": "We threat model our technology to ensure strong, resilient designs. As a critical control, our practice of threat modeling demands the same rigor. Learn to drink your own champagne by threat modeling your program's weaknesses to design better strategies and unlock more business value from your threat models."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup: Developer mode",
        "date": "2023-10-24",
        "time": "8:30-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/296685550",
        "timezone": "America/Montevideo",
        "description": "¿Te interesa una práctica de ciberseguridad pensada **exclusivamente para desarrolladores**?\n\nEn esta Meetup, utilizando el proyecto [OWASP Secure Coding Dojo](https://owasp.org/www-project-secure-coding-dojo/) tendremos una sesión de ejercicios que incluyen **revisión de código** y **detección de vulnerabilidades**. Los desafíos son guiados y se cuenta con el apoyo de expertos en seguridad de aplicaciones.\n\nSolo precisas **llevar una notebook** para participar, sin descarga de materiales o herramientas. Solo se utilizará un navegador.\n\nEn esta instancia la Meetup será en las oficinas de Geocom (Dionisio Oribe 3071).\n\n**IMPORTANTE**: *Las medidas de seguridad del host requieren que los asistentes provean de antemano **nombre** y **documento de identidad**. Al ingresar a las oficinas además se pedirá el **número de teléfono**. Estos datos se pedirán a los asistentes confirmados **el día previo al evento**. Dejamos a criterio de los asistentes si quieren ofrecer tal información o desistir de atender. **Habrá lista de espera** para incluir a quienes en esta instancia no entren en el cupo.*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Rating API Business Risks based on OWASP Top-10 API Security Vulnerabilities",
        "date": "2023-10-19",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248518",
        "timezone": "America/Vancouver",
        "description": "Web APIs are a common glue that connect people and processes with digital systems all across the globe. Not surprisingly, Web APIs contribute more than 80% of the Internet traffic today. Given the importance of APIs, OWASP has recommended top-10 API specific security vulnerabilities (such as Broken Authentication/Authorization and Excessive Data Exposure problems) that organizations must address to strengthen their security posture. Albeit useful, these API specific vulnerabilities do not necessarily translate to the same business risks. For instance, two APIs from an organization with Broken Object Level Authorization (BOLA) may pose very different business risks to that organization.\n\nIn this session, we'll talk about API Risk Rating System (ARRS) that maps API specific vulnerabilities to business risks such as Legal/Contractual, Operational, Financial, Reputational and Regulatory. Similar in-principle yet different than Common Vulnerability Scoring System (CVSS), the main objective of ARRS is to prioritize API specific vulnerabilities based on their business risks. We'll describe the methodology behind the system developed using thousands of APIs that are being tracked at a global scale. We’ll also share some hands-on practical scenarios.\n\nThe work presented was done by Samantha Sanchez, Jun Hee Lee, Alberto Ciconi and Baljeet Malhotra. Samantha, Jun Hee and Alberto are MSc Cybersecurity students at NYIT. Baljeet is an Adjunct Professor at NYIT, UBC, UVic, UNBC, and CEO of TeejLab Inc."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-11-08",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889868",
        "timezone": "America/New_York",
        "description": "Welcome to our monthly SAMM community call Wednesday 8th November, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EST.\n\nJoin Zoom Meeting: [Zoom link](https://zoom.us/j/96866048960?pwd=TmZkTSs3ZmlWU09DbHJoSnVZWmdiUT09)."
    }
]