[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - November",
        "date": "2021-11-23",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Aarhus-Chapter/events/281947916/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>OWASP Aarhus, Denmark is always greatly honored to welcome both experienced presenters as well as new ones! But they do not get more experienced than these two!</p> <p>In my career path in IT security a handful of people stands out as having had the biggest influence and impact. Two of these are Richard Campbell (<a href=\"https://www.linkedin.com/in/richjcampbell/\" class=\"linkified\">https://www.linkedin.com/in/richjcampbell/</a>) and Paula Januszkiewicz (<a href=\"https://www.linkedin.com/in/paulajanuszkiewicz/\" class=\"linkified\">https://www.linkedin.com/in/paulajanuszkiewicz/</a>) and it is therefore a bit of a dream come true that we got them to speak at our meetup – And at the same meetup!</p> <p>Richard is probably best known from RunAsRadio (<a href=\"https://runasradio.com\" class=\"linkified\">https://runasradio.com</a>) and DotNetRocks (<a href=\"https://www.dotnetrocks.com/\" class=\"linkified\">https://www.dotnetrocks.com/</a>) and there have been days in my career where I have found myself talking more back at his podcast then I have talked with my wife that day!</p> <p>Paula is the founder and CEO of CQURE and has been giving presentations on security longer than I can remember. I try to listen/watch as many of them as possible because I always learn something and I am always entertained when she talks! And as she writes on her CV “She has access to the source code of Windows”</p> <p>Mark this time and come join us!</p> <p>This event is purely virtual but feel free to meetup in groups and it will be updated with more information about the presentations later. It will be held in English</p> <p>The meetup will not be recorded.</p> <p>I will update this page with more information very shortly!</p> "
    },
    {
        "group": "Bellingham",
        "repo": "www-chapter-bellingham",
        "name": "Virtual OWASP Bellingham first meeting",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/owasp-bellingham-chapter/events/281383573/",
        "timezone": "US/Pacific",
        "description": "<p>Hello folks,</p> <p>Please join us on November 18th at 6 PM for the inaugural meetup of Bellingham's brand new OWASP chapter. We'll talk about our plans for the Bellingham chapter as well as go over some upcoming events in the region and if you're working on something cool and would like to share we'd love to hear about it!</p> <p>Thank you and we'll see you soon.</p> "
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston November 2021 Meetup - Virtual Attendance",
        "date": "2021-11-11",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspboston/events/281596072/",
        "timezone": "US/Eastern",
        "description": "<p>After a brief break for everyone to enjoy the end of summer OWASP Boston is back! We will be returning this month with our first ever hybrid meeting. We have reserved space in the Seaport at District Hall to accommodate up to 30 participants.</p> <p>Masks &amp; vaccinations will be required for the in-person event. Please only reserve your seat in person if you can make it.</p> <p>Here are the links to both events:<br/>In-person - <a href=\"https://www.meetup.com/owaspboston/events/281675417/\" class=\"linkified\">https://www.meetup.com/owaspboston/events/281675417/</a><br/>Virtual - <a href=\"https://www.meetup.com/owaspboston/events/281596072\" class=\"linkified\">https://www.meetup.com/owaspboston/events/281596072</a></p> <p>During this month’s meetup we will have some time set aside for networking, news from OWASP and other areas of AppSec, and a presentation by Jeremiah Salamon about the OWASP Top 10. The OWASP Top 10 presentation will cover the team that leads the generation of the top 10, the process that they use, and the adjustments made to the 2021 list.</p> <p>We hope to see you all there, virtually or in-person!</p> "
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston November 2021 Meetup - In Person",
        "date": "2021-11-11",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspboston/events/281675417/",
        "timezone": "US/Eastern",
        "description": "<p>After a brief break for everyone to enjoy the end of summer OWASP Boston is back! We will be returning this month with our first ever hybrid meeting. We have reserved space in the Seaport at District Hall to accommodate up to 30 participants.</p> <p>Masks &amp; vaccinations will be required for the in-person event. Please only reserve your seat in person if you can make it.</p> <p>Here are the links to both events:<br/>In-person - <a href=\"https://www.meetup.com/owaspboston/events/281675417/\" class=\"linkified\">https://www.meetup.com/owaspboston/events/281675417/</a><br/>Virtual - <a href=\"https://www.meetup.com/owaspboston/events/281596072\" class=\"linkified\">https://www.meetup.com/owaspboston/events/281596072</a></p> <p>During this month’s meetup we will have some time set aside for networking, news from OWASP and other areas of AppSec, and a presentation by Jeremiah Salamon about the OWASP Top 10. The OWASP Top 10 presentation will cover the team that leads the generation of the top 10, the process that they use, and the adjustments made to the 2021 list.</p> <p>We hope to see you all there, virtually or in-person!</p> "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC",
        "date": "2021-12-08",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/281869377/",
        "timezone": "Europe/London",
        "description": "<p>We are looking to publish on @YouTube the recordings of our meetups. If you would like to be notified when we a new video is published, please feel free to subscribe on our channel at:<br/><a href=\"https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ\" class=\"embedded\">https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ</a></p> "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP CTF 2021 (Virtual event)",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/279155585/",
        "timezone": "Europe/London",
        "description": "<p>New virtual event - OWASP CTF 2021, led by OWASP Dorset Chapter and in collaboration with OWASP Diversity and Inclusion Committee and UK Chapters: Bristol, Cambridge, London, Newcastle, Reading, Suffolk.</p> <p>The CTF will be hosted by Security Innovation and be instructor lead. It combines with Security Innovation's CMD+Ctrl Bootcamp and they are extending an offer to all participants for 4-weeks FREE access to the self-paced training courses.</p> <p>Although the event is online, as this is a live participatory event it will not be recorded.</p> <p>Event registration link will be shared nearer to the time.</p> "
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "OWASP (UK Chapters) CTF Competition 2021 ",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/281899521/",
        "timezone": "Europe/London",
        "description": "<p>OWASP Dorset Chapter is proud to present our CTF event for 2021 in collaboration with OWASP Diversity and Inclusion Committee and many OWASP UK Chapters (including; Bristol, Cambridge, London, Newcastle, Reading, Suffolk).</p> <p>The CTF will be hosted by Security Innovation and be instructor lead. It combines with Security Innovation's CMD+Ctrl Bootcamp and they are extending an offer to all participants for 4-weeks FREE access to the self-paced training courses.</p> <p>Although the event is online, as this is a live participatory event it will not be recorded.</p> <p>Event registration link will be shared nearer to the time</p> "
    },
    {
        "group": "Canberra",
        "repo": "www-chapter-canberra",
        "name": "Avoid IaC misconfigurations across the different platforms",
        "date": "2021-11-17",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Canberra-Chapter/events/281946376/",
        "timezone": "Australia/Canberra",
        "description": "<p>Infrastructure as Code (IaC) makes deploying cloud or container configurations scalable and faster. If you are launching a microservice into a Kubernetes cluster, or even building an entire AWS virtual infrastructure, IaC can automate the deployment. By building repeatable templates you can also ensure that deployments happen exactly as you design, every time. However, errors in infrastructure configuration are now regarded as the second biggest cause of data breaches. There are many ways to give adversaries an advantage through security misconfigurations. Overly permissive storage volumes, unauthenticated database access, or ports left open to the internet have all been a cause of compromise. The solution? Treat your infrastructure code the same as your application code. During your build process, use tools to scan for infrastructure misconfigurations. When you find them raise alerts or even break the build. </p> <p>In this session, we will discuss common types of IaC misconfigurations, and demonstrate a free, open-source security tool that developers can build into their pipelines to help protect infrastructure from compromise.</p> <p>About Speaker - Ori Bendet<br/>An experienced product leader combining strong technical and marketing skills, Ori has been leading Checkmarx's flagship product, CxSAST (Static Application Security Testing), a Gartner and Forrester market-leading solution, serving thousands of customers worldwide for the last 2 years. Prior to Checkmarx, he was in Time To Know, HPE, PicApp and Bezeq in various product and engineering positions.</p> <p>Please join us for this great session with Ori Bendet,<br/>Regards<br/>Akshay Gupta, OWASP Leader , Canberra Chapter<br/>Toby Amodio, OWASP Leader, Canberra Chapter</p> "
    },
    {
        "group": "Czech Republic",
        "repo": "www-chapter-czech-republic",
        "name": "OWASP Czech Chapter Meeting",
        "date": "2021-11-25",
        "time": "09:00",
        "link": "https://www.meetup.com/owasp-czech-republic-meetup-group/events/281716573/",
        "timezone": "Europe/Prague",
        "description": "<p>Dear OWASP fellows,<br/>It’s our pleasure to inform you that the next local chapter meeting will be held on November 25th 2021 at NN IT HUB, Karla Engliše 6/3201, Praha 5-Smíchov.</p> <p>This time we prepared for you  a full day event. You can enjoy workshop during the morning and interesting talks during the afternoon together with the CTF. The admission is as usual free of charge.</p> <p>Schedule<br/>Morning workshop<br/>9:00 - 12:00 Jan Kopecký: Fuzzing workshop<br/>9:00 - 12:00 CTF led by TunaSec.cz</p> <p>Talks<br/>12:00 - 12:15 Opening ceremony with OWASP chapter leaders and announcing winners of the CTF<br/>12:15 - 13:00 LUNCH TIME!<br/>13:00 - 13:45 Václav Chlad: I'm you: Caller ID spoofing<br/>14:00 - 14:45 Filip Holec: Hacking 101<br/>15:00 - 15:45 Ondřej Bouček: Should I Trust? Exploring New Approaches to Detecting Computational Propaganda<br/>16:00 - 16:45 Kamil Vávra: WordPress Supply Chain Attack<br/>17:00 - 17:45 Marek Jílek: Hey Google, give me tons of public calendars! (how I become #1 on H1 in CZ)<br/>17:45 - .......... Closing ceremony and networking</p> <p>Information about the trainer, workshop and CTF</p> <p>The registration for the talks or workshop is possible ONLY by Eventbrite - <a href=\"https://www.eventbrite.com/e/199371514567/\" class=\"linkified\">https://www.eventbrite.com/e/199371514567/</a></p> <p>Additional information</p> <p>If using public transportation you can go to the metro station Anděl and walk 5 minutes. For cars there are paid parking lots in the street Kováků or you can park in the OC Nový Smíchov.</p> <p>NN IT HUB is in the Anděl Park office building, there will be someone to guide you at the main entry. There will be signs showing you way to the conference hall and the lecture room for workshop.</p> <p>For the workshop, please come at least 10 minutes ahead of time, otherwise it can happen that your seat is taken by somebody on the waiting list.</p> <p>We have to follow current COVID rules - please check your email a few days before the event, we will inform you about current conditions.</p> <p>There will be some snacks and soft drinks prepared for you during the event and of course the lunch! :)</p> <p>Unless stated otherwise, talks will be in English and the recordings will be available online ( with speakers' permission) after the convention</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP November Meeting",
        "date": "2021-11-09",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/280769873/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>What is an SBOM, why do I care, and how does my organization get started?</p> <p>Description:</p> <p>It’s nice to know what’s in the food on the shelf at the store so you can make an informed decision whether you should buy it. And when there are recalls of certain ingredients it’s nice to quickly know whether those ingredients are already in your cupboard. Software Bills of Materials enable you to know what’s in the software you consider procuring, and let you quickly know what’s already inside your organization. Of course, you can even use them to understand the risk in the portfolio of software your organization baked itself! Since the May Executive Order on Improving the Nation’s Cybersecurity SBOMs have gotten a lot more attention, but what does it really mean for an organization to make the most of this capability? This talk will help you prepare your organization for the near future when generating, evaluating, and leveraging SBOMs will be expected.</p> <p>Bio:</p> <p>Greg Mohler is a Manager within KPMG's Cyber Defense practice, and has spent the past four years helping over 20 clients solve difficult problems related to DevSecOps, Application Security, and Vulnerability Management. He is passionate about minimizing the distraction of security incidents so that businesses can focus on innovation, growth, and speed to market. Greg has led the delivery of services that not only uplift clients' technical capabilities, but also bolster security education &amp; culture.</p> <p>Caleb Queern is a Director in KPMG's Cyber practice and is based in Austin. He has more than 15 years of technology and information security experience. His focus is reducing risk and improving performance so organizations can meet business goals and enable growth. Caleb has lead engagements in technology companies, pharmaceutical companies, higher education, financial services, manufacturing, and others. His specialties include secure DevOps and application security, security operations, and operational excellence.</p> "
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Dorset CTF 2021 - online",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Dorset-Chapter/events/281718178/",
        "timezone": "Europe/London",
        "description": "<p>OWASP Dorset Chapter is proud to present our CTF event for 2021 in collaboration with OWASP Diversity and Inclusion Committee and many OWASP UK Chapters (including; Bristol, Cambridge, London, Newcastle, Reading, Suffolk).</p> <p>The CTF will be hosted by Security Innovation and be instructor lead. It combines with Security Innovation's CMD+Ctrl Bootcamp and they are extending an offer to all participants for 4-weeks FREE access to the self-paced training courses.</p> <p>Although the event is online, as this is a live participatory event it will not be recorded.</p> <p>Event registration link will be shared nearer to the time</p> "
    },
    {
        "group": "Erode",
        "repo": "www-chapter-erode",
        "name": "JVM Reverse Engineering Introduction ",
        "date": "2021-11-27",
        "time": "19:00",
        "link": "https://www.meetup.com/owasp-erode/events/281962663/",
        "timezone": "Asia/Calcutta",
        "description": "<p>OWASP Erode's November Session on JVM Reverse Engineering. The Session will be conducted online (google meet) Maximum Duration 1 hour. The Entire Session will be on Tamil and the Google Meet link will provided day before the session.</p> "
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP GBG + CloudNativeGbg - Cloud security",
        "date": "2021-11-11",
        "time": "17:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/281753680/",
        "timezone": "Europe/Stockholm",
        "description": "<p>This time OWASP Göteborg is happy to collaborate with CloudNativeGbg!! We will bring you two interesting talks that focusing on Cloud Security. The event is hosted by Pagero at their office on Västra Hamngatan 1 in Gothenburg.</p> <p>--&gt; OBS! The tickets to this events has to be booked through Eventbrite:<br/><a href=\"https://www.eventbrite.com/e/owasp-gbg-cloudnativegbg-cloud-security-tickets-200472397337\" class=\"linkified\">https://www.eventbrite.com/e/owasp-gbg-cloudnativegbg-cloud-security-tickets-200472397337</a> . The attendee limit in Meetup is incorrect ;)</p> <p>-- &gt; It will be an IRL event and we of course expect all participants to be fully vaccinated.</p> <p>Agenda:<br/>17:00 - 17:40 Welcome to Pagero<br/>Beer, Pizza and this newly hip thing called socializing. Sponsored by Xenit AB.</p> <p>17:40 - 18:00 Introduction<br/>Introduction from the event hosts and presentation of tonight's speakers.</p> <p>18:00 - 18:40 #1 Cloud security best practices<br/>Many corporations have already migrated fully to the cloud to meet the requirements of our ever changing IT demands and our free and remote workspace. Those who haven't already are probably looking to migrating or are already running a hybrid IT environment. With the COVID outbreak there's even a greater demand today enable workers to work from anywhere and forces organizations to integrate cloud solutions quickly. But what about security? In this talk Benjamin will walk you through a brief introduction to the cloud and cloud security components, present common mistakes made in cloud environments and leave you with good cloud security resources and functions available at several cloud providers.<br/>Benjamin Svensson is a IT-security specialist in networking and infrastructure with everal years of experience with security products, penetration testing and network security. Co-founder and organizer of SecurityFest, a technical IT-Security conference on the Swedish West Coast!</p> <p>19:00 - 19:40 #2 Cloud Whisper - Connecting the dots between vulnerabilities and cloud compromises<br/>Running your infrastructure through a cloud provider is nowadays a no brainer, start small and scale to infinity and beyond. We have established the norm of continuous everything, but what effects does this extremely agile way of working have on security? This presentation will take a dive into the deep and often murky waters of common cloud security flaws, introduced by either vulnerabilities within your code base or through cloud misconfiguration. Jesper will showcase ways of exploiting common vulnerability classes that will severely make any DevOps, SysOps day a lot more interesting.<br/>Jesper Larsson is a freelance IT-security specialist and vulnerability researcher penetration tester, focusing on technical infrastructure with a special focus on orchestrations, infrastructure-as-code, deployment pipelines, cloud implementation and integrations. Working for multinational clients spanning several fields and helping companies, foundation entities with implementing secure infrastructure solutions worldwide. Jesper has audited numerous open source projects for a plethora of foundations and companies, such as the CNCF, Mozilla foundation and Linux foundation. Also Jesper is one of the co-founder and organizer of SecurityFest, a technical IT-Security conference on the Swedish West Coast!</p> <p>19:40 - 21:00 Over-Time (Optional)<br/>Let´s have a couple of beers and continue the discussion around CloudNative! We will try to close down at around 21:00 and we usually go somewhere close to end the night with another beer or two.</p> "
    },
    {
        "group": "Guayaquil",
        "repo": "www-chapter-guayaquil",
        "name": "Convenio OWASP con Universidad Casa Grande (Actualización)",
        "date": "2021-11-26",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Guayaquil-Chapter/events/281873272/",
        "timezone": "America/Guayaquil",
        "description": "<p>Actualización Viernes 26 de Noviembre 2021<br/>Convenio entre OWASP capítulo Guayaquil y la Universidad Casa Grande<br/>Beneficios sobre convenio<br/>Breve charla sobre la maestría en Cibersegurdad de la Universidad Casa Grande<br/>Charlas de seguridad web</p> "
    },
    {
        "group": "Hyderabad",
        "repo": "www-chapter-hyderabad",
        "name": "OWASP Hyderabad Chapter Meet - November 2021",
        "date": "2021-11-13",
        "time": "10:00",
        "link": "https://www.meetup.com/hyderabad-owasp-meetup-group/events/281853147/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Hello OWASPIANS ,</p> <p>It's a great pleasure to announce the OWASP Hyderabad Chapter November month meetup</p> <p>The following talks are lined up for the day :</p> <p>1. Threat Modelling - Manish Sharma</p> <p>This session will cover how to perform Threat Modelling and how and what all process or say methodology is present for this process. Will be covering about advantage as well as disadvantages</p> <p>About Manish Sharma: working as Associate Information Security Engineer @ Gainsight who has demonstrated history of working in the Information Security industry. Skilled in Network Vulnerability Assessment and Penetration Testing, Python (Programming Language), Application Security (Web, API, Mobile as well as Thick Client), Secure Code Review, Threat Modelling, Linux and Shell Scripting. Strong consulting professional with a BTech focused in Electronics and Communication</p> <p>2. All you ever wanted to know about Deserialization - Mr.Aqeel aka Ciph3r00t</p> <p>About Mr.Aqeel: Passionate Information Security Engineer with 10 + years of professional experience and currently leading security team @ Servicenow</p> <p>He holds OSCP, CISM, CISA to name few with masters degree in computer science and Engineering.</p> <p>He got accolades from Apple, Microsoft, Google, Linkedin, Amazon, SAP, Intel, NASA, SANS Institute and others for reporting Critical Security Vulnerabilities</p> <p>Join Zoom Meeting<br/><a href=\"https://us06web.zoom.us/j/85053811753?pwd=T0FzazF5ajJPUkJSc1d3UXJDYTkxQT09\" class=\"linkified\">https://us06web.zoom.us/j/85053811753?pwd=T0FzazF5ajJPUkJSc1d3UXJDYTkxQT09</a></p> <p>Meeting ID: 850 5381 1753<br/>One tap mobile<br/>+19294362866,,85053811753# US (New York)<br/>+12532158782,,85053811753# US (Tacoma)</p> <p>Dial by your location<br/>+1 929 436 2866 US (New York)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 301 715 8592 US (Washington DC)<br/>+1 312 626 6799 US (Chicago)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>Meeting ID: 850 5381 1753<br/>Find your local number: <a href=\"https://us06web.zoom.us/u/kkmGepHVh\" class=\"linkified\">https://us06web.zoom.us/u/kkmGepHVh</a></p> "
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "OWASP x Bank Jago",
        "date": "2021-11-26",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/281863881/",
        "timezone": "Asia/Jakarta",
        "description": "<p>Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…<br/>• Tool dan standar keamanan aplikasi<br/>• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan<br/>• Kendali keamanan dan pustaka standar<br/>• Cabang lokal di seluruh dunia<br/>• Riset terkini<br/>• Konferensi lengkap di seluruh dunia<br/>• Mailing list<br/>• Dan banyak lagi … di www.owasp.org</p> <p>Kali ini Kolaborasi OWASP x Bank Jago akan membahas :</p> <p>1. Cycle Process of DevSecOps by Yohanes Syailendra</p> <p>Short description of topic:</p> <p>A conversation on how DevSecOps implementation in Jago helps them integrate and automate security into the entire testing, development, and delivery process; enabling Jago to deliver a secure and seamless experience at speed.</p> <p>Short bio of speaker:</p> <p>Having 10 years of working experience in IT, Yohanes Syailendra has significant experience and deep knowledge in Technology Assessment and Cyber Security Services, especially in DevSecOps implementation.</p> <p>Outside of his work as Application Security Lead in Jago, Yohanes is also active as a lecturer and trainer at various events in Government and Cyber Communities, as well as leading nationwide research in Cyber Security Community (Indonesia Honeynet Project).</p> <p>2. Cyber Intelligence Practice By Fajrin Nur Hidayat</p> <p>Abtract;</p> <p>Cyber Intelligence is mainly categorized as strategic, tactical, technical, and operational.</p> <p>Short bio of speaker:</p> <p>Fajrin Nur Hidayat is Board Member of OWASP Jakarta, Juga merangkap Head of Cyber Intelligence of AppSec.asia (PT.Aplikasi Siber Teknologi)</p> <p>Venue :</p> <p>Online by zoom</p> <p>Time: Nov 26, 2021 07:00 PM Jakarta</p> <p>This event supported by Appsec.asia <a href=\"https://appsec.asia\" class=\"linkified\">https://appsec.asia</a> &amp; Bank Jago.com <a href=\"https://jago.com\" class=\"linkified\">https://jago.com</a></p> <p>Catatan :<br/>Acara Ini Free for Everyone<br/>Acara ini Di deliver dengan Bahasa Indonesia</p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-11-22",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccpbdc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Leeds Uk",
        "repo": "www-chapter-leeds-uk",
        "name": "November OWASP meet ",
        "date": "2021-11-10",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Leeds-Chapter/events/281093548/",
        "timezone": "Europe/London",
        "description": "<p>After the recent success of the re-booted Leeds Chapter, we've decided to do another!</p> <p>Speakers:</p> <p>John Staveley<br/>&amp;<br/>Nathan Critchley (Airnow)</p> <p>See you there, drinks and nibbles will be provided</p> "
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London CTF 2021 - ONLINE",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-London/events/281856079/",
        "timezone": "Europe/London",
        "description": "<p>OWASP London Chapter is proud to present our CTF event for 2021 in collaboration with OWASP Diversity and Inclusion Committee and many OWASP UK Chapters (including; Bristol, Cambridge, Dorset , Newcastle, Reading, Suffolk).</p> <p>The CTF will be hosted by Security Innovation using their platform and will be instructor lead. It combines with Security Innovation's CMD+Ctrl Bootcamp and they are extending an offer to all participants for 4-weeks FREE access to the self-paced training courses.</p> <p>Although the event is online, as this is a live participatory event it will not be recorded.</p> <p>Want to test your skills in identifying web app vulnerabilities? Join Several OWASP UK Chapters and Security Innovation as members compete in CMD+CTRL, a web application cyber range where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defence is all about thinking on your feet.</p> <p>For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard for a chance to win fantastic prizes! CMD+CTRL is ideal for development teams to train and develop skills.</p> <p>ATTENTION: Additional registration required in order to gain access to the CTF platform and play.<br/>Event registration link will be shared nearer to the time</p> "
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly Virtual Meeting - NOV 24, 2021",
        "date": "2021-11-24",
        "time": "23:45",
        "link": "https://www.meetup.com/OWASP-Los-Angeles/events/278725708/",
        "timezone": "US/Pacific",
        "description": "<p>Come join us as we hear the monthly presentation by Sean Wright Lead Application Security SME at Immersive Labs</p> <p>TOPIC: Open Source Software Supply Chains</p> <p>ABSTRACT: As modern software development evolves; we no longer build things from the ground up. Extensive use is made of open source software such as libraries and frameworks. While this is fantastic from a development point of view (allowing for faster development of applications and features), it does present a potential drawback if not done correctly, an increased risk. Often, we see libraries being used and seldom updated, also we see several libraries being blindly with little to not inspections and reviews. This is gold mine for attackers, there are many ways that they have will continue to use this to their advantage. The purpose of this talk is to cover some of the techniques which attackers could use to exploit open source supply chains. This will include a live demonstration of one such technique which an attacker could used. The talk will then focus on the excellent OWASP Dependency Track tool, showing how this can help reduce the risk to organizations when it comes to dealing with open source packages in software.</p> <p>BIO: Sean Wright is the Lead Application Security SME at Immersive Labs with an origin as a software developer. Primarily focused on web-based application security with a special interest in TLS related subjects. Experienced in providing technical leadership in relation to application security, as well as engaging with teams to improve the security of systems that they develop. Passionate to be a part of the community and giving back to the community. Additionally, enjoy spending personal time performing personal security-related research.</p> <p>Meeting info will be visible to you only if you RSVP for the meeting.</p> <p>ATTENTION SPONSORS: YOUR NAME COULD BE HERE<br/>Check out sponsorship opportunities here<br/><a href=\"https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471\" class=\"linkified\">https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471</a></p> "
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "AWS ID Prefixes: What AWS Doesn't Cover is What You Need to Know",
        "date": "2021-11-10",
        "time": "19:30",
        "link": "https://www.meetup.com/OWASP-Nashville-Chapter/events/281949599/",
        "timezone": "US/Central",
        "description": "<p>In this talk, we will showcase AWS Prefixes and go over those prefixes what they mean, how you can get them. Some resource types like S3 for example allow for the use of a unique ID rather than the full principal ARN that many know and understand. We can cover why use of the unique ID is fundamentally a bad idea, and how to handle them should you run into an environment that has them.</p> "
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Filipi Pires",
        "date": "2021-11-18",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/281288393/",
        "timezone": "US/Eastern",
        "description": "<p>Filipi Pires (@FilipiPires) will present on \"Keep your code safe during the development path using Opensource tools.\"</p> <p>Abstract:</p> <p>Practical demonstration of how a Developer can use a SAST tool for static analysis in code vulnerability, executing it in source code, byte code and/or binary and identifying security holes during the development process, analyzing many languages and codes.<br/>The ecosystem will have the opportunity to know about an open source tool that orchestrates other security tools and identifies security flaws or vulnerabilities in projects and put all results in a database for analysis and generation of metrics, working this analysis with select the languages ​​and/or tools to be used on the project based on the available stack.<br/>These languages and tools are: Python, Ruby, Javascript/Typescript, GoLang, C#, Java, Kotlin, Kubernetes, Terraform, some Leaks, Leaks(optional search in git history), PHP, C, HTML, JSON, Shell Script and Elixir, it being done in source code, byte code or binary, finding “Leaks\" checks the source code for possible leaks of credentials, private keys or hard coded passwords and analyze the project’s dependencies to check for vulnerabilities in third-party libraries. in third-party libraries.</p> <p><a href=\"https://horusec.io\" class=\"linkified\">https://horusec.io</a><br/><a href=\"https://docs.horusec.io\" class=\"linkified\">https://docs.horusec.io</a></p> <p>Similar presentations:<br/><a href=\"https://www.youtube.com/watch?v=ZIY0Wf6QUdY\" class=\"embedded\">https://www.youtube.com/watch?v=ZIY0Wf6QUdY</a> - (D.C. Cybersecurity Professionals – 2021)<br/><a href=\"https://www.youtube.com/watch?v=no5iUdRd64g\" class=\"embedded\">https://www.youtube.com/watch?v=no5iUdRd64g</a> - (RTV 2021 - Learning Thrusday)</p> "
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "(Alert Level 1 permitting) The new OWASP Top 10 Web Application Security Risks",
        "date": "2021-11-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-Zealand-Chapter-Christchurch/events/281034378/",
        "timezone": "Pacific/Auckland",
        "description": "<p>Important! Traction on Demand (formerly Trineo) is not hosting events under Alert Level 2, so this is a tentative placeholder for the next meetup. Details to be added soon…</p> "
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle CTF 2021 - Online",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Newcastle-Chapter/events/281889035/",
        "timezone": "Europe/London",
        "description": "<p>OWASP Newcastle Chapter is proud to present our CTF event for 2021 in collaboration with OWASP Diversity and Inclusion Committee and many OWASP UK Chapters (including Bristol, Cambridge, Dorset, London, Reading and Suffolk).</p> <p>The CTF will be hosted by Security Innovation and will be instructor lead. It combines with Security Innovation's CMD+CTRL Bootcamp and they are extending an offer to all participants for 4 weeks' FREE access to the self-paced training courses.</p> <p>Although the event is online, as this is a live participatory event it will not be recorded.</p> <p>Event registration link will be shared nearer to the time.</p> "
    },
    {
        "group": "Omaha",
        "repo": "www-chapter-omaha",
        "name": "Q4 Meeting: Securing your Applications with the OWASP ASVS",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspomaha-meetup-group/events/280673562/",
        "timezone": "US/Central",
        "description": "<p>Michael Born, Director of Security Consulting at SecureSky, Inc. will walk the audience through how to employ the OWASP Application Security Verification Standard to harden modern applications. This presentation will also provide guidance for deploying applications in Microsoft Azure that comply with the OWASP ASVS.</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Analyzing source code for vulnerabilities: A how-to workshop",
        "date": "2021-11-18",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-OC/events/281234132/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Vickie Li, Developer Evangelist, ShiftLeft</p> <p>Topic: Analyzing source code for vulnerabilities: A how-to workshop</p> <p>Live stream: <a href=\"https://www.twitch.tv/owaspoc\" class=\"linkified\">https://www.twitch.tv/owaspoc</a></p> <p>Abstract and workshop preparation guide:<br/>Writing code is hard. Writing secure code is even harder. Serious security vulnerabilities often stem from small programming mistakes. As developers, we can safeguard our applications by catching these mistakes in our own code.</p> <p>Performing a source code review is one of the best ways to find security issues in code. But how do you do it? In this workshop, we will first go through the basics of how to review your code for vulnerabilities and some tactics for performing an effective security code review on your application.</p> <p>But the process of manually analyzing code for vulnerabilities can be very time-consuming. In the second part of this talk, we will also talk about how to use the interactive code analysis tool Joern to make code analysis more efficient. How do you effectively trace user input in code? How can you efficiently link bug sources to sensitive sink functions? If you’d like to follow along, here is what you need to get ready.</p> <p>Joern is open-sourced, download Joern and install:<br/>$ wget <a href=\"https://github.com/joernio/joern/releases/latest/download/joern-install.sh\" class=\"linkified\">https://github.com/joernio/joern/releases/latest/download/joern-install.sh</a><br/>$ chmod +x ./joern-install.sh<br/>$ sudo ./joern-install.sh</p> <p>If you need help here are some important links:<br/>Joern Community: <a href=\"https://discord.gg/ff3ahcFrJq\" class=\"linkified\">https://discord.gg/ff3ahcFrJq</a><br/>Joern Documentation: <a href=\"https://docs.joern.io\" class=\"linkified\">https://docs.joern.io</a><br/>Joern query database: <a href=\"https://queries.joern.io\" class=\"linkified\">https://queries.joern.io</a></p> <p>Speaker Bio:<br/>Vickie Li is the resident developer evangelist at ShiftLeft. She is an experienced web developer with an avid interest in security research. She can be found on <a href=\"https://vickieli.dev\" class=\"linkified\">https://vickieli.dev</a>, where she blogs about security news, techniques, and her latest bug bounty findings. She also hosts “Security Simplified”, a developer education series focusing on web security: <a href=\"https://www.youtube.com/c/vickielidev\" class=\"embedded\">https://www.youtube.com/c/vickielidev</a>.</p> <p>Twitter: @vickieli7<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/vickie-li-103a35b8\" class=\"linkified\">https://www.linkedin.com/in/vickie-li-103a35b8</a></p> <p>--------------------------------------------------------------------------------------<br/>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa November 2021: Content Security Policy (CSP): Not just for XSS",
        "date": "2021-11-17",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Ottawa/events/281832893/",
        "timezone": "Canada/Eastern",
        "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=mT6Eq6Lm7hg\" class=\"embedded\">https://www.youtube.com/watch?v=mT6Eq6Lm7hg</a></p> <p>7:00 PM EDT Technical Talks</p> <p>1. Announcements</p> <p>2. Content Security Policy (CSP): Not just for XSS</p> <p>Abstract:<br/>Can’t let go of inline js just yet? Is CSP really useless if you allow unsafe-inline? Let’s explore some other CSP directives to see what we can do to secure our web apps outside of XSS. We will look at enforcing secure network protocols, preventing clickjacking and stopping magecart attacks.</p> <p>Bio: Kathy Nguyen<br/>Kathy Nguyen is a Winnipeg native that somehow found her way into the precarious world of application security. Kathy is currently a senior security engineer at Datadog. While not doing epic security stuff she is cheering for the Jets. Rumours of her trash talking the Leafs are purely speculative.</p> "
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "10. OWASP Poland Meetup (Warsaw + Online)",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/owasp-poland/events/281894735/",
        "timezone": "Europe/Warsaw",
        "description": "<p>Serdecznie zapraszam na kolejne spotkanie OWASP, które odbędzie się 18 listopada 2021. Tym razem działamy hybrydowo. Dzięki zaproszeniu Goldman Sachs, spotkanie odbędzie się fizycznie w Warszawie w budunku Warsaw Spire. Z uwagi na pandemię w spotkaniu będzie mogło wziąć udział jedynie 30 osób (dodatkowo aby wejść na spotkanie będzie również wymagane okazanie certyfikatu potwierdzającego przyjęcie dwóch dawek szczepienia oraz okazanie dokumentu potwierdzającego tożsamość). Dlatego równolegle będzie realizowana transmisja on-line bez limitów miejsc (link do spotkania Zoom zostanie opublikowany przed spotkaniem).</p> <p>Z uwagi na ograniczoną liczbę miejsc ogromna prośba o rejestrowanie się przy 100% pewności możliwości wzięcia udziału w spotkaniu, tak by nie blokować miejsc. Również jeśli po rejestracji okaże się, że przybycie nie będzie możliwe, bardzo proszę o wyrejestrowanie się, by mogły skorzystać osoby z listy rezerwowej.</p> <p>Agenda spotkania:</p> <p>18:00 – 18:05 – Powitanie i otwarcie spotkania, Daniel Krasnokucki</p> <p>18:05 – 18:50 – \"Discovery and exploitation of CSRF to RCE in CloverDX Server - CVE-2021-29995\", Patryk Bogusz</p> <p>Prezentacja opisywać będzie proces znalezienia i wykorzystania podatności CSRF w CloverDX Serverze, która ostatecznie prowadzi do zdalnego wykonania kodu na serwerze. W trakcie prezentacji przejdę od podstaw, czyli opisu czym jest CSRF, poprzez crackowanie generatora liczb pseudolosowych, aż do samej exploitacji CSRF prowadzącej do zdalnego wykonania kodu.</p> <p>Patryk Bogusz - Pentester w Goldman Sachs, na codzień zajmuje sie testowaniem bezpieczenstwa aplikacji i infrastruktury chmurowej. W wolnym czasie amatorsko trenuje boks tajski w Sparta Gym Warszawa.</p> <p>18:50 – 19:35 – \"Feedback loop in DevSecOps - mature security process and dev cooperation\", Daniel Krasnokucki</p> <p>Having Security testing in the pipeline is getting more and more popular, I would say it is becoming a standard! But what we are doing with findings? What are we automating and how are using the automation?</p> <p>The presentation will cover security-as-a-code practices to integrate security testing into the CI and CD pipelines, but in addition - I will discuss the part of the testing that cannot be automated, which is penetration testing. How do you connect it with your automation testing and what is the role of penetration testing in monitoring? I will show how it affects next round of the process and what the process should look like.</p> <p>During the presentation I will discuss real use cases from different pipelines and security tools, showing pros and cons, advantages and challenges. Demo will include GitHub Actions and open-source tools like OWASP ZAP and examples will be provided with pipeline-as-a-code and security-as-a-code. Real life use cases and examples with step-by-step instruction how the development process in mature state of DevSecOps should look like.</p> <p>Daniel Krasnokucki - Security freak, pentester, programmer, and day-to-day also a manager of Product Security team @ Equinix. Leader of OWASP Poland with a strong focus on building security controls and improving different areas in a very techy company. Privately likes board games, football (soccer) and loves skiing!</p> <p>19:35 – 20:00 – Discussions</p> "
    },
    {
        "group": "Rio De Janeiro",
        "repo": "www-chapter-rio-de-janeiro",
        "name": "OWASP RJ - 9º - Segurança no e-mail",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/owasp-rio-de-janeiro/events/281947370/",
        "timezone": "America/Sao_Paulo",
        "description": "<p>Vamos abordar nesse encontro alguns protocolos de segurança utilizados no transporte de e-mails.<br/>Veja nossa agenda a seguir:</p> <p>1. Warm-up (10min)<br/>2. Segurança no e-mail (25min)<br/>3. Discussão, cases e exemplos (20min)</p> <p>Confira mais sobre o capítulo em <a href=\"https://owasp.org/www-chapter-rio-de-janeiro/\" class=\"linkified\">https://owasp.org/www-chapter-rio-de-janeiro/</a>.</p> "
    },
    {
        "group": "Saint Louis",
        "repo": "www-chapter-saint-louis",
        "name": "OWASP Night",
        "date": "2021-12-02",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-STL/events/277429806/",
        "timezone": "US/Central",
        "description": "<p>Celebrating OWASP's 20th anniversary!</p> "
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "November 2021 Chapter Meeting (virtual)",
        "date": "2021-11-22",
        "time": "12:00",
        "link": "https://www.meetup.com/owasp-slc/events/281873625/",
        "timezone": "US/Mountain",
        "description": "<p>We'll meetup virtually this month, and host a round table discussion on Topics of Interest.</p> <p>-----AGENDA-----<br/>Topics:<br/>--OWASP Top 10<br/>------What impact to your teams?<br/>--Grow the Group<br/>------Assigning Tasks, etc.<br/>--...</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC/Wasatch AppSec November Chapter Meeting<br/>Time: Nov 22, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://us06web.zoom.us/j/83313385598?pwd=NzBEQWJCZTJSWnhmdzMweFZPaktyQT09\" class=\"linkified\">https://us06web.zoom.us/j/83313385598?pwd=NzBEQWJCZTJSWnhmdzMweFZPaktyQT09</a></p> <p>Meeting ID: 833 1338 5598<br/>Passcode: 841876<br/>One tap mobile<br/>+13462487799,,83313385598#,,,,*841876# US (Houston)<br/>+16699006833,,83313385598#,,,,*841876# US (San Jose)</p> <p>Dial by your location<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>+1 301 715 8592 US (Washington DC)<br/>Meeting ID: 833 1338 5598<br/>Passcode: 841876<br/>Find your local number: <a href=\"https://us06web.zoom.us/u/keIjBnQdW6\" class=\"linkified\">https://us06web.zoom.us/u/keIjBnQdW6</a></p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "Monthly Meeting",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccpbxb/",
        "timezone": "US/Pacific",
        "description": "<p>Monthly OWASP meeting</p> "
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Using OWASP Nettacker for Recon and Vulnerability Scanning",
        "date": "2021-11-17",
        "time": "16:00",
        "link": "https://www.meetup.com/Santa-Barbara-OWASP-Chapter/events/281836250/",
        "timezone": "US/Pacific",
        "description": "<p>NOTE: You need to RSVP in order to get the link the day of the event.</p> <p>### Event Agenda (PDT timezone) ###<br/>04:00 pm -- Event Kickoff &amp; Announcements, by Walter Martín Villalba, OWASP SB Leader -- <a href=\"https://twitter.com/act1vand0\" class=\"linkified\">https://twitter.com/act1vand0</a><br/>04:10 pm -- Presentation: Using OWASP Nettacker for Recon and Vulnerability Scanning, by Sam Stepanyan, Application Security Architect -- <a href=\"https://twitter.com/securestep9\" class=\"linkified\">https://twitter.com/securestep9</a><br/>05:00 pm -- Networking / Closing Remarks</p> <p>### Abstract ###<br/>The OWASP Nettacker project was created to automate information gathering, vulnerability scanning, and in general to aid the penetration testing engagements. Nettacker is able to run various scans using a variety of methods and generate scan reports for applications and networks, including services, bugs, vulnerabilities, misconfigurations, default credentials and many other cool features - for example the ability to chain different scan methods. This relatively new (Summer 2017) and a lesser-known OWASP project has generated a huge amount of interest at BlackHat Europe 2018/2019 Arsenal live demo gathering massive crowds of seasoned hackers and penetration testers eager to see this new tool in action. This talk will showcase the OWASP Nettacker project giving an overview of its features and including a live demo of the tool.</p> <p>### Speaker Bio ###<br/>Sam Stepanyan is an OWASP London Chapter Leader and an Independent Application Security Consultant with over 20 years of experience in the IT industry with a background in software engineering and web application development. Sam has worked for various financial services institutions in the City of London specialising in Application Security consulting, Secure Software Development Lifecycle (SDLC), developer training, source code reviews and vulnerability management. He is also a Subject Matter Expert in Web Application Firewalls (WAF) and SIEM systems. Sam holds a Master’s degree in Software Engineering and a CISSP certification.</p> "
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Architecting for Security in the Cloud",
        "date": "2021-11-11",
        "time": "18:00",
        "link": "https://www.meetup.com/Santa-Barbara-OWASP-Chapter/events/281822274/",
        "timezone": "US/Pacific",
        "description": "<p>NOTE: You need to RSVP in order to get the link the day of the event.</p> <p>### Event Agenda (PST timezone) ###<br/>06:00 pm -- Event Kickoff &amp; Announcements, by Walter Martín Villalba, OWASP SB Leader -- <a href=\"https://twitter.com/act1vand0\" class=\"linkified\">https://twitter.com/act1vand0</a><br/>06:10 pm -- Presentation: Architecting for Security in the Cloud, by Josh Sokol, CEO of SimpleRisk -- <a href=\"https://twitter.com/joshsokol\" class=\"linkified\">https://twitter.com/joshsokol</a><br/>06:50 pm -- Networking / Closing Remarks</p> <p>### Abstract ###<br/>The best part about creating new products and services in the cloud is the agility that it provides. Your company literally can scale at the click of a button. But if you take the simplicity of the cloud for granted, you wind up with brittle security that even a novice adversary can overcome. This talk will focus on identifying the holes in your cloud application before the attackers do, closing those gaps, and building architectures that can withstand the barrage of attacks that the Internet will throw at it.</p> <p>### Speaker Bio ###<br/>Josh Sokol, CISSP, graduated from the University of Texas at Austin with a BS in Computer Science in 2002. Since that time, he has worked for several large companies, including AMD and BearingPoint, spent some time as a military contractor, and recently left a ten year career as the Information Security Program Owner at National Instruments in order to pursue a full-time role as the Creator, CEO, and CISO of the free and open source risk management tool named SimpleRisk. Josh has spoken on dozens of security topics, including the much-hyped “HTTPSCan Byte Me” talk at Black Hat 2010, and served for four years on the OWASP Global Board of Directors.</p> "
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2021-12-08",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Seattle-Chapter/events/pfhhqsyccqblb/",
        "timezone": "US/Pacific",
        "description": "<p>At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.</p> <p>Suggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.</p> <p>Slack @ #chapter-seattle (<a href=\"https://bit.ly/owasp-seattle-slack\" class=\"linkified\">https://bit.ly/owasp-seattle-slack</a>)</p> <p>seattle-chapter@owasp.org (<a href=\"https://groups.google.com/a/owasp.org/g/seattle-chapter\" class=\"linkified\">https://groups.google.com/a/owasp.org/g/seattle-chapter</a>)</p> "
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2021-11-10",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Seattle-Chapter/events/pfhhqsyccpbnb/",
        "timezone": "US/Pacific",
        "description": "<p>At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.</p> <p>Suggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.</p> <p>Slack @ #chapter-seattle (<a href=\"https://bit.ly/owasp-seattle-slack\" class=\"linkified\">https://bit.ly/owasp-seattle-slack</a>)</p> <p>seattle-chapter@owasp.org (<a href=\"https://groups.google.com/a/owasp.org/g/seattle-chapter\" class=\"linkified\">https://groups.google.com/a/owasp.org/g/seattle-chapter</a>)</p> "
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": "OWASP Seoul Conference 2021",
        "date": "2021-11-17",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Seoul/events/280484529/",
        "timezone": "Asia/Seoul",
        "description": "<p>OWASP Seoul Chapter  AIOT    \"AIoT  /  \"  \"OWASP SEOUL CONFERENCE 2021\"  .       .</p> <p>The OWASP Seoul Chapter will hold the \"OWASP SEOUL CONFERENCE 2021\" event under the theme of \"Security of AIoT Convergence Products/Services\" to improve AIOT security at home and abroad.<br/>We hope that many of you who are interested in the event will participate.</p> <p>&lt; Event Overview &gt;<br/>- When : 2021.11.17(Wed) 19:00 ~ 21:00, KST<br/>- Where : Zoom (<a href=\"https://url.kr/pn52f6\" class=\"linkified\">https://url.kr/pn52f6</a>)<br/>- Target :  AIOT     <br/>Anyone interested in AIOT security at home and abroad</p> <p>&lt; Event Program &gt;<br/>#1 : IoT     <br/>- ()   (DualAuth Jonghyun Woo CEO)</p> <p>#2 : 5G    (Security Threats in 5G Edge Environments)<br/>-    (ETRI Youngsoo Kim Principal Researcher)</p> <p>#3 : IoT       <br/>-    (KISA Sanggeol Lee Principal Researcher)</p> <p>#4 : IoT     (IoT Software Supply Chain Attack)<br/>-  : Checkmarx Korea   (Greg Song Korea Country Manager)</p> <p>       .</p> "
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Malware Discovered in Popular NPM: Anatomy of Next-Gen Supply Chain Attacks",
        "date": "2021-11-16",
        "time": "19:30",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/281710523/",
        "timezone": "Asia/Singapore",
        "description": "<p>In this meetup, we will explore some tools and understand guidelines that can secure popular software packages and dependencies such as NPM, PyPI, Maven, NuGet, Crates and RubyGems.</p> <p>We will also learn how Gitops play a critical role in \"shifting left\" and learn how to set up guardrails, not roadblocks, to help developers. We will also look at how fuzzing can be incorporated into DevSecOps.</p> <p>Finally we will learn the importance of having Cloud Infrastructure Entitlements Management (CIEM) to enforce permissions and security identities across workloads and clouds. Demo will be included in this meetup.</p> <p>Speaker: Nathan Aw<br/>With over 9 years of experience as a software developer and application (security) architect, Nathan Aw is a firm believer-practitioner of zero trust and advocate of secure coding practices. His passion is in designing, building and rolling out asynchronous, polyglot-based microservices that are both zero-trust, performant which can securely run anywhere (multi-cloud and/or on-premise) that scale without limits.</p> <p>Through hands-on setup of a Secure Software Factory (SSF), he understands the importance of setting up a first-class secure software factory that is able to industralise “shift left” practises that translates to quicker delivery of trusted and secure digital services to its customers.</p> <p>Other Nathan's interests include emerging technology frameworks and frontier technologies such as WebAssembly, metaverse, quantum computing, cybersecurity for 5G Cloud Infrastructure and ICS/OT.</p> <p>More on Nathan can be found at <a href=\"https://nathanawmk.github.io/\" class=\"linkified\">https://nathanawmk.github.io/</a> and <a href=\"https://sg.linkedin.com/in/awnathan\" class=\"linkified\">https://sg.linkedin.com/in/awnathan</a></p> "
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk CTF 2021 - ONLINE",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/281865338/",
        "timezone": "Europe/London",
        "description": "<p>Details</p> <p>OWASP Suffolk Chapter is proud to present a CTF event for 2021 in collaboration with OWASP Diversity and Inclusion Committee and many OWASP UK Chapters (including; Dorset, London, Bristol, Reading, Cambridge, Newcastle).</p> <p>The CTF will be hosted by Security Innovation using their platform and will be instructor lead. It combines with Security Innovation's CMD+Ctrl Bootcamp and they are extending an offer to all participants for 4-weeks FREE access to the self-paced training courses.</p> <p>Although the event is online, as this is a live participatory event it will not be recorded.</p> <p>Want to test your skills in identifying web app vulnerabilities? Join Several OWASP UK Chapters and Security Innovation as members compete in CMD+CTRL, a web application cyber range where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defence is all about thinking on your feet.</p> <p>For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard for a chance to win fantastic prizes! CMD+CTRL is ideal for development teams to train and develop skills.</p> <p>ATTENTION: Additional registration required in order to gain access to the CTF platform and play.<br/>Event registration link will be shared nearer to the time</p> "
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Security in a games world (working title)",
        "date": "2021-12-02",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASPSwitzerland/events/281403322/",
        "timezone": "Europe/Zurich",
        "description": "<p>Hear from a security officer working in the games domain what's different and the same regarding security considerations and security measures.<br/>(Details to follow)</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney - Fun with Hack the Box",
        "date": "2021-12-09",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/281563593/",
        "timezone": "Australia/Sydney",
        "description": "<p>Please join us to play/train in Hack The Box (HTB), what you need is a Hack the Box account, free is cool, join us in discord (link <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a>) - FC-Announcements-Voice Channel, please ensure, after registration in Discord you go to the Bot and accept the Code of Conduct, otherwise, you won't be able to access the channels.</p> <p>There is no format to this night, we just want to get together to have some fun playing some battlegrounds, doing some of the machines or challenges; having fun overall!</p> <p>Please make sure you know the basics about HTB, eg. how to connect to the HTB VPN and that you have a valid account.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney - Fun with Hack the Box",
        "date": "2021-11-11",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/279765803/",
        "timezone": "Australia/Sydney",
        "description": "<p>Please join us to play/train in Hack The Box (HTB), what you need is a Hack the Box account, free is cool, join us in discord (link <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a>) - FC-Announcements-Voice Channel, please ensure, after registration in Discord you go to the Bot and accept the Code of Conduct, otherwise, you won't be able to access the channels.</p> <p>There is no format to this night, we just want to get together to have some fun playing some battlegrounds, doing some of the machines or challenges; having fun overall!</p> <p>Please make sure you know the basics about HTB, eg. how to connect to the HTB VPN and that you have a valid account.</p> "
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "November Event - OWASP Threat Dragon | Failure to Report",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Toronto/events/281510935/",
        "timezone": "Canada/Eastern",
        "description": "<p>LIGHTNING TALK<br/>------------------------</p> <p>OWASP Threat Dragon, A modern threat modeling tool, done right.</p> <p>Summary:</p> <p>OWASP Threat Dragon is a threat modeling tool used to create threat model diagrams as part of a secure development lifecycle. Come to this talk for a brief overview of the project, how it works, and how you can contribute!</p> <p>Presenter:</p> <p>I am Matthew McCarty, an application security engineer currently working for Coinsquare in Toronto. I am passionate about security and ensuring users of all kinds can safely and securely use the applications they want without worry! (a little cheesy I know)</p> <p>TALK<br/>-------</p> <p>Failure to Report</p> <p>Summary:</p> <p>Andrew has worked in infosec long enough to have seen and written many good and bad reports, and there's a few trends that are slowly driving him insane. Andrew hopes that his screaming in his talk, \"Failure to Report: A Semi-Structured Rant on What's Wrong with Vulnerability Assessment Reporting\" will help banish some bad practices to the land of wind and ghosts, never to be seen again. Or at least it will make him feel better.</p> <p>Presenter:</p> <p>Andrew Turnsek is a Senior Security Consultant at Security Compass and has been primarily working in penetration testing and vulnerability assessment since 2013, with brief stops in threat intelligence, security architecture review, and as a \"BS Detector\" for auditing teams. He can be found at security conferences and hockey games, usually wearing a Marlies hat.</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2021-11-25",
        "time": "18:30",
        "link": "https://www.meetup.com/owasptriangle/events/pqfzhsyccpbhc/",
        "timezone": "US/Eastern",
        "description": "<p>TBA</p> "
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "November 2021 Threat Modelling Virtual Workshop",
        "date": "2021-11-23",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/281402288/",
        "timezone": "Canada/Pacific",
        "description": "<p>The OWASP Victoria chapter is proud to present our next quarterly event. Jeevan Singh will be delivering a talk with an accompanying workshop on Threat Modelling 101.</p> <p>The event will be held on November 23 from 5:30 pm to 8:00 pm PT.</p> <p>This event will feature Jeevan’s talk followed by a Q&amp;A, workshop, and a draw for a prize (must be a registered member and reside in Canada). Join us for an evening of threat modelling!</p> <p>Visit our OWASP Chapter to learn more about us at:<br/><a href=\"https://owasp.org/www-chapter-victoria/\" class=\"linkified\">https://owasp.org/www-chapter-victoria/</a></p> <p>Speaker: Jeevan Singh<br/>Presentation: Talk, Q&amp;A, and accompanying workshop</p> <p>Event Details:</p> <p>Threat Modelling is a great way to discover and remediate threats in your system before they are even created. Security professionals commonly perform it, but anyone can do threat modelling. This hands-on workshop will cover the threat modelling workflow, common classes of vulnerabilities, and hands-on examples that will have *you* discover threats in different systems. Threat Modelling is an integral part of every company’s Security Development Lifecycle. Still, as development teams grow more prominent, security will have to choose which features they want to Threat Model, or they will become a bottleneck for the development organization.</p> <p>Speaker Biography:</p> <p>Jeevan Singh is an Application Security Engineering Manager for Twilio Segment (<a href=\"https://segment.com\" class=\"linkified\">https://segment.com</a>), where he is embedding security into all aspects of the software development process. Jeevan enjoys building a security culture within organizations and educating staff on security best practices. Jeevan is responsible for a wide variety of tasks, including architecting security solutions, working with development teams to resolve security vulnerabilities, and building out security features. Before life in the security space, Jeevan had a wide variety of development and leadership roles over the past 15 years.</p> "
    },
    {
        "group": "Vina Del Mar",
        "repo": "www-chapter-vina-del-mar",
        "name": "Owasp Viña del mar-tercer Evento 2021",
        "date": "2021-11-13",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Vina-del-Mar-Chapter/events/281817631/",
        "timezone": "America/Santiago",
        "description": "<p>Owasp viña del mar tiene el agrado de anunciar un nuevo evento gratuito el día sábado 13</p> <p>Charlas Corfirmadas:</p> <p>*Marcelo Burgos<br/>CAPTCHA Defeat y Bypass en Bug Hunting<br/><a href=\"https://www.linkedin.com/in/marceloburgosc/\" class=\"linkified\">https://www.linkedin.com/in/marceloburgosc/</a></p> <p>*Gustavo Nieves<br/>Controles y desarrollo seguro en Smart Contrat para Block Chains(transacciones electronicas) (Investigación que lidera en la CSA, de como hacer desarrollo seguro en Smart Contract)</p> "
    },
    {
        "group": "Zhytomyr",
        "repo": "www-chapter-zhytomyr",
        "name": "OWASP Zhytomyr 2021 Meetup #3",
        "date": "2021-11-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Zhytomyr-Chapter/events/281782803/",
        "timezone": "Europe/Kiev",
        "description": "<p>Увага! Там наче карантин посилили знову, тож буде багато вiльного часу. Пiклуючись про вас, ми натякаємо вам на те, що це виглядає як кльова можливiсть приєднатись до мітапу OWASP Zhytomyr, поширювати знання та ділитися досвідом в сфері кібербезпеки. Також ви можете скористатися цим часом щоб підготувати гарну доповідь на онлайн івент, що відбудеться 24.11.2021 о 19:00.<br/>Не втрачайте змогу зустрiтись iз ламповим OWASP Zhytomyr =)<br/>Ми за вами вже скучили!<br/>CFP: <a href=\"https://www.papercall.io/owasp-zhytomyr-3\" class=\"linkified\">https://www.papercall.io/owasp-zhytomyr-3</a></p> "
    },
    {
        "group": "Wia",
        "repo": "www-committee-wia",
        "name": "Cloud Security by Dr. Abhilasha Vyas",
        "date": "2021-11-27",
        "time": "13:00",
        "link": "https://www.meetup.com/womeninappsec/events/281539760/",
        "timezone": "US/Eastern",
        "description": "<p>This talk will discuss about Cloud Security. What are the security services provided by CSPs. How we can manage our resources on Cloud.</p> <p>Dr. Abhilasha Vyasr's LinkedIn profile: <a href=\"https://www.linkedin.com/in/dr-abhilasha-rakesh-vyas-96a15b199\" class=\"linkified\">https://www.linkedin.com/in/dr-abhilasha-rakesh-vyas-96a15b199</a></p> "
    },
    {
        "group": "Wia",
        "repo": "www-committee-wia",
        "name": "CTF 2021 - online",
        "date": "2021-11-18",
        "time": "13:00",
        "link": "https://www.meetup.com/womeninappsec/events/281922373/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Diversity and Inclusion Committee is proud to present our CTF event for 2021 in collaboration with many OWASP UK Chapters (including; Dorset, Bristol, Cambridge, London, Newcastle, Reading, Suffolk).</p> <p>The CTF will be hosted by Security Innovation and be instructor lead. It combines with Security Innovation's CMD+Ctrl Bootcamp and they are extending an offer to all participants for 4-weeks FREE access to the self-paced training courses.</p> <p>Although the event is online, as this is a live participatory event it will not be recorded.</p> <p>Event registration link will be shared nearer to the time</p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Testing your Assumptions with Red Teaming",
        "date": "2021-11-19",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/281752553/",
        "timezone": "Canada/Eastern",
        "description": "<p>In this question and answer/panel-style session, “Alex” -- Australia’s only hacker will answer your questions and muse about how everyone's out here being like \"yes this is secure\" or \"oh no, no it isn't\", but how do we actually know? We don't, really.</p> <p>Alex will also share their thoughts about the one thing they do know: The scientific method is the only good thing we have. So, using cutting-edge 1500s techniques, we can do what 1400s scientists only dreamed of: test out what would actually happen if someone were to try and hack us.</p> <p>Make sure you join us LIVE to get a chance to win a Burp Suite Professional subscription</p> <p>\"ALEX\"</p> <p>Alex works on the Red Team at Atlassian, in which they do crimes, and then write very, very detailed confession letters. You can follow Alex on Twitter (<a href=\"https://twitter.com/mangopdf\" class=\"linkified\">https://twitter.com/mangopdf</a>).</p> <p> Connect with Us  <br/>YOUTUBE  <a href=\"https://www.youtube.com/c/OWASPDevSlop/\" class=\"embedded\">https://www.youtube.com/c/OWASPDevSlop/</a>​<br/>INSTAGRAM  <a href=\"https://www.instagram.com/owaspdevslop/\" class=\"linkified\">https://www.instagram.com/owaspdevslop/</a>​<br/>TWITTER  <a href=\"https://twitter.com/Owasp_DevSlop\" class=\"linkified\">https://twitter.com/Owasp_DevSlop</a>​<br/>LINKEDIN  <a href=\"https://www.linkedin.com/company/owasp-devslop/\" class=\"linkified\">https://www.linkedin.com/company/owasp-devslop/</a></p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "OAuth and OpenID Connect Clearly Explained",
        "date": "2021-11-14",
        "time": "13:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/280156356/",
        "timezone": "Canada/Eastern",
        "description": "<p>If you're like us, you've heard about OAuth 2.0 and OpenID Connect, but have a lot of unanswered questions. What's the big deal, anyway? Why do we need yet another set of standards for authentication on the web?</p> <p>In this episode, Nate Barbettini breaks down the rationale behind OAuth and OpenID Connect in plain language and explains when and how you should use them.</p> <p>If you've ever felt confused about these terms and standards, join us!</p> <p>NATE BARBETTINI</p> <p>Nate Barbettini (@nbarbettini) is the CTO and co-founder of Cobbler, where he leads a team building financial analysis software for enterprise businesses. Previously, he was a Product Manager at Okta focused on making security and authentication easier for developers. He is a former Microsoft MVP and the author of the free Little ASP.NET Core Book (<a href=\"http://littleasp.net/book\" class=\"linkified\">http://littleasp.net/book</a>).</p> <p> Connect with Us  <br/>YOUTUBE  <a href=\"https://www.youtube.com/c/OWASPDevSlop/\" class=\"embedded\">https://www.youtube.com/c/OWASPDevSlop/</a>​<br/>INSTAGRAM  <a href=\"https://www.instagram.com/owaspdevslop/\" class=\"linkified\">https://www.instagram.com/owaspdevslop/</a>​<br/>TWITTER  <a href=\"https://twitter.com/Owasp_DevSlop\" class=\"linkified\">https://twitter.com/Owasp_DevSlop</a>​<br/>LINKEDIN  <a href=\"https://www.linkedin.com/company/owasp-devslop/\" class=\"linkified\">https://www.linkedin.com/company/owasp-devslop/</a></p> "
    }
]