[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - October",
        "date": "2021-10-26",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Aarhus-Chapter/events/281291184/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>Notice, that this is a physical event and that Cryptomathic will be hosting it. By signing up, you accept that OWASP Aarhus will hand over a list of participants to Cryptomathic for the sole purpose of hosting this event.</p> <p>19:00 - 19:30<br/>\"Welcome, Food and Drinks\"<br/>Thomas Ljungberg Kristensen - Co-Chapter Leader OWASP Aarhus<br/>Dennis Perto - Co-Chapter Leader OWASP Aarhus</p> <p>19:30 - 20:15<br/>\"Mobile Security: App Attestation and keeping secrets on the phone\"<br/>Peter Ørbæk, Software Engineer at Cryptomathic</p> <p>About the presentation:<br/>\"Mobile app security is about two things: protecting secrets (password, tokens, keys) on the phone, and ensuring the backend that it is talking the genuine app and user. This talk is about how Cryptomathic solved this and the path which lead to App Attestation and the Cryptomathic Mobile App Security Core.\"</p> <p>About Peter:<br/>My name is Peter Ørbæk. I have a Ph.D in computer science from the University of Aarhus. Since 2010 I have worked as a Senior Software Engineer at Cryptomathic on key management, authentication, document signing, and not least, mobile security in the banking world.</p> <p>20:30 - 21:15<br/>\"Cryptography and it’s flaws in practice\"<br/>Marcus Sellebjerg, Student at Aarhus university with a passion for cybersecurity and cryptography</p> <p>About the presentation:<br/>It’s widely acceptable that security on the internet is very important. Still many developers doesn’t know how to implement security mechanisms and particularly cryptography is a very error prone area. For many cryptography is a black box of math-magic and while that is fine, it’s important to use this black box in a correct manner which is sadly not easy. In this talk I’ll give you an introduction on how to use the cryptography black box and how it can be exploited if not used correct.</p> <p>About Marcus:<br/>My name is Marcus, I’m currently a masters student at Aarhus University with a huge interest in cryptography and the math behind it. Beside university I compete in capture the flag tournaments together with my team (Kalmarunionen), where we look at different security solutions and tries to circumvent the implemented security mechanisms, both crypto and other areas. I also work in the cryptography department of Danske bank and have been programming since I was around the age of 12, where the concept of hiding information in plain sight also found my interest.</p> <p>21:15 - 21:30<br/>Goodbyes and plans going forward<br/>Thomas Ljungberg Kristensen - Co-Chapter Leader OWASP Aarhus<br/>Dennis Perto - Co-Chapter Leader OWASP Aarhus</p> "
    },
    {
        "group": "Aguascalientes",
        "repo": "www-chapter-aguascalientes",
        "name": "OWASP Aguascalientes",
        "date": "2021-10-26",
        "time": "20:00",
        "link": "https://www.meetup.com/owasp-aguascalientes-meetup-group/events/281586397/",
        "timezone": "America/Mexico_City",
        "description": "<p>En esta reunion platicaremos de los siguientes temas:</p> <p>David Alejandro Garcia Guevara<br/>* Introducción a Software Composition Analysis (SCA)</p> <p>Christian Fernando Agredano Herrera<br/>* SSH Port Forwarding &amp; SSH Tunneling</p> <p>Tambien nos pueden encontrar en:<br/>OWASP: <a href=\"https://owasp.org/www-chapter-aguascalientes/\" class=\"linkified\">https://owasp.org/www-chapter-aguascalientes/</a><br/>FB: <a href=\"https://www.facebook.com/OWASPAguascalientes/\" class=\"linkified\">https://www.facebook.com/OWASPAguascalientes/</a><br/>YT: <a href=\"https://www.youtube.com/channel/UC4EL3F0TTjFcdua3j74kzTw\" class=\"embedded\">https://www.youtube.com/channel/UC4EL3F0TTjFcdua3j74kzTw</a></p> "
    },
    {
        "group": "Bellingham",
        "repo": "www-chapter-bellingham",
        "name": "Virtual OWASP Bellingham first meeting",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/owasp-bellingham-chapter/events/281383573/",
        "timezone": "US/Pacific",
        "description": "<p>Hello folks,</p> <p>Please join us on November 18th at 6 PM for the inaugural meetup of Bellingham's brand new OWASP chapter. We'll talk about our plans for the Bellingham chapter as well as go over some upcoming events in the region and if you're working on something cool and would like to share we'd love to hear about it!</p> <p>Thank you and we'll see you soon.</p> "
    },
    {
        "group": "Boise",
        "repo": "www-chapter-boise",
        "name": "OWASP Boise - Security Incident Response - (Fall 2021 Meeting)",
        "date": "2021-10-27",
        "time": "12:00",
        "link": "https://www.meetup.com/owasp-boise/events/281570214/",
        "timezone": "US/Mountain",
        "description": "<p>The main focus of this meeting will be a presentation on security incident response and how to be prepared when the inevitable happens. The presentation will focus primarily on lessons learned from responding to real incidents and some of the things that can often only be learned from the \"heat of the moment\".</p> <p>Presentation put on by OWASP Boise chapter leaders.</p> "
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston November 2021 Meetup - Virtual Attendance",
        "date": "2021-11-11",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspboston/events/281596072/",
        "timezone": "US/Eastern",
        "description": "<p>More details to come, including a potential in-person option!</p> "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC",
        "date": "2021-11-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/279155585/",
        "timezone": "Europe/London",
        "description": "<p>We are looking to publish on @YouTube the recordings of our meetups. If you would like to be notified when we a new video is published, please feel free to subscribe on our channel at:<br/><a href=\"https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ\" class=\"embedded\">https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ</a></p> "
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Secure Code Warrior CTF",
        "date": "2021-10-28",
        "time": "12:00",
        "link": "https://www.meetup.com/Columbus-OWASP/events/281270826/",
        "timezone": "US/Eastern",
        "description": "<p> Secure Code Warrior Tournament + OWASP Columbus</p> <p> When: October 28th, 12:00PM ET<br/>October 30th, 5:00PM ET</p> <p>Secure Code Warrior brings you a defensive security-based tournament from a developer's perspective. The tournament allows you to test your skill against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability. You don’t need extensive programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but is also secure.</p> <p> You can find the tournament step-by-step guide here: <a href=\"https://youtu.be/o8XhKK_eOOs\" class=\"embedded\">https://youtu.be/o8XhKK_eOOs</a></p> <p>The tournament is run virtually so you can join through your laptop from the most convenient location and time. It should take only a few hours, drop-in as you see fit during the duration of the event to complete all the challenges and win prizes!</p> <p>Instructions for playing:<br/> 1) Register for the Secure Code Warrior platform here: <a href=\"https://discover.securecodewarrior.com/OWASPColumbus.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPColumbus.html</a><br/> 2) Check your email for the confirmation and access the unique link to create your profile.<br/> 3) Once logged in: click “Tournaments”<br/> 4) Join the OWASP Columbus Secure Coding Tournament</p> <p>The Secure Code Warrior platform will be open before and after the tournament, so feel free to practice in the “Training” tab.</p> <p> Monitor the live leaderboard to see how you're performing!</p> "
    },
    {
        "group": "Cork",
        "repo": "www-chapter-cork",
        "name": "Neurodiversity in Cyber Security",
        "date": "2021-11-03",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Cork/events/281395587/",
        "timezone": "Europe/Dublin",
        "description": "<p>Our next meetup is supporting HAYS and Genius Within's discussions around neurodiveristy as it applies to cybersecurity. An interesting and important topic which we are excited to hear more about.</p> <p>Expert speakers Daniel CM Browne (<a href=\"https://www.linkedin.com/in/dcmbrowne/\" class=\"linkified\">https://www.linkedin.com/in/dcmbrowne/</a>) and Jacqui Wallis (<a href=\"https://www.linkedin.com/in/jacquiwallis/\" class=\"linkified\">https://www.linkedin.com/in/jacquiwallis/</a>) talk openly about how businesses, business leaders, and all of us in the Cyber/Tech world can do more to attract, support, and retain Neurodiverse talent. We intend to have a thought-provoking conversation, that will hopefully drive some habitual changes and do more to support the neurodiverse community.</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP November Meeting",
        "date": "2021-11-09",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/280769873/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>What is an SBOM, why do I care, and how does my organization get started?</p> <p>Description:</p> <p>It’s nice to know what’s in the food on the shelf at the store so you can make an informed decision whether you should buy it. And when there are recalls of certain ingredients it’s nice to quickly know whether those ingredients are already in your cupboard. Software Bills of Materials enable you to know what’s in the software you consider procuring, and let you quickly know what’s already inside your organization. Of course, you can even use them to understand the risk in the portfolio of software your organization baked itself! Since the May Executive Order on Improving the Nation’s Cybersecurity SBOMs have gotten a lot more attention, but what does it really mean for an organization to make the most of this capability? This talk will help you prepare your organization for the near future when generating, evaluating, and leveraging SBOMs will be expected.</p> <p>Bio:</p> <p>Greg Mohler is a Manager within KPMG's Cyber Defense practice, and has spent the past four years helping over 20 clients solve difficult problems related to DevSecOps, Application Security, and Vulnerability Management. He is passionate about minimizing the distraction of security incidents so that businesses can focus on innovation, growth, and speed to market. Greg has led the delivery of services that not only uplift clients' technical capabilities, but also bolster security education &amp; culture.</p> <p>Caleb Queern is a Director in KPMG's Cyber practice and is based in Austin. He has more than 15 years of technology and information security experience. His focus is reducing risk and improving performance so organizations can meet business goals and enable growth. Caleb has lead engagements in technology companies, pharmaceutical companies, higher education, financial services, manufacturing, and others. His specialties include secure DevOps and application security, security operations, and operational excellence.</p> "
    },
    {
        "group": "Doha",
        "repo": "www-chapter-doha",
        "name": "Cyber Security Virtual Meetup Doha - \"Ransomware\" by Mr. Ashraf ",
        "date": "2021-10-27",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Doha-Chapter/events/281563016/",
        "timezone": "Asia/Qatar",
        "description": "<p>Announcing online information security meetup supported by the local information security community Doha, Qatar.</p> <p>Agenda &amp; Schedule for this meetup Dated 27/10/2021</p> <p>6:00 PM to 6:30 PM: \"Ransomware\" by Mr. Ashraf Aboukass<br/>6:30 PM to 6:45 PM: Questions &amp; answer session</p> <p>Topic: Ransomware<br/>Speaker: Mr. Ashraf Aboukass</p> <p>This event is free to attend for both members and non-members of (ISC)²/OWASP/Null and is open to anyone interested in information security and cybersecurity awareness. Please note that you MUST RSVP it will help us in organizing.</p> <p>As this will be a recurring event, we welcome as many paper submissions as possible, and reserve keeps interesting talk proposals for future editions.</p> <p>The talk proposal should abide by the (ISC)²/OWASP/Null principles: to promote and disseminate knowledge and tools in cybersecurity that respect its core values, openness, support for innovation, global reach, and integrity. The talks should be vendor-neutral, which is not publicity talks for a specific company or a proprietary tool, but about interesting experiences insecurity that can engage and foster discussion in the local community.</p> "
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Novembre 2021",
        "date": "2021-11-08",
        "time": "19:00",
        "link": "https://www.meetup.com/owasp-france/events/281564797/",
        "timezone": "Europe/Paris",
        "description": "<p>Vous l'attendiez? Et bien voici le meetup de la rentrée 2021 de l'OWASP France à Paris!<br/>Un peu en retard... Mais avec une surprise!<br/>Le prochain meetup aura lieu en physique.<br/>Nous serons accueilli par notre sponsor Total Energies que nous remerçions de leur soutien.</p> <p>Face à la situation sanitaire et aux conditions d'accès aux locaux, plusieurs conditions sont présentes:<br/>- Le meetup est limité à 20 personnes. Si vous avez un empechement, nous vous remerçions de bien vouloir libérer votre place au plus tôt pour qu'une autre personne en profite<br/>- Un passe sanitaire valable et une pièce d'identité vous seront demandés pour accéder à ce meetup<br/>- Un wifi est présent. Vous pourrez vous y connecter grâce à l'adresse email utilisée pour Meetup. Les comptes seront créés en avance. L'inscription se terminera donc le mercredi 3 novembre en fin de journee.</p> <p>OWASP Paris est le meetup dédié à la sécurité applicative. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.<br/>Ce meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!</p> <p>Lightning Talks:<br/>La soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.</p> <p>Workshop:<br/>La soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles</p> <p>Pour rappel, le meetup se veut non commercial.</p> <p>Le format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.</p> <p>L'agenda et le compte-rendu des précédents meetups est accessible ici: <a href=\"https://owasp.org/www-chapter-france/\" class=\"linkified\">https://owasp.org/www-chapter-france/</a></p> "
    },
    {
        "group": "Gwalior",
        "repo": "www-chapter-gwalior",
        "name": "Cyber-Security in Action",
        "date": "2021-10-24",
        "time": "09:00",
        "link": "https://www.meetup.com/OWASP-Gwalior-Chapter/events/281423250/",
        "timezone": "Asia/Calcutta",
        "description": "<p>The Cybersecurity in Action Gwalior meetup aims to bring like-minded people together in all areas of Cybersecurity and bring you some of the best insights from the top Cybersecurity professionals and technologists in Ireland.</p> <p>This group is for Cybersecurity professionals, academics and tech enthusiasts only.</p> <p>If you have any queries about the meetup or would like to give a presentation at our events, please PM organizer Sumit Ojha - sumit.ojha@owasp.org</p> "
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Q4 Meetup - Vuln Chaining",
        "date": "2021-10-28",
        "time": "19:00",
        "link": "https://www.meetup.com/indyowasp/events/280097107/",
        "timezone": "US/Eastern",
        "description": "<p>In AppSec, most people understand that context is everything when it comes to assigning risk. Certain factors and other vulnerabilities, when combined together, can increase the severity of a vulnerability. Defenders and bug hunters alike help organizations understand a more accurate threat landscape from experience, but it's not something that is well documented. Join Curtis as he discuses this gap and introduces some tools and new resources for vuln chaining.</p> <p>---</p> <p>Curtis is a Cybersecurity enthusiast with years of defensive and offensive experience. He's currently a Managing Security Consultant at GuidePoint Security where he helps lead tactical services on the Application Security team.</p> "
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Online meeting ",
        "date": "2021-11-08",
        "time": "18:45",
        "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/nnccjsyccpblb/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-11-22",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccpbdc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Kyiv",
        "repo": "www-chapter-kyiv",
        "name": "OWASP Kyiv Fall 2021 ONLINE Meetup",
        "date": "2021-10-30",
        "time": "10:00",
        "link": "https://www.meetup.com/kyiv-meetup-group/events/279752085/",
        "timezone": "Europe/Kiev",
        "description": "<p>The fourth OWASP Kyiv chapter meetup in 2021 will be held on October 30 in the online format. The attendance is free of charge.<br/>If you want to be a speaker or present your workshop, please feel free to fill the form here: <a href=\"https://cfp.owaspukraine.org/okfall2021/cfp\" class=\"linkified\">https://cfp.owaspukraine.org/okfall2021/cfp</a></p> "
    },
    {
        "group": "Leeds Uk",
        "repo": "www-chapter-leeds-uk",
        "name": "November OWASP meet ",
        "date": "2021-11-10",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Leeds-Chapter/events/281093548/",
        "timezone": "Europe/London",
        "description": "<p>After the recent success of the re-booted Leeds Chapter, we've decided to do another!</p> <p>Speakers TBA and if you'd like to speak - please get in touch.</p> <p>See you there, drinks and nibbles will be provided</p> "
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly Virtual Meeting - OCT 27, 2021",
        "date": "2021-10-27",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Los-Angeles/events/278725579/",
        "timezone": "US/Pacific",
        "description": "<p>Come join us as we hear the monthly presentation by Aaron Guzman, Head of Product &amp; Application Security with Cisco Meraki</p> <p>TOPIC: OWASP &amp; CSA IoT: Impacting Medical Security</p> <p>ABSTRACT: The Open Web Application Security Project (OWASP) IoT Project is designed to help manufacturers, developers, and consumers better understand the security issues associated with the Internet of Things as well as enable users in any context to make better security decisions when building, deploying, or assessing IoT technologies. Similarly, CSA's IoT Working group is dedicated to understanding IoT deployments and defining actionable guidance to secure ecosystems. Their efforts are often used to develop medical security guidelines for developers and manufacturers alike but also to influence IoT security assessment methodologies for later use on commercial IoT certification schemes. This session will provide insights into current project initiatives, including those that directly impact medical devices and how you can save lives by getting involved.</p> <p>BIO: Aaron Guzman is a published author and a technical reviewer for several security books. He is the Head of Product &amp; Application Security with Cisco Meraki where he focuses on building security into enterprise IoT products and crafting designs that keep users safe from compromise. Aaron spearheads many open-source initiatives, raising awareness about IoT hacking and proactive defensive strategies under OWASP’s IoT and Embedded Application Security projects. A co-chair of Cloud Security Alliance’s IoT Working Group, he has extensive public speaking experience delivering conference presentations, training, and workshops globally. Follow Aaron on Twitter @scriptingxss.</p> <p>Meeting info will be available on meetup - BE SURE TO RSVP to access the link</p> <p>ATTENTION SPONSORS: YOUR NAME COULD BE HERE<br/>Check out sponsorship opportunities here<br/><a href=\"https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471\" class=\"linkified\">https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471</a></p> "
    },
    {
        "group": "Luxembourg",
        "repo": "www-chapter-luxembourg",
        "name": "OWASP Luxembourg Chapter - Meeting#2 - OWASP Top 10:2021 Overview",
        "date": "2021-10-27",
        "time": "17:30",
        "link": "https://www.meetup.com/owasp-luxembourg-group/events/281144615/",
        "timezone": "Europe/Luxembourg",
        "description": "<p>Description of the talk:<br/>Learn about the new OWASP Top 10:2021 that was released in September, 2021. This talk will walk through the process we used to build the new Top 10 and provide a brief overview of each of the risk categories in this updated list. Hear how the OWASP Top 10:2021 can fit into your organization and provide a baseline for secure development.</p> <p>About the speaker:<br/>Brian Glas, OWASP Top Ten Leader | Assistant Professor Of Computer Science, Union University Brian has over 20 years of experience in various roles in IT and over a decade and a half of that in application development and security. His day job is serving as an Assistant Professor teaching a full load of Computer Science and Cybersecurity classes at Union University. He helped build FedEx's AppSec team, worked on the Trustworthy Computing team at Microsoft, consulted on software security for years, and served as a project lead and active contributor for SAMM v1.1-2.0+ and OWASP Top 10 2017 and 2021. Brian is a contributor to the RABET-V Pilot Program. He holds several Cybersecurity and IT certifications and is currently working on his Doctor of Computer Science in Cybersecurity and Information Assurance.</p> <p>Who should attend?<br/>Both existing OWASP members and people unfamiliar with OWASP. Information security practitioners of all levels, IT professionals, and business leaders. Developers, development managers, product owners, QA professionals, program managers, and anyone involved in building software, etc.</p> "
    },
    {
        "group": "Manchester Nh",
        "repo": "www-chapter-manchester-nh",
        "name": "OWASP Manchester, New Hampshire Chapter Meeting - October 2021",
        "date": "2021-10-27",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Manchester-NH/events/281248223/",
        "timezone": "US/Eastern",
        "description": "<p>Join us for an informal discussion around operational Vulnerability Management, and OpenVAS, an open source VM scanner. Moving this to October 27th around the Red Sox Game 5.</p> <p>Video call link: <a href=\"https://meet.google.com/fev-ouxk-nnd\" class=\"linkified\">https://meet.google.com/fev-ouxk-nnd</a><br/>Or dial: ‪(US) +1 319-382-9461‬ PIN: ‪621 952 993‬#</p> "
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "October 2021 OWASP Chapter Netherlands Meetup",
        "date": "2021-10-28",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Chapter-Netherlands-Meetup/events/281228990/",
        "timezone": "Europe/Amsterdam",
        "description": "<p>19:00 - 19:15 Welcome<br/>19:15 - 20:00 Our Secrets Management Journey: From Code to Vault by Jeroen Willemsen<br/>20:00 - 20:15 Break<br/>20:15 - 21:00 Doing Security in DevOps, the right way! by Irfaan Santoe</p> <p>Our Secrets Management Journey: From Code to Vault</p> <p>So you have an access key that you need to store somewhere. Maybe it is better not to put it in your code, nor in your container. But what about Kubernetes? What about a custom secrets storage solution? Of course, we tried many, sometimes funny, things to get our secrets secured. And luckily we ended up with a combination of safe methods, with Vault at its core. Want to know more? Join us, as we will go through various examples and their challenges!</p> <p>Jeroen Willemsen is a Principal Security Architect at Xebia and a jack of all trades in security. He loves to develop new software, set up DevSecOps support tooling, and help companies with security programs. He enjoys sharing knowledge, which is why he published articles, blogs and gave trainings and talks about various subjects.</p> <p>Doing Security in DevOps, the right way!</p> <p>Automation is not DevSecOps, but without automation there is no DevSecOps! Secret management, SAST, DAST, Pen Testing, Container Security, Secure Config Management etc. are about automating security. But let me ask you, can one reach nirvana in securing DevOps with solely automation? This talk will address ALL dimensions required for doing security in DevOps, so we get it right!</p> <p>Irfaan Santoe is a Global Security Director at Wolters Kluwer advising the Business &amp; IT on the information security ambition &amp; implementation. Prior to Wolters Kluwer, Irfaan was the Global Head of Security Engineering at ABN AMRO bank and lead the security implementation of ABN AMRO’s IT transformation towards DevOps. This transformation program is set to uplift more than 500+ Dev-teams to become DevOps and increasing security without breaking DevOps! Irfaan is a Master in Computer Science (a programmer by heart) and is fascinated by the Inner Science of Yoga &amp; Meditation.</p> "
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Filipi Pires",
        "date": "2021-11-18",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/281288393/",
        "timezone": "US/Eastern",
        "description": "<p>Filipi Pires (@FilipiPires) will present on \"Keep your code safe during the development path using Opensource tools.\"</p> <p>Abstract:</p> <p>Practical demonstration of how a Developer can use a SAST tool for static analysis in code vulnerability, executing it in source code, byte code and/or binary and identifying security holes during the development process, analyzing many languages and codes.<br/>The ecosystem will have the opportunity to know about an open source tool that orchestrates other security tools and identifies security flaws or vulnerabilities in projects and put all results in a database for analysis and generation of metrics, working this analysis with select the languages ​​and/or tools to be used on the project based on the available stack.<br/>These languages and tools are: Python, Ruby, Javascript/Typescript, GoLang, C#, Java, Kotlin, Kubernetes, Terraform, some Leaks, Leaks(optional search in git history), PHP, C, HTML, JSON, Shell Script and Elixir, it being done in source code, byte code or binary, finding “Leaks\" checks the source code for possible leaks of credentials, private keys or hard coded passwords and analyze the project’s dependencies to check for vulnerabilities in third-party libraries. in third-party libraries.</p> <p><a href=\"https://horusec.io\" class=\"linkified\">https://horusec.io</a><br/><a href=\"https://docs.horusec.io\" class=\"linkified\">https://docs.horusec.io</a></p> <p>Similar presentations:<br/><a href=\"https://www.youtube.com/watch?v=ZIY0Wf6QUdY\" class=\"embedded\">https://www.youtube.com/watch?v=ZIY0Wf6QUdY</a> - (D.C. Cybersecurity Professionals – 2021)<br/><a href=\"https://www.youtube.com/watch?v=no5iUdRd64g\" class=\"embedded\">https://www.youtube.com/watch?v=no5iUdRd64g</a> - (RTV 2021 - Learning Thrusday)</p> "
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "(Alert Level 1 permitting) The new OWASP Top 10 Web Application Security Risks",
        "date": "2021-11-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-Zealand-Chapter-Christchurch/events/281034378/",
        "timezone": "Pacific/Auckland",
        "description": "<p>Important! Traction on Demand (formerly Trineo) is not hosting events under Alert Level 2, so this is a tentative placeholder for the next meetup. Details to be added soon…</p> "
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Making the New OWASP Top 10 List",
        "date": "2021-11-04",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/281550694/",
        "timezone": "US/Eastern",
        "description": "<p>Bio:<br/>Brian has over 20 years of experience in various roles in IT and over a decade and a half of that in application development and security. His day job is serving as an Assistant Professor teaching a full load of Computer Science and Cybersecurity classes at Union University. He helped build FedEx's AppSec team, worked on the Trustworthy Computing team at Microsoft, consulted on software security for years, and served as a project lead and active contributor for SAMM v1.1-2.0+ and OWASP Top 10 2017 and 2021. Brian is a contributor to the RABET-V Pilot Program. He holds several Cybersecurity and IT certifications and is currently working on his Doctor of Computer Science in Cybersecurity and Information Assurance.</p> <p>Abstract:<br/>Ever wonder how the bread is made? We'll take you back into the kitchen so you can see how the Top 10:2021 was made. We'll walk through the process of which decisions were made and why. Covering data collection, survey, data analysis, categorization, drafts, reviews, and the released product. This talk is not about what's in the Top 10, this talk is about what went into making the Top 10:2021 and some insights the data can tell us outside of the Top 10.</p> "
    },
    {
        "group": "Omaha",
        "repo": "www-chapter-omaha",
        "name": "Q4 Meeting: Securing your Applications with the OWASP ASVS",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspomaha-meetup-group/events/280673562/",
        "timezone": "US/Central",
        "description": "<p>Michael Born, Director of Security Consulting at SecureSky, Inc. will walk the audience through how to employ the OWASP Application Security Verification Standard to harden modern applications. This presentation will also provide guidance for deploying applications in Microsoft Azure that comply with the OWASP ASVS.</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Analyzing source code for vulnerabilities: A how-to workshop",
        "date": "2021-11-18",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-OC/events/281234132/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Vickie Li, Developer Evangelist, ShiftLeft</p> <p>Topic: Analyzing source code for vulnerabilities: A how-to workshop</p> <p>Live stream: <a href=\"https://www.twitch.tv/owaspoc\" class=\"linkified\">https://www.twitch.tv/owaspoc</a></p> <p>Abstract and workshop preparation guide:<br/>Writing code is hard. Writing secure code is even harder. Serious security vulnerabilities often stem from small programming mistakes. As developers, we can safeguard our applications by catching these mistakes in our own code.</p> <p>Performing a source code review is one of the best ways to find security issues in code. But how do you do it? In this workshop, we will first go through the basics of how to review your code for vulnerabilities and some tactics for performing an effective security code review on your application.</p> <p>But the process of manually analyzing code for vulnerabilities can be very time-consuming. In the second part of this talk, we will also talk about how to use the interactive code analysis tool Joern to make code analysis more efficient. How do you effectively trace user input in code? How can you efficiently link bug sources to sensitive sink functions? If you’d like to follow along, here is what you need to get ready.</p> <p>Joern is open-sourced, download Joern and install:<br/>$ wget <a href=\"https://github.com/joernio/joern/releases/latest/download/joern-install.sh\" class=\"linkified\">https://github.com/joernio/joern/releases/latest/download/joern-install.sh</a><br/>$ chmod +x ./joern-install.sh<br/>$ sudo ./joern-install.sh</p> <p>If you need help here are some important links:<br/>Joern Community: <a href=\"https://discord.gg/ff3ahcFrJq\" class=\"linkified\">https://discord.gg/ff3ahcFrJq</a><br/>Joern Documentation: <a href=\"https://docs.joern.io\" class=\"linkified\">https://docs.joern.io</a><br/>Joern query database: <a href=\"https://queries.joern.io\" class=\"linkified\">https://queries.joern.io</a></p> <p>Speaker Bio:<br/>Vickie Li is the resident developer evangelist at ShiftLeft. She is an experienced web developer with an avid interest in security research. She can be found on <a href=\"https://vickieli.dev\" class=\"linkified\">https://vickieli.dev</a>, where she blogs about security news, techniques, and her latest bug bounty findings. She also hosts “Security Simplified”, a developer education series focusing on web security: <a href=\"https://www.youtube.com/c/vickielidev\" class=\"embedded\">https://www.youtube.com/c/vickielidev</a>.</p> <p>Twitter: @vickieli7<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/vickie-li-103a35b8\" class=\"linkified\">https://www.linkedin.com/in/vickie-li-103a35b8</a></p> <p>--------------------------------------------------------------------------------------<br/>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "Virtual Happy Hour - OWASP Sacramento October Meetup",
        "date": "2021-10-28",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/281403542/",
        "timezone": "US/Pacific",
        "description": "<p>Agenda:<br/>- Community Topics<br/>- Main Topic: Virtual happy hour, open format. Grab yourself your favorite drink, maybe an appetizer and let's chat about security, the chapter, and whatever else comes up.</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "Monthly Meeting",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccpbxb/",
        "timezone": "US/Pacific",
        "description": "<p>Monthly OWASP meeting</p> "
    },
    {
        "group": "San Jose",
        "repo": "www-chapter-san-jose",
        "name": "OWASP Top 10 - 2021",
        "date": "2021-10-28",
        "time": "19:00",
        "link": "https://www.meetup.com/owasp-san-jose-cr/events/281601602/",
        "timezone": "America/Costa_Rica",
        "description": "<p>Por Mario Robles, CEO de WhiteJaguars Cyber Security.</p> <p>Todo lo que necesita saber sobre OWASP Top 10 - 2021.</p> "
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2021-11-10",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Seattle-Chapter/events/pfhhqsyccpbnb/",
        "timezone": "US/Pacific",
        "description": "<p>At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.</p> <p>Suggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.</p> <p>Slack @ #chapter-seattle (<a href=\"https://bit.ly/owasp-seattle-slack\" class=\"linkified\">https://bit.ly/owasp-seattle-slack</a>)</p> <p>seattle-chapter@owasp.org (<a href=\"https://groups.google.com/a/owasp.org/g/seattle-chapter\" class=\"linkified\">https://groups.google.com/a/owasp.org/g/seattle-chapter</a>)</p> "
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": "OWASP Seoul Conference 2021",
        "date": "2021-11-17",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Seoul/events/280484529/",
        "timezone": "Asia/Seoul",
        "description": "<p>OWASP Seoul Chapter  AIOT    \"AIoT  /  \"  \"OWASP SEOUL CONFERENCE 2021\"  .       .</p> <p>The OWASP Seoul Chapter will hold the \"OWASP SEOUL CONFERENCE 2021\" event under the theme of \"Security of AIoT Convergence Products/Services\" to improve AIOT security at home and abroad.<br/>We hope that many of you who are interested in the event will participate.</p> <p>&lt; Event Overview &gt;<br/>- When : 2021.11.17(Wed) 19:00 ~ 21:00, KST<br/>- Where : Zoom (<a href=\"https://url.kr/pn52f6\" class=\"linkified\">https://url.kr/pn52f6</a>)<br/>- Target :  AIOT     <br/>Anyone interested in AIOT security at home and abroad</p> <p>&lt; Event Program &gt;<br/>#1 : IoT     <br/>- ()   (DualAuth Jonghyun Woo CEO)</p> <p>#2 : 5G    (Security Threats in 5G Edge Environments)<br/>-    (ETRI Youngsoo Kim Principal Researcher)</p> <p>#3 : IoT       <br/>-    (KISA Sanggeol Lee Principal Researcher)</p> <p>#4 : IoT     (IoT Software Supply Chain Attack)<br/>-  : Checkmarx Korea   (Greg Song Korea Country Manager)</p> <p>       .</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney - Fun with Hack the Box",
        "date": "2021-11-11",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/279765803/",
        "timezone": "Australia/Sydney",
        "description": "<p>Please join us to play/train in Hack The Box (HTB), what you need is a Hack the Box account, free is cool, join us in discord (link <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a>) - FC-Announcements-Voice Channel, please ensure, after registration in Discord you go to the Bot and accept the Code of Conduct, otherwise, you won't be able to access the channels.</p> <p>There is no format to this night, we just want to get together to have some fun playing some battlegrounds, doing some of the machines or challenges; having fun overall!</p> <p>Please make sure you know the basics about HTB, eg. how to connect to the HTB VPN and that you have a valid account.</p> "
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "November Event - OWASP Threat Dragon | Why won't you take likelihood seriously?",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Toronto/events/281510935/",
        "timezone": "Canada/Eastern",
        "description": "<p>LIGHTNING TALK<br/>------------------------</p> <p>OWASP Threat Dragon, A modern threat modeling tool, done right.</p> <p>Summary:</p> <p>OWASP Threat Dragon is a threat modeling tool used to create threat model diagrams as part of a secure development lifecycle. Come to this talk for a brief overview of the project, how it works, and how you can contribute!</p> <p>Presenter:</p> <p>I am Matthew McCarty, an application security engineer currently working for Coinsquare in Toronto. I am passionate about security and ensuring users of all kinds can safely and securely use the applications they want without worry! (a little cheesy I know)</p> <p>TALK<br/>-------</p> <p>Why won't you just take likelihood seriously?</p> <p>Summary:</p> <p>Andrew has worked in infosec long enough to have seen and written many good and bad reports, and there's a few trends that are slowly driving him insane. Andrew hopes that his screaming in his talk, \"Failure to Report: A Semi-Structured Rant on What's Wrong with Vulnerability Assessment Reporting\" will help banish some bad practices to the land of wind and ghosts, never to be seen again. Or at least it will make him feel better.</p> <p>Presenter:</p> <p>Andrew Turnsek is a Senior Security Consultant at Security Compass and has been primarily working in penetration testing and vulnerability assessment since 2013, with brief stops in threat intelligence, security architecture review, and as a \"BS Detector\" for auditing teams. He can be found at security conferences and hockey games, usually wearing a Marlies hat.</p> "
    },
    {
        "group": "University Of Washington",
        "repo": "www-chapter-university-of-washington",
        "name": "Cybersecurity Career in pandemic and post-pandemic environment",
        "date": "2021-10-28",
        "time": "14:30",
        "link": "https://www.meetup.com/owasp-university-of-washington-meetup-group/events/281365340/",
        "timezone": "US/Pacific",
        "description": "<p>We will discuss Cybersecurity career opportunities in the pandemic and post-pandemic environment.<br/>Speaker: TBD</p> "
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "November 2021 Threat Modelling Virtual Workshop",
        "date": "2021-11-23",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/281402288/",
        "timezone": "Canada/Pacific",
        "description": "<p>The OWASP Victoria chapter is proud to present our next quarterly event. Jeevan Singh will be delivering a talk with an accompanying workshop on Threat Modelling 101.</p> <p>The event will be held on November 23 from 5:30 pm to 8:00 pm PT.</p> <p>This event will feature Jeevan’s talk followed by a Q&amp;A, workshop, and a draw for a prize (must be a registered member and reside in Canada). Join us for an evening of threat modelling!</p> <p>Visit our OWASP Chapter to learn more about us at:<br/><a href=\"https://owasp.org/www-chapter-victoria/\" class=\"linkified\">https://owasp.org/www-chapter-victoria/</a></p> <p>Speaker: Jeevan Singh<br/>Presentation: Talk, Q&amp;A, and accompanying workshop</p> <p>Event Details:</p> <p>Threat Modelling is a great way to discover and remediate threats in your system before they are even created. Security professionals commonly perform it, but anyone can do threat modelling. This hands-on workshop will cover the threat modelling workflow, common classes of vulnerabilities, and hands-on examples that will have *you* discover threats in different systems. Threat Modelling is an integral part of every company’s Security Development Lifecycle. Still, as development teams grow more prominent, security will have to choose which features they want to Threat Model, or they will become a bottleneck for the development organization.</p> <p>Speaker Biography:</p> <p>Jeevan Singh is an Application Security Engineering Manager for Twilio Segment (<a href=\"https://segment.com\" class=\"linkified\">https://segment.com</a>), where he is embedding security into all aspects of the software development process. Jeevan enjoys building a security culture within organizations and educating staff on security best practices. Jeevan is responsible for a wide variety of tasks, including architecting security solutions, working with development teams to resolve security vulnerabilities, and building out security features. Before life in the security space, Jeevan had a wide variety of development and leadership roles over the past 15 years.</p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Cloud Security Tooling for the Sole Practitioner",
        "date": "2021-10-24",
        "time": "10:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/276120026/",
        "timezone": "Canada/Eastern",
        "description": "<p>***RAFFLE***<br/>Attend this episode live and get a chance to win the AWS certification exam voucher of your choice!<br/>***RAFFLE***</p> <p>You're the sole practitioner of cloud security at your organization. You're happy to get your hands dirty in your cloud environment use some tools to lock things down, but it seems like there are new cloud security tools coming out every week. Where do you start? How do you prioritize which ones will have the most impact upfront?</p> <p>In this show, Kinnaird McQuade, Lead Security Engineer at Salesforce will go over what sole practitioners need to build out their own \"lean but mean\" cloud security toolkit.</p> <p>KINNAIRD McQUADE</p> <p>Kinnaird McQuade is a Lead Security Engineer at Salesforce, where he specializes in building, breaking, and automating security controls in cloud infrastructure and CI/CD. Kinnaird is the author of several cloud security tools - Cloudsplaining and Policy Sentry among them - and is passionate about making security easy via automation. You can find him on kmcquade.com (<a href=\"http://kmcquade.com/\" class=\"linkified\">http://kmcquade.com/</a>) and on Twitter @kmcquade3.</p> "
    }
]