[
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "2. OWASP Augsburg Stammtisch",
        "date": "2024-05-29",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/300790684",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda**\n\n* *Vortrag:* **<- WIR SUCHEN NOCH VORTRAGENDE!**\n* Austausch & Networking\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "June 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-06-13",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299655980",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, June 13th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Checkmarx](https://checkmarx.com)\n*Checkmarx is constantly pushing the boundaries of Application Security Testing to make security seamless and simple for the world’s developers and security teams. As the AppSec testing leader, we deliver the unparalleled accuracy, coverage, visibility, and guidance our customers need to build tomorrow’s software securely and at speed.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-06",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301085528",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-05-30",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/300947621",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2024 (Online)",
        "date": "2024-05-28",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207005",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nPresentation: **Digital Deceit and AI Hallucinations: Safeguarding the Software Supply Chain**\n\nThe presentation unites Tyler Agypt's expertise in a riveting exploration of software supply chain threats, spanning traditional dangers to the novel challenge of AI Package Hallucination. Agypt, VP of Global Enablement at Checkmarx, exposes the hidden risks in software dependencies and the emerging threat of artificially generated, nonexistent code packages. Through real-world examples and insights from over 1 million malicious packages, he reveals the deceptive practices endangering our digital ecosystem, from Dependency Confusion to Star-Jacking to Repo-Jacking.\nAgypt advocates for robust defensive strategies, tools and improved dependency management, to counteract these threats. This presentation is a call to action for the developer and cybersecurity community to elevate their vigilance and adopt a proactive stance against the evolving challenges in software supply chain security. Join this enlightening session for a comprehensive understanding of both traditional and AI-induced vulnerabilities, and equip yourself to better face tomorrow's cybersecurity challenges.\n\n**Speaker: Tyler Agypt**\n\nTo RSVP for the in-person meeting at NI/Emerson, please see [https://owasp-austin-2024-may-g1.eventbrite.com](https://owasp-austin-2024-may-g1.eventbrite.com)"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-05-23",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/300808636",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combined Bangalore  Meet 25 May 2024",
        "date": "2024-05-25",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/301096225",
        "timezone": "Asia/Kolkata",
        "description": "Join us at the Null/OWASP Combined Meet in Bangalore on Saturday, May 25, 2024, from 09:30 AM to 02:30 PM at Tekion India Pvt Ltd, Bagamane Solarium City. This free event offers a platform for cybersecurity enthusiasts to learn and share knowledge through sessions including IoS Pentesting by Abida Shariff, Zeroclicks Everywhere by Mr-IoT, AD Pentesting by Surya Dev Singh, a Practical Approach to OWASP Machine Learning Top 10 by Rallapalli Nagarjun, and Microprobing with ICEBite by Karthik Ekanathan. Network with peers, engage in enriching discussions, and enhance your cybersecurity skills at this dynamic gathering. No registration fees are required; just bring an open mind and a willingness to learn!\n\n### Session Schedule\n\n| Name | Speaker | Start Time | End Time | Resources |\n| ---- | ------- | ---------- | -------- | --------- |\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM | |\n| [IoS Pentesting](https://null.community/event_sessions/4272-ios-pentesting) | [abida shariff](https://null.community/profile/38340-abida-shariff) | 09:40 AM | 10:10 AM | |\n| **Introduction** | 10:10 AM | 10:25 AM | |\n| [Zeroclicks Everywhere](https://null.community/event_sessions/4274-zeroclicks-everywhere) | [Mr-IoT](https://null.community/profile/3556-mr-iot) | 10:25 AM | 11:15 AM | |\n| [AD Pentesting](https://null.community/event_sessions/4275-ad-pentesting) | [Surya Dev Singh](https://null.community/profile/43956-surya-dev-singh) | 11:15 AM | 12:05 PM | |\n| **Networking Session + Break** | 12:05 PM | 12:30 PM | |\n| [Practical Approach to OWASP Machine Learning Top 10](https://null.community/event_sessions/4277-practical-approach-to-owasp-machine-learning-top-10) | [Rallapalli Nagarjun](https://null.community/profile/37824-rallapalli-nagarjun) | 12:30 PM | 01:20 PM | |\n| [Microprobing with ICEBite](https://null.community/event_sessions/4278-microprobing-with-icebite) | [Karthik Ekanathan](https://null.community/profile/32567-karthik-ekanathan) | 01:20 PM | 02:10 PM | |\n| **Feedback + Next Month’s Planning** | 02:10 PM | 02:30 PM |"
    },
    {
        "group": "Beja",
        "repo": "www-chapter-beja",
        "name": "0x01 Securing the Web",
        "date": "2024-05-23",
        "time": "14:30+01:00",
        "link": "https://www.meetup.com/owasp-beja-chapter/events/300539527",
        "timezone": "Europe/Lisbon",
        "description": "Securing the Web is the second meetup of OWASP Beja chapter which will be held on May 23rd, 2024, at 14:30 sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**.\n\n**Schedule**\n\n14:30 - **Welcome Notes** by OWASP Beja chapter leadership team\n14:35 - **Purple Team Approach Towards Confluence RCE** by Paulo Viegas\n15:00 - **Newton's Third Law: Static vs. Dynamic Abusers** by Diogo Sousa\n16:00 - **Snacks & Drinks** sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**\n\n**Talks**\n\n**Purple Team approach towards Confluence RCE**\nby Paulo Viegas, Threat Detection Analyst @ Siemens\n\nTalk about the value of collaboration between the red and blue team with a practical example.\n\n**About the Speaker**\nCurious Blue Teamer with special taste for malware and forensics.\n\n\\-\\-\\-\n\n**Newton's Third Law: Static vs. Dynamic Abusers**\nby Diogo Sousa, Engineering Manager @ Canonical\n\nIf you offer a service on the web, odds are that someone will abuse it. Be it an API, a SaaS, a PaaS, or even a static website, someone somewhere will try to figure out a way to use it to their own needs. In this talk we'll compare measures that are effective against static attackers and how to battle a dynamic attacker who adapts to your counter-measures.\n\n**About the Speaker**\nAn opinionated individual with an interest in cryptography and its intersection with secure software development."
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "C3 Dev Festival - the contemporary software engineering and design festival",
        "date": "2024-06-14",
        "time": "08:00+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/300841713",
        "timezone": "Europe/London",
        "description": "OWASP Belfast is pleased to announce the C3, a contemporary software engineering & design festival!\n\n**With 3 free tickets, we'll run a draw on May 20th among all who comment on this post!**\n\nCode, career, creativity\n12 artists & 30 speakers\nSpeed Networking\n& many more\n\n**#Amsterdam, June 14-15, 2024 → https://c3fest.com**\n\nСonference announcement:\n\nCheck out the C3, a contemporary software engineering & design festival, organized by GitNation!\n\nIt is set to be one of the most vibrant festivals, blending technology, design, art, and music. It's a global gathering of tech enthusiasts in the beautiful city of Amsterdam!\n\nExcept for the 40 + speaker talks, the festival includes workshops, icebreaker activities, a game tournament, a pre-party, discussion rooms, a digital art exhibition, and a night party featuring 18+ DJs, musicians & creative coders on Techno/House, Algorave/Experimental, Night Cinema/Karaoke Hall stages\n\nAmongawesome first confirmed artists & speakers:\n\n• Rival Consoles, London-based critically acclaimed electronic music producer presenting a brand new unique performance that will take the form of an immersive audio-visual experience\n• Sam Aaron, key figure in algorave movement\n• Saskia Freeke, Creative coder, interaction designer, visual designer and educator\n• Christian Heilmann, Author of the Developer Advocacy Handbook\n& more\n\nExplore more about C3 and grab your ticket → https://c3fest.com/"
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE Chapter Meeting (21/05/2024, Brussels)",
        "date": "2024-05-21",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/300566355",
        "timezone": "Europe/Brussels",
        "description": "On May 21st, we organize our next OWASP Belgium chapter meeting at BeCentral (Brussels), by the courtesy of Proximus-ADA.\n\n**Agenda**:\n\n* 18h00-18h30: Welcome and refreshments\n* 18h30-18h40: **OWASP Update**\n18h40-19h30: **[User Privacy in Online Location-Based Services](https://owasp.org/www-chapter-belgium/#user-privacy-in-online-location-based-services---victor-lepochat-and-karel-dhondt-distrinet---ku-leuven)** (by Victor LePochat and Karel Dhondt, KU Leuven-Distrinet)\n19h30-19h45: Break\n19:45-20h35: **[Signaling New Frontiers: SS7 Insights by Jeremy Schmidt (Proximus ADA)](https://owasp.org/www-chapter-belgium/#signaling-new-frontiers-ss7-insights---jeremy-schmidt-proximus-ada)** (by Jeremy Schmidt, Proximus ADA)\n21:00: Close\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Bham Chapter Meetup May 2024!",
        "date": "2024-05-23",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/300370233",
        "timezone": "Europe/London",
        "description": "Welcome from OWASP Birmingham our first Meetup of 2024\n\nOnce again we'll be @Hays at One Colmore Square Thursday 23rd May for two great Infosec talks\n\n5.45pm - Doors open\n6.15pm - Welcome and Food\n6.30pm - \"**Post-Quantum Cryptography**\"\n\nSpeaker: Charlie Anglin\n\nSynopsis : Quantum computers are here and research is advancing every day. Boffins tell us that the rise of quantum computing will soon make our current encryption algorithms irrelevant. This talk aims to cover questions such as:\n\n· What are the facts?\n· What's being done to produce quantum-safe cryptography?\n· What can we expect to happen in the next few years?\n· What actions, if any, should we be taking?\n\nSpeaker Bio:\nCharlie is an engineer at Capgemini. He's spent the last 8 years in a number of roles, in particular as a security engineer and as a developer across multiple languages.\n\n7.15pm - Break\n7.30pm - \"**Practical Security Testing for E-Commerce and Payment Applications**\"\n\nSpeaker: Soroush Dalili\n\nSynopsis: This talk aims to deepen the audience's understanding of security challenges in e-commerce and payment applications and to introduce a practical testing methodology. We will detail specific vulnerabilities and demonstrate how to test for race conditions using tools like Burp Suite and Turbo Intruder. Additionally, if time permits, we will explore intriguing cases where simple arithmetic operations lead to unexpected security outcomes.\n\nSpeaker Bio:\nSoroush, the founder and director of SecProject, is a distinguished expert in web application security with over 15 years of experience specialising in vulnerability discovery, security source code review, and penetration testing. Before establishing his own company, he served as a principal security consultant at MDSec and NCC Group. He has contributed numerous security advisories to industry giants such as Microsoft, Mozilla, Adobe, Yahoo, and Facebook. Soroush's expertise has been showcased through speaking engagements at security conferences and events, including AppSec EU, SteelCon, BSides Manchester, and HackPra.\n\n8.15pm - Questions/Any Other Business\n8.30pm - Close\n\nRSVP when you get a chance so we can plan accordingly. We look forward to catching up with you all next month!"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - June 2024",
        "date": "2024-06-12",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owaspboston/events/301105296",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Lindsay Kaye as our presenter. Lindsay will be giving her presentation an Overview of the PROXYLIB Campaign.\n\nIn May 2023, we identified a cluster of VPN apps available on the Google Play Store that transformed the user’s device into a proxy node without their knowledge. We’ve dubbed this operation PROXYLIB. Other researchers identified this malicious behavior in a single free VPN application—Oko VPN— which resulted in the app's removal from the Play Store. Based on further analysis of Oko VPN, Satori researchers uncovered 27 additional applications related to PROXYLIB. These apps shared a common native library, written in Golang, that enrolls the device as a proxy node. This talk will provide a high-level overview of the PROXYLIB Android malware and take the listener through the changes we observed in response to defenders’ actions.\n\nLindsay Kaye is the Vice President of Threat Intelligence at HUMAN Security. Her technical specialty spans the fields of malware analysis and reverse engineering, with a keen interest in dissecting custom cryptographic systems. Lindsay is an internationally-recognized cybersecurity speaker and author. Lindsay holds a BS in Engineering with a Concentration in Computing from Olin College of Engineering and an MBA from Babson College."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Interactive cyber crisis simulation, at Immersive Labs",
        "date": "2024-05-21",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/300831085",
        "timezone": "Europe/London",
        "description": "Immersive Labs invites you to participate in an interactive cyber crisis simulation.\n\nYou will make key decisions that could lead to mitigation and containment of the crisis or management of the fallout and potential reputational damage. You will play the role of a boardroom as you seek to make quick decisions during a cyber crisis. Attendees are encouraged to participate using their mobile phones during the session and our Head of AppSec will discuss your decisions at each stage and feedback on how you performed as a group. This is a fun session to creates discussion but also equips you with some decision making skills you can take back into the workplace.\n\n\\-\\-\\-\n\n**Directions:**\nIn-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.\n\nTo find the entrance, it might be easier to search for \"Programme, Bristol, BS1 2NB\", or use this link to [Google Maps](https://www.google.com/maps/?q=51.455666,-2.592341).\n\n**Venue:**\nPhoto shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard)."
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland - Meet and Greet",
        "date": "2024-06-05",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/300914168",
        "timezone": "America/New_York",
        "description": "OWASP Cleveland is back! We're starting off with a meet & greet where we can get to know one another, gauge our community's areas of interest, and start planning our roadmap for the rest of the year.\n\n**Agenda:**\n\n* Introductions\n* Community roundtable: which AppSec topics and OWASP projects most interest you?\n* Planning for upcoming events\n\nJoin us at Market Avenue Wine Bar in Ohio City! Check them out here: [https://marketavenuewinebar.com/](https://marketavenuewinebar.com/)\n\n**About OWASP**\nThe Open Worldwide Application Security Project (OWASP) is a nonprofit foundation that works to improve the security of software. Our programming includes:\n\n* Community-led open source projects including code, documentation, and standards\n* Over 250+ local chapters worldwide\n* Tens of thousands of members\n* Industry-leading educational and training conferences\n\nEveryone is free to participate in OWASP and all of our materials are available under a free and open software license. Learn more about the OWASP Foundation and our work: [https://owasp.org/about/](https://owasp.org/about/)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS May 2024",
        "date": "2024-05-30",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/300804464",
        "timezone": "America/Denver",
        "description": "Speaker: Ben Struebing; \"The Summit Awaits: Are you ready the Purple Ascent?\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A Night of Honeypots and Information flow security",
        "date": "2024-05-23",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/300776505",
        "timezone": "Europe/Copenhagen",
        "description": "**Can we outsmart the adversaries? (Effective) Cyber Deception with Honeypots**\nIn today's ever-evolving cyber threat landscape, traditional defence mechanisms often struggle to keep pace with attacker ingenuity. Cyber deception offers a proactive approach, utilizing traps and deceiving tactics to lure attackers into controlled environments. Honeypots are one of the prominent techniques of cyber deception that act as decoy systems for capturing attacks and analyzing the adversary strategy. They provide an early detection mechanism as well as a method for learning how adversaries work and think. However, over the past years, several researchers have shown methods for fingerprinting honeypots. This significantly decreases the value of a honeypot; if an attacker can recognize the existence of such a system, they can evade it. This talk delves into the world of cyber deception, focusing on honeypots, their efficacy, and some fingerprinting techniques from my research. We'll explore how honeypots function and the contributions from The Honeynet Project, a non-profit, open-source community.\n**Speaker:** [Shreyas Srinivasa](https://www.linkedin.com/in/shreyas-srinivasa-ph-d-47038b13/overlay/contact-info/) is Cyber Security Specialist at TERMA Group, Co-founder of Selene CTI and previously Security Researcher at Aalborg University. He is contributor to the [Honeynet project](https://www.honeynet.org/), a non-profit dedicated to investigating the latest attacks and developing open source security tools to improve Internet security.\n\n**Information-Flow Security for the Working Software Engineer**\nHow does information flow through your software? Awareness of this gives you a new perspective when writing software with security requirements; it helps you avoid introducing information leaks into software, and gives you a conceptual framework for reasoning about software security in general.\nIn this talk, you will meet concepts like information leak, sources & sinks, dependencies, side–channels, and flow policies. You will learn to identify information flows in software, to express application–specific security requirements as flow policies, and to implement software that adheres to said flow policies.\nWant to try this out? Then bring a laptop; right after the talks, I will organize a little activity where you can tinker with \\`ifc-ts\\` - my TypeScript library for expressing flow policies. In \\`ifc-ts\\`, flow policy checks are reduced to checks performed by TypeScript's type checker. Thus, if your code type-checks, then your code is guaranteed to adhere to the flow policies expressed therein.\n\n**Speaker:** [Willard Rafnsson](https://www.willardthor.com/) is Associate Professor at the IT University of Copenhagen (ITU). I am a member of the Center for Information Security and Trust (CISAT), as well as the Programming, Logic and Semantics (PLS) and Software Quality Research (SQUARE) groups.\n\n**Location:** IT University, Copenhagen"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP June Meet - In person",
        "date": "2024-06-11",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/301038527",
        "timezone": "America/Chicago",
        "description": "\\*\\*\\*\\*AI Hallucination\\*\\*\\*\\*\\*\n\n90% of the code in Apps today comes from Open Source Software. Whether through infiltrating the software delivery pipeline, deliberately uploading malicious components to popular repositories, or taking advantage of existing vulnerabilities in open source components, attackers are leveraging gaps in supply chain controls to compromise organizations. With GenAI quickly becoming a popular tool for developers to generate code, a new threat has emerged. AI package hallucinations is one of the more recent attack types within supply chain that is easy to execute and can have devastating effects. During this session we will give an overview of Supply Chain Security with some examples of the current threats, discuss AI package hallucinations, and preventative measures."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Incident Response Coaching with SentinelOne's Purple AI and MNP Digital",
        "date": "2024-06-12",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/300949430",
        "timezone": "America/Edmonton",
        "description": "*As Franklin D. Roosevelt once wisely said, \"A smooth sea never made a skilled sailor.\"*\n\n**Ahoy, cyber sailors!** Just as sailors master the waves, [SentinelOne ](https://www.sentinelone.com/)and [MNP Digital](https://mnpdigital.ca/) are here to steer your ship through the stormy seas of cyberspace. Picture this: [SentinelOne's Purple AI](https://www.sentinelone.com/platform/purple/) is your trusty first mate, offering personalized coaching to navigate through cyber currents and dodge digital pirates‍. Together, we'll transform your crew into skilled cyber defenders ready to face any challenge on the high seas of security. \n\nAnd that's not all - [MNP](https://mnpdigital.ca/) is bringing in an Incident Response specialist to share the latest insights and trends. MNP doesn't just crunch numbers and balance the books like the superheroes of the accounting world. But they also fend off digital villains with their mighty Cybersecurity team. Think of MNP as your financial wizards by day and cyber warriors by night. They keep your money safe in more ways than one – after all, who knew accountants could also be your digital bodyguards? ‍\n\nJoin us for a day of learning, laughter, and delicious food as we level up our cyber defenses together!\n\n**Culinary Details**\nAfter the presentation, we'll be descending a few floors to MNP's brand new social and games floor, with a huge shoutout and special thanks to MNP for granting us early access! \n\nBut wait, there's more! Thanks to SentinelOne, we're serving up [Cornerstone BBQ's](https://www.cornerstonebbq.com/) mouthwatering beef brisket and grilled chicken at the event, all on the house! \n\n**Registration**\nJoin us for an open and inclusive gathering, dedicated to our shared theme. In compliance with our commitment to provide an optimal experience, we encourage timely registration to accommodate all interested participants within the policy guidelines. \n\n**Agenda **\n5:00 - 5:30 - Registration Verification\n5:30 - 6:00 - Presentation\n6:00 - 7:00 - Dinner and Socializing"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg AI Security and Header Injections",
        "date": "2024-05-29",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/300784706",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Benify's office for an interesting evening with food and drinks, and talks about AI security and the security implications of attacker controlled HTTP response headers!**\n\n**Where:** Benify, Masthamnsgatan 5, 413 27 Göteborg\n\n**Agenda:**\n**17:00 - 17:25:** Welcome to Benify\n\n**17:25 - 17:40:** Introduction from the event hosts and presentation of tonight's speakers.\n\n**17:40 - 18:40:** *Securing the Future: Ethical, Robust, and Secure AI Development*\n\nOutline:\n\nHistorical Overview of AI\n\n* Evolution of artificial intelligence\n* Key milestones in AI development\n\nAI and Ethics\n\n* Impact on business operations and decision-making\n* Overview of ethical guidelines and frameworks\n* Best practices for ethical AI implementation\n* Strategies to mitigate ethical risks\n\nRobustness & Reliability of AI Code Generation\n\n* Common misuse patterns and how to address them\n* Key metrics for measuring AI system reliability\n\nArtificial Intelligence Security Introduction\n\n* Historical case studies of AI failures\n\nOWASP Top Ten for Large Language Models\n\n* Security issues ranging from prompt injection to model theft\n\nThreat Modeling AI Systems\n\n* Methodologies for assessing and mitigating threats in AI ecosystems\n\nHugging Face Open Source AI Tools\n\n* Overview of tools for AI development and research\n\nDifferential Privacy and AI\n\n* Principles and applications to protect user data\n\nNIST AI Risk Framework\n\n* Framework for managing AI risks\n\nExecutive Order on AI Development and Use (Dated Oct 30, 2023)\n\n* Analysis of the executive order and its implications for AI\n\nEU AI Act\n\n* Exploration of the EU's first regulation on AI (link provided in the talk)\n\n**Jim Manico** is the Founder of Manicode Security, a company dedicated to providing expert training in secure coding and security engineering to software developers. His work at Manicode Security reflects his deep commitment to elevating software security standards in the industry. In addition to leading Manicode, Jim is actively involved in the tech startup ecosystem as an investor and advisor. His portfolio includes notable companies such as SemGrep, EdgeScan, Nucleus Security, Defect Dojo, KSOC, Akto, MergeBase, Inspectiv, Levo.ai and Pheonix. Furthermore, he is a fund-limited investor with Aviso Ventures, bringing his knowledge of software security to the venture capital domain. Jim is a recognized figure in the software development community, particularly known for his contributions to secure software practices. He holds the title of a Java Champion, acknowledging his contributions to the Java community. He is also the author of \"Iron-Clad Java: Building Secure Web Applications\", published by Oracle Press. Jim is committed to giving back to the community through his volunteer work with the OWASP foundation. He co-leads projects such as the OWASP Application Security Verification Standard and the OWASP Cheatsheet Series, contributing significantly to the field of web application security. For more information, please visit his LinkedIn profile at https://www.linkedin.com/in/jmanico or visit him on X/Twitter @manicode.\n\n**18:40 - 19:20:** Food & Drinks\n\n**19:20 - 20:00:** *Controlling the response: a peek into the risk of attacker-controlled HTTP headers*\nThe talk will present research into the security implications of attacker-controlled response headers. What can go wrong when we intentionally or unintentionally allow an attacker to control the headers of an HTTP response? We will examine some services where this exists \"by design\" where developers have tried to mitigate any risk using filters and Content Security Policies. We will also take a new look at the classic \"CRLF header injection\". The presentation will cover some known escalations in this area but also present a lesser-known escalation that abuses Network Error Logging.\n\n**Johan Carlsson** is a developer, bug bounty hunter, and hobby security researcher. He works at Recorded Future but has just finished three months of self-employment as a full-time bug hunter. Johan has found numerous vulnerabilities in many companies but is most known for his work on securing GitLab.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-06-17",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686433",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-05-20",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/299878996",
        "timezone": "America/New_York",
        "description": "An introduction to OWASP's Juice Shop. A vulnerable website built for CTF practice."
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Chapter Limassol meetup 2024-v1",
        "date": "2024-05-31",
        "time": "18:30+03:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/300819935",
        "timezone": "Asia/Nicosia",
        "description": "The location is **The Ballroom Suite B** at the [Crowne Plaza Hotel](https://maps.app.goo.gl/38rAWxBS9gMoSiH69).\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the fourth meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/), supported by [Semrush Inc.](https://semrush.com)!\n\nWe cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\nWe look forward to seeing you there and would be delighted to offer a **complimentary gift to each attendee**!\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19-00 — 19:35 **Ivan Elkin**, Application Security Team Leader at Exness with the topic **ASPM - story about unicorns, sneaky business and unexpected decisions**\n19-35 — 20:05 **Michael Markevich**, Security Lead at DHIS2, ex-CISO at Opera, with a talk **DHIS2: Building Security For An Open-Source Project**, which is a great opportunity to learn how a security professional can make the world of open-source better.\n20:05 — 20:30 A short break + Quiz\n20-30 — 21:00 **Dmitrii Stepul**, student of Neapolis university Pafos will talk about **Content Blocking system in Cyprus**\n21:05 — 21:40 **Sergey Belov**, Product Security Lead at Acronis. The topic will be **Impossible security - solving tasks with no right solution**\n21:40 — 22:05 Outro + Quiz\n22:05 — 23:00 Eat, drink, networking!\n\nIn addition, as usual, we are working hard to deliver the best knowledge to the community and are happy to announce that this event is fully packed with amazing gifts:\n\\- quizzes winners \\(**RTL-SDR Blog V3** R860 RTL2832U 1PPM TCXO HF Bias Tee SMA SDR with Dipole Antenna Kit) + branded T-shirt\n\\- activity winners \\(NooElec '**Yard Stick One**' USB Transceiver & 915MHz Antenne) + branded T-shirt\n\\- speakers \\(**Hamgeek HackRF One R9** and Portapack H2 Include 5 Antennas and Data Cable 1MHz-6GHz SDR Radio Unmounted Black) + branded T-shirt\n\nWe'll have catering and a chilly sunset view zone to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#07 - The Son",
        "date": "2024-05-28",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/300726135",
        "timezone": "Europe/Lisbon",
        "description": "Join us for the 7th OWASP Lisboa meetup!\n\nThe OWASP Lisboa chapter meetup will be held on May 28th, 2024, at 18:00, **and is** **supported by [Springer Nature Group](https://www.springernature.com/) and [AP2SI](https://ap2si.org/).**\n\nThe schedule is the following:\n**18:00** - **Welcome notes** by the OWASP Lisboa chapter leadership team\n**18:15** - **Technical Challenges of Security Scanning in CI/CD** by Tiago Mendo\n**19:10** - **Harnessing Reachability Analysis to Discern Real Threats in** by Joseph Hejderup\n**20:00** - **Drinks & Dinner** by Springer Nature Group\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Technical Challenges of Security Scanning in CI/CD**\n\nSpeaker: **Tiago Mendo**\n\nAbstract:\nHave you ever tried to add a web application security scanner to a CI/CD pipeline?\nI intend to draw attention to some of the challenges that development/security teams experience when trying to automate security tests.\nThe objective is to make the audience aware of these problems so that they can solve them as soon as possible, increasing the success of the tests and the adoption by the teams, which, in the end, will lead to greater security for the organization.\nThe focus will be on problems such as the scale of tests, speed of obtaining results, false positives and how these can destroy the process - or make it more expensive, and the use of the tools itself. All problems will be based on real situations, with examples whenever possible. I will propose solutions for different teams' maturity levels, giving practical tips to start implementing security in the developers' pipeline.\n\nBio:\nTiago Mendo is a co-founder and CTO of Probely, a cybersecurity company that does web and API security scanning. With over 19 years of experience in the security field, he has extensive experience in pentesting applications, training, and providing all-around security consultancy.\nHolds a Master's in Information Security from Carnegie Mellon University and a CISSP certification. He is also a qualified member of AP2SI, a non-profit organization that promotes Information Security, and Co-Leader of the OWASP Lisboa Chapter, in Portugal.\nHe is also an international speaker at security conferences, such as SnowFROC, LASCON, BSides Kraków, and BSides Lisbon.\n\nLinkedIn: [https://www.linkedin.com/in/tiagomendo/](https://www.linkedin.com/in/tiagomendo/)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Harnessing Reachability Analysis to Discern Real Threats in Software Dependencies**\n\nSpeaker: **Joseph Hejderup**\n\nAbstract:\nIn this talk, we will dive into the shortcomings of traditional dependency analysis methods, which usually focus on looking at build manifests and metadata, to spot security or performance vulnerabilities in Java projects. While tools like Maven Dependency Checker and Gradle's dependency-analysis plugin are invaluable for their ability to manage dependencies, they often fall short when we need quick and precise answers, forcing developers to lean on time-consuming tests and manual code reviews. We believe that a thorough look at how dependencies are actually used in the code—with the help of static and reachability analyses—can be a more effective way to pinpoint real threats in Java dependencies.\n\nWe'll use real-world examples to show how static analysis, and in particular reachability analysis, offers deeper insights into potential vulnerabilities by moving beyond simple metadata. By sharing examples where static analysis has been a game-changer, and pointing out where it might not be enough, we aim to shed light on the challenges and opportunities this method brings to improving security and performance in software projects.\n\nOur goal is to provide attendees with practical strategies for using static and reachability analyses, promoting a more detailed method for managing dependencies and finding vulnerabilities in software applications.\n\nBio:\nPart-time developer, part-time PhD student, full-time enthusiast in developing and researching techniques that makes package management system more intelligent and resilient against supply chain problems! Joseph Hejderup (Researcher/Software Engineer at Endor Labs & PhD student at Delft University of Technology) is applying program analysis techniques to better understand how we use third-party components and what risks third-party components entails from a security and maintenance perspective. Currently, he is applying years of research in Endor Labs with the mission to make dependency management a robust process that will empower developers, increase productivity, and solve security problems.\n\nLinkedIn: [https://www.linkedin.com/in/josephhejderup/](https://www.linkedin.com/in/josephhejderup/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "LayerOne Security Conference - Pasadena, CA",
        "date": "2024-05-25",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/301054531",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** will be hosting a booth at the **LayerOne 2024** security conference coming up in two short weeks! Be sure to stop by and say hi!\n\nDon’t forget – you have until May 25th to save big on registration. Head over to the [registration page](http://www.layerone.org/registration/) and secure your tickets now! Use promo code **L12024OWASPLA10** for 10% off registration courtesy of OWASP Los Angeles.\n\nPre-registration gets you full access to the event, all presentations, contests, villages, and the Saturday Night party.\n\nSee you there!!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAY 22, 2024",
        "date": "2024-05-22",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300022938",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Securing Generative AI Applications using the OWASP Top 10 for Large Language Models\nJoin us for dinner+drinks, networking, and see a presentation by **Steve Wilson**, OWASP project leader and Chief Product Officer at **Exabeam**\n\n**ABSTRACT**: What are the new risks that generative AI brings to your environment? In this cutting-edge session, we uncover the potential hazards that Large Language Models (LLMs) introduce to modern application ecosystems. Drawing on the expertise distilled in the OWASP Top 10 for LLMs, we offer a comprehensive roadmap for mitigating these risks. Attendees will gain insights into securing generative AI applications, recognizing the nuances of LLM vulnerabilities, and deploying defenses. This talk is a call to action for developers and security professionals to foster a culture of secure, responsible AI development. Equip yourself with the knowledge to anticipate threats, apply best practices, and build AI systems that are not only intelligent but also resilient in the face of cybersecurity challenges.\n\n**THANKS to OUR SPONSOR**: *[Kodem](https://www.kodemsecurity.com/)*\n*Kodem means “first” or “early” in Hebrew. A priority. We believe in helping appsec teams make security a priority by spotlighting risks that truly matter. We believe in helping developers improve code quality by shifting left and catching issues early. And we believe in making people a priority: our customers, our team, and our partners.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Secure the Supply Chain with Software Bill of Materials (SBOM's)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Are you being asked about the security of your software supply chain? This seems to be one of the hottest and most prominent topics, both from auditors and customer compliance requirements right now within application and software security.\n\nJoin us Wednesday, May 22nd from 6:30pm - 8:30pm to hear from the experts at Synopsys software integrity group on the best ways to utilize SBOM's to ensure your software supply chain is secure!"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Supply Chain Security with Dan Lorenc, CEO Chainguard",
        "date": "2024-05-22",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/298689779",
        "timezone": "America/Chicago",
        "description": "Join us for an informative and hands-on workshop on securing your software supply-chain. In this event, we will be joined by Dan Lorenc, CEO and founder of Chainguard Inc. We will have food, learning, swag and, of course, networking with other like-minded folks in the area.\n\nChainguard and Pins Mechanical will host us after the event for those that can come have some fun! To be sure that I can help ensure head count, parking and more, please be sure to RSVP if attending in-person.\n\nNote: This event is organized by the OWASP Nashville Chapter and is open to both OWASP members and non-members. Whether you are already a member or interested in becoming one, we encourage you to attend this event and learn more about the benefits of being part of the OWASP community."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "CyberBooked 2024",
        "date": "2024-05-23",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/300656600",
        "timezone": "Europe/Amsterdam",
        "description": "### **Book your ticket now as seats are limited!**\n\nCyber Booked is a one of a kind physical CyberSecurity event, featuring both recently published and more well-known CyberSecurity books. The authors will share the latest insights from their books and you will have the opportunity to ask them questions about their books. During the break and drinks you can meet & greet with the authors and maybe even get your book signed!\n\nThis event is a joint event organised by the Dutch chapters of OWASP along with ISACA, ISC2 and the Secure Software Alliance (SSA).\nThe event is free of charge and CPE certificates will be issued from ISACA and ISC2. The event will be presented in English.\n\nPlease use the link below to register for the event with you full and correct information as this information will be used to process your CPE points.\n\nhttps://isaca.nl/events/cyber-booked-2024/"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-05-21",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780385",
        "timezone": "Pacific/Auckland",
        "description": "We've resumed our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for May will be **A02:2021 - Cryptographic Failures**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Steps to Reduce Friction between Development and Security Teams",
        "date": "2024-05-30",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/300805662",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on May 26th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Abstract**\nIn an era where cloud security is critical, the delicate balance between rapid development and maintaining stringent security measures is more critical than ever. Join Doron Naim (DevOcean) as he addresses this challenge head-on, offering members of OWASP new actionable strategies and expert insights for enhancing collaboration and efficiency in cloud security and remediation efforts.\n**Key Insights:**\n\n* **Collaboration Techniques**: Learn proven collaboration methods to boost synergy across security, DevOps, and development teams.\n* **Smart Remediation**: Discover how intelligent workflows can significantly speed up the identification and resolution of security vulnerabilities.\n* **Ownership & Efficiency**: Gain insights on automating the assignment of fixes to the right team members, streamlining the remediation pipeline, and cutting down on ticket clutter.\n* **Preventive Measures:** Explore methods to ensure vulnerabilities are fixed right the first time, preventing future occurrences.\n\n**Why Attend:**\n\n* **Immediate Value**: Walk away with strategies you can implement now, no matter your platform or tools.\n* **Enhanced Security Posture**: Learn how to reduce friction and elevate your cloud security practices.\n* **Practical Knowledge**: Whether or not DevOcean is part of your toolkit, this session promises insights to help your organization thrive in cloud security.\n\n**Ready to Bridge the Gap between Security and Dev?**\nJoin us to unlock NextGen collaboration strategies that support secure, rapid development. Learn how to streamline workflows, elevate your cloud security posture, and achieve continuous innovation."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-05-30",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/300641588",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Secure the Supply Chain with Software Bill of Materials (SBOM's)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Are you being asked about the security of your software supply chain? This seems to be one of the hottest and most prominent topics, both from auditors and customer compliance requirements right now within application and software security.\n\nJoin us Wednesday, May 22nd from 6:30pm - 8:30pm to hear from the experts at Synopsys software integrity group on the best ways to utilize SBOM's to ensure your software supply chain is secure!"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec/OWASP-SLC - May Meetup (in person) @ Murray Park - Pavilion #4",
        "date": "2024-05-29",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/300938258",
        "timezone": "America/Denver",
        "description": "**Agenda:**\n\n1. Lunch\n2. Discussion: **AppSec AI, how to test with it, test it, and LLMs.**\n1. Mini-presentations by Justin Ellis and Seth Law\n\nTo help us plan for food, please RSVP if you're plan to be there.\n\nSee you all then!\n[ADDRESS]\nMurray Park Pavilion #4, Murray, UT 84107\nhttps://maps.app.goo.gl/QdGX5UM2eAsM23Ur7"
    },
    {
        "group": "Sao Paulo",
        "repo": "www-chapter-sao-paulo",
        "name": "OWASP Chapter SP - Retomada dos Encontros Presenciais",
        "date": "2024-05-21",
        "time": "18:30-03:00",
        "link": "https://www.meetup.com/owasp-sao-paulo-chapter/events/301006922",
        "timezone": "America/Sao_Paulo",
        "description": "**Retomada dos Encontros Presenciais do OWASP Chapter SP**\n\nTemos o prazer de anunciar o retorno dos nossos encontros presenciais! Este será o primeiro evento presencial desde a pausa causada pela pandemia e estamos empenhados em torná-lo inesquecível com uma série de discussões enriquecedoras para profissionais da segurança da informação e desenvolvimento de software.\n\n**Detalhes do Evento:**\n\n* **Data:** 21 de Maio de 2024\n* **Horário:** 18h30\n* **Local:** Universidade São Judas Tadeu - Campus Paulista, Av. Angélica, 2565 - Bela Vista, São Paulo\n\n**Painel: A Importância da Segurança de Aplicações para o Compliance com LGPD/Privacidade**\nExploraremos o papel crucial da segurança de aplicações na conformidade com regulamentações de privacidade e proteção de dados pessoais.\n\n* **Participantes**: Paulo Baldin (CISO e DPO, Stark Bank), Ronaldo (CISO, Horiens), Calza Neto (DPO, Sport Clube Corinthians Paulista)\n* **Mediador:** Wagner Elias (CEO, Conviso Application Security)\n\n**Painel: Medidas de Segurança e AppSec**\nEstratégias de segurança em implementações técnicas, incluindo SSDL, shift-left, e desenvolvimento seguro.\n\n* **Participantes:** Juliana Gaioso (AppSec, PicPay), Daiane Santos (Tech Lead Mobile Security), Jessica Felix (Tech Lead, Itaú)\n* **Mediadora:** Ana Tessaro\n\n**Palestra: Strategic Code Security: GitHub Actions and SAST/SCA Integration**\nDemonstração prática de como integrar GitHub Actions com ferramentas SAST e SCA para identificação de vulnerabilidades em diversas linguagens de programação.\n\n* **Palestrante:** Filipi Pires (Threat Researcher & Cybersecurity Advocate, Senhasegura)\n\n**Conheça os Participantes:**\n\n**Paulo Baldin:** Com uma extensa trajetória como CIO, CISO e DPO na STARK BANK, Paulo possui mais de 16 anos de experiência, coordenando mais de 100 projetos em diversas áreas, incluindo proteção de dados e privacidade.\n\n**Ronaldo Andrade:** Atuando como CISO na Horiens Risk Advisors, Ronaldo possui 18 anos de experiência, especializado em infraestrutura, DevOps e Cyber Segurança.\n\n**Calza Neto:** DPO do Sport Clube Corinthians Paulista, Walter Calza Neto é um advogado especialista em Proteção de Dados e Cibersegurança.\n\n**Wagner Elias:** CEO da Conviso Application Security, com mais de 20 anos de experiência em segurança de aplicações e um membro ativo da comunidade de AppSec.\n\n**Juliana Gaioso:** Especialista em AppSec no PicPay, com uma vasta experiência em desenvolvimento web e segurança da informação.\n\n**Daiane Santos:** Tech Lead de Mobile Security, com uma carreira focada em segurança da informação no setor financeiro.\n\n**Jessica Felix:** Tech Lead no Itaú Unibanco, com uma carreira rica em engenharia de software e liderança técnica.\n\n**Ana Tessaro:** Engenheira de Cibersegurança e mediadora do painel sobre medidas de segurança e AppSec.\n\n**Filipi Pires:** Threat Researcher & Cybersecurity Advocate na Senhasegura, destacado por sua atuação internacional como palestrante e especialista em segurança de aplicações.\n\n**Convidamos todos os interessados em aprofundar seus conhecimentos e práticas em segurança de aplicações a participar deste encontro enriquecedor. Garanta sua participação e junte-se a nós em uma jornada de aprendizado e troca de experiências.**"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-06-12",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300218560",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "OWASP South Florida Chapter Meeting May 2024 ",
        "date": "2024-05-29",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/300771107",
        "timezone": "America/New_York",
        "description": "We still haven't found a suitable in-person meeting venue. We'll be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.\n\nPlease join us virtually for our May 2024 Meeting.\n\nBYOB - Bring Your Own Beverage\n\n**Agenda**\n===\n\n* Chapter update/news\n* Talk by Rohini Sulatycki\n* Virtual Networking\n\n**Talk Title:** Securing the Digital Pipeline: Unveiling the Power of Software Bill of Materials (SBOM)\n**Talk Summary:** A significant increase in cyber attacks due to vulnerabilities within the supply chain has led to a heightened awareness of the security of supply chains and creating a software bill of materials (SBOM) is gaining traction as a good initial step. A SBOM is essentially the “ingredient list” that goes into the making of the software. In this talk, we will discuss:\n\n* What is an SBOM\n* The elements that make up an SBOM\n* The problems that can be solved by an SBOM\n* SBOM tooling\n* Future thoughts"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Pub evening - Summer OWASP meet up and after-work near Odenplan",
        "date": "2024-06-05",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/299591604",
        "timezone": "Europe/Stockholm",
        "description": "Time for a summer get together before we all disappear for the summer holidays . This is the perfect opportunity for all of us app-sec interested folks to get together and meet up in real life for a relaxed chat and maybe a beer or some other refreshments.\n\n When: 5th June, 2024 17:00\n Where: The Old Brewer - Public House & Dining Room at Luntmakargatan 98, 113 51 Stockholm\n\nExpect:\n Quick AppSec Tips\n Networking\n Drinks & Laughter\n\nThe meeting will start at 17:00, but it's a casual event so turn up when it suits."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - The EU Cyber Resilience Act and why the SBOM is so important",
        "date": "2024-05-21",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/300469641",
        "timezone": "Europe/Stockholm",
        "description": "EU is about to become a market leader in software cybersecurity regulation. With a large set of proposed and active laws, software development will be regulated like never before.\n\nWith the coming EU Cyber Resilience Act (CRA) all software and embedded systems will have to get a CE mark, which is now expanded to include cybersecurity aspects. It’s going to be a huge change and will mean that the manufacturers (and in some cases importers) will get responsibility for the user’s security and will have to provide free security patches for the lifetime of the product. Software developers will have to learn secure coding and the need for cyber security professionals will be very high.\n\nOne of the focus areas is vulnerability management. To keep a product secure during its lifetime, all 3rd party components will have to be monitored and up to date. At the heart of this process is the Software Bill of Materials, SBOM, which is used to monitor for known vulnerabilities in both Open Source and commercial components. The OWASP CycloneDX project fits right in and have been working with various kinds of bill-of-materials for a long time. CycloneDX is in the process of becoming an ECMA standard and thus fits better in to the EU regulation.\n\nIn this talk Olle E. Johansson will introduce the proposed EU CRA legislation and talk about the SBOM with a focus on the toolchain needed to manage vulnerabilities.\n\nWe will start the evening with a mingle at 17:30 followed by a presentation that will start at 18:00. The talk will be around 1 hour long followed by a further mingle/time for questions and answers.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcoming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "1st OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-06-06",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/300610888",
        "timezone": "Europe/Berlin",
        "description": "**OWASP® and beyond - much more than just OWASP Top 10**\n\nOWASP is famous for the OWASP Top 10. This session will explain why the OWASP Top 10 is misused all the time. You will learn about several other OWASP projects and their potential use in your daily work. There will also be a technical demo to solve together.\n\n**Referent**: Cybersecurity Expert [Tobias Glemser](https://www.linkedin.com/in/tobias-glemser/) will host this session. In his work as a BSI-certified penetration tester and volunteering [OWASP German Chapter](https://owasp.org/www-chapter-germany/) Lead, the managing director of the IT security company https://www.secuvera.de/[secuvera](https://www.secuvera.de/) has extensive practical experience since more than 20 years.\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation (TBD)\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "OWASP Switzerland Summit: Recharge & Reconnect",
        "date": "2024-06-05",
        "time": "13:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/300958621",
        "timezone": "Europe/Zurich",
        "description": "After more than two years with only online talks, we are going physical again.\nTo celebrate this reboot, we are organizing an summit with four captivating talks and lots of opportunity for you to reconnect with your local application security community and recharge with know-how.\n\nAs this is a physical event, please be sure to only register, if you will really be there, so that we get the amount of drinks right!\n\nBut now for the **program**:\n*Startup:*\n\n* **13:15** **Doors open**: Grab a drink, meet old and new friends from the OWASP Switzerland community\n* **13:50 Welcome words** (OWASP Switzerland Leader-Team)\n\n*Talks: Recharge your know-how*\n\n* **14:00** **OWASP Mobile Application Security for Developers and Penetration Testers** (Stefan Bernhardsgrütter, Lead Security Tester @ Redguard AG)\n* **15:00 Beyond the Top 10: Limits of a finite Checklist** (Marco Schnüriger, Security Consultant @ Protect7 GmbH)\n\n*Break:*\n\n* **16:00 Break**. Reconnect with peers and refill your drinks.\n\n*Talks: Recharge with even more know-how*\n\n* **16:30 Cloud Security - more info coming soon** (Andrew Hutchison, Technical Program Manager, ISE lead @ Google)\n* **17:30 Confidential Computing** (Thomas Bosshard, Security Consultant @ Zühlke Engineering)\n\n*On the move: Join DEFCON / OWASP Switzerland warm-up beer*\n\n* **18:45 Relocate** and join the warm-up beer with our friends from Area41/DEFCON Switzerland. Enjoy the community.\n\n**Talk details:**\n\n* **OWASP Mobile Application Security for Developers and Penetration Testers**: Mobile applications are central to digital life today. To ensure that mobile e-banking, door controls, health data, personal messages and photos are secure, mobile applications should also be developed securely. As the threat model for a mobile app can differ from other kinds of applications, frameworks such as the OWASP Application Security Verification Standard (ASVS) may not cover all the relevant IT security topics.\n* **Beyond the Top 10: Limits of a Finite Checklist**: In his talk, Marco will share insights from almost two decades of experience with the OWASP Top 10. He will discuss how this checklist has advanced web application security and brought critical issues to the forefront and also to the attention of non-technical people.\nMarco will provide real-world project anecdotes to highlight the limits of the Top 10, particularly in stakeholder communication. He will explore how broader resources like OWASP ASVS and SAMM provide additional guidance and fit into the bigger picture of establishing security practices.\nThe talk will conclude with an outlook on integrating practical checklists with detailed frameworks to enhance security strategies and stakeholder understanding. This session is a must for those seeking to bridge the gap between vulnerabilities and effective communication..\n* **Cloud Security**: More info coming soon\n* **Confidential Computing**: Encryption of data at rest and in transit are two well-established and generally advisable best practices for protecting IT environments. They can be implemented leveraging a plethora of tested and proven technologies such as disk encryption and network security. But what happens when data is processed, therefore not being at rest or in transit? At this point data becomes available in memory, usually in unencrypted to allow processing. This provides a window of opportunity for attackers to gain unallowed access to the data or perform various actions on it. Mitigating some of these attack vectors is what confidential computing aims to do. In this talk I will provide a brief overview over the concepts and outline use cases and limitations. There might after all be some caveats to it..."
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #25: Firewalls, Product Security & Contingency plans [IN-PERSON]",
        "date": "2024-05-23",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/300712957",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\n\nTheme sessions - Theme: Firewalls, Product Security & Contingency plans.\n\n\\`Schedule\\` **\\`Time:\\`**\\` 18:00 to 20:30\\`\nIntroduction, OWASP News & Updates - Catalin Curelaru\nSecuring the Gates: The Hidden Flaws Behind the Firewall - Adrian Daniel BACANU (RAZDON)\nRunning a Product Security Assessment Program at scale - Alina NICULA (VISMA)\nContingency plan from security point of view - Adrian BARAN (VITESCO)\n\nLocation of the event: UBC3, et 10, Sediu VISMA, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by VISMA\n\nMore about the speakers and topics:\n**Adrian Daniel BACANU - CEO @ RAZDON,** is the CEO and co-founder of Razdon, a pioneering CyberSecurity startup. With 14 years of enterprise experience and a lifelong passion for hacking—now spanning two decades—Daniel brings a wealth of expertise to the cybersecurity field. He still offers some Security Architectural consultancy for different companies across Europe, and from time to time, he engages in bounty hunting. When not decoding the matrix of cyber threats, Daniel enjoys life with his wife and two boys, plays football twice a week, and maintains a spirited sense of humor—because in cybersecurity, sometimes, you really can't afford to joke.\n***\\~Securing the Gates: The Hidden Flaws Behind the Firewall\\~***\nEffective cybersecurity is not just about having defenses in place but ensuring they are properly designed. 'Securing the Gates: The Hidden Flaws Behind the Firewall' illuminates the common pitfalls in firewall implementations that often go unnoticed. This presentation will demonstrate typical design errors that compromise security and provide actionable insights on how to rectify these flaws to create robust defenses. Attendees will learn how to not only deploy but also optimize firewalls to safeguard their digital assets effectively.\n\n**Alina NICULA** - **VASP Lead and Product security assessment service owner and reviewer @Visma**. Alina has been working within product development teams as a software developer, security engineer, software and cloud service architect. In the last years she focused on software security by guiding Visma teams into securing their applications, data, cloud workloads, and delivery pipelines to avoid potential cybersecurity risks.\n***\\~Running a Product Security Assessment Program at scale\\~***\nHaving a product security assessment program is essential for any company. It is equally critical to ensure that this program remains relevant over the time and is scalable as the company grows.In this presentation, I will discuss how we ensure that our designed processes empower development teams to make informed security decisions while also giving them ownership over the remediation of the security aspects that impact their products.\nHowever, achieving this goal requires a strong and knowledgeable security review team that supports the delivery teams with informed security by design best practices.\nSo, how have we been able to grow our program? I hope you will leave this presentation with a clear understanding of our approach.\n\n**Adrian BARAN -** **Security Manager @ VITESCO**,\n\n***\\~ Contingency plan from security point of view \\~***\nAbstract:"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly OWASP SAMM Community Call - June 2024",
        "date": "2024-06-12",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/300918520",
        "timezone": "America/New_York",
        "description": "Our next community call in June 12, we will cover:\n1) Welcome new community members\n2) SAMM project updates\n2) Q&A"
    }
]