[
    {
        "group": "San Pedro Sula",
        "repo": "www-chapter-san-pedro-sula",
        "name": "Seguridad en la nube",
        "date": "2022-10-11",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-san-pedro-sula-chapter/events/288020311",
        "timezone": "America/Tegucigalpa",
        "description": "¿Quieres aprender sobre Seguridad en la nube?\n\nDurante esta charla aprenderemos sobre “Seguridad en la nube”, de la mano de Claudia Izquierdo quien es AWS Solutions Architect y cuenta con amplio conocimiento en el rubro de las tecnologías de la información, ciberseguridad, soluciones en la nube y telecomunicaciones."
    },
    {
        "group": "Ghana",
        "repo": "www-chapter-ghana",
        "name": "App/Software Security virtual Meet up - Speakers TBC",
        "date": "2022-09-24",
        "time": "1:00Z",
        "link": "https://www.meetup.com/owasp-ghana-chapter/events/287449849",
        "timezone": "Africa/Accra",
        "description": "We will have our quarterly OWASP Ghana meet virtually on Saturday 24th of September 2022.\n\n**Call for speakers is open,**\nIf you would like to present a 15-45 minute talk on Application / Cyber Security at future OWASP Ghana Chapter events - please review and agree with the [OWASP Speaker Agreement](https://owasp.org/www-policy/legal/speaker-agreement) and submit your talk/presentation [Ghana Leaders](http://mailto:ghana-leaders@owasp.org/)\n\nFollow us on twitter: [https://www.twitter.com/OWASPGhana](https://www.twitter.com/OWASPGhana)\n\nOnline meeting link will be announced before the event day."
    },
    {
        "group": "Las Vegas",
        "repo": "www-chapter-las-vegas",
        "name": "Getting Into Cyber Security",
        "date": "2022-10-14",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-las-vegas-chapter/events/288342694",
        "timezone": "America/Los_Angeles",
        "description": "**General concern around the security of personal information is growing at a furiously rapid pace. So many people nowadays are starting to care about how their information is handled, and that it has caused a massive boom in the need for cyber security professionals.**\n\n**Knowing how nebulous the world of cyber security can be, OWASP Las Vegas is hosting a panel discussion on Friday October 14th @ 5:30pm PST called Getting Into Cyber Security aimed at helping people interested in cyber security.**\n\n**Join our host Shane Mitchell as he asks 3 Cyber Security Professionals of varying backgrounds questions about what it means to work in a cyber security role and how someone could go about getting into cyber security.**\n\n**Panelists include:**\n**Dustin Lehr - Director Application Security - Fivetran**\n\n* **Over a decade as a software engineer and application architect before moving into a Cyber Security role.**\n\n**Michael Julian - Security Operations Manager - Boyd Gaming**\n\n* **USCG Veteran with 8+ years of cyber security operations and management experience.**\n\n**Chang Tan - Penetration Testing Instructor / EX-Hacker**\n\n* **Exploit Development Instructor and Independent Contractor working for three online learning platforms.**\n\n**We hope to see you there!**"
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Backdoors and Breaches at Beer Revolution.",
        "date": "2022-10-02",
        "time": "5:00-06:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/288458229",
        "timezone": "America/Edmonton",
        "description": "Backdoors & Breaches is an Incident Response Card Game, from Black Hills Information Security and Active Countermeasures. Backdoors & Breaches contains 52 unique cards to help you conduct incident response tabletop exercises and learn attack tactics, tools, and methods."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver - October 2022",
        "date": "2022-10-20",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/285780734",
        "timezone": "America/Vancouver",
        "description": "OWASP Vancouver October meetup"
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "ADCS - O Domain Admin é logo ali",
        "date": "2022-10-04",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/288471467",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: Fabrício Porto\nTema: ADCS - O Domain Admin é logo ali"
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "Resiliência Cibernética: Uma estratégia contra a ameaça fantasma",
        "date": "2022-09-27",
        "time": "0:00-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/288471410",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: Julio Correia\nTema: Resiliência Cibernética: Uma estratégia contra a ameaça fantasma"
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Bug Bounty - Tips & Trick",
        "date": "2022-09-25",
        "time": "9:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/288446563",
        "timezone": "Asia/Jakarta",
        "description": "Topic : Bug Bounty\n\nBio:\n$(whoami)\nAshish Dhone\n\n$(Bio)\n Senior Security Analyst at Persistent Systems.\n Independent Security Researcher at Synack, Hackerone and Bugcrowd.\n\nI have significant knowledge in,\nVulnerability Assessment, Penetration Testing, Network Security, Mobile Application Security, Web Application Security, API Security, Digital Forensic, Threat Intelligence and Red Teaming.\n\n$(CVEs)\n CVE-2021-37999 - UXSS in Google Chrome\n CVE-2021-31832 - Stored XSS in McAfee DLP\n CVE-2020-35745 - Privilege Escalation- Unauthenticated access to Admin Portal in PHPGurukul\n CVE-2020-25925 - Reflected XSS in IceWarp WebClient\n\n$(HONORS & AWARDS)\n Top 120's in the World at Google Hacker's Ranking.\n BOUNTYCON – FACEBOOK & GOOGLE, selected in all over Asia region at Facebook’s HQ in Singapore to attend a Conference dedicated to the Security Researcher Community.\n Acknowledged, Rewarded and listed in “HACKER’S HALL OF FAME\" For Finding Several Security Flaws in,\nGoogle, Apple, Facebook, Shopify, Gitlab, AT&T, Western Union, Paytm, Swiggy and several of other 100+ Top Fortune Companies\n\nlinkedin\nhttps://www.linkedin.com/in/ashish-dhone-640489135"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2022-10-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/288506633",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "security.ac.nz 2022 - Auckland",
        "date": "2022-09-24",
        "time": "9:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/287978137",
        "timezone": "Pacific/Auckland",
        "description": "Please join us for our second [security.ac.nz](https://security.ac.nz/) student-focused conference. This year's event will be held in Auckland, at the Owen G. Glenn Building at University of Auckland.\n\nDetails, including full schedule and talks, are currently TBC. Tea breaks and a light lunch will be provided both days. The website still shows the information and schedule from 2019, but that will be updated soon.\n\nRegistration is FREE and is now open [on Humanitix](https://events.humanitix.com/security-ac-nz-2022-auckland). Attendance is limited to 200, so be sure to get your tickets now.\n\n### Event description\n\nWelcome!\n*You* are invited to join us at security.ac.nz - in Auckland, this September - for a study break weekend, where you can learn all about security and hacking.\n\n## Who?\n\nYou! Anyone who is learning about software, and wants to learn about how to make software secure…with a dose of “how to hack” thrown in.\nTo clarify: The two days will aim to suit students with a 100-level knowledge of software development. However, you’re still welcome if you’re not a University student… anyone interested in security should come!\n\n## What?\n\nTwo days of training in the art of securing the web… covering topics like:\n\n* Learning to hack\n* Threats & Trust\n* Secure the Cloud\n* Secure Development\n* Web Security\n* Cyber Security Careers\n\n## Where?\n\nOwen G. Glenn Building\nUniversity of Auckland\n12 Grafton Road, Auckland\n\nWe will be running the two days of activities in Lecture Theatre OGGB4 (Room 073). Check-in, breaks, and lunches will be in the Level 0 Foyer (071/088).\n\n## When?\n\nSaturday & Sunday\n24 & 25 September\n9:30 a.m. - 6:00 p.m.\n\nPlease plan to arrive by 9:00, so everyone can get checked in, get a cup of coffee or tea, and we can start promptly.\n\n## How?\n\nRegister [here](https://events.humanitix.com/security-ac-nz-2022-auckland) for your **FREE** ticket to the best security-themed weekend event at the University of Auckland this year!\n\nNOTE: Spaces are limited, and people are notorious for registering and not attending free events. In the week before the event, you'll have to confirm your registration to keep your place.\n\n## Why?\n\nOver the course of the two days there will be great speakers, and we're working on organising other activities. You will be learning about all aspects of security from some of the best in New Zealand!\n\n## Hungry?\n\nWe will be providing a light lunch, including options for those on vegetarian and gluten-free diets. Please bring a water bottle and any snacks you need to keep you going.\n\nThe area around the OGGB will be pretty quiet over the weekend, so don’t count on a lot of nearby options' being open for coffee or food."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney Fight Club - Oct meet ",
        "date": "2022-10-13",
        "time": "8:00+11:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/284217896",
        "timezone": "Australia/Sydney",
        "description": "Welcome back to OWASP Sydney’s Fight Club!\n\nJoin us once a month in our fc-announcements [Discord channel](https://discord.com/invite/uAWze2B) where we come together to break into machines, go head to head in [Hack The Box’s](https://app.hackthebox.com/login) (HTB) battlegrounds, and dive down rabbit holes!\n\nTo participate in the event, please ensure you know the basics of HTB, e.g. how to connect to the VPN, and have a valid account set up and ready to go.\n\nThere is no set agenda for the night, we might form teams and compete, or we might all go on a solo mission - the aim is to train up your skills alongside other members of the community and have a good time!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2022 (Online)",
        "date": "2022-09-27",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/288406456",
        "timezone": "America/Chicago",
        "description": "*Due to a limited space for attendees, if you would like to attend in-person at NI, please see* [https://owasp-austin-2022-september.eventbrite.com](https://owasp-austin-2022-september.eventbrite.com)\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n**Insider's Guide to Mobile AppSec with OWASP MASVS w/ Brendan Hann**\n\nFrom the birth of MASVS and MSTG in January 2018 to the most recent updates, the OWASP Mobile Security Project has advanced the state of mobile app security testing dramatically. As supporters and contributors to the Mobile Security Project at OWASP, we have pen tested thousands of mobile apps and scanned millions of commercial apps in the app stores over the years… and have identified the most common security issues that plague developers and security teams. Whether you are new to mobile pen testing or a veteran looking for the latest tools and tactics, join this session to learn 10 keys to mobile appsec leveraging OWASP MASVS and practical real-world experience.\n\n**Presenter: Brendan Hann**\n\nAs Product Marketing Manager for NowSecure, Brendan Hann focuses on equipping developers, security professionals and DevSecOps teams with best-of-breed mobile app security skills, tools and resources. His career has focused on helping organizations deliver innovative, secure applications at scale. Brendan’s track record of success with application and security teams spans NowSecure, Veracode and PayPal. Brendan has presented at OWASP Los Angeles, OWASP Columbus, OWASP Global AppSec 2021, Connect 2021, and DevOps World 2021. With experience in both web and mobile application security testing, Brendan provides a unique perspective on best practices and the successful deployment of DevSecOps."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2022 (In-Person)",
        "date": "2022-09-27",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/288405843",
        "timezone": "America/Chicago",
        "description": "Due to the limited venue attendance, please register for the in-person meetup at [https://owasp-austin-2022-september.eventbrite.com](https://owasp-austin-2022-september.eventbrite.com)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBack at NI again! While we will also be online, the chapter would like for folks to attend personally if possible!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n## Insider's Guide to Mobile AppSec with OWASP MASVS\n\n**Abstract:**\nFrom the birth of MASVS and MSTG in January 2018 to the most recent updates, the OWASP Mobile Security Project has advanced the state of mobile app security testing dramatically. As supporters and contributors to the Mobile Security Project at OWASP, we have pen tested thousands of mobile apps and scanned millions of commercial apps in the app stores over the years… and have identified the most common security issues that plague developers and security teams. Whether you are new to mobile pen testing or a veteran looking for the latest tools and tactics, join this session to learn 10 keys to mobile appsec leveraging OWASP MASVS and practical real-world experience.\n**Presenter: Brendan Hann**\nAs Product Marketing Manager for NowSecure, Brendan Hann focuses on equipping developers, security professionals and DevSecOps teams with best-of-breed mobile app security skills, tools and resources. His career has focused on helping organizations deliver innovative, secure applications at scale. Brendan’s track record of success with application and security teams spans NowSecure, Veracode and PayPal. Brendan has presented at OWASP Los Angeles, OWASP Columbus, OWASP Global AppSec 2021, Connect 2021, and DevOps World 2021. With experience in both web and mobile application security testing, Brendan provides a unique perspective on best practices and the successful deployment of DevSecOps."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Rooftop Happy Hour",
        "date": "2022-09-29",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/288605367",
        "timezone": "America/Los_Angeles",
        "description": "Come join your fellow OWASP Bay Area members on Thursday, Sept. 29, 2022 for a Rooftop Happy Hour.\nSponsored by Synack (pentesting via a platform), the event will be held on the roof of the Spaces Clocktower building. It’s a great way to connect with the local Infosec community to get defenders and attackers together to hear about what’s working for others facing the same issues you are facing. Also Airpods will be raffled off to one lucky attendee. Other Swag items will be offered as well, so there is something for everyone. No speaker, just eats and drinks and the summer sun. (Note: In the event of rain, check this page and @synack on Twitter for updates.)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2022-10-10",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/288531007",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Introduction to Threat Modeling with Josh Williams ",
        "date": "2022-09-27",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owasp-kansas-city/events/288606531",
        "timezone": "America/Chicago",
        "description": "we're back! first KC - OWASP meeting in a hot minute. let's use this to learn about threat modeling, sharpen our skills, meet new people, and make plans for the future of OWASP in KC!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - October 5, 2022",
        "date": "2022-10-05",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/287593912",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Security for Growth Companies\n\n\\*\\*\\* **NOTE NEW DATE \\*\\*\\*** Join us for great networking, dinner, and see a presentation by [Cassio Goldschmidt](linkedin.com/in/cassiogoldschmidt), the founder of [OWASP Los Angeles](https://www.linkedin.com/company/owaspla/) and CISO at [ServiceTitan](https://www.linkedin.com/company/servicetitan/)\n\n**ABSTRACT**: The increased pressure for cybersecurity practices, even in their earliest stages, is becoming a common demand from both customers and investors. With cyber threats escalating, it’s more urgent than ever to embed security into a company’s day-to-day operations from day one to prevent ‘security debt’ from emerging as the company scales.\nEstablishing a robust cyber security program can be a daunting task. A cloud-native company faces dozens of cybersecurity tools to choose from and the typical resource constraints of a young company that needs to grow fast. Based on the practical advice given by CISOs of 7 hyper-growth companies (Netflix, Datadog, HashiCorp, ACV, Axonius, Discord, and ServiceTitan), this talk aims to provide you with a modern, light-weight security guide to succeed in the cloud-first/cloud-native era.\n\n**BIO**: Cassio Goldschmidt is the Chief Information Security Officer (CISO) at ServiceTitan and an operating advisor at Bessemer. He is also an investor, startup advisor, MBA mentor, regular speaker at conferences, long-time contributor to the security community, and an award-winning technology executive.\n\n**Sponsor**: Vendors interested in sponsoring send an email to sponsorship.la@owasp.org"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "(On-line) Cherrybomb – API security tests in the CI pipeline",
        "date": "2022-10-11",
        "time": "7:00-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/288608767",
        "timezone": "America/Chicago",
        "description": "**Guy Levinger: Cherrybomb – API security tests in the CI pipeline**\n\n* Concepts of OpenAPI specifications, and show how important and easy to generate they are.\n* API security testing in the CI pipeline, and present Cherrybomb and its capabilities.\n* Demo time! We'll demonstrate Cherrybomb on a live API to find a set of vulnerabilities.\n\nGuy Levinger is the CTO of BLST security, the publisher of Cherrybomb. He previously served as a tech lead in the IDF. Previously, he worked as a freelance penetration tester and core developer for various companies.\n\nAgenda:\n5:00 - Socializing/connecting\n5:10 - OWASP announcements\n5:15 - Presentation"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando 2022 Community Event",
        "date": "2022-10-05",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/288289728",
        "timezone": "America/New_York",
        "description": "Intro to OWASP Mission\nOverview of OWASP Projects and Resources\nA Brief History of OWASP Orlando\nCall for Volunteers for OWASP Orlando"
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Intro to Burp Suite ",
        "date": "2022-10-12",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/288531135",
        "timezone": "America/Los_Angeles",
        "description": "Join PDX OWASP for a in person event sponsored by NetSpi.\n\n**Abstract:**\nIntroduction to Burp Suite, the differences between the Community (free) and Pro Editions, and the major tools and features it provides. We will be testing against OWASP’s Juice Shop that will be hosted in the cloud, so participants will be able to get some hands-on experience. Slides of the presentation will be provided, as well as links to resources to continue learning.\n\n**Shane Kell:**\nI started with NetSPI this past January in the NetSPI U program, getting a crash course in Web Application testing for 6 months, and currently work as a Security Consultant testing Web Applications for various clients.\n\nDuring the pandemic I upskilled in several ways. I used TryHackMe, HackTheBox, and TCM to learn and practice new skills. I also found ways to add developing my cyber security skillset to my development plan at work, and this was how I was able to participate in a Vuln Hub hacking group that was hosted by Nike’s Red Team when I was a contractor there. They run it like a book club for hackers, picking a new vuln box every two weeks, show newcomers the ropes, and work on more advanced topics depending on the box that is selected. I also have an associate degree in Computer Information Systems and do my share of hacking on my own time. I am currently learning how to deconstruct, tweak, and recompile Android apps, and how to breach and move laterally within the Active Directory environment.\n\nThere are many free or reasonably priced Cyber Security resources available, and I am happy to share what I know of them."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2022-09-29",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/288385351",
        "timezone": "America/New_York",
        "description": "TBA"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Kubernetes Pentest 101",
        "date": "2022-10-22",
        "time": "5:30+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/288495546",
        "timezone": "Asia/Kolkata",
        "description": "The adoption of Kubernetes use in production has increased to 83% from a survey by CNCF. The participants will be learning Tactics, Techniques, and Procedures (TTP) to attack and assess Kubernetes cluster environments at different layers like Supply chain, Infrastructure, Runtime, and many others.\n\nRegistration Form Link - https://forms.gle/kMDcBm6ZmMpEP8He6"
    },
    {
        "group": "Hyderabad",
        "repo": "www-chapter-hyderabad",
        "name": "OWASP Hyderabad Chapter Meet - Sept 2022",
        "date": "2022-09-24",
        "time": "1:00+05:30",
        "link": "https://www.meetup.com/hyderabad-owasp-meetup-group/events/288548985",
        "timezone": "Asia/Kolkata",
        "description": "Hello OWASPIANS ,\n\nIt's a great pleasure to announce the OWASP Hyderabad Chapter monthly meetup\n\nThe following talks are lined up for the day :\nAPI Pentest - (API basics, pentest and to secure) Deep dive by Anas Khan\n\nAbout Mr.Anas Khan: Anas Ali Khan (r3dg33k) - Bug bounty : prtg, SoundCloud, Asus\nWorking as a pentester (Bahrain). with 8 + years of experience into Vulnerability Detection and Bug bounty. CVE allotted by Asus and toshiba (CVE-2020-5569) and for nuclie by project discovery.\nAreas of interest: network, mobile and web application pentesting. External attack surface management/enumeration and osint. Exploring open source tool specific to enumeration/vulnerabilities and osint. C2 frameworks : covenant and cobalt strike\nOscp certified, ceh master and crto\n\nOWASP HYDERABAD CHAPTER MEET\n\nTopic: OWASP Hyderabad Chapter Meet\n\nTime: Sep 24, 2022 11:00 AM Mumbai, Kolkata, New Delhi\n\nJoin Zoom Meeting\n[https://us06web.zoom.us/j/83658414957?pwd=dTlKUDkySVJ3NDZqdjJxWkc2eTdBdz09](https://us06web.zoom.us/j/83658414957?pwd=dTlKUDkySVJ3NDZqdjJxWkc2eTdBdz09)\n\nMeeting ID: 836 5841 4957\n\nOne tap mobile\n+13126266799,,83658414957# US (Chicago)\n+13462487799,,83658414957# US (Houston)\n\nDial by your location\n+1 346 248 7799 US (Houston)\n+1 669 900 6833 US (San Jose)\n+1 929 436 2866 US (New York)\n+1 253 215 8782 US (Tacoma)\n+1 301 715 8592 US (Washington DC)\n+1 312 626 6799 US (Chicago)\nMeeting ID: 881 2411 3233\nFind your local number: [https://us06web.zoom.us/u/kcl26qI7Up](https://us06web.zoom.us/u/kcl26qI7Up)"
    },
    {
        "group": "Pune",
        "repo": "www-chapter-pune",
        "name": "OWASP Pune Meet with API Security 24th Sep 2022",
        "date": "2022-09-24",
        "time": "0:15+05:30",
        "link": "https://www.meetup.com/owasp-pune-chapter/events/288620559",
        "timezone": "Asia/Kolkata",
        "description": "In a world where APIs have become so critical to the proper functioning of mission-critical applications, how do organizations ensure that their APIs are constantly evaluated for their security and performance issues?\n\nWe are organizing this event in collaboration with [AWS UG Pune](https://www.meetup.com/puneawsug) and [API Security India](https://www.meetup.com/api-security-india).\n\n***Agenda:***\n10:30 AM - 10:45 AM: Welcome Note by Organizers\n\n10:45 AM - 11:15 AM: **Talk 1: *Protect what matters!,* Speaker:** Shubham Jindal, Technical Lead, TraceableAI\n\n11:15 AM - 11:45 AM: **Talk 2: *API testing methodology,* Speaker:** Jyoti Raval, Staff Product Security Engineer, Harness\n\n11:45 AM - 12:00 AM: **Talk 3 [Lightening Talk]: SecOps automation with Open Source, Speaker:** Abhishek Saxena, Founder & CEO, Unskript\n\n12:00 PM - 12:30 PM: Lunch & networking\n\n12:30 PM - 1:00 PM: **Talk 4: vPrioritizer: the art of risk prioritization, Speaker:** Pramod Rana, Manager - Application Security, NetSkope\n\n1:00 PM - 1:30 PM: **Talk 5: Digital Payments, APIs, and Security, Speaker:** Karan Manshani, Vice President - Payments, Easebuzz\n\n1:30 PM - 2:00 PM: **Talk 6:** ***Demystifying cloud security with AWS: fundamentals and best practices,* Speaker:** Vishal Alhat, Senior Engineer, Forcepoint Inc.\n\n2:00 PM - 2:15 PM: closing & giveaways"
    },
    {
        "group": "Cluj",
        "repo": "www-chapter-cluj",
        "name": "OWASP Cluj Sept Chapter Meeting",
        "date": "2022-09-29",
        "time": "8:30+03:00",
        "link": "https://www.meetup.com/owasp-cluj-napoca-chapter/events/288131985",
        "timezone": "Europe/Bucharest",
        "description": "We welcome you to our Sept Chapter meeting\n\nAgenda:\n**Robert Suciaghi** Intro (10 min)\n**Stefan Farr** Zero Trust (20 min + 10 min Q&A)\nBreak (20 min)\n**Gustavo Silva** Surface Security (20 min + 10 min Q&A)\n**Rares Preda** Cyber Threat Landscape (20 min + 10 min Q&A)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "API Security in a DevSecOps World",
        "date": "2022-10-18",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/288499628",
        "timezone": "Europe/London",
        "description": "Talk: API security in a DevSecOps setting. Covering Security tools and application security operations.\n\nSpeaker: Paul McCabe has worked in Cyber security for 25 years working for Barclays, IBM and the Financial Regulator in Security Consultancy, Security Engineering and Cryptography Operations. He currently manages an application security team co-ordinating assessments for Regulatory Compliance.\n\nAgenda:\n\n* OWASP updates\n* Guest speaker\n* Q&A"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - September 2022",
        "date": "2022-09-27",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/288598563",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nLive attempt of a HTB machine or challenge."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": " What is eBPF and why should you care?",
        "date": "2022-10-20",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/285365525",
        "timezone": "Europe/London",
        "description": "Agenda:\n\n* OWASP Updates\n* Talk: What is eBPF and why should you care? with Kev Sheldrake\n* Open discussion\n\nTitle: What is eBPF and why should you care?\nAbstract: eBPF is relatively new and “a revolutionary technology with origins in the Linux kernel that can run sandboxed programs in an operating system kernel.” You can achieve similar results to writing a kernel module, but in a (supposedly – we’ll come to that) safe manner. eBPF code runs in a virtual machine and, depending on the program type, can access all sorts of kernel internals, with programs being launched when specified code points get hit.\n\nI will talk about the basics and how to get up and running, the challenges and pitfalls to overcome, a library I wrote when working at Sysinternals to take away some of the pain, the Sysmon For Linux tool I wrote for Sysinternals that logs events to Syslog, and Cilium/Tetragon (and Cilium/ebpf library) that makes accessing eBPF for system observability easier. I will discuss technical details and explain the different use cases that might benefit you, from blue team using Sysmon and Cilium/Tetragon to achieve super powerful abilities, to researchers building custom program tracers, to red team exploiting kernel vulns, to sysadmins seeking performance issues.\n\nIt is a truly exciting thing that everyone is talking about.\n\nBio: Kev Sheldrake is a security software engineer and researcher who started working in the technical security field in 1997. Over the years, Kev has been a developer and systems administrator of ‘secure’ systems, an infosec policy consultant, a penetration tester, a reverse engineer and an entrepreneur who founded and ran his own security consulting company. He currently works at Isovalent on the open source and enterprise versions of the system observability tool Tetragon, and in the past he specialised in IoT, crypto, and tool development for a number of years.\nTwitter: [@kevsecurity](https://twitter.com/kevsecurity)"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "API Security in a DevSecOps World",
        "date": "2022-10-18",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/288558656",
        "timezone": "Europe/London",
        "description": "**Talk**: API security in a DevSecOps setting. Covering Security tools and application security operations.\n\n**Speaker**: Paul McCabe has worked in Cyber security for 25 years working for Barclays, IBM and the Financial Regulator in Security Consultancy, Security Engineering and Cryptography Operations. He currently manages an application security team co-ordinating assessments for Regulatory Compliance.\n\n**Agenda**:\nOWASP updates\nGuest speaker\nQ&A"
    },
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - September",
        "date": "2022-09-29",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/282652945",
        "timezone": "Europe/Copenhagen",
        "description": "Notice that this is a physical event and that DEIF will be hosting it. By signing up, you accept that OWASP Aarhus may hand over a list of participants to DEIF for the sole purpose of hosting this event.\nAlso, DEIF and/or OWASP Aarhus may be taking pictures and posting them on social media. Please let us know if you do not wish to be present in the pictures.\n\n19:00 - 19:30\n\"Welcome, Food and Drinks\" by DEIF and OWASP Chapter Aarhus\n\n**19:30 - 19:45 “IEC 62443” by Claus Riber, Senior Manager, Software Cyber Security at BEUMER Group**\n\nAbout the presentation:\nIEC 62443 is an international series of standards that addresses cybersecurity for operational technology in automation and control systems. The standards describes both technical and process-related aspects.\nAgenda:\n\\- Overview of the standards\n\\- How we defined the security program for improving cyber security in our deliveries\n\\- What is the outcome of the first large step\\, leading to process descriptions and the first certificate of compliance\n\\- What are the next steps\n\\- What are our experiences with the standards\\, implementation and certification process\n\nAbout Claus:\nAfter some years as a developer/architect I focused on management and security, and was for some years department manager leading sales, development and operation of security products and services. In that role I have been responsible for ISO 27001 and GDPR process implementation and certifications.\nAfter joining BEUMER in 2020, I'm responsible for the security in our SW deliveries.\n\nA large part of my job is defining and managing our security program, including Secure Development Lifecycle processes with a virtual team of experts.\n\nI believe I have the necessary patience and persistence and enjoy when my colleagues also see the light of security and processes.\nI have an old master in computer science from AU, followed much later by a diploma in management and latest CISSP and CCSK exams.\n\n**20:00 - 20:45 \"IEC62443, Practically executed\" by Helge Jensen, Full vertical leader: Business, Technology and Cyber Security**\n\nAbout Helge:\nHelge Jensen has built two software consultancies business around data and cyber-security in the energy industries, and is now an angel investor and independent consultant helping change culture and performance of operational security in large enterprises.\n\nAbout the presentation:\nThe session \"IEC62443, Practically executed\" will leave you better prepared for your Cyber Security journey. We will zoom in to specifics via some of the major challenges using IEC62443 (and other standards) to improve cyber security in a frank and direct style. The talk will serve several observations collected in practical settings in the energy industry, and allow raising some of those burning and hard questions.\n\n20:45 - 21:00\nGoodbyes and plans going forward by OWASP Chapter Aarhus"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "AppSec & Cybersecurity Governance (ASSG)",
        "date": "2022-10-07",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/288376867",
        "timezone": "Europe/Rome",
        "description": "This one-day free conference is intended to appeal to application security professionals, professional software developers, software quality engineers and computer science students. The conference goal is to stimulate interest in application and secure software engineering practices and new initiatives within organizations.\n\nThe program of the event is published on the official website: https://sites.google.com/owasp.org/assg2022\n\n**The event will be on site! Please only register if you really plan to attend it!**"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "October 2022 OWASP Chapter Netherlands Meetup",
        "date": "2022-10-20",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/288558159",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** (Near) Utrecht\n\n**More information:** To be announced shortly."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm Educating Society about Online Safety [Virtual]",
        "date": "2022-10-06",
        "time": "7:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/288621525",
        "timezone": "Europe/Stockholm",
        "description": "Welcome to another online virtual OWASP Stockholm event!\n\nCyber security and online safety has never been more important than it is today. How do we promote good online safety practice to groups that need it most? Do companies that have the technical expertise in this area have a corporate responsibility to share their knowledge with the public at large? Join this session to see how several organisations have taken onboard that responsibility and have created outreach programs to spread cybersecurity safety knowledge to the following segments in society:\n\n* School students, teachers and parents.\n* Female victims of domestic violence\n* Old age pensioners and the elderly\n\n**Schools and Teachers (The Cybersecurity Academy)**\nJudith Maiers and Evelina Pärnerud will talk about [the Cybersecurity Academy](https://cybersecurityacademy.se/), a joint initiative with IBM and Young Scientists, which offers training in network security for students and teachers. The aim of the project is to spread knowledge about responsible use of the internet. The initiative provides free lectures by IT experts and teaching materials for schools. The [Swedish Civil Contingencies Agency](https://www.msb.se/) supports the project with funding\n\n**Female Victims of Men's Violence (Digital Freedom For Women)**\nMatilda Sjöstrand and Åsa Holmberg will present the [Digital Women's Freedom](https://www.digitalkvinnofrid.se/) project, which is run by [Sentor](https://www.sentor.se/) and[ Uppsala Women's Shelter](https://www.uppsalakvinnojour.se/) with the aim of protecting women who live under the threat of digital violence, stalking and persecution from men. The project aims to increase the IT and information security skills of women's shelters and other businesses that meet victims of **domestic violence**, as well as to provide women's shelters with concrete tools for enhanced security work.\n\n**Seniors and Pensioners**\nPensioners and the elderly have become a high-risk group in the online community, where their lack of familiarity with the internet and limited technical skills can make them a target for online criminals and scammers. [Björn Appelgren](https://www.linkedin.com/in/bj%C3%B6rn-appelgren-707229103/) from the [Swedish Internet Foundation](https://internetstiftelsen.se/) will discuss the educational material the foundation has produced to help education the elderly in society about the risks and challenges of navigating through their online lives in 2022.\n\n**Speaker Bio:**\n**Judith Maiers**\n[Judith Maiers](https://www.linkedin.com/in/judithmaiers/) works as a project manager at the non-profit organisation Young Scientists ([Unga Forskare](https://ungaforskare.se/)). There she is responsible for the [Cybersecurity Academy](https://cybersecurityacademy.se/), a joint initiative with IBM. The initiative provides free lectures by IT experts and teaching materials for schools. At present, about 15 IT companies are affiliated to the initiative and contribute with volunteer time. The [Swedish Civil Contingencies Agency (MSB)](https://www.msb.se/) supports the project with funding.\n\n**Evelina Pärnerud**\n[Evelina](https://www.linkedin.com/in/evelina-p%C3%A4rnerud-99718b16/) leads the IBM CSR work in Northern Europe (the Nordic countries and the Benelux). It is important that everyone in the society has the possibility to take part of the digitalization journey we all are on and therefore the CSR work at IBM has a clear focus on Education & Skills. Evelina drives several initiatives which are focusing on upskilling both youths and adults. In Sweden [the Cybersecurity Academy](https://cybersecurityacademy.se/), is one of the biggest initiatives.\n\n**Matilda Sjöstrand**\nMatilda Sjöstrand is responsible for CSR at the cybersecurity company [Sentor](https://www.sentor.se/), part of Accenture. She is one of the initiators of the [Digital Women's Freedom project](https://www.digitalkvinnofrid.se/), and has both led the project and trained staff in women's shelters for almost four years.\n\n**Åse Holmberg**\n[Åse Holmberg](https://www.linkedin.com/in/ase-holmberg/) is CEO at [Sentor](https://www.sentor.se/), a leading Swedish Cybersecurity firm that is part of Accenture. She has a degree in economics with a master's degree from the Gothenburg School of Economics, and has a long background from leading positions at Clas Ohlson, Tele2 and Lindex.\n\n**Björn Appelgren**\n[Björn Appelgren](https://www.linkedin.com/in/bj%C3%B6rn-appelgren-707229103/) works as public education officer and project leader at the [Swedish Internet Foundation](https://internetstiftelsen.se/). He has a background as a high school teacher and has also worked with public education issues at [Swedish Educational Radio (UR) ](https://www.ur.se/)that produces educational radio/tv programs for the public broadcasting channels.\n\n**Location**: Zoom ([link](https://us06web.zoom.us/j/83850194828?pwd=cXdSUWkvVFJNZTZpRW1VSW5adnFMdz09))\nTime: October 06, 17.30 – 19.30"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm Educating Society about Online Safety [Physical]",
        "date": "2022-10-06",
        "time": "7:00+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/288621586",
        "timezone": "Europe/Stockholm",
        "description": "Welcome to another physical OWASP Stockholm event!\n\n**Note - Doors Close 17:00 it is important you are at the meeting before 5pm. Some food and light refreshments will be available**\n\nCyber security and online safety has never been more important than it is today. How do we promote good online safety practice to groups that need it most? Do companies that have the technical expertise in this area have a corporate responsibility to share their knowledge with the public at large? Join this session to see how several organisations have taken onboard that responsibility and have created outreach programs to spread cybersecurity safety knowledge to the following segments in society:\n\n* Students, teachers and parents.\n* Female victims of domestic violence\n* The elderly\n\n**Schools and Teachers (The Cybersecurity Academy)**\nJudith Maiers and Evelina Pärnerud will talk about [the Cybersecurity Academy](https://cybersecurityacademy.se/), a joint initiative with IBM and Young Scientist, which offers training in network security for students and teachers. The aim of the project is to spread knowledge about responsible use of the internet. The initiative provides free lectures by IT experts and teaching materials for schools and is supported by the [Swedish Civil Contingencies Agency](https://www.msb.se/).\n\n**Domestic Violence Victims (Digital Women's Freedom)**\nMatilda Sjöstrand and Åse Holmberg will present the [Digital Women's Freedom](https://www.digitalkvinnofrid.se/) project, which is run by [Sentor](https://www.sentor.se/) and[ Uppsala Women's Shelter](https://www.uppsalakvinnojour.se/) with the aim of protecting women who live under the threat of digital violence, from men. The project aims to increase the IT and information security skills of women's shelters and other businesses that meet victims of **domestic violence**, as well as to provide women's shelters with concrete tools for enhanced security work.\n\n**Seniors and Pensioners**\nPensioners and the elderly have become a high-risk group in the online community, where their lack of familiarity with the internet and limited technical skills can make them a target for online criminals and scammers. [Björn Appelgren](https://www.linkedin.com/in/bj%C3%B6rn-appelgren-707229103/) from the [Swedish Internet Foundation](https://internetstiftelsen.se/) will discuss the educational material the foundation has produced to help education the elderly in society about the risks and challenges of navigating through their online lives in 2022.\n\n**Speaker Bio:**\n**Judith Maiers**\n[Judith Maiers](https://www.linkedin.com/in/judithmaiers/) works as a project manager at the non-profit organisation Young Scientists ([Unga Forskare](https://ungaforskare.se/)). There she is responsible for the [Cybersecurity Academy](https://cybersecurityacademy.se/), a joint initiative with IBM. The initiative provides free lectures by IT experts and teaching materials for schools. At present, about 15 IT companies are affiliated to the initiative and contribute with volunteer time. The [Swedish Civil Contingencies Agency (MSB)](https://www.msb.se/) supports the project with funding.\n\n**Evelina Pärnerud**\n[Evelina](https://www.linkedin.com/in/evelina-p%C3%A4rnerud-99718b16/) leads the IBM CSR work in Northern Europe (the Nordic countries and the Benelux). It is important that everyone in the society has the possibility to take part of the digitalization journey we all are on and therefore the CSR work at IBM has a clear focus on Education & Skills. Evelina drives several initiatives which are focusing on upskilling both youths and adults. In Sweden [the Cybersecurity Academy](https://cybersecurityacademy.se/), is one of the biggest initiatives.\n\n**Matilda Sjöstrand**\nMatilda Sjöstrand is responsible for CSR at the cybersecurity company [Sentor](https://www.sentor.se/), part of Accenture. She is one of the initiators of the [Digital Women's Freedom project](https://www.digitalkvinnofrid.se/), and has both led the project and trained staff in women's shelters for almost four years.\n\n**Åse Holmberg**\n[Åse Holmberg](https://www.linkedin.com/in/ase-holmberg/) is CEO at [Sentor](https://www.sentor.se/), a leading Swedish Cybersecurity firm that is part of Accenture. She has a degree in economics with a master's degree from the Gothenburg School of Economics, and has a long background from leading positions at Clas Ohlson, Tele2 and Lindex.\n\n**Björn Appelgren**\n[Björn Appelgren](https://www.linkedin.com/in/bj%C3%B6rn-appelgren-707229103/) works as public education officer and project leader at the [Swedish Internet Foundation](https://internetstiftelsen.se/). He has a background as a high school teacher and has also worked with public education issues at [Swedish Educational Radio (UR) ](https://www.ur.se/)that produces education radio/tv programs for the public broadcasting channels.\n\n**Location**:\nIBM Innovation Center\nKistagången 6, 164 40 Kista\nTime: October 06, 17.00 – 19.30"
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "TBC",
        "date": "2022-10-19",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/285847693",
        "timezone": "Europe/London",
        "description": "Hosted by OWASP Bristol in partnership with OWASP Suffolk.\n\nWe are looking to publish on @YouTube the recordings of our meetups. If you would like to be notified when we a new video is published, please feel free to subscribe on our channel at:\n\nhttps://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ"
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Hacking Mobile Games with Alex Rosenzweig",
        "date": "2022-09-23",
        "time": "1:00-04:00",
        "link": "https://www.meetup.com/owasp-devslop-project/events/288131564",
        "timezone": "America/Toronto",
        "description": " **ABSTRACT** \nLike many people Alex first got interested in cybersecurity by trying to find ways to hack/cheat at video games. Though his skills at Halo haven't improved he has managed to learn a thing or two about offensive security and will share some insights regarding mobile video game security.\n\n **Alex Rosenzweig** \nAlex is a Security Engineer at Afterpay with a passion for all things Offensive Security and Security Automation. [Connect with Alex on Linkedin](https://au.linkedin.com/in/alex-rosenzweig)."
    },
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "OWASP Quarterly Meeting",
        "date": "2022-10-04",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-bonita-springs-chapter/events/288160923",
        "timezone": "America/New_York",
        "description": "We generally review security related happenings, share tips and tricks for configuring software and hardware, and chat about various topics such as security, privacy, exploitation, vulnerabilities, pen testing, web app security, CTFs, IoT security, mobile security and anything else members wish to discuss."
    },
    {
        "group": "Indraprastha Institute Of Information Technology",
        "repo": "www-chapter-indraprastha-institute-of-information-technology",
        "name": "OWASP IIITD September Meetup",
        "date": "2022-09-24",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-indraprastha-institute-of-information-technology/events/288505455",
        "timezone": "Asia/Kolkata",
        "description": "**OWASP IIITD** is back with **another meetup!**\n\nThis time, it’s **more than just a meetup**. We have **two keynotes**, an exciting, fun and rewarding **cybersecurity quiz** in collaboration with ***Trivialis***, and a **mini-hack**!\n\n**Itinerary**\n\n* **12:00-12:15** Registrations\n* **12:30-13:00** Notes by the Organisers\n* **13:00-13:40** Keynote: “**OSINT For AppSec**” by **Mehul Arora (sociallyencrypted)**\n* **13:40-14:30** Refreshments and Mini-Hack\n* **14:30-16:00** **No (P)Cap Quiz**, a cybersec quiz in collaboration with Trivialis\n* **16:00-16:40** Keynote: “**Privacy 101 for Users and Devs**” by **Prateek Kumar**\n* **16:40-17:00** Closing Speech\n\n**Venue:** C201, Lecture Hall Complex, IIIT Delhi\n**Time:** 12 noon\n**Date:** Saturday, September 24, 2022"
    },
    {
        "group": "Amrita School Of Engineering",
        "repo": "www-chapter-amrita-school-of-engineering",
        "name": "Hands on session: OWASP TOP 10 Vulnerabilities",
        "date": "2022-09-30",
        "time": "9:00+05:30",
        "link": "https://www.meetup.com/owasp-amrita-school-of-engineering-chennai-chapter/events/288526950",
        "timezone": "Asia/Kolkata",
        "description": "This is **event** held within Amrita School of Engineering, Chennai campus. Mr. Melvin John is guest speaker, who will be inaugurating the student chapter as well as be conducting **[Hands on session: OWASP TOP 10 Vulnerabilities](https://owasp.org/www-chapter-amrita-school-of-engineering/)**."
    }
]