[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "AI Empowerment vs. Security Risk: Navigating the AppSec Challenges of AI Agents ",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304581179",
        "timezone": "America/New_York",
        "description": "In just a short span, AI Agents and low-code development have transformed how businesses operate, allowing users without coding backgrounds to create applications, automate processes, and streamline workflows. Business users are empowered as never before, using tools that merge AI with productivity—from email and business intelligence to application development. But while these tools amplify efficiency, they also introduce new security risks that challenge the traditional boundaries of IT and AppSec.\n\nAs security teams grapple with vulnerabilities like authorization misuse, data leakage, and the risk of exfiltration, they must decide how to approach the widespread adoption of AI-driven tools and low-code platforms without stifling innovation. In this session, we’ll explore recent research into the security challenges posed by AI agents and low-code development, emphasizing the pitfalls that emerge when business users become app creators. We’ll also outline how AppSec teams can adapt their approaches to balance security with productivity, ensuring they enable the business rather than block it."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "9. OWASP Augsburg Stammtisch",
        "date": "2025-02-26",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/306014620",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda**\n**Vortrag von Nina: Webapps aus der Perspektive einer Pentesterin**\n\nPentesting wird oft als „legales“ oder „beauftragtes“ Hacken bezeichnet. Doch oft gibt es Rätselraten, was dabei eigentlich passiert. Spoiler: keine Magie.\n\nIn diesem Vortrag gibt’s deshalb Einblicke hinter die Kulissen, um folgende Fragen zu beantworten:\n\n* Was ist eigentlich ein Pentest?\n* Wie ist das Vorgehen beim Pentesten (d)einer Webanwendung?\n* Welche typischen Schwachstellen gibt es in Webanwendungen?\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - February 2025 (Online)",
        "date": "2025-02-25",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489290",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n***When the Tool is the Weapon -- Abusing (and defending) native M365 applications***\nWhen you think about Business Email Compromise, you think about the mailbox, right? Malicious inbox rules, spoofed domains hijacking email threads, and phishing campaigns blasted to a user’s contact list are hallmarks of this type of attack. However, other applications within the M365 ecosystem are often leveraged by Threat Actors while they are in a compromised tenant.\n\nTeams, SharePoint, E-Discovery, and OneNote can and have been abused by threat actors during a business email compromise. Initial access, exfil, and leapfrogging to new victims can happen in a way that will not throw any alerts. What are the threat actors doing with these apps, how can we detect it, and how can we stop it?\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nIf you want to attend in-person, please see [Eventbrite](https://owasp-austin-2025-february.eventbrite.com). Please do not pull an in-person ticket unless you are going to attend as we purchase lunch for all in-person attendees."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "February 2025 OWASP Happy Hour sponsored by Cyera",
        "date": "2025-02-13",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305616287",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, February 13th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cyera](https://cyera.io/)\n*Cyera is an AI-powered data security platform that helps organizations manage and protect their data in today’s complex digital landscape. The company’s platform combines advanced Data Security Posture Management (DSPM) with real-time enforcement controls, providing customers with a comprehensive solution for securing their data assets against evolving threats. Learn more at cyera.io.*"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "NULL / OWASP Bangalore Combined 15 February 2025",
        "date": "2025-02-15",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/306113996",
        "timezone": "Asia/Kolkata",
        "description": "Join the [Null Bangalore](https://www.linkedin.com/in/nullblr/) & OWASP Bangalore Combined Meetup – February 15, 2025!\n\nGet ready for an exciting day filled with top-tier security talks, hands-on discussions, and networking with the best minds in cybersecurity!\n\n Date: Saturday, February 15, 2025\n Venue: Flipkart Internet Pvt Ltd (ETV Campus), Tower 5A, Embassy Tech Village Rd, Bengaluru, Karnataka 560103\n⏰ Time: 09:30 AM – 02:00 PM\n Free Entry \\| Open to All \\| No Registration Limits\n\nAgenda Highlights:\n Software Supply Chain Attacks – Arjun BM\n Simplifying Security with Local AI Agents – Abhinandan Khurana\n OpSec on the High Seas: A Gophish Adventure – @abhijeet\n Hunting Malware using Memory Forensics – Monnappa K A\n\nDon’t miss this opportunity to learn, share, and connect with the open security community!\n\n Event details & registration:\n[https://lnkd.in/eW7sij8Z](https://lnkd.in/eW7sij8Z)"
    },
    {
        "group": "Belo Horizonte",
        "repo": "www-chapter-belo-horizonte",
        "name": " OWASP BH: Hacking a Bank Without Leaving Your Bedroom",
        "date": "2025-02-21",
        "time": "20:00-03:00",
        "link": "https://www.meetup.com/owasp-belo-horizonte-chapter/events/306048579",
        "timezone": "America/Sao_Paulo",
        "description": "Temos o prazer de convidá-los para o nosso próximo evento que acontecerá no dia **21/02**, às **20 horas**. Será uma oportunidade incrível para nos aprofundarmos no mundo da segurança cibernética e hacking ético.\n\n** Detalhes do Evento**\nData: **21 de Fevereiro de 2025**\nHorário: **20:00**\nPlataforma: **[Zoom](https://us06web.zoom.us/j/82672501627?pwd=MmDbiRIXJR5bb87FbyUja1J91WIm96.1)**\n\n **Sobre a Palestra**\nNesta palestra, Arthur compartilhará suas experiências e insights sobre como é possível explorar vulnerabilidades e os caminhos para fortalecer a segurança de sistemas financeiros sem sair do conforto de casa.\n\n**‍ Sobre o Palestrante**\n[Arthur Aires](https://www.linkedin.com/in/arthur-aires-93388211b/)\n\nArthur Aires é Bug Hunter e pentester com mais de 3 anos de experiência, tendo destaque internacional na categoria. Ele atua em pentestes e testes de vulnerabilidades, gerenciamento de equipes, avaliações de Red Team, divulgação de vulnerabilidades, entre outros. Foi convidado cinco vezes pela HackerOne (H1-512, H1-702-2022, H1-3493, H1-702-2023 e H1-702-2024) para o Live Hacking Event, onde pôde colaborar pessoalmente com a segurança de empresas como PayPal, AWS, Amazon e Zoom.\n\nContamos com a presença de todos para um momento enriquecedor de aprendizado e troca de experiências!"
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland: Contrast Security Demonstration",
        "date": "2025-02-18",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/305067809",
        "timezone": "America/New_York",
        "description": "Join us on Tuesday, February 18th at Market Avenue Wine Bar for a hands-on lab demonstration with Contrast Security. The presentation will go over features and limitations of Contrasts RAST tool. This session is designed for everyone, whether you decide to participate or not.\n\nContrast is an Application Security solution used by companies like AARP, InfoSys, Citizens Bank, Snap Finance, and more."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Authentication Demystified: Basic Auth to Web Tokens in 60 minutes",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/305318149",
        "timezone": "America/New_York",
        "description": "Welcome to 2025! Both the speaker and I are off at CodeMash in January, so we are going to start our EVERY MONTH transition in February!\n\nWe'll start off with a few highlights related to what is new in the world of appsec, and have a good-of-the-order style chat about the year, and then ... Have you ever searched for \"how to authenticate an API call\" and been confused by the dizzying array of techniques, terminology, jargon, and acronyms that come back?\n\nThis session is designed for anyone that's struggling to make sense of modern authentication options. You'll learn the differences between OAuth, API Keys, HMAC, JSON Web Tokens (JWT), SAML, OpenID Connect, and passkeys using Webauthn. Each technique will be explained in a clear, practical, easy-to-understand way.\n\nThis session focuses on core concepts, not code, and is accessible to anyone that works with technology."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #70 - OWASP meets Legal & Regulations",
        "date": "2025-02-26",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/305522192",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #70! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n* **Rechtssicher durch den Cybervorfall:** We are excited to welcome **Olga Stepanova** and **Dirk Koch** \\- both partners at ByteLaw \\- who will guide you through the rough waters on how you can protect your company from the legal consequences of a cyber incident\\. Experts explain current threats such as ransomware and business email compromise and provide practical tips on how to deal with perpetrators\\, authorities and insurance companies in a legally secure manner\\.\n* **Regulatory Affairs for Hackers:** It's not just since the GDPR that we've known what a resounding impact legal changes can have, but what else can we possibly expect when regulation gets really strict?\n**Leon Holub**, product owner of the Regulatory Radar platform at Johner Institute GmbH tries to give an insight into the world of legal requirements for medical devices, from a perspective of a software developer who has immersed himself in the details of the world's regulatory systems not too long ago.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **26.02.2025** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 , located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy @ Security Summit 2025",
        "date": "2025-03-13",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/305915839",
        "timezone": "Europe/Rome",
        "description": "   -    -  - ://.\n\nAnche quest'anno OWASP Italy è ospite del Security Summit Milano, con una sessione interamente dedicata all'Application Security.\n\nLa sessione è rivolta a professionisti della sicurezza delle applicazioni, sviluppatori di software professionali, ingegneri della qualità del software, ricercatori e studenti di informatica. L'obiettivo della sessione è stimolare l'interesse per le pratiche di ingegneria del software applicativo e sicuro e per le nuove iniziative all'interno delle organizzazioni.\n\nAll'interno della sessione, saranno ospitate 2 talk da 20 minuti ciascuna, per i quali è aperta la Call for Talks qui di seguito descritta.\n\nGli argomenti speciali di interesse sono i seguenti:\n\\- AppSec\n\\- Intelligenza artificiale \\(AI\\)\n\\- Sicurezza per applicazioni mobile\\, cloud e serverless\n\\- Blockchain e Internet of Things per usi legati alla sicurezza\n\\- Penetration testing e attacchi a livello applicativo\n\\- Threat modeling\\, architettura delle applicazioni e dei sistemi\n\\- DevSecOps\n\\- Pianificazione e implementazione di un programma di sicurezza applicativa\n\\- Creazione di un team e di una cultura dedicata alla sicurezza applicativa \\(AppSec\\)\n\nIncoraggiamo i professionisti della sicurezza delle applicazioni, gli sviluppatori di software professionali, gli ingegneri della qualità del software, i ricercatori e gli studenti di informatica a presentare proposte come opportunità per condividere le conoscenze e le lezioni apprese su argomenti rilevanti per la sicurezza delle applicazioni e del software con una precedente esperienza di presentazione alle conferenze sulla sicurezza.\n\n \nI candidati speaker possono inviare un abstract del loro intervento proposto tramite Easychair entro il 14 Febbraio 2025. Il link Easychair per l'invio è riportato di seguito.\n\nL'abstract deve essere in formato PDF e deve contenere le seguenti informazioni:\n\\- Nome e cognome del relatore\n\\- Istituzioni e ruoli ricoperti dal relatore\n\\- Breve biografia del relatore\n\\- Titolo del contributo\n\\- Abstract della presentazione\nLa presentazione non deve superare le 2 pagine complessive. Non sono previsti ulteriori requisiti di formattazione.\nLa durata prevista degli interventi proposti è di 20 minuti.\nLe presentazioni saranno esaminate dal comitato di programma e le proposte di intervento più interessanti saranno selezionate per la conferenza.\n\n  : 14 Febbraio 2025\n  : 21 Febbraio 2025\n: 13 Marzo.\n\n : [https://lnkd.in/dzGHvz7Q](https://lnkd.in/dzGHvz7Q)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Meeting ",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242794",
        "timezone": "America/New_York",
        "description": "Introduction to OWASP projects. New Members drive."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Essentials: An Overview of Key Projects and Best Practice",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242793",
        "timezone": "America/New_York",
        "description": "Join us for a high-level introduction to the Open Web Application Security Project (OWASP) foundation. We’ll explore its most notable resources—like the OWASP Top 10, Zed Attack Proxy (ZAP), and the Application Security Verification Standard (ASVS)—and discuss practical ways to use them in everyday development and security workflows. This session is perfect for those new to OWASP or looking to brush up on core concepts.\n\nPresented by Francois Fried."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "SCaLE 22x – the 22nd Annual Southern California Linux Expo",
        "date": "2025-03-06",
        "time": "09:00-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306004903",
        "timezone": "America/Los_Angeles",
        "description": "***SCaLE22x – the 22nd Annual Southern California Linux Expo***, will take place March 6-9, 2025 at the Pasadena Convention Center in Pasadena, CA. \\*\\*[Register Now](https://register.socallinuxexpo.org/reg6/)\\*\\* using code **OWASP** to receive a **50% discount off registration!**\n\n**SCaLE** is the largest community-run open-source and free software conference in North America. It is held annually in the greater Los Angeles area.\nSeveral **co-located Events**, including Cloud Native Days LA, DevOpsDay LA, PlanetNix, Beginner Linux Training, UbuCon will kickoff the conference on **Thursday**.\n**Expo** is open Friday - Sunday.\n**Talks and workshops** are Thursday - Sunday.\n\n[Solomon Hykes](https://www.socallinuxexpo.org/scale/22x/speakers/solomon-hykes), creator of Docker and co-founder of Dagger.io will deliver the opening keynote, \"Robots building Robots\", while [Leslie Lamport](https://www.socallinuxexpo.org/scale/22x/speakers/leslie-lamport), Turing Award winner and pioneer in the field of distributed computing will close the conference Sunday evening.\n\nIn between, there are dozens of talks and workshops available spanning nine tracks: Security, Developer, FOSS @ HOME, Open Source AI, Cloud Native, Kernel & Low Level Systems, Systems & Infrastructure, Observability, and General.\n\nDon't miss this amazing opportunity to attend this conference and expand your knowledge or brush up on what you already know. \\*\\*[Register Now](https://register.socallinuxexpo.org/reg6/)\\*\\* using code **OWASP** to receive a **50% discount off registration!**\n\n/\\*\\* THIS IS A PAID CONFERENCE \\*\\*/\nAnd finally **don't forget** to visit us at the OWASP Los Angeles booth!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "To be Announced",
        "date": "2025-02-26",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/305822172",
        "timezone": "America/Los_Angeles",
        "description": "**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Web Security Code Review Workshop",
        "date": "2025-02-18",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/305822087",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Hands-on Web Security Code Review Workshop\nHello AppSec teams and tech enthusiasts! We're thrilled to roll out an exceptional Web Security Code Review Workshop in collaboration with **OWASP LA** and offered by OWASP.\n\n**Abstract:** Learn how to identify vulnerabilities through effective manual security code reviews. In this workshop, we’ll analyze real-world code examples, uncover common flaws like injections and authentication issues, and explore how to leverage built-in security features. You’ll gain practical skills to complement automated tools and confidently tackle security challenges in real codebases. Ideal for developers, AppSec engineers, and code reviewers, this session focuses on practical techniques and real-world impact.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\nhttps://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "2nd Annual 2025 OWASP Maine Secure Coding Tournament",
        "date": "2025-03-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-maine/events/305886218",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 2nd annual OWASP Maine Secure Coding Tournament! This will be an in-person meetup where we welcome all software developers and appsec professionals from entry-level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2025!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* TBD VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* TBD VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* TBD VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Thursday March 6th 2025 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:**\nTBD\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "February meetup",
        "date": "2025-02-25",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/305641736",
        "timezone": "America/Chicago",
        "description": "**Tracy Walker, principal solutions architect, DefectDojo**\n**Enhancing Open Source Tools Using AI: A \"No Code\" Journey to Build an Automated DefectDojo Parser Generator**\n\nFor February's talk, we welcome DefectDojo, the open-source OWASP flagship project for vulnerability management. See a live demonstration of using AI to accelerate the ability to adopt new, custom or unsupported security tools into DefectDojo, an open-source vulnerability management platform. Tracy Walker will demonstrate how he leverages AI LLM assistance to build security tool parsers from scratch, making tool integration accessible to security practitioners of all technical levels. Through live examples, attendees will learn how AI can help map and normalize security data, generate code and unit tests while maintaining code quality and existing parser best practices -- without actually \"writing\" code.\n\nPerfect for security engineers, DevSecOps practitioners, and anyone interested in enhancing their security toolchain through open source solutions and collaboration.\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nDefectDojo is graciously providing food and drink for the event.\n\nPlease remember to register and keep your registration up to date so we know how many to expect."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": " AI is here for business users. What does that mean for AppSec?",
        "date": "2025-03-12",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/304456309",
        "timezone": "America/Chicago",
        "description": "Gone are the days where you needed to have a coding background in order to create apps, automate processes, or reduce the need for manual tasks. Now, emails and communications are sent quicker, code is written faster, and applications are built en masse. Business users are enabled and empowered in ways we never dreamed of even 12 months ago. Thanks to the injection of AI into essentially every business productivity tool, from email to business intelligence to application development, business users are able to get more done without needing IT or dev teams to get involved. However, as is often the case, productivity and ease can come at the expense of security if not controlled properly. As people are brought closer to technology through the use of Gen AI tools and Copilots, security teams are facing difficult decisions on whether to clamp down on the use of these tools, or staring down increased likelihoods of data leakage and exfiltration. For a long time, security has been seen as a business blocker, but the introduction of Gen AI is forcing a reset on organizations that presents an opportunity for security to act as a business enabler."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "February 2025 OWASP Chapter Netherlands Meetup",
        "date": "2025-02-13",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/305251997",
        "timezone": "Europe/Amsterdam",
        "description": "See [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **The AI Who Shagged Me!** by **Ali Abdollahi**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Behind the Breach: Understanding and Preventing Web Vulnerabilities** by **Mitchel Koster**\n\n**The AI Who Shagged Me!**\n*Abstract:*\nIn today’s ever-changing world of cybersecurity, bringing AI into red teaming exercises is an exciting way to boost how we assess our organizational defenses. This approach fits well with frameworks like TIBER, which focus on creating realistic simulations of cyber threats. It’s all about making our defenses stronger and more effective! AI algorithms effectively analyze large datasets to identify emerging threats and tactics, aiding in realistic attack simulations. AI-driven tools help replicate complex attacks, providing red teams with thorough assessments of security measures. Using AI-generated anomalies enhances detection capabilities and strengthens incident response plans. However, the integration of AI into red teaming is not without challenges. This discussion aims to provide a nuanced overview of the application of AI in red teaming exercises, examining its potential benefits and limitations within established frameworks like TIBER. By critically evaluating this integration, we can better understand how to harness AI’s capabilities to strengthen cybersecurity offense and defense.\n*Bio:*\nAli is a cybersecurity researcher with over 12 years of experience. Currently, he is the application and offensive security manager at Canon EMEA. He studied computer engineering, published articles, and holds several professional certificates. Ali is a Microsoft MVP and regular speaker or trainer at industry conferences and events.\n\n**Behind the Breach: Understanding and Preventing Web Vulnerabilities**\n*Abstract:*\n“Behind the Breach: Understanding and Preventing Web Vulnerabilities delves into the transformation of modern web applications and architecture, showcasing how advancements in frameworks and browser technologies have revolutionized security. Yet, even with these innovations, attackers persist in uncovering and exploiting vulnerabilities. Drawing from real-world case studies across industries—from agile startups to global enterprises—this presentation not only demonstrates how a deeper understanding of security can thwart these threats, but also highlights how effectively conveying the potential impact of vulnerabilities is key to prioritizing security efforts.”\n*Bio:*\nMitchel Koster is the Chief Security Researcher at Breachlock, where he leads the development of new security products and conducts research and engagements for high-profile clients. His work includes Red and Purple Team exercises and addressing custom security requirements across diverse sectors, including Aviation and Healthcare. With a background in computer science, embedded systems, and programming, Mitchel bridges the gap between modern software development practices and robust security measures.\n\nFor parking, there’s a (paid) parking space less than 5 minutes away at the Q-Park Hermitage. ([ https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88](https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88) )\n\nAlso a 5 minute walk is the Zaandam station. ([ https://maps.app.goo.gl/3emKrp4ygx41SoN67](https://maps.app.goo.gl/3emKrp4ygx41SoN67) )"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2025-03-11",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/305744864",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2025, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe present an introductory talk about the OWASP Top 10 (2021 edition) with a new item each meeting.\n\nOur Top 10 topic for March 2025 will be **A06:2021 - Vulnerable and Outdated Components**.\n\n**Technical Topic Speaker:** Jagan Boda (Jay)\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact Austin (austin.chamberlain@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be Austin talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2025-03-11",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/305744832",
        "timezone": "Pacific/Auckland",
        "description": "This is the regular OWASP Auckland Meetup schedule.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for November will be **A06:2021 - Vulnerable and Outdated Components**.\n\n**Technical Topic Speaker:** Jagan Boda (Jay)\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact Austin (austin.chamberlain@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be Austin talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle February 2025",
        "date": "2025-02-19",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/305613479",
        "timezone": "Europe/London",
        "description": "We're back with our first event of 2025! We’ll be doing our usual two talks and pizza format.\n\nLocation: Opencast Software, Unit 2, The Kiln, Hoults Yard, Newcastle‑upon‑Tyne NE6 1AB.\nThere is free onsite registered parking. To register, attendees must enter their details into an iPad upon entering the Opencast office otherwise a parking fine may be issued.\nNeither OWASP Newcastle or Opencast can assist with or be responsible for parking issues, you do so at your own risk.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1830 OWASP Newcastle Welcome\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk one\n**Title:** Harassed by Hamas: Israel’s Cyberwar\n**Speaker:** Andy Pannell\n**Speaker Bio:** Andy Pannell is an accomplished application security lead with a keen focus on safeguarding product and cloud security for a prominent mobile ride-hailing company. His expertise lies in identifying vulnerabilities, implementing robust security measures, and ensuring the integrity of critical systems.\nOutside the digital realm, Andy indulges in a passion that balances the binary code: endurance racing. Andy spends hours at racetracks, appreciating the symphony of precision engineering and adrenaline-fueled competition.\n**Talk Synopsis:** This presentation examines (in my opinion) one of the most recently overused phrases in the media “cyber war”, and what it actually means in reality for us cyber security practitioners.\nWe will start by examining warfare, and review previous nation states attacks that have crossed the boundary into offensive cyber operations.\nWe will then focus on October 2023 and the tactics deployed by both Hamas and the IDF during the war, from a cyber perspective. To do this we will discuss reverse engineering malware samples, API security and DDoS attacks in detail.\nLastly we will conclude by looking at what the future of cyber warfare looks like, and what we can do to best protect ourselves / our organisations in such events.\n\nTalk two\n**Title:** Scaling Security Through Collaboration: The Role of Security Champions in Modern Organisations.\n**Speaker:** Kimberley Graham\n**Speaker Bio:** Kimberley is the Manager of People-Centered Security at Sage, headquartered in Newcastle. She is responsible for promoting and championing security within Sage.\n**Talk Synopsis:** TBC\n\nThere is a capacity limit on the venue so ticket numbers for the event have been restricted so please cancel your ticket if you are unable to attend.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Security Code Review and JWT",
        "date": "2025-02-20",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/306063585",
        "timezone": "America/Los_Angeles",
        "description": "**Reserve your spot! Only 60 RSVPs for this specific event.**\n\n**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, February 17th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: [http://twitch.tv/owaspoc](http://twitch.tv/owaspoc)\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Abstract**\nEver wanted to get serious about security code review? In this talk, Louis will share tips and tricks on how to get started, covering the basics of what to look for when reviewing code for vulnerabilities. We’ll explore some common mistakes developers make—highlighted by real-world CVEs—to see how small missteps can lead to big security headaches.\nWe’ll also dig into the specifics of JSON Web Tokens (JWTs), focusing on algorithm confusion. By studying what’s supposed to keep JWTs secure from these attacks, you’ll see how knowing the standard protection patterns makes it a lot easier to spot potentially vulnerable code.\n\nExpect real examples, practical insights, and a chance to learn what seasoned reviewers look for when they’re on the hunt for security pitfalls."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-03-13",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181943",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa Feb 19th 2025: Are We Leak-Free Yet? Securing Production App Secrets",
        "date": "2025-02-19",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/305942268",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in-Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **\"Are We Leak-Free Yet? Securing Production App Secrets\" with Robert Babaev**\n\n**Abstract:**\nA month or so ago, I was fiddling with ways of getting secret values (API keys, database URLs, etc.) into an application without leaking them. This talk will go over that journey, and how complicated it actually can be to get zero-leak secret injection in web apps, namely those using Docker Compose and Docker Swarm. Considerations for client-side secrets, server-side secrets, and more! Demos include showcasing source code, and possibly spooling up Docker containers and/or building web applications on a local environment. Likely pre-recorded.\n\n**Speakers:**\n**Robert Babaev** is a recent graduate of Carleton University with an Honours Bachelor of Computer Science, specializing in Computer and Internet Security. He has done multiple internships at major Canadian cyber companies like Barracuda Networks and Software Secured, research into authentication and access control frameworks, and competed internationally in Athens and Prague in competitions through CyberSci. Robert also regularly engages in side projects including CourseFull, an app built to help students track their academic goals without the guesswork."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Glo Golf Mini Golf",
        "date": "2025-02-27",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/305905090",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Mini Golf @ Glo Golf Peterborough\n\n**When?**\n\n* \\- Thursday 27th February\n\nEverybody welcome! For this event, please ensure you contact a host as pre-payment is required.\n\nThank you,\nRyan"
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "Approachable Threat Modeling for Technical and Non-Technical Folks",
        "date": "2025-02-18",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/306015927",
        "timezone": "America/New_York",
        "description": "HellOWASP! Yikes. But we all give and receive grace when we need to, that’s why I love our community. And hot off the heels of our now-annual January kick-off, one of our newest members will be delivering fresh perspectives on threat modeling for everyone. How’s that for community?\n\nSo please join us, for me, for you, and for the world we all seek to secure and share in this community, talk some shop, and warmly welcome our speaker Michael Novack.\n\nMike will first lay a foundation of threat modeling, then will present a method he calls a \"Cyber Book Club\" that allows technical and non-technical folks to engage with the threat modeling discussion.\n\nOur meetings always have and always will be free for all to attend, partake, and learn. The agenda will also have some front matter of other chapter happenings, and lite refreshments will be provided. So I'll see you at the place we meet - upstairs at the Black Sheep!"
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Supply chain in application security",
        "date": "2025-02-24",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/306081108",
        "timezone": "Europe/Warsaw",
        "description": "**Important note first:** Unfortunately our previous venue - Techies' is temporarily closed, so this time we are meeting at Relativity office.\n\nOur main topic for this meeting will be supply chain attack and defence. First our guest - Pedro Fortuna will introduce one of supply chain attacks - so called - resurected domains. Then we will host a discussion about how we can defend dependencies in our software to not be a victim of constantly growing supply chain attacks.\n\nAgenda:\n\n1. **Dawn of the Dead - The Tale of the Resurrected Domains**\n*Pedro Fortuna (CTO at Jscrambler)*\nWeb applications’ strengths—composability, dynamic distribution, and error-tolerant runtimes—also make them highly vulnerable to supply chain attacks. The heavy reliance on third-party dependencies, especially dynamically loaded scripts, introduces risks as these scripts can be updated without site owners’ knowledge, bypassing integrity checks like SRI.\nA major concern arises when third-party script hosts go offline, leaving their domains up for grabs. Attackers have exploited this by acquiring such domains to inject malicious code into linked websites. In one case, over 1,000 websites were compromised before researchers detected and neutralized the threat.\nFollowing the incident, further research revealed the widespread nature of this attack vector, leading to the development of a tool capable of scanning millions of websites for similar vulnerabilities. The researchers also created a free tool to alert website owners if they are unknowingly using scripts from defunct, potentially hijacked domains. These findings and tools will be presented in the talk.\n\n2. After the break, we will host a discussion about supply chain defence.\n**Unpacking the Web Supply Chain: Trust, Risk, and the Future of Secure Development**\nIn today's fast-paced world of software development, how dependent have we become on third-party components? Has this reliance become more of a liability than an asset?\nIs a completely self-reliant software ecosystem even possible, or will external risks always be a fundamental part of modern development? With the rise of AI and LLMs, how are software creation processes changing? What new supply chain threats are emerging because of these advancements?\nAre traditional security measures like SBOMs, vulnerability management, and runtime security controls sufficient to address these evolving threats?\nWith dynamically updating scripts, lack of version control, gaps in CSP, SRI, and integrity monitoring, are enterprises sufficiently protected?\nCan we truly trust the browser environment, or are we vulnerable to manipulated content?\nWhat innovative strategies, like a zero-trust model, can better secure third-party JavaScript dependencies?\nLooking ahead, what concrete actions are needed to enhance software supply chain security? Is regulation the answer, or could it create more challenges? Should the industry implement a standardized \"seal of approval\" for third-party components? Are security vendors, enterprises, and regulators doing enough to tackle this growing threat landscape?\nJoin us as we challenge assumptions, explore emerging solutions, and outline a path forward in securing the software and web supply chain.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this invitation** with friends and in your social media."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "2nd Annual 2025 OWASP Maine Secure Coding Tournament",
        "date": "2025-03-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-maine/events/305886218",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 2nd annual OWASP Maine Secure Coding Tournament! This will be an in-person meetup where we welcome all software developers and appsec professionals from entry-level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2025!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* TBD VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* TBD VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* TBD VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Thursday March 6th 2025 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:**\nTBD\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Riga",
        "repo": "www-chapter-riga",
        "name": "The 2nd OWASP Riga Chapter Meetup [IN-PERSON]",
        "date": "2025-02-13",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-riga-chapter/events/305918541",
        "timezone": "Europe/Riga",
        "description": "**This event is kindly hosted by [Ekonomikas un kultūras augstskola](https://www.augstskola.lv/). There is limited seating available for in-person attendees. Registration required.**\n\n**Venue Location**: [Pērnavas iela 62, Latgales priekšpilsēta, Rīga, LV-1009, Latvia](https://www.google.com/maps/place//data=!4m2!3m1!1s0x46eece2216ab4c0b:0x242a2d93eecba91a?sa=X&ved=1t:8290&ictx=111)\n\n**Doors Open at 17.30** for registration, cookies and networking. The talks start at 18.00 (we start on time!).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** - [Vladislavs Kolosovs](https://www.linkedin.com/in/vladislavs-kolosovs/), [Andrey Gubarev](https://www.linkedin.com/in/andreygubarev/) \\- OWASP Riga Chapter Leaders\n\n**Threat Modelling Workshop** - [Andrey Adamovich](https://www.linkedin.com/in/andreyadamovich/)\nIn this workshop, we’ll collaborate live on a Miro board to analyze a simple system architecture, uncover potential threats, and propose mitigations. We’ll demystify threat modeling using the STRIDE framework to identify risks and the DREAD methodology to prioritize them.\n\n**Applying OWASP to GraphQL -** [Gvido Bērziņš](https://www.linkedin.com/in/gvidob/)\nA lot of people still don't know what is GraphQL and refuse or don't know how to hack it, so let's try to change that, by demistifying it and applying OWASP Top 10 techniques and tools to test it just like a regular old REST API.\n\nGraphQL is still a relatively new technology that is still worth hacking with many implementations and not enough security controls built in, that's what we're going to talk about.\n\n**SPEAKERS**\n\n**Andrey Adamovich**\nAndrey is a software craftsman and CTO with a focus on IT strategy, platform engineering, and security. He helps organizations build scalable and secure technology platforms that improve software delivery. With expertise in DevOps, automation, and cloud technologies, Andrey creates systems that support agile teams and drive efficiency.\n\nAs an educator, Andrey has delivered over 300 courses across Europe, helping teams master software development, automation, and security practices. He is also a regular speaker at international conferences, sharing his insights on modern software development.\n\n**Gvido Bērziņš**\nCyber Security Consultant on the Red Team with experience in software development and other IT fields. Currently works at Possible Security.\n\n**TICKETS**\nOWASP meetups are **free** and open to **anyone** interested in application security. *Please note that you MUST book your place to be admitted to the event by the building security.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\n\nOWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-03-12",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306111347",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "OWASP Switzerland Community Meetup, February 2025",
        "date": "2025-02-19",
        "time": "17:10+01:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/305296964",
        "timezone": "Europe/Zurich",
        "description": "Join us at the OWASP Switzerland Community Meetup to kick off the year 2025! This meetup will feature two exciting talks on application security. It’s a fantastic opportunity to network with like-minded professionals, exchange ideas, and expand your knowledge in a friendly and collaborative environment.\n\n**Program:**\n**17:10** - **Doors open**: Grab a drink, meet old and new friends from the OWASP Switzerland community\n\n**17:35** - **Uninstallable by Design**: The Role of Pre-installed Apps in Android’s Security Landscape - (Thomas Sutter, PhD Student @ University of Bern)\n\n**18:30** - **Coffee Break**\n\n**18:45** - **Continuous Security with DevSecOps**: How Platform Engineering Transforms Modern Application Security​ - (Romano Roth, Chief of DevOps / Partner @ Zühlke)\n\n**19:40 - 20:10 - Drinks, Fingerfood and Networking:** Grab a bite and chat with old and new friends\n\n**Talk details:**\n\n* **Uninstallable by Design - by Thomas Sutter**: The competitive smartphone market is keen to prevent its intellectual property from being analysed by competitors and the public. As a result, most smartphones are locked when distributed, and anti-reversing techniques are widely used. Consequently, millions of users use smartphones daily without a clear understanding of the software’s functionality and purpose. To lower the bar for security researcher to analyze Android firmware, we developed a novel framework, called FirmwareDroid. In this talk, we discuss the challenges to automate the process of analyzing Android firmware and showcase how we use FirmwareDroid to analyse pre-installed Android apps in academia.\n* **Continuous Security with DevSecOps - by Romano Roth:** Security must be seamlessly integrated into every stage of the software development lifecycle. This talk explores how combining DevSecOps principles with Platform Engineering empowers teams through automation, standardized environments, and reduced complexity. Learn how these approaches transform application security into a proactive, scalable, and collaborative enabler for delivering secure, high-quality software at speed."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-02-20",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510162",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | From Basics to Burp - Part 3: Navigating PortSwigger Academy ",
        "date": "2025-03-13",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/306014796",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter is pleased to partner with UVIC VikeSec to host the third iteration of a hands-on introduction to Burp Suite and the PortSwigger Web Security Academy. Wyatt Harvey and Sebastian Bethell will be presenting a workshop titled \"From Basics to Burp - Part 3: Navigating PortSwigger Academy\".\n\nThe event will be held on March 13, 2025 from 5:30 PM to 8:20 PM at The University of Victoria in Room 116 of the Engineering and Computer Science building.\n\nThe event will feature the workshop, an introduction to PortSwigger's Web Security Academy, and working through some of the introductory labs using Burp Suite, a comprehensive tool for performing security testing on web applications.\n\nPortSwigger's Web Security Academy is an online platform offering interactive learning materials and labs focused on web application security and instructions on how to identify and exploit a wide range of web application vulnerabilities.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and develop hands-on skills in web application hacking. If you would like to attend, please click the RSVP button to reserve your spot as we have limited seats available.\n\nBring your laptop with Burp Suite installed, your PortSwigger account ready, and join us for a hands-on evening of web application hacking and networking fun!\n\nBurp Suite Community can be installed from the following link:\n\n* https://portswigger.net/burp/communitydownload\n\n‎\nYou can register your PortSwigger account at the following link:\n\n* https://portswigger.net/users/register\n\n‎\nOnce you have Burp Suite installed and a PortSwigger account created, browse through Web Security Academy to get an idea of the content offered on the platform in preparation for the event:\n\n* https://portswigger.net/web-security\n\nWe would also like to give a special thanks to UVIC VikeSec for helping facilitate this event."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "March community call - OWASP SAMM",
        "date": "2025-03-12",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/306053378",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Extra OWASP SAMM community call Europe - Asia",
        "date": "2025-02-14",
        "time": "08:00-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/305496638",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\nWe will share any project news and updates.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "February community call - OWASP SAMM",
        "date": "2025-02-12",
        "time": "15:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/306052321",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #70 - OWASP meets Legal & Regulations",
        "date": "2025-02-26",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/305522192",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #70! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n* **Rechtssicher durch den Cybervorfall:** We are excited to welcome **Olga Stepanova** and **Dirk Koch** \\- both partners at ByteLaw \\- who will guide you through the rough waters on how you can protect your company from the legal consequences of a cyber incident\\. Experts explain current threats such as ransomware and business email compromise and provide practical tips on how to deal with perpetrators\\, authorities and insurance companies in a legally secure manner\\.\n* **Regulatory Affairs for Hackers:** It's not just since the GDPR that we've known what a resounding impact legal changes can have, but what else can we possibly expect when regulation gets really strict?\n**Leon Holub**, product owner of the Regulatory Radar platform at Johner Institute GmbH tries to give an insight into the world of legal requirements for medical devices, from a perspective of a software developer who has immersed himself in the details of the world's regulatory systems not too long ago.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **26.02.2025** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 , located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    }
]