[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Project Spotlight - OWASP SAMM",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/293864175",
        "timezone": "America/New_York",
        "description": "Interested in learning how to secure your software development lifecycle? Then join us as we dive deep into the OWASP Software Assurance Maturity Model (SAMM), a technology and process agnostic framework that helps to provide an effective and measurable way for you to analyze and improve your secure development lifecycle. Our speaker, Christian DeHoyos, will walk through its history, use cases, benefits, and how one can quickly leverage OWASP SAMM at their org."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - June 2023 (Online)",
        "date": "2023-06-27",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705746",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- Coming Soon\\!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 24 June 2023 ",
        "date": "2023-06-24",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/294034192",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 24 June 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n*\n* Securing IoT on the Home Network by **Vedant Khandelwal**\n* OAUTH vulnerabilities by **Soujanya Namburi**\n* AWS serverless pentesting by **Divyanshu shukla**\n* Policy based Kubernetes Security Using KYVERNO by **Ravi**\n* GCP with IAP Security by **Anjali Shukla**\n\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "June Meetup ",
        "date": "2023-06-14",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/293963878",
        "timezone": "America/Los_Angeles",
        "description": "Security time, We will have exciting talks, lots of people to meet, and great food and Drinks. Courtesy our sponsors JIT (https://www.jit.io).\n\nThis is a joint meetup with Pacific hackers community (https://www.phack.org/)\n\n*Jit*\\- An open DevSecOps Orchestration Platform allows high\\-velocity Engineering teams to own product security while increasing dev velocity\\.\n\n5PM to 5.45PM Networking, food/Drinks\n5.45 PM to 8 PM Talks\n\n**Talk #1: \"Securing a cloud app: from threat modeling to Continuous Security\"**\n(basically I am doing is an extended talk based on the MVS one for Python apps)\n\n**Abstract:**\nIn this presentation, we will delve into the process of securing a cloud hosted application, using a Python-based app as our demonstrative model, from scratch. Our initial focus is on the initial crucial step of threat modeling, demystifying the process for beginners and offering a deep-dive into the identification, analysis, and prioritization of potential security risks across the codebase, infrastructure, CI/CD pipeline, and runtime.\n\nFurther, we will explore how these identified risks can be mapped to security tools using open-source security (OSS) tools, including some developed by OWASP.\n\nThe final part of our journey takes us through the seamless integration of these tools into the Continuous Integration/Continuous Deployment (CI/CD) pipeline. Utilizing Github Actions as a case study, we will show how to build and automate a security-focused workflow, ensuring a constantly secure state for your application.\n\nBy attending this session, you'll gain practical insights and tools to build secure cloud applications, maintain an efficient CI/CD pipeline, and tackle the dynamic cyber threat landscape with confidence and foresight. Stay a step ahead in your application security with continuous and integrated security measures.\n\n**Speaker:** David Melamed CTO JIT\n\n**Talks #2: Unlock Your AppSec Career Potential: A Guide to Successful career**\nDescription:\nRapid development cycles and time constraints, diverse skill sets required to evaluate applications built with complex new technologies, evolving threat landscape are some of the reasons that make application security engineer’s job interesting and difficult at the same time. As a result appsec engineers have to develop fast learning mechanisms and based on their strengths and interest, pick the right career paths to not just survive but thrive in the world of application security. In this talk, we will discuss how to analyze one’s strengths and interests and choose the right application security career path and continue to prosper throughout your career.\n\nSpeaker: Trupti Shiralkar, Sr Manager Product Security at Datadog and Deidre Diamond Founder CyberSN\n\n**Talk #3: Winning Others Over, Cross-Functional Collaboration in Cybersecurity**\n\nWhether we’re an extrovert, ambivert, or introvert, the majority of us work with people. Even when we write or review code most of the day, we still receive and provide feedback. In cybersecurity, a large portion of success relies on your ability to win others over. How do you convince developers to write secure code or care about it? How do you work with HR/People to educate new and existing employees about security practices? How do you collaborate with product, program, and project teams to build, deploy, or review? How do we incorporate the OWASP Top 10 into our work and communicate those vulnerabilities and their importance to other teams? Solid documentation is a hallmark of cybersecurity work and an aspect of WOO, but there's more to it. In this presentation, we’ll discuss ways to work cross-functionally and win others over. Methods will be presented for all personality types, and participants will have examples that can be applied in their workplaces.\n\nSpeaker: Kelly Thibault is the Executive Director at Secure Diversity, a non-profit focused on diversity in cybersecurity. In her job, she runs the Day of Shecurity Conference and partners with cybersecurity professionals of all levels. She has spent over 15 years running programs, managing risk and crisis response, leading people, and working cross-functionally. She loves learning, wearing multiple hats, and building relationships. She attributes much of her success in building and problem-solving to her ability to make connections and build work relationships."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "The Risks of Hardcoding Secrets in AI-Generated Code",
        "date": "2023-06-14",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/293890172",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person or online (link to be provided).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nFor our June meeting, Julie Peterson, Senior Product Marketing Manager at Cycode, will be speaking to the chapter about The Risks of Hardcoding Secrets in AI-Generated Code.\n\nMachine learning, particularly Language Learning Models (LLMs), has paved the way for groundbreaking advancements in many fields, including code generation. However, this innovation is not without inherent risks. One potential issue is that these models generate code with hardcoded secrets, such as API keys or database credentials. This practice stands in stark contrast to the recommended way of managing these secrets – through a secrets manager.\n\nIn this presentation, we consider the following:\n\\- What are hardcoded secrets and how to prevent them\n\\- The importance of secrets management\n\\- The impact of LLMs in generating code\n\\- How to mitigate the risk of hardcoded secrets in code generated by LLM\n\nThis will be an exciting session, RSVP now!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "PCI - The Good, The Bad and the Ugly",
        "date": "2023-06-20",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/293853720",
        "timezone": "Australia/Brisbane",
        "description": "Intro - Craig & Michael\nPCI - What is it?\nPCI Projects - The Game Plan\nApp Sec Deep(ish) Dive\nAuditor Whispering\nWar Stories\nIs PCI DSS Effective? The Verdict"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Browser Extension Security, and Scripting for Web Application Testers",
        "date": "2023-06-15",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/290892060",
        "timezone": "Europe/London",
        "description": "In-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.\n\nTo find the entrance, it might be easier to search for \"Programme, Bristol, BS1 2NB\", or use this link to [Google Maps](https://www.google.com/maps/?q=51.455666,-2.592341).\n\n**Agenda:**\n\n* OWASP Updates.\n* Talk 1: LLM and Application Security, with Chris Wood from Immersive Labs.\n* Break.\n* Talk 2: Intro to Scripting for Web Application Testers with Alex Archondakis.\n* Networking.\n\n**Venue:**\nPhoto shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard).\n\nAddress: 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.\n\n\\-\\-\\-\n\nTalk 1: **LLM and Application Security**, presented by **Chris Wood**.\n\n**Abstract**: A look at LLMs and how they affect the security of code and how humans are still needed in the loop.\n\n**Bio:** Chris is Principal AppSec Engineer at Immersive Labs leading on the development of our Secure Coding product. He is also a founder of BSides Cheltenham.\n\n\\-\\-\\-\n\nTalk 2: **An Introduction to scripting for Application Testers,** presented by **Alex Archondakis**.\n\n**Abstract**: Scripting, or the ability to write code that allows you to perform actions or automate repetitive tasks is a crucial tool in any application security testers belt, however, it doesn’t seem to be a common one.\n\nThe purpose of this talk is to introduce scripting to application security testers, this will be achieved by looking at case studies to determine where scripting may be appropriate and how to solve the problem. We will discuss multiple languages and their advantages whilst focussing on interacting with the HTTP protocol.\n\nThe key learning points from this talk are as follows:\n\n* To gain an understanding of the importance of scripting for application security testers.\n* What programming languages are used, and their advantages/disadvantages.\n* Typical scenarios where scripting is required because tooling is not comprehensive enough.\n\n**Bio**: Alex is head of professional services & a senior consultant at Pentest People. He has a wealth of experience in penetration testing, people management and training hackers. He believes that all application security professionals should be able to write basic scripts to solve common problems."
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Desarrollo Seguro basado en OWASP",
        "date": "2023-06-15",
        "time": "0:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/294054054",
        "timezone": "America/Santiago",
        "description": "Santiago, Jueves 15-Junio, desde 20:00 horas.\n\nOwaspChile, te invita a una charla-resumen de una hora, basada en los entrenamientos disponibles para aprender OWASP Top10 y programación segura.\n\n**TRAINING ROADMAP**\n===\n\n**Jueves 15-Junio,**\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\nLevel 2: Advanced Training. Es un entrenamiento de 16 horas con laboratorios de programación segura para un lenguaje a elección (JAVA, .NET o PHP a definir) y store procedures de Bases de Datos.\n\n\\*(Inscríbete y el día de la charla recibirás el link de conexión via e-mail).\n\nLos esperamos."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS June 2023",
        "date": "2023-06-22",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/294021716",
        "timezone": "America/Denver",
        "description": "Speaker: Stan Richister, Social Engineering: How and Why it Works (A “soft” Kill is Still a Kill).\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP June Meet ",
        "date": "2023-06-20",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/293404993",
        "timezone": "America/Chicago",
        "description": "\"Common Security Considerations for Web 3.0”\n\nJoin this virtual event to discuss:\n\n* an overview of decentralization\n* digital identities in 3.0 and typical threats\n* examples of Web 3.0 attacks and mitigations\n* security concerns and some actions to consider to protect organizations."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Join us LIVE and IN-PERSON for Denver OWASP's June Meetup",
        "date": "2023-06-21",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/293553304",
        "timezone": "America/Denver",
        "description": "**As always, everyone is welcome! You do NOT have to be an OWASP member to attend.**\n\nJoin us June 21st for food, drinks, networking and a super informative presentation on \"The Joys of Mobile Application Testing\" from one of the best and brightest in the industry: Greg Leonard. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to our Denver OWASP sponsor [SpyderSec](https://spydersec.com)**\n\n**Presentation Title:** The Joys of Mobile Application Testing\n\n**Presentation Details:** In this talk, I will walk through the major challenges of testing mobile applications. This will include reliably capturing HTTPS traffic between the app and it's backend APIs, reviewing data stored by the app on the mobile device, working around defenses built into many apps, and discussing some obstacles that need to be worked around with modern mobile operating systems."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "Adopting DevSecOps for faster and more secure SDLC",
        "date": "2023-06-15",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/293758240",
        "timezone": "Asia/Dubai",
        "description": "Accelerate your software delivery with DevSecOps culture!\n\nJoin our free webinar led by Ahmed Abdallah, a Senior Solutions Architect and Cyber Security Consultant, and learn about all things DevSecOps.\n\nIn this session, participants will gain further knowledge on the importance of the concept and discover how integrating security throughout the software development process can enhance speed, quality, and overall success."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-07-10",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/294138407",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lima",
        "repo": "www-chapter-lima",
        "name": "OWASP Meeting Junio 2023",
        "date": "2023-06-21",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/owasp-lima-meetup-group/events/293986407",
        "timezone": "America/Lima",
        "description": "**OWASP Meeting Junio 2023**\nReunión Mensual de Seguridad de Aplicaciones\n\n**PRESENTACIONES:**\n\n***Técnicas de evasión de sistemas de detección y prevención de intrusiones (IDS/IPS) - Aleida Pérez* (MX)**\n¿Te gustaría conocer las estrategias utilizadas por los hackers para evadir los sistemas de seguridad más avanzados? ¿Quieres estar un paso adelante en la protección de tu red?\nEn esta charla, profundizaremos en las técnicas de evasión de IDS/IPS. Aprenderás cómo los atacantes logran evitar la detección y el bloqueo de los sistemas de seguridad, y cómo puedes fortalecer tus defensas para proteger mejor tu infraestructura.\n\n***Ciberseguridad para Todos - Alejandra Figueroa* (MX)**\nSe abordarán la historia de la ciberseguridad, los conceptos principales, herramientas, cómo incursionar en el área, campo laboral y experiencias personales."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUN 28, 2023",
        "date": "2023-06-28",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/292955470",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Security Architecture - What is it? How to Deploy it\nJoin us for great networking, dinner and drinks, and see a presentation by President and Founder of iSecurePrivacy, LLC.\n\n**ABSTRACT**: Security Architecture is a security design that addresses the technology goals, approaches, controls, and potential for the enterprise. It also specifies when and where to apply security controls. This discussion starts from the enterprise perspective using SABSA (Sherwood Applied Business Security Architecture). It then introduces COBIT, from ISACA, which is a framework that focuses on the governance and management of enterprise IT. TOGAF (The Open Group Architecture Framework) aligns security with business needs. Then there is the OWASP SAMM (Software Assurance Maturity Model) that is a framework for helping organizations analyze their current software security practices in the development of new applications. Within these four security architectures, we will also talk about some software secure coding standards such as (PCI Software Security Framework, SEI CERT Coding Standards, NIST SSDF, Microsoft Secure Coding Guidelines , and OWASP Secure Coding Practices). These standards are important, but they need to be based on meeting the business strategic objectives, business model, and business needs. That is what security architectures provide.\n\n**Thanks to our Sponsor**: *[Prisma Cloud](https://www.paloaltonetworks.com/prisma/cloud)*\n*The Most Complete Cloud-Native Application Protection Platform (CNAPP). Prisma Cloud secures applications from code to cloud, enabling security and DevOps teams to effectively collaborate to accelerate secure cloud-native application development and deployment.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/293695815",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS), the OWASP Mobile Application Security Verification Standard (MASVS), and OWASP Mobile Application Security Testing Guide (MASTG) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. Come join us!\n\n\\*Food and drinks will be provided by NowSecure\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "Secure File Location Handling - Build.Attack.Fix Games",
        "date": "2023-06-29",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/294138476",
        "timezone": "Australia/Melbourne",
        "description": "Hello OWASP Melbourne,\nFollowing our last challenge being well received, we're back with another challenge and ramped up the stakes. Brought to you in collaboration with Dr. Pedram from SecDim, this time a King of the Hill style challenge. Build your app, attack other's apps, and iterate on improving your defences.\n\nHow will this work?\n\nThis is a battle challenge. You have limited time to address the security vulnerabilities in your code. Once you push your code, you enter the battle page where you can hack other players app. Anytime you successfully hack a player's app, you need to extract the flag. You then submit the flag to get the score. The earlier you defend your app or hack another player's, the higher will be your ranking.\n\nNOTE: If a player hacks your app, you will lose the score and get kicked out of the battle page. You may try again.\n\nNo presentation, no lecture. This is a hands-on session to up-skill in secure programming. Please bring your laptop with your development environment set up and ready to go, so that you can jump right into the action.\n\n**We will explore these weaknesses**:\n\n* CWE-35 and CWE-23\n\n**Agenda**:\n\n* 6:00-6:10 Welcome\n* 6:10-7:30 Let the battle begin.\n\nThis event is not catered, but you're welcomed to bring your own food along.\n\n**Prepare**:\nIf you are a first timer, **get your workstation setup** by completing any of the \"Start Here\" levels on [https://play.secdim.com](https://play.secdim.com/) (SecDim Play is a training game for secure programming)\n\n**Contribute**: Help to foster the community by **contributing a secure programming challenge**. Follow the guide at [https://github.com/secdim/play-sdk](https://github.com/secdim/play-sdk).\n\n**Keep in-touch**:\nKeep the conversation going. OWASP Melbourne is on the [AppSec ANZ Discord ( https://discord.gg/uAWze2B )](https://discord.gg/uAWze2B) where you can meet up with others interested in AppSec and secure development.\n\n**Hybrid event**:\nIf you're attending in-person, please RSVP (and update if you no longer are able to go) as the venue is very limited. We will update this listing here with the video conference link closer to the event:\n< virtual attendance link coming soon >\n\n**Required Equipment**\nPlease bring your own laptop along to the event that has been setup as described above. There is free wifi, but without your own laptop, you won't be able to participate.\n\n**PS. This is a joint community event with SecDim.**\n\n**Other Information**\n**What is OWASP?**\nThe Open Worldwide Application Security Project® (OWASP) is a volunteer-run, nonprofit foundation that works to improve the security of software. Through community-led open source software projects, hundreds of local chapters worldwide, tens of thousands of members, and leading educational and training conferences, the OWASP Foundation is the source for developers and technologists to secure the web.\n\n**Find out more?**\nMeetup.com Page: https://www.meetup.com/Application-Security-OWASP-Melbourne/\nAbout the Chapter: https://owasp.org/www-chapter-melbourne/\nJoin the AppSec ANZ Discord: https://discord.gg/uAWze2B"
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "Workshop 2023 Presencial #01",
        "date": "2023-06-24",
        "time": "0:45-03:00",
        "link": "https://www.meetup.com/owasp-natal-chapter/events/294090555",
        "timezone": "America/Fortaleza",
        "description": "**ATENÇÃO!**\nEste é um workshop gratuito com vagas limitadas, favor fazer sua inscrição apenas se estiver com o material necessário para a atividade:\n\\- Notebook\n\\- Instalação do software Docker\\(não obrigatório\\)\n\nOWASP é uma organização sem fins lucrativos que se dedica a melhorar a segurança da informação global. Ela busca conscientizar as empresas e as universidades sobre as ameaças de segurança cibernética e fornecer ferramentas e recursos para defender contra essas ameaças.\n\nCom este evento, as empresas e as universidades participantes terão a oportunidade de serem atualizadas sobre os mais recentes desenvolvimentos e técnicas na área de segurança da informação. Além disso, as palestras serão ministradas por profissionais experientes e altamente qualificados, o que lhes dará acesso a conhecimento e a uma rede de contatos de especialistas.\n\nNeste workshop presencial o que vai rolar:\n**\\- Treinamento de Desenvolvimento Seguro utilizando o OWASP Juice Shop**\n\nTreinamento de Desenvolvimento Seguro utilizando o OWASP Juice Shop é uma iniciativa gratuita voltada para desenvolvedores, analistas de segurança da informação e qualquer interessado no desenvolvimento de software seguro. Ao longo do workshop, os participantes terão a oportunidade de aprender e praticar os princípios do desenvolvimento seguro, utilizando a plataforma OWASP Juice Shop - uma aplicação web intencionalmente insegura, criada para o ensino de técnicas de segurança.\n\nOs participantes irão explorar, através de exercícios práticos, como identificar e corrigir várias vulnerabilidades de segurança, incluindo as listadas no OWASP Top 10. Isso proporcionará uma melhor compreensão de como ocorrem as violações de segurança e como preveni-las.\n\nO workshop será ministrado por especialistas na área de segurança da informação e contará com sessões de perguntas e respostas, permitindo que os participantes esclareçam suas dúvidas e aprofundem seus conhecimentos sobre o assunto. Este é um excelente passo para aprimorar suas habilidades e aumentar sua competência no desenvolvimento de software seguro.\n\n**Local:** SEBRAE RN / Av. Lima e Silva, 76 - Lagoa Nova\n\n**Evento Gratutito**\nInscrições para receber o Certificado de participação: https://meetup.grupyrn.org/workshop-owasp-2023"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP NZ - Auckland Meetup - July 2023",
        "date": "2023-07-11",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721004",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for July will be **A08:2021 - Software and Data Integrity Failures.**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "Save the Date - OWASP New Zealand Day 2023",
        "date": "2023-07-04",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/287977420",
        "timezone": "Pacific/Auckland",
        "description": "As plans for the event come together, we'll add details here."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Anatomy of a Breach: Dissecting Cloud Security",
        "date": "2023-06-29",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/293621833",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\nCloud security presents unique challenges. As enterprises continue to move to the cloud, security practitioners face new threats and paradigms. In this session, we’ll forensically reconstruct major cloud-centric breaches and step through them, building an understanding of what happened, how it happened, and developing key takeaways to help secure our own infrastructure, especially in AWS, Azure, and GCP.\n\n**Code of Conduct:**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**Sponsorship:**\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa June 21st 2023: Metamorphic Testing",
        "date": "2023-06-21",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/294089785",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\n**Health Notice:**\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/channel/UCxSU-KvNmYusZEq6v4YK5Lw). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EDT** Arrival, setup, mingle\n**6:30 PM EDT** Technical Talks\n\n1. **Introduction to OWASP Ottawa, Public Announcements.**\n2. Metamorphic Testing for Web System Security.\n\n**Abstract:**\nSecurity testing aims at verifying that the software meets its security properties. In modern Web systems, however, this often entails the verification of the outputs generated when exercising the system with a very large set of inputs. Full automation is thus required to lower costs and increase the effectiveness of security testing.\n\nUnfortunately, to achieve such automation, in addition to strategies for automatically deriving test inputs, we need to address the oracle problem, which refers to the challenge, given an input for a system, of distinguishing correct from incorrect behavior (e.g., the response to be received after a specific HTTP GET request).\n\nIn this presentation, we propose Metamorphic Security Testing for Web-interactions (MST-wi), a metamorphic testing approach that integrates test input generation strategies inspired by mutational fuzzing and alleviates the oracle problem in security testing. It enables engineers to specify metamorphic relations (MRs) that capture many security properties of Web systems. To facilitate the specification of such MRs, we provide a domain-specific language accompanied by an Eclipse editor. MST-wi automatically collects the input data and transforms the MRs into executable Java code to automatically perform security testing. It automatically tests Web systems to detect vulnerabilities based on the relations and collected data.\n\n**Speaker Bio:**\nNazanin Bayati is a Ph.D. candidate at the School of EECS at the University of Ottawa and a member of the Nanda Lab. She received several academic awards, including a Ph.D. admission scholarship, an international doctoral scholarship from the University of Ottawa, and an honourable award for being an outstanding student during her master’s degree at the Iran University of Science and Technology. She was also ranked the best student among all computer engineering students at the Iran University of Science and Technology in 2019. Her research interests include automated software testing concerning security testing, applied data science and empirical software engineering."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter 2: OWASP Meet Up",
        "date": "2023-07-05",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/292660571",
        "timezone": "Europe/London",
        "description": "**OWASP JULY!**\nWe're back for our 2nd Cyber catch up! July's focus is on cloud security, trends and behaviours.\n\n**Who is it for?**\nEverybody! Come along, bring a friend, share with your colleagues.\nA principle of the chapter is to ensure **cyber security is accessible** for everyone. You don't need to be a security professional, each session will break down topics to ensure everybody can take something away.\n\n**Agenda**\n*2 talks* to be confirmed soon, with a *round-table discussion* on trending cyber security topics.\n\n**When is it?**\n\n* Wednesday 5th July\n* **Start** from 7:30pm\n* **Finish** around 11:00pm\n\n**Where is it?**\n\n* The Brewery Tap, Peterborough\n\n**How can you get involved?**\n\n* Respond **'I'm coming!'** to this group\n* Check out our OWASP Chapter [page](https://owasp.org/www-chapter-peterborough/)\n\nWe look forward to seeing you there!"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-06-29",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/293991357",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/293695815",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS), the OWASP Mobile Application Security Verification Standard (MASVS), and OWASP Mobile Application Security Testing Guide (MASTG) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. Come join us!\n\n\\*Food and drinks will be provided by NowSecure\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "June Meetup",
        "date": "2023-06-21",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/293615825",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of each month. We will announce topics 2-3 weeks in advanced of our meetups.\n\n7PM-9PM\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Community Topics\n* Presentation TBD"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838145",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838144",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - June Encore 2023",
        "date": "2023-06-27",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/293587120",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "¿CÓMO IDENTIFICAR UN CORREO ELECTRÓNICO PHISHING?",
        "date": "2023-06-16",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-tegucigalpa-chapter/events/293849484",
        "timezone": "America/Tegucigalpa",
        "description": "**Tema: Phishing**\nEs una técnica de ingeniería social que consiste en el envío de correos electrónicos que suplantan la identidad de compañías u organismos públicos y solicitan información personal y bancaria al usuario.\n\nEste método sirve para engañarle y hacer que comparta contraseñas, números de tarjeta de crédito, y otra información confidencial haciéndose pasar por una institución de confianza en un mensaje de correo electrónico o llamada telefónica"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP x Project Calico x Okta | Container and Kubernetes security policy design",
        "date": "2023-06-15",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/293475436",
        "timezone": "America/Toronto",
        "description": "\\*\\*\\* THIS TALK IS BOTH ONLINE (https://www.youtube.com/watch?v=eMSnga3arIA) and OFFLINE @ the Okta offices \\*\\*\\*\n\n**TALK**\n\n**Container and Kubernetes security policy design: 10 critical best practices**\n\n**Summary:**\n\nCompanies are constantly seeking new and innovative ways to stay ahead in a highly competitive and rapidly changing business landscape. One strategy that has proven to be highly effective is application modernization. This is not just a mere upgrade; it is a complete transformation of how businesses operate. By embracing this approach, companies can accelerate innovation, optimize costs, and improve their overall security posture.\n\nHowever, embarking on the journey of application modernization is not an easy task. It requires a significant investment in people, processes, and technology to achieve the desired business outcomes. The right foundation must be established from the beginning to avoid the high cost of re-architecture, which can be a major roadblock in achieving success. One crucial aspect is developing a standard and scalable security design for their Kubernetes environment. This will establish the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\nIn conclusion, application modernization is a strategic initiative that can transform businesses. Developing a standard and scalable security design for the Kubernetes environment is critical to establishing the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\n**Presenter:**\n\n**Regis Martins**\n\nRegis Martins is a passionate problem solver and technologist with a deep-rooted love for finding innovative solutions. With a background in Electrical Engineering and a Master's Degree in Computer Science, he has honed his expertise in areas such as deep packet inspection technologies, traffic management, network analytics, and Kubernetes. His journey has led him to excel as a Sales Engineer, where he architects solutions, educates clients, and thrives in helping organizations overcome challenges. With a diverse skill set encompassing Python, Linux, virtualization, cloud computing, and more, Regis is committed to making a positive impact in the world of technology through continuous innovation and knowledge sharing."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2023-06-29",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/293768575",
        "timezone": "America/New_York",
        "description": "TBA"
    }
]