[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - April",
        "date": "2024-04-23",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460499",
        "timezone": "Europe/Copenhagen",
        "description": "**IMPORTANT:**\n\n* **You need to reverse into the parking spot!**\n\nOWASP Aarhus and Siemens Gamesa are happy to invite you to this OWASP Aarhus meetup - in Brande.\n\n**19:00 – 19:10** Morten Thrane\nWelcome by Siemens Gamesa and OWASP Aarhus\n\n**19:10 – 20:00** Matija Stevanovic\n**Title:** *Safeguarding Wind Power – Cybersecurity in the context of Wind Power Plants*\n**Abstract:**\nIn recent years, the global energy landscape has undergone a remarkable transformation, with renewable energy sources emerging as pivotal players in the pursuit of a sustainable future. Among these, wind power has surged to the forefront, harnessing the natural force of wind to generate clean and efficient electricity. As we embrace the transition towards greener energy solutions, it is imperative that we also confront the challenges that accompany it. One such challenge, though perhaps less visible, is cybersecurity.\nThroughout this presentation, we will delve into the intricacies of cybersecurity as it pertains to wind power plants. We will explore the broader business context, provide overview of customer expectations and the increasingly stringent requirements imposed by national legislators. Additionally, we will sketch the threats and vulnerabilities facing these critical assets. Finally, we will provide an overview of the strategies and technologies deployed to mitigate these risks, ensuring the resilience and safety of our wind power infrastructure amidst the ever-evolving landscape of cyber threats.\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** Aleksander Kjær vil give en grundlæggende introduktion til forhandling baseret på Harvard Negotiations Project og Uri & Fishers bog \"Getting to Yes\".\n\nHan vil introducere nøglekoncepterne og teknikkerne inden for forhandling og vise, hvordan deltagerne selv kan anvende disse til at forbedre deres forhandlingsevner - både professionelt og personligt. Det er hans holdning, at alle kan blive en dygtig forhandler!\nDerudover vil han illustrere disse teknikker med konkrete eksempler fra virkelige forhandlingssituationer.\n\nHan vil også præsentere, hvordan man kan overbevise en tvær og nærrig ledelse om at investere mere i IT-sikkerhed ved hjælp af de forhandlingsteknikker, der har gennemgået.\n\nKort om Aleksander - Jeg har en kandidatgrad i økonomi og antropologi og har altid haft stor interesse for forhandling gennem mine studier, især i en international kontekst. Bl.a. var jeg i praktik på den danske ambassade i Tallinn Estland i 2018, hvor der skete en masse inden for det militære og cyber- og informationssikkerhed området i Danmark og Estland. Efterfølgende tilbragte jeg fire måneder i New York City, hvor jeg skrev mit speciale om danske virksomheders udfordringer med at etablere sig på det amerikanske marked. På nuværende tidspunkt studerer jeg softwareteknologi på 6. semester og er særligt interesseret i governance-området inden cyber- og informationssikkerhed, som jeg håber at gøre en karriere indenfor i fremtiden.\n\n**21:15 – 21:30** Closing notes, networking and goodbyes"
    },
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "Bus tur fra Aarhus til OWASP i Brande",
        "date": "2024-04-23",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/300424641",
        "timezone": "Europe/Copenhagen",
        "description": "Bus tur/retur fra Erhvervsakademi Aarhus til OWASP event ved Siemens Gamesa i Brande.\nKun 10 pladser tilbage.\n\nKontakt Hans Henrik på mobil: 72286308\neller\nLinkedIn: [https://www.linkedin.com/in/hansjeppesen/](https://www.linkedin.com/in/hansjeppesen/)"
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Adversarial Machine Learning Tactics",
        "date": "2024-04-24",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/300300371",
        "timezone": "America/New_York",
        "description": "In this talk, we will conduct an examination of the methodologies employed by adversaries to exploit machine learning systems and leverage these systems for their benefit. We will delve into various attack vectors, such as evasion and poisoning, and discuss the current use cases of machine learning and AI being employed by threat actors. Participants will gain insight into the latest defensive applications of machine learning, along with strategies for mitigating risks posed by new and evolving threats. This session aims to equip attendees with an understanding of both offensive and defensive aspects of machine learning in cybersecurity, fostering a proactive approach to safeguarding these advanced systems."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "May 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-05-09",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299656219",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, May 9th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-05-09",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536968",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-05-02",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536962",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2024 (Online)",
        "date": "2024-04-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207001",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nIf you would like to attend in person, please pull a ticket from [Eventbrite ](https://www.eventbrite.com/e/owasp-austin-chapter-monthly-meeting-april-2024-group-2-tickets-882900538277). Please only pull a ticket from Eventbrite if you are planning on attending, as we purchase food for in-person meeting and don't want to waste both donations and food (and canceling a ticket the day of still has food already purchased.)\n\nAgenda:\n11:30-12 -- Room Opens, food is available and in-room discussions\n12-12:05 -- Chapter/OWASP info presentation\n12:05-1 -- Speaker Presentation\n\n**Presentation: The Truman Show: Real-world application attacks instead of canned demos**\nIn this presentation, Kevin Johnson of Secure Ideas will walk attendees through various scenarios used in penetration testing of applications. These demonstrations will use real attacks and discuss how a penetration tester views applications. This talk will explain the mindset of an attacker, using actual applications as well as demonstration apps to allow for exploitation.\n\n**Speaker: Kevin Johnson**"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-04-25",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536957",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 27 April 2024",
        "date": "2024-04-27",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/300066541",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 27 April 2024 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* CTF Solvings for OSCP Aspirants by **SATHIYANARAYANA S**\n* Firmware diffing to Nday exploits by **IamAlch3mist**\n* Wannacry : Behind The Scenes by **Abhay Naik (Abhay Vox)**\n* Threat Intel by **Ashwin Maganahalli**\n* Shielding Cloud Buckets by **Pradeep Bhat**\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- The Anatomy of a Breach : Lessons from common mistakes",
        "date": "2024-04-26",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/300344553",
        "timezone": "America/Los_Angeles",
        "description": "Hello...Are you ready to dive into world of enterprise security ?. Join us for an exciting Hacker Days, where we'll explore some of the Information Security essential requirements and it's a shared responsibility to protect systems and data. In this workshop, we will play roles of Developer/End-user/Security Engineer and explore various common mistakes which lead to critical security issues. We will also discuss the best practices for preventing such attacks.\n\nThank you very much to Endor Labs for gracious providing us the venue and Levo.ai - the guardians of the API galaxy! for sponsoring the food and drinks.\nThis event is in partnership pacific hackers community https://www.pacifichackers.org/\n\nWorkshop outline:\n\n\\* Overview\n\\- Introduction: Responsibilities of different roles\\.\n\\- Demo application walkthrough: A custom \\.net web application and a mobile app\\.\n\\- Tools: BurpSuite\\, Wireshark\\, ApkTool\n\\* Developer mistakes: Various mistakes done by developers will be explained along with the impact and how to identify and prevent them.\n\\- Hardcoded Secrets\n\\- Login Credentials\n\\- Lack of Awareness\n\\- Security Misconfiguration\n\\* End-user mistakes: As end-users, one can be a victim of cyber attack due to simple mistakes. Let's explore scenarios with live demo.\n\\- Wi\\-Fi Attack\n\\- Offer and Freebies\n\\* Security Engineer mistakes: Security engineers are responsible for detecting vulnerabilities and recommending fixes. But we are also human being and can commit mistakes which can lead to attacks.\n\\- Misusing available tools\n\\- Lack of scoping\n\\- Few OWASP top 10 vulnerability demo\n\\* Closing Note\n\\* Q&A\n\nSpeaker Details:\nName: Sarwar Jahan M\nLinkedin: [https://www.linkedin.com/in/sarwarjahanm/](https://www.linkedin.com/in/sarwarjahanm/)\nBio: Sarwar Jahan is currently working as a Senior Enterprise Security Engineer, who worked at tech giants like Synopsys, Microsoft and Salesforce. He has 10+ years of experience and was ranked among top ethical hackers globally. He is passionate about sharing knowledge with the community and running a non-profit initiative called InfoSecCamp to spread security awareness among people by conducting Boot Camps.("
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "April meetup",
        "date": "2024-04-23",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/300013837",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming April meetup, which will be hosted by the wonderful team at **Truffle Security**. Get ready for insightful discussions, delicious refreshments, and the chance to network with some of the brightest minds in the industry.\nAgenda:\n5-5.45Pm :- Doors open, networking and food\n5.45-6.30PM :- Leaked Secrets and Unlimited Miles\n6.30-7.15PM :- Secrets from a bygone era\n7.15-8 PM :- The Internet is broken, Putting IPv6 into perspective\n8PM Doors closed.\n\n**Talk#1: Leaked Secrets and Unlimited Miles by Sam Curry**\nNearly every major rewards program (United MileagePlus, American Express, Southwest Rapid Rewards, etc.) is powered by a single provider: [points.com](http://points.com/). Join us as we discuss vulnerabilities identified in [points.com](http://points.com/) and other pieces of airline infrastructure which lead to mass PII disclosure, an infinite money glitch, and free upgrades.\n\n**Talk #2 -** Secrets from a bygone era by **Dylan Ayrey**\nGitHub is a platform that was designed for sharing, it wasn't designed for unsharing. So how difficult does it become to unshare? This talk will dig into all the different ways your secrets might get replicated, propagated, persisted, and shared, for decades following your mistake.\n\n**Talk#3** The Internet is broken, Putting IPv6 into perspective\n**Description**:\nMost of the Internet is currently running on a legacy version of the Internet Protocol: IPv4. Despite of this, the number of engineers, especially in security, who know how to use IPv6 is relatively low. In this talk, previously presented internally at NCC Group, I will show you why today's Internet does not live up to its original vision, take you back to the past to show you what the IPv4 Internet used to look like and through this reveal the secrets that will make you understand IPv6.\n\n**Speaker**:**Denis Smajlović,** Founding Security Consultant at Nova Information Security. With a background in security consulting having worked for some of the largest financial institutions in Scandinavia and biggest tech companies in the Bay Area, I started Nova to provide web application and network pentesting services with the idea that we are able to work closer with clients and provide greater value."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Web Security 101: Safeguarding Your Digital Footprint",
        "date": "2024-04-28",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/300502194",
        "timezone": "Asia/Kolkata",
        "description": "Welcome to \"Web Security 101: Safeguarding Your Digital Footprint,\" a comprehensive beginner-level event designed to equip you with the essential knowledge and skills to protect yourself online.\n\nIn today's digital age, our online presence is more significant than ever. From personal information to financial data, we entrust a plethora of sensitive details to the web. However, with the increasing prevalence of cyber threats and malicious actors, it's crucial to fortify our defenses and ensure the safety of our digital footprint.\n\nJoin us for an enlightening journey into the realm of web security, where you'll learn:\n\\- Foundations of Web Security: Understand the basic concepts and principles of web security\\, including common vulnerabilities and attack vectors\\.\n\n* Protecting Your Digital Assets: Discover practical tips and best practices for safeguarding your personal and professional information online.\n* Securing Your Devices and Networks: Learn how to secure your devices, networks, and online accounts against cyber threats, malware, and phishing attacks.\n* Navigating the Cyber Landscape: Gain insights into the evolving cybersecurity landscape and emerging trends, empowering you to stay ahead of potential threats.\n* Interactive Workshops and Demos: Engage in hands-on workshops and live demonstrations that reinforce your learning and provide practical guidance for implementing security measures effectively.\n* Community Engagement: Connect with like-minded individuals, share experiences, and collaborate on strategies for enhancing web security awareness and resilience.\n\nWhether you're a student, professional, or simply a concerned internet user, \"Web Security 101: Safeguarding Your Digital Footprint\" offers a welcoming environment where everyone can learn and thrive.\n\nDon't miss this opportunity to take control of your online security and protect what matters most. Reserve your spot today and embark on a journey towards a safer digital future!"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS April 2024",
        "date": "2024-04-25",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/300235874",
        "timezone": "America/Denver",
        "description": "Speaker: Stu Gentry; Intro to Software Reverse Engineering\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "OWASP Top 10 for Large Language Model Applications",
        "date": "2024-05-16",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295530895",
        "timezone": "America/New_York",
        "description": "The OWASP Top 10 for Large Language Model Applications project aims to educate developers, designers, architects, managers, and organizations about the potential security risks when deploying and managing Large Language Models (LLMs). The project provides a list of the top 10 most critical vulnerabilities often seen in LLM applications, highlighting their potential impact, ease of exploitation, and prevalence in real-world applications. Examples of vulnerabilities include prompt injections, data leakage, inadequate sandboxing, and unauthorized code execution, among others. The goal is to raise awareness of these vulnerabilities, suggest remediation strategies, and ultimately improve the security posture of LLM applications."
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "Security and Compression",
        "date": "2024-04-24",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-delaware-chapter/events/300190943",
        "timezone": "America/New_York",
        "description": "**Agenda**\n\n* **Chapter Intro**\n\n* **Main presentation: Title: Security and Compression**\n\nAuthor: Lucas Driscoll [https://github.com/Lukerd-29-00/](https://github.com/Lukerd-29-00/)\nAbstract: This is a talk on the cybersecurity risks caused by using compression, especially in a web context. It goes over the basic mechanics of attacking a scheme where text is compressed and then encrypted, the attacks that have been discovered in practice, and mitigations against them.\nThis relates to attacks against TLS, such as Compression Ratio Info-leak Made Easy (CRIME) and BREACH (Browser Reconnaissance and Exfiltration via Adaptive Compression of Hypertext) .\n\n* **Web Academy hands-on labs** \\- We continue our journey through the Web Academy at [https://portswigger.net/web-security/](https://portswigger.net/web-security/)\n\nThe meeting will be held in the library's computer lab to encourage people to get some hands-on web security testing experience."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Avril 2024",
        "date": "2024-04-25",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/300284708",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **PADOK** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #65 - Data Centricity and Securing AI",
        "date": "2024-04-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/299501950",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #65! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Data Centricity for Cloud and Application Security**\n\n*Prof. Dr. Igor Podebrad, Director CISO Office, Google Cloud*\n\nIgor's talk will demystify data-centricity as a key driver for robust application and cloud security. He'll contrast the shift to data-centricity focus how it underpins cloud, AI and supports sound risk decisions. He will also discuss how this shift is reshaping security and resilience in for digital transformation. Igor is currently a Director at Google Cloud's Office of the CISO and a former Group CISO at Commerzbank AG. He holds a PhD in Medical Care Logistics from the University of Berlin.\n\n**2\\. Talk: Securing GenAI Applications on Cloud: Three pronged approach**\n\n*Hari Hayagreevan, Technical Leader – AI Security, IBM Consulting DACH*\n\nThe convergence of Generative Artificial Intelligence (Gen AI) with cybersecurity introduces a spectrum of challenges and prospects. To embrace Gen AI extensively within enterprise contexts, it's imperative for these AI systems to be devoid of vulnerabilities in their application and infrastructure. This necessitates a holistic approach to securing Gen AI platforms. In this session, Hari will take you through the different viewpoints, offering insights from an Enterprise Security Architect’s perspective, with practical enterprise scenarios. Hari is Enterprise Security Architect and currently is the Technical Leader for IBM Consulting’s GenAI Security practice in DACH. He started his career as Cybersecurity incident responder (SOC Analyst) 18 years ago and now advises Enterprise CISOs and Security Architecture teams on adopting security principles for preventing cyber attacks.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 24.04.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\ncodecentric AG, Lise-Meitner-Straße 4, 60486 Frankfurt am Main\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - May 2024",
        "date": "2024-05-08",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/300284832",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is excited to welcome you to our latest Meetup event! \nPrepare to dive into the world of AppSec with an evening filled with engaging security topics, networking, and of course, plenty of food and drinks.\n\nThis time, we're delighted to have Playtika host our gathering!\n\n====================================================================\n\nAgenda:\nTBD\n\n=====================================================================\n\nThis event is hosted by Playtika in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-05-20",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/299878996",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "OWASP KC May Meetup",
        "date": "2024-05-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-kansas-city/events/300496496",
        "timezone": "America/Chicago",
        "description": "TBD"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-04-30",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/299453895",
        "timezone": "America/Los_Angeles",
        "description": "Join us for our 2nd mixer with participating cybersecurity communities in Southern California, enjoy the beautiful weather, amazing sunset, great conversations, network with your peers, make new friends!\nYou **don'**t have to be a member of any group to participate. Mark your calendars; see you there!!\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring OWASP LA events please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - APR 24, 2024",
        "date": "2024-04-24",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/298386031",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Building A Product Security Team – The Good, The Bad And The Ugly - Lessons From The Field\nJoin us for great networking, dinner and drinks, and see a presentation by **Peter Morin**, Principal, National Cyber Security Leader, **Grant Thornton LLP**\n\n**ABSTRACT**: Ensuring that the products and services we build, and deliver are as threat resistant as possible is extremely important today. Meeting this challenge is not just about building secure applications since we all know that rapid development of software as well as the evolution of threats and vulnerabilities can see our applications as secure today but vulnerable tomorrow. That is why having an established product security team and response capability is extremely important.\nDuring this discussion, I will discuss, using real-world examples, including that of my own, how organizations can meet the demands of product security including:\n\n* Building a culture of security within your organization beyond firewalls and anti-virus\n* How to “sell” security to executive management and explaining what product security does and doesn’t do (e.g., staffing, budgets, etc.)\n* Building and deploying software using the \"DevOps\" approach, while maintaining a high level of security\n* Difficulties of wearing multiple hats, with security being one of them\n* Embedding “security” in the software development life cycle (SDLC)\n* Establishing a proper security “response” program\n* Product vulnerability transparency and developing a disclosure policy\n* How to measure the success of your program\n* Establishing a bug bounty program\n\n**THANKS to OUR SPONSOR**: *[DevOcean](https://www.devocean.security)*\n*DevOcean Unified Remediation Platform™, a Gartner Cool Vendor, helps organizations cut the time, backlog, and manual effort needed to fix issues and manage threat exposure. Going beyond traditional methods, DevOcean enables security, dev and devops teams to collaborate efficiently without the usual pain and friction of day-to-day operations. Our powerful workflow automation engine leverages the unique context of cloud-to-code root cause analysis and ownership association to deliver a highly accurate remediation solution that drives resolution at scale.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Understanding the Cyber Kill Chain with Elizabeth Stephens",
        "date": "2024-05-01",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300316300",
        "timezone": "America/Chicago",
        "description": "This session will delve into the Cyber Kill Chain, a foundational framework for comprehending cyberattacks. We'll explore how attackers operate and empower ourselves to build targeted defenses. While a valuable tool, we'll also discuss the Kill Chain's limitations and the evolving nature of attacker tactics."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-05-21",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780385",
        "timezone": "Pacific/Auckland",
        "description": "We've resumed our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for May will be **A02:2021 - Cryptographic Failures**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Workshop: Vulnerability Reachability Analysis Using OSS Tools",
        "date": "2024-04-25",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/300191397",
        "timezone": "America/Los_Angeles",
        "description": "# Vulnerability Reachability Analysis Using OSS Tools\n\n**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on April 22nd, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and will join via livestream instead.*\n\n**Abstract**\nNew vulnerabilities are disclosed every day in dependencies that you or your team may be using. But how do you know if you are actually using the vulnerable code? This talk will show you how to use two different types of tools to analyze reachability – deciding if the vulnerability needs to be prioritized based on your own code usage.\n\n**Workshop Overview:**\nThe workshop will be broken into several modules; introductory modules will cover the workshop organization and administrative matters (installing and configuring the tools used in the workshop). Subsequent modules will give an outline of what vulnerability reachability is and why it is important and compare/contrast the two main ways of understanding reachability (static call graphs and runtime analysis).\n\nNext, the workshop will present two short exercises, intended for the attendees to gain hands-on experience using both types of tools against real applications with real vulnerabilities. Interpreted languages (Java) and compiled languages (C/C++/Go) will be covered. Subsequently, the following module will walk through how to interpret the results obtained from the exercises and draw conclusions. The languages chosen are merely representative; the skills learned in the workshop are equally applicable to other languages.\n\nThe workshop will conclude with two modules which will present a short overview of commercial tools and a conclusion/wrap-up/Q&A session.\n\n**Workshop Outline:**\nI. Overview (10 minutes)\nA. Workshop organization\nB. About the tools and sample applications\n\n1. What are the tools and applications we are going to use?\n\nC. Obtaining/installing the tools and sample applications\n2\\. Cloning from the github repo\n\nD. Goals of the workshop (what you will learn)\n3\\. Be able to understand the importance of vulnerability\nreachability and how it helps prioritize remediation strategy\n\n4\\. Become familiar with some of the tools available to help with\nvulnerability reachability\n\n5\\. Learn where you can reach out to for more help in these areas\nafter the completion of the workshop\n\nII. Types of reachability analysis (10 minutes)\nA. Static analysis / call graphs\n6\\. What is a call graph?\n7\\. What information does a call graph provide to you\n\nB. Runtime analysis\nC. Language and environment considerations\n8\\. Things to consider when choosing a reachability analysis\nsolution\na. Types of applications being analyzed (COTS vs self-written)\nb. Availability of source code\nc. Robustness of test environment\nIII. Static call graph analysis exercise (20 minutes)\nA. Using static call graph analysis in IntelliJ/Eclipse to analyze a\nJava application\nB. Using Go callgraph to analyze a Go application\nC. How to correlate a call graph with an SBOM\nIV. Dynamic/runtime analysis exercise (20 minutes)\nA. Using a Java agent to analyze runtime reachability in a running\nJava application\nB. Using valgrind/KCacheGrind to analyze a running C/C++ application\nC. How to correlate runtime analysis with an SBOM\n\nV. Results comparison (10 minutes)\nA. Using the results of each exercise to determine if vulnerable\ncode was used\n\n1. How to use the output of each tool to understand what\n\nvulnerabilities need to be prioritized\nB. Benefits and limitations of each approach\n\nVI. Conclusion & Q&A (20 minutes)\n\n**Schedule:**\n6:00pm - 6:30pm Networking, Food & Drinks\n6:30pm - 8:00pm Presentation"
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "OWASP Oslo Chapter meetup",
        "date": "2024-04-29",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-oslo/events/300368216",
        "timezone": "Europe/Oslo",
        "description": "Big thanks to NAV for sponsoring this event!\n\n* **17:00-17:15 Food**\n* **17:15-18:00 Finding a three 0-day exploit chain in Ivanti EPMM and Ivanti Sentry,** Tor E. Bjørstad and Erlend Leiknes, mnemonic\n* **18:15-19:00 Testing race conditions has never been faster,** Sofia Lindqvist, Binary Security\n\n**Finding a three 0-day exploit chain in Ivanti EPMM and Ivanti Sentry**\nDuring the summer of 2023, a team at mnemonic discovered three 0-day vulnerabilities in Ivanti Endpoint Protection Manager Mobile (EPMM, formerly known as Mobileiron Core) and Ivanti Sentry.\n\n* CVE-2023-35078: authentication bypass in Ivanti EPMM, CVSS 9.8\n* CVE-2023-35081: path traversal / arbitrary file write in Ivanti EPMM, CVSS 7.2\n* CVE-2023-38035: authentication bypass in Ivanti Sentry, CVSS 9.8, allowing command execution as root.\n\nAll three vulnerabilities are listed in CISA's Known Exploited Vulnerabilities catalog, as they are known to have been exploited by threat actors in the wild. Ivanti has also confirmed that the vulnerabilities can be combined in an exploit chain.\nIn this talk we'll take a closer look at what actually happened.\n\n**Speakers**\n\n* **Tor E. Bjørstad** has spent his entire career in security and privacy. For the last decade he has worked as a principal security consultant at mnemonic, based in Oslo. He has mainly focused on software security and security architecture, with a particular interest in society-critical infrastructure. Tor holds a Ph.d. in cryptography from the University of Bergen.\n* **Erlend Leiknes**, a security consultant at mnemonic as, Oslo, spends his days as a penetration tester. His professional motto is that most vulnerabilities are obvious, the endeavor is to look at the right places. Erlend holds a master's degree in technical societal safety from University of Stavanger.\n\n**TESTING RACE CONDITIONS HAS NEVER BEEN FASTER**\n\nHistorically, testing for race condition vulnerabilities in web apps has been a painful ordeal, likely making race conditions an under-explored attack vector. In the summer of 2023, groundbreaking research by James Kettle completely changed the game, suddenly making it much easier for pentesters (and attackers) to test for this type of vulnerability. In this talk I will show how race conditions work, how to test for them and how to protect against them, based off an example vulnerability I found during a recent pentest.\n\n**Speaker**\n\n**Sofia Lindqvist**, security specialist, Binary Security\n\nSofia works as a security specialist at Binary Security. She started her career with a PhD in pure maths, followed by three years at Cisco developing one of their networking OSs. She eventually made her way into security testing, which she has been doing for a year and a half."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-04-25",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/300080531",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "May 2024 Meeting",
        "date": "2024-05-07",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/300506523",
        "timezone": "America/Phoenix",
        "description": "**Topic #1 - GitHub Supply Chain Attack Overview** \\- 5 Minutes\n*In March, Dark Reading reported a [GitHub Supply Chain Attack](https://www.darkreading.com/application-security/github-developers-hit-in-complex-supply-chain-cyberattack). Learn about the GitHub platform, software package dependencies, and the attack techniques in this high level overview.*\n\n**Topic #2 - OWASP Top 10 Web Application Risks Quiz -** 20 Minutes\n*Test your knowledge of the [OWASP Top 10 web application security risks](https://owasp.org/www-project-top-ten)! Compete for a chance to win fabulous prizes (aka candy bars).*\n\n**Cost**\n\nFree!\n\n**OWASP Info**\n\nOWASP is a non-profit dedicated to **application security**. Our meetings are free to attend and you do not need to be a member, nor have any experience with application security. All are welcome!\n\n**Meetings Every Month!**\n\nMeetings occur the first Tuesday of every month. Be sure to join our Meetup page to be notified of future meetings and topics.\n\n**Free Parking**\n\nFree Parking Lot:\n1 N Macdonald St, Mesa, AZ 85201\n[https://downtownmesa.com/parking/green-lot](https://downtownmesa.com/parking/green-lot)\n\nNote that this parking lot is across the street from HeatSync Labs. There are other nearby lots and street parking as well."
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro 014 [ONLINE]",
        "date": "2024-04-25",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/300369000",
        "timezone": "America/Sao_Paulo",
        "description": "Em setembro teremos o nosso próximo encontro, será no dia 25/04 (quinta-feira), a partir das 19h30, online em nosso canal do YouTube.\n\n**Link para a transmissão:** https://www.youtube.com/watch?v=4ZxnGWUiunQ\n\n**Confira nossa agenda:**\n\n**19h30-20h30**\n**\"A necessidade de segurança nos seus produtos\"**\n\nNesta palestra, abordaremos a importância crítica da segurança de produtos. Com a crescente complexidade dos produtos e a evolução das regulamentações globais, garantir a segurança tornou-se um desafio multifacetado para empresas de todos os tamanhos e setores, vamos ver como podemos garantir a segurança dos seus produtos utilizando boas práticas de desenvolvimento seguro e testes de segurança.\n\n**Palestrante:** Joas A Santos (Offensive Security Engineer na Unico IdTech)\n\nJoas A Santos é engenheiro de segurança ofensiva na Unico IdTech, Autor de livros sobre Segurança Ofensiva e Pesquisador de Segurança nas horas vagas."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC / Wasatch AppSec -April Meetup (In person) @HealthEquity",
        "date": "2024-04-25",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/300281702",
        "timezone": "America/Denver",
        "description": "**Agenda**:\n\n1. Introductions / Lunch\n2. Topic of Discussion: Book Club: \"[9 Lies about Work](https://www.amazon.com/Nine-Lies-about-Work-Freethinking-ebook/dp/B07C3ZT28C)\" through the lens of working in AppSec.\n3. Q&A\n\nCome join us for a lunch meetup at the Health Equity building in Draper, UT.\nCasual meetup, anyone interested in Application Security is welcome to attend. Please RSVP. We'll discuss the [book](https://www.amazon.com/Nine-Lies-about-Work-Freethinking-ebook/dp/B07C3ZT28C) in the context of how to support an organization's software security program.\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-05-08",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300238774",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Seattle Cyber Mixers | Inaugural Mixer",
        "date": "2024-04-25",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/299560512",
        "timezone": "America/Los_Angeles",
        "description": "**J**oin us for the inaugural Seattle Cyber Mixers brought to you by the leading local security non-profit organizations and sponsored by [Archer](https://www.archerirm.com/). These new series are designed to offer more informal connection opportunities for the cybersecurity community of the Greater Seattle area.\n\nWe're kicking off a casual, low-key gathering where local security professionals can connect and unwind in an informal low-pressure setting. As the first of many, we plan to host these mixers at various locations, rotating based on your feedback. Our aim is to cultivate a regular cadence, potentially monthly or bimonthly, evolving with the community's interest.\n\nAny questions or suggestions, message the [OWASP Seattle Chapter](https://www.linkedin.com/company/owasp-seattle-chapter/) or contact [Eva Benn](https://www.linkedin.com/in/evabenn/)."
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Zero Trust in API Security",
        "date": "2024-05-08",
        "time": "19:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/300531477",
        "timezone": "Asia/Singapore",
        "description": "The ultimate goal of Zero-Trust Architecture is to protect an organization’s critical data against advanced threats. However, the current market focus is overly focused on network architecture, overlooking the elephant in the room.\n\nIn a modern application architecture, APIs are the backbone of interconnecting microservices. This means APIs are the most closely related ‘services’ to an organization’s data, which explains why advanced attackers target APIs. In this session, we will explain how the zero-trust concept protects APIs."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - TruffleHog Disclosure @ Omegapoint",
        "date": "2024-04-24",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/299767743",
        "timezone": "Europe/Stockholm",
        "description": "Welcome to another OWASP Stockholm event! This time we will be visiting Omegapoint!\n\nThe meetup will start with a mingle with food and drinks at 17:30 and the main presentation will begin at 18:00.\n\n***18:00 TruffleHog Security Issue Disclosure - Helena Rosenzweig***\nThis presentation covers a set of security issues in TruffleHog, an open source, automated security tool that scans code repositories and configuration files for active secrets. The session provides a detailed walkthrough with several live demos, showing how the tool can be exploited to remotely harvest credentials from anyone running a default installation of TruffleHog v3. This presentation is part of a coordinated disclosure together with Truffle Security, the team behind TruffleHog.\n\n**Location**: Vasagatan 16, 111 20 Stockholm\nTime: April 24th, 17.30 – 21.00\nLighter food & drinks will be served.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcomming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Threat Modelling with Reliable Data",
        "date": "2024-05-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/299507519",
        "timezone": "Europe/Zurich",
        "description": "Reliable data is inherently critical for application threat models. As threat modelling continues to proliferate across security programs, bad habits in feeding threat models with relevant data is becoming prevalent. This session will explore top 3 mistakes of \"data starvation/ gluttony\" with respect to application threat models and how to achieve a contextualized, balanced data diet.\n\nJoin this OWASP Switzerland event to learn more from Tony about threat modelling and how to make sure you use quality data in doing so."
    },
    {
        "group": "Tunisia",
        "repo": "www-chapter-tunisia",
        "name": "AI: The New Attack Surface and Strategies for Securing It",
        "date": "2024-04-26",
        "time": "20:00+01:00",
        "link": "https://www.meetup.com/owasp-tunis-meetup-group/events/300270789",
        "timezone": "Africa/Tunis",
        "description": "Welcome to OWASP Tunisia\n\nFollow us and Subscribe to our channel https://www.youtube.com/@owasptunisiachapter4108/streams\n\nJoin our OWASP Tunisia Community via Meetup : https://www.meetup.com/owasp-tunis-meetup-group/\n\nAn Exceptional episode with our Honorable guest Speaker ***Jeff Crume*** !\nSave the date 26 April 2024 at 8 pm(UTC+1) !\n\n***Jeff Crume*** *is an IBM Distinguished Engineer and Master Inventor with more than 40 years’ experience in the IT industry. He has a PhD in Cybersecurity and also serves as an Adjunct Professor at NC State University. Jeff’s YouTube videos have been viewed more than 3 million times and he is the author of a book entitled \"Inside Internet Security: What Hackers Don't Want You To Know” as well as a contributing author to the \"Information Security Management Handbook.” He is a member of the inaugural class of the NC State University Computer Science Alumni Hall of Fame and serves on the editorial board for the “Information and Computer Security” research journal. Jeff lived in Beijing on assignment in 2006 and has worked with clients in 50 countries.*\n\n**Topic: *AI: The New Attack Surface and Strategies for Securing It***\n\n**Description:**\nArtificial Intelligence (AI) introduces novel security challenges, including adversarial attacks and model vulnerabilities. This session discusses proactive measures for bolstering AI by securing the data, the model, the usage and the infrastructure. In addition, six different types of AI attacks will be covered in order to provide a better understanding of the threatscape."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Ensuring Application Security Excellence in the Age of AI",
        "date": "2024-05-16",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516396",
        "timezone": "America/Vancouver",
        "description": "**Ensuring Application Security Excellence in the Age of AI** with Michael Argast\n\nIn a time where artificial intelligence (AI) permeates every facet of digital existence, the imperative to ensure application security has reached unprecedented heights. In this talk, Michael Argast, Co-founder and CEO of Kobalt.io will delve into the essential strategies for ensuring application security excellence amidst the pervasive influence of AI. By exploring the intricate interplay between AI and cybersecurity, you will gain insights into how AI augments defensive strategies, mitigates vulnerabilities, and addresses emerging threats within application environments. Through real-world case studies and practical recommendations, this session equips you with the knowledge and tools needed to leverage AI effectively in the face of evolving challenges.\n\n**Michael** is an experienced cybersecurity professional with over 20 years of industry experience. He is the co-founder and CEO of Kobalt.io, a rapidly growing cloud-focused security services provider. Kobalt.io works with over 200 cloud-focused technology companies to help develop their cyber security programs and ensure the security of their organization.\n\nWe would like to thank **Microsoft** for sponsoring this event."
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "Segurança Digital: Navegando com Confiança em um Mundo de Cyber Fraudes",
        "date": "2024-04-24",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/300441132",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: André Vidal\nTema: Segurança Digital: Navegando com Confiança em um Mundo de Cyber Fraudes\nData: 24/04/2024 às 19:30"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #65 - Data Centricity and Securing AI",
        "date": "2024-04-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/299501950",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #65! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Data Centricity for Cloud and Application Security**\n\n*Prof. Dr. Igor Podebrad, Director CISO Office, Google Cloud*\n\nIgor's talk will demystify data-centricity as a key driver for robust application and cloud security. He'll contrast the shift to data-centricity focus how it underpins cloud, AI and supports sound risk decisions. He will also discuss how this shift is reshaping security and resilience in for digital transformation. Igor is currently a Director at Google Cloud's Office of the CISO and a former Group CISO at Commerzbank AG. He holds a PhD in Medical Care Logistics from the University of Berlin.\n\n**2\\. Talk: Securing GenAI Applications on Cloud: Three pronged approach**\n\n*Hari Hayagreevan, Technical Leader – AI Security, IBM Consulting DACH*\n\nThe convergence of Generative Artificial Intelligence (Gen AI) with cybersecurity introduces a spectrum of challenges and prospects. To embrace Gen AI extensively within enterprise contexts, it's imperative for these AI systems to be devoid of vulnerabilities in their application and infrastructure. This necessitates a holistic approach to securing Gen AI platforms. In this session, Hari will take you through the different viewpoints, offering insights from an Enterprise Security Architect’s perspective, with practical enterprise scenarios. Hari is Enterprise Security Architect and currently is the Technical Leader for IBM Consulting’s GenAI Security practice in DACH. He started his career as Cybersecurity incident responder (SOC Analyst) 18 years ago and now advises Enterprise CISOs and Security Architecture teams on adopting security principles for preventing cyber attacks.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 24.04.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\ncodecentric AG, Lise-Meitner-Straße 4, 60486 Frankfurt am Main\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    }
]