[
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "2. OWASP Augsburg Stammtisch",
        "date": "2024-05-29",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/300790684",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda**\n\n* *Vortrag:* **<- WIR SUCHEN NOCH VORTRAGENDE!**\n* Austausch & Networking\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2024 (Online)",
        "date": "2024-05-28",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207005",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-05-23",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/300808636",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-05-16",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/300909022",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "May 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-05-09",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299656219",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, May 9th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-05-09",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/300806712",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Beja",
        "repo": "www-chapter-beja",
        "name": "0x01 Securing the Web",
        "date": "2024-05-23",
        "time": "14:30+01:00",
        "link": "https://www.meetup.com/owasp-beja-chapter/events/300539527",
        "timezone": "Europe/Lisbon",
        "description": "Securing the Web is the second meetup of OWASP Beja chapter which will be held on May 23rd, 2024, at 14:30 sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**.\n\n**Schedule**\n\n14:30 - **Welcome Notes** by OWASP Beja chapter leadership team\n14:35 - **Purple Team Approach Towards Confluence RCE** by Paulo Viegas\n15:00 - **Newton's Third Law: Static vs. Dynamic Abusers** by Diogo Sousa\n16:00 - **Snacks & Drinks** sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**\n\n**Talks**\n\n**Purple Team approach towards Confluence RCE**\nby Paulo Viegas, Threat Detection Analyst @ Siemens\n\nTalk about the value of collaboration between the red and blue team with a practical example.\n\n**About the Speaker**\nCurious Blue Teamer with special taste for malware and forensics.\n\n\\-\\-\\-\n\n**Newton's Third Law: Static vs. Dynamic Abusers**\nby Diogo Sousa, Engineering Manager @ Canonical\n\nIf you offer a service on the web, odds are that someone will abuse it. Be it an API, a SaaS, a PaaS, or even a static website, someone somewhere will try to figure out a way to use it to their own needs. In this talk we'll compare measures that are effective against static attackers and how to battle a dynamic attacker who adapts to your counter-measures.\n\n**About the Speaker**\nAn opinionated individual with an interest in cryptography and its intersection with secure software development."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE Chapter Meeting (21/05/2024, Brussels)",
        "date": "2024-05-21",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/300566355",
        "timezone": "Europe/Brussels",
        "description": "On May 21st, we organize our next OWASP Belgium chapter meeting at BeCentral (Brussels), by the courtesy of Proximus-ADA.\n\n**Agenda**:\n\n* 18h00-18h30: Welcome and refreshments\n* 18h30-18h40: **OWASP Update**\n18h40-19h30: **[User Privacy in Online Location-Based Services](https://owasp.org/www-chapter-belgium/#user-privacy-in-online-location-based-services---victor-lepochat-and-karel-dhondt-distrinet---ku-leuven)** (by Victor LePochat and Karel Dhondt, KU Leuven-Distrinet)\n19h30-19h45: Break\n19:45-20h35: **[Signaling New Frontiers: SS7 Insights by Jeremy Schmidt (Proximus ADA)](https://owasp.org/www-chapter-belgium/#signaling-new-frontiers-ss7-insights---jeremy-schmidt-proximus-ada)** (by Jeremy Schmidt, Proximus ADA)\n21:00: Close\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Bham Chapter Meetup May 2024!",
        "date": "2024-05-23",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/300370233",
        "timezone": "Europe/London",
        "description": "Welcome from OWASP Birmingham our first Meetup of 2024\n\nOnce again we'll be @Hays at One Colmore Square Thursday 23rd May for two great Infosec talks\n\n5.45pm - Doors open\n6.15pm - Welcome and Food\n6.30pm - \"**Post-Quantum Cryptography**\"\n\nSpeaker: Charlie Anglin\n\nSynopsis : Quantum computers are here and research is advancing every day. Boffins tell us that the rise of quantum computing will soon make our current encryption algorithms irrelevant. This talk aims to cover questions such as:\n\n· What are the facts?\n· What's being done to produce quantum-safe cryptography?\n· What can we expect to happen in the next few years?\n· What actions, if any, should we be taking?\n\nSpeaker Bio:\nCharlie is an engineer at Capgemini. He's spent the last 8 years in a number of roles, in particular as a security engineer and as a developer across multiple languages.\n\n7.15pm - Break\n7.30pm - \"**Practical Security Testing for E-Commerce and Payment Applications**\"\n\nSpeaker: Soroush Dalili\n\nSynopsis: This talk aims to deepen the audience's understanding of security challenges in e-commerce and payment applications and to introduce a practical testing methodology. We will detail specific vulnerabilities and demonstrate how to test for race conditions using tools like Burp Suite and Turbo Intruder. Additionally, if time permits, we will explore intriguing cases where simple arithmetic operations lead to unexpected security outcomes.\n\nSpeaker Bio:\nSoroush, the founder and director of SecProject, is a distinguished expert in web application security with over 15 years of experience specialising in vulnerability discovery, security source code review, and penetration testing. Before establishing his own company, he served as a principal security consultant at MDSec and NCC Group. He has contributed numerous security advisories to industry giants such as Microsoft, Mozilla, Adobe, Yahoo, and Facebook. Soroush's expertise has been showcased through speaking engagements at security conferences and events, including AppSec EU, SteelCon, BSides Manchester, and HackPra.\n\n8.15pm - Questions/Any Other Business\n8.30pm - Close\n\nRSVP when you get a chance so we can plan accordingly. We look forward to catching up with you all next month!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Rethinking attack surface management for an entire country",
        "date": "2024-05-14",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/300746223",
        "timezone": "Australia/Brisbane",
        "description": "In the physical world, if our neighbours left their front door open and were being robbed in broad daylight, the community would do something about it, like calling the police or yelling at the criminals from a safe distance. On the internet, we don’t really do anything. Even the government just sits around waiting for people to (virtually) get shot and then report an incident. We need to rethink our approach.\nIn this talk, Haoxi will talk about trench stories over the last 6 months of running DirectCyber, a volunteer based CSIRT that tracks exposures to critical vulnerabilities and notifies potential victims with pinpoint accuracy. He will cover why this was feasible to run with 2.5-person team, how to prioritise which vulnerabilities to track, challenges for disclosure, and legal concerns. He will share success cases from other public and private sector companies such as DIVD and TruffleSec, along with the bigger picture of how we can influence government security strategy for the better if we work together."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Interactive cyber crisis simulation, at Immersive Labs",
        "date": "2024-05-21",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/300831085",
        "timezone": "Europe/London",
        "description": "Immersive Labs invites you to participate in an interactive cyber crisis simulation.\n\nYou will make key decisions that could lead to mitigation and containment of the crisis or management of the fallout and potential reputational damage. You will play the role of a boardroom as you seek to make quick decisions during a cyber crisis. Attendees are encouraged to participate using their mobile phones during the session and our Head of AppSec will discuss your decisions at each stage and feedback on how you performed as a group. This is a fun session to creates discussion but also equips you with some decision making skills you can take back into the workplace.\n\n\\-\\-\\-\n\n**Directions:**\nIn-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.\n\nTo find the entrance, it might be easier to search for \"Programme, Bristol, BS1 2NB\", or use this link to [Google Maps](https://www.google.com/maps/?q=51.455666,-2.592341).\n\n**Venue:**\nPhoto shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard)."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS May 2024",
        "date": "2024-05-30",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/300804464",
        "timezone": "America/Denver",
        "description": "Speaker: Ben Struebing; \"The Summit Awaits: Are you ready the Purple Ascent?\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "OWASP Top 10 for Large Language Model Applications",
        "date": "2024-05-16",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295530895",
        "timezone": "America/New_York",
        "description": "The OWASP Top 10 for Large Language Model Applications project aims to educate developers, designers, architects, managers, and organizations about the potential security risks when deploying and managing Large Language Models (LLMs). The project provides a list of the top 10 most critical vulnerabilities often seen in LLM applications, highlighting their potential impact, ease of exploitation, and prevalence in real-world applications. Examples of vulnerabilities include prompt injections, data leakage, inadequate sandboxing, and unauthorized code execution, among others. The goal is to raise awareness of these vulnerabilities, suggest remediation strategies, and ultimately improve the security posture of LLM applications."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A Night of Honeypots and Information flow security",
        "date": "2024-05-23",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/300776505",
        "timezone": "Europe/Copenhagen",
        "description": "**Can we outsmart the adversaries? (Effective) Cyber Deception with Honeypots**\nIn today's ever-evolving cyber threat landscape, traditional defence mechanisms often struggle to keep pace with attacker ingenuity. Cyber deception offers a proactive approach, utilizing traps and deceiving tactics to lure attackers into controlled environments. Honeypots are one of the prominent techniques of cyber deception that act as decoy systems for capturing attacks and analyzing the adversary strategy. They provide an early detection mechanism as well as a method for learning how adversaries work and think. However, over the past years, several researchers have shown methods for fingerprinting honeypots. This significantly decreases the value of a honeypot; if an attacker can recognize the existence of such a system, they can evade it. This talk delves into the world of cyber deception, focusing on honeypots, their efficacy, and some fingerprinting techniques from my research. We'll explore how honeypots function and the contributions from The Honeynet Project, a non-profit, open-source community.\n**Speaker:** [Shreyas Srinivas](https://www.linkedin.com/in/shreyas-srinivasa-ph-d-47038b13/overlay/contact-info/) is Cyber Security Specialist at TERMA Group, Co-founder of Selene CTI and previously Security Researcher at Aalborg University. He is contributor to the [Honeynet project](https://www.honeynet.org/), a non-profit dedicated to investigating the latest attacks and developing open source security tools to improve Internet security.\n\n**Information-Flow Security for the Working Software Engineer**\nHow does information flow through your software? Awareness of this gives you a new perspective when writing software with security requirements; it helps you avoid introducing information leaks into software, and gives you a conceptual framework for reasoning about software security in general.\nIn this talk, you will meet concepts like information leak, sources & sinks, dependencies, side–channels, and flow policies. You will learn to identify information flows in software, to express application–specific security requirements as flow policies, and to implement software that adheres to said flow policies.\nWant to try this out? Then bring a laptop; right after the talks, I will organize a little activity where you can tinker with \\`ifc-ts\\` - my TypeScript library for expressing flow policies. In \\`ifc-ts\\`, flow policy checks are reduced to checks performed by TypeScript's type checker. Thus, if your code type-checks, then your code is guaranteed to adhere to the flow policies expressed therein.\n\n**Speaker:** [Willard Rafnsson](https://www.willardthor.com/) is Associate Professor at the IT University of Copenhagen (ITU). I am a member of the Center for Information Security and Trust (CISAT), as well as the Programming, Logic and Semantics (PLS) and Software Quality Research (SQUARE) groups.\n\n**Location:** to be announced"
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Cybersecurity careers in the AI era: Stay ahead of the curve",
        "date": "2024-05-12",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-cuddalore-chapter/events/300904777",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an interactive workshop on careers in the AI era in cybersecurity, hosted by OWASP Cuddalore Chapter. Don't miss this chance to enhance your knowledge and skills in software security. See you there!\n\nFollow Our Handles for updates:\n\n[Instagram](https://www.instagram.com/owaspcuddalore/)\n[Twitter](https://twitter.com/owaspcuddalore)"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Mai 2024",
        "date": "2024-05-13",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/300715711",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **[Theodo](https://www.theodo.fr/)** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg AI Security and Header Injections",
        "date": "2024-05-29",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/300784706",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Benify's office for an interesting evening with food and drinks, and talks about AI security and the security implications of attacker controlled HTTP response headers!**\n\n**Where:** Benify, Masthamnsgatan 5, 413 27 Göteborg\n\n**Agenda:**\n**17:00 - 17:25:** Welcome to Benify\n\n**17:25 - 17:40:** Introduction from the event hosts and presentation of tonight's speakers.\n\n**17:40 - 18:40:** *Securing the Future: Ethical, Robust, and Secure AI Development*\n\nOutline:\n\nHistorical Overview of AI\n\n* Evolution of artificial intelligence\n* Key milestones in AI development\n\nAI and Ethics\n\n* Impact on business operations and decision-making\n* Overview of ethical guidelines and frameworks\n* Best practices for ethical AI implementation\n* Strategies to mitigate ethical risks\n\nRobustness & Reliability of AI Code Generation\n\n* Common misuse patterns and how to address them\n* Key metrics for measuring AI system reliability\n\nArtificial Intelligence Security Introduction\n\n* Historical case studies of AI failures\n\nOWASP Top Ten for Large Language Models\n\n* Security issues ranging from prompt injection to model theft\n\nThreat Modeling AI Systems\n\n* Methodologies for assessing and mitigating threats in AI ecosystems\n\nHugging Face Open Source AI Tools\n\n* Overview of tools for AI development and research\n\nDifferential Privacy and AI\n\n* Principles and applications to protect user data\n\nNIST AI Risk Framework\n\n* Framework for managing AI risks\n\nExecutive Order on AI Development and Use (Dated Oct 30, 2023)\n\n* Analysis of the executive order and its implications for AI\n\nEU AI Act\n\n* Exploration of the EU's first regulation on AI (link provided in the talk)\n\n**Jim Manico** is the Founder of Manicode Security, a company dedicated to providing expert training in secure coding and security engineering to software developers. His work at Manicode Security reflects his deep commitment to elevating software security standards in the industry. In addition to leading Manicode, Jim is actively involved in the tech startup ecosystem as an investor and advisor. His portfolio includes notable companies such as SemGrep, EdgeScan, Nucleus Security, Defect Dojo, KSOC, Akto, MergeBase, Inspectiv, Levo.ai and Pheonix. Furthermore, he is a fund-limited investor with Aviso Ventures, bringing his knowledge of software security to the venture capital domain. Jim is a recognized figure in the software development community, particularly known for his contributions to secure software practices. He holds the title of a Java Champion, acknowledging his contributions to the Java community. He is also the author of \"Iron-Clad Java: Building Secure Web Applications\", published by Oracle Press. Jim is committed to giving back to the community through his volunteer work with the OWASP foundation. He co-leads projects such as the OWASP Application Security Verification Standard and the OWASP Cheatsheet Series, contributing significantly to the field of web application security. For more information, please visit his LinkedIn profile at https://www.linkedin.com/in/jmanico or visit him on X/Twitter @manicode.\n\n**18:40 - 19:20:** Food & Drinks\n\n**19:20 - 20:00:** *Controlling the response: a peek into the risk of attacker-controlled HTTP headers*\nThe talk will present research into the security implications of attacker-controlled response headers. What can go wrong when we intentionally or unintentionally allow an attacker to control the headers of an HTTP response? We will examine some services where this exists \"by design\" where developers have tried to mitigate any risk using filters and Content Security Policies. We will also take a new look at the classic \"CRLF header injection\". The presentation will cover some known escalations in this area but also present a lesser-known escalation that abuses Network Error Logging.\n\n**Johan Carlsson** is a developer, bug bounty hunter, and hobby security researcher. He works at Recorded Future but has just finished three months of self-employment as a full-time bug hunter. Johan has found numerous vulnerabilities in many companies but is most known for his work on securing GitLab.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-05-20",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/299878996",
        "timezone": "America/New_York",
        "description": "An introduction to OWASP's Juice Shop. A vulnerable website built for CTF practice."
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "OWASP KC May Meetup",
        "date": "2024-05-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-kansas-city/events/300496496",
        "timezone": "America/Chicago",
        "description": "TBD"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Chapter Limassol meetup 2024-v1",
        "date": "2024-05-31",
        "time": "18:30+03:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/300819935",
        "timezone": "Asia/Nicosia",
        "description": "The location is **The Ballroom Suite B** at the [Crowne Plaza Hotel](https://maps.app.goo.gl/38rAWxBS9gMoSiH69).\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the fourth meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/), supported by [Semrush Inc.](https://semrush.com)!\n\nWe cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\nWe look forward to seeing you there and would be delighted to offer a **complimentary gift to each attendee**!\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19-00 — 19:35 \"**ASPM** \\- a story about unicorns\\, sneaky business\\, and unexpected decisions\\.\" [Ivan Elkin](https://www.linkedin.com/in/ivan-elkin/)\n19-35 — 20:05 TBA\n20:05 — 20:30 A short break\n20-30 — 21:00 TBA\n21:05 — 21:40 TBA\n21:40 — 22:05 Outro\n22:05 — 23:00 Eat, drink, networking!\n\nIn addition, as usual, we are working hard to deliver the best knowledge to the community and are happy to announce that this event is fully packed with amazing gifts:\n\\- quizzes winners \\(**RTL-SDR Blog V3** R860 RTL2832U 1PPM TCXO HF Bias Tee SMA SDR with Dipole Antenna Kit) + branded T-shirt\n\\- activity winners \\(NooElec '**Yard Stick One**' USB Transceiver & 915MHz Antenne) + branded T-shirt\n\\- speakers \\(**Hamgeek HackRF One R9** and Portapack H2 Include 5 Antennas and Data Cable 1MHz-6GHz SDR Radio Unmounted Black) + branded T-shirt\n\nWe'll have catering and a chilly sunset view zone to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#07 - The Son",
        "date": "2024-05-28",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/300726135",
        "timezone": "Europe/Lisbon",
        "description": "Join us for the 7th OWASP Lisboa meetup!\n\nThe OWASP Lisboa chapter meetup will be held on May 28th, 2024, at 18:00, **and is** **supported by [Springer](https://www.springer.com/) and [AP2SI](https://ap2si.org/).**\n\nThe schedule is the following:\n**18:00** - **Welcome notes** by the OWASP Lisboa chapter leadership team\n**18:15** - **Technical Challenges of Security Scanning in CI/CD** by Tiago Mendo\n**19:10** - **Harnessing Reachability Analysis to Discern Real Threats in** by Joseph Hejderup\n**20:00** - **Drinks & Dinner** by Springer\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Technical Challenges of Security Scanning in CI/CD**\n\nSpeaker: **Tiago Mendo**\n\nAbstract:\nHave you ever tried to add a web application security scanner to a CI/CD pipeline?\nI intend to draw attention to some of the challenges that development/security teams experience when trying to automate security tests.\nThe objective is to make the audience aware of these problems so that they can solve them as soon as possible, increasing the success of the tests and the adoption by the teams, which, in the end, will lead to greater security for the organization.\nThe focus will be on problems such as the scale of tests, speed of obtaining results, false positives and how these can destroy the process - or make it more expensive, and the use of the tools itself. All problems will be based on real situations, with examples whenever possible. I will propose solutions for different teams' maturity levels, giving practical tips to start implementing security in the developers' pipeline.\n\nBio:\nTiago Mendo is a co-founder and CTO of Probely, a cybersecurity company that does web and API security scanning. With over 19 years of experience in the security field, he has extensive experience in pentesting applications, training, and providing all-around security consultancy.\nHolds a Master's in Information Security from Carnegie Mellon University and a CISSP certification. He is also a qualified member of AP2SI, a non-profit organization that promotes Information Security, and Co-Leader of the OWASP Lisboa Chapter, in Portugal.\nHe is also an international speaker at security conferences, such as SnowFROC, LASCON, BSides Kraków, and BSides Lisbon.\n\nLinkedIn: [https://www.linkedin.com/in/tiagomendo/](https://www.linkedin.com/in/tiagomendo/)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Harnessing Reachability Analysis to Discern Real Threats in Software Dependencies**\n\nSpeaker: **Joseph Hejderup**\n\nAbstract:\nIn this talk, we will dive into the shortcomings of traditional dependency analysis methods, which usually focus on looking at build manifests and metadata, to spot security or performance vulnerabilities in Java projects. While tools like Maven Dependency Checker and Gradle's dependency-analysis plugin are invaluable for their ability to manage dependencies, they often fall short when we need quick and precise answers, forcing developers to lean on time-consuming tests and manual code reviews. We believe that a thorough look at how dependencies are actually used in the code—with the help of static and reachability analyses—can be a more effective way to pinpoint real threats in Java dependencies.\n\nWe'll use real-world examples to show how static analysis, and in particular reachability analysis, offers deeper insights into potential vulnerabilities by moving beyond simple metadata. By sharing examples where static analysis has been a game-changer, and pointing out where it might not be enough, we aim to shed light on the challenges and opportunities this method brings to improving security and performance in software projects.\n\nOur goal is to provide attendees with practical strategies for using static and reachability analyses, promoting a more detailed method for managing dependencies and finding vulnerabilities in software applications.\n\nBio:\nPart-time developer, part-time PhD student, full-time enthusiast in developing and researching techniques that makes package management system more intelligent and resilient against supply chain problems! Joseph Hejderup (Researcher/Software Engineer at Endor Labs & PhD student at Delft University of Technology) is applying program analysis techniques to better understand how we use third-party components and what risks third-party components entails from a security and maintenance perspective. Currently, he is applying years of research in Endor Labs with the mission to make dependency management a robust process that will empower developers, increase productivity, and solve security problems.\n\nLinkedIn: [https://www.linkedin.com/in/josephhejderup/](https://www.linkedin.com/in/josephhejderup/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAY 22, 2024",
        "date": "2024-05-22",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300022938",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Securing Generative AI Applications using the OWASP Top 10 for Large Language Models\nJoin us for dinner+drinks, networking, and see a presentation by **Steve Wilson**, OWASP project leader and Chief Product Officer at **Exabeam**\n\n**ABSTRACT**: What are the new risks that generative AI brings to your environment? In this cutting-edge session, we uncover the potential hazards that Large Language Models (LLMs) introduce to modern application ecosystems. Drawing on the expertise distilled in the OWASP Top 10 for LLMs, we offer a comprehensive roadmap for mitigating these risks. Attendees will gain insights into securing generative AI applications, recognizing the nuances of LLM vulnerabilities, and deploying defenses. This talk is a call to action for developers and security professionals to foster a culture of secure, responsible AI development. Equip yourself with the knowledge to anticipate threats, apply best practices, and build AI systems that are not only intelligent but also resilient in the face of cybersecurity challenges.\n\n**THANKS to OUR SPONSOR**: *[Kodem](https://www.kodemsecurity.com/)*\n*Kodem means “first” or “early” in Hebrew. A priority. We believe in helping appsec teams make security a priority by spotlighting risks that truly matter. We believe in helping developers improve code quality by shifting left and catching issues early. And we believe in making people a priority: our customers, our team, and our partners.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Secure the Supply Chain with Software Bill of Materials (SBOM's)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Are you being asked about the security of your software supply chain? This seems to be one of the hottest and most prominent topics, both from auditors and customer compliance requirements right now within application and software security.\n\nJoin us Wednesday, May 22nd from 6:30pm - 8:30pm to hear from the experts at Synopsys software integrity group on the best ways to utilize SBOM's to ensure your software supply chain is secure!"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Supply Chain Security with Dan Lorenc, CEO Chainguard",
        "date": "2024-05-22",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/298689779",
        "timezone": "America/Chicago",
        "description": "Join us for an informative and hands-on workshop on securing your software supply-chain. In this event, we will be joined by Dan Lorenc, CEO and founder of Chainguard Inc. We will have food, learning, swag and, of course, networking with other like-minded folks in the area.\n\nChainguard and Pins Mechanical will host us after the event for those that can come have some fun! To be sure that I can help ensure head count, parking and more, please be sure to RSVP if attending in-person.\n\nNote: This event is organized by the OWASP Nashville Chapter and is open to both OWASP members and non-members. Whether you are already a member or interested in becoming one, we encourage you to attend this event and learn more about the benefits of being part of the OWASP community."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "CyberBooked 2024",
        "date": "2024-05-23",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/300656600",
        "timezone": "Europe/Amsterdam",
        "description": "### **Book your ticket now as seats are limited!**\n\nCyber Booked is a one of a kind physical CyberSecurity event, featuring both recently published and more well-known CyberSecurity books. The authors will share the latest insights from their books and you will have the opportunity to ask them questions about their books. During the break and drinks you can meet & greet with the authors and maybe even get your book signed!\n\nThis event is a joint event organised by the Dutch chapters of OWASP along with ISACA, ISC2 and the Secure Software Alliance (SSA).\nThe event is free of charge and CPE certificates will be issued from ISACA and ISC2. The event will be presented in English.\n\nPlease use the link below to register for the event with you full and correct information as this information will be used to process your CPE points.\n\nhttps://isaca.nl/events/cyber-booked-2024/"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Come meet & learn AppSec 2.0 w/ Host Dell, Deepfactor & DTR.",
        "date": "2024-05-15",
        "time": "17:00-04:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/300763664",
        "timezone": "America/New_York",
        "description": "An OWASP NYC Chapter Meetup\nAppSec 2.0: Security without the NOISE\n\nAppSec: Best Practices Tools... PaaS, SBOM’s, SCA and Runtime Security, let’s have some fun!!!\n\nIntroductions By Dell Technologies Security Team\n\nSession 1: An intro to DTR. Founder & CEO, Adam de Delva will introduce his services and how they develop Platform-as-a-Service (PaaS) for cloud - native applications and security.\n\nSession 2: { deepfactor } (Hands-On Workshop)\nWorkshop Topic: Vulnerability Reachability Analysis Using OSS Tools.\nWorkshop Abstract: New vulnerabilities are disclosed every day in dependencies that you or your team may be using. But how do you know if you are actually using the vulnerable code? This talk will show you how to use two different types of tools to analyze reachability – deciding if the vulnerability needs to be prioritized based on your own code usage.\n\nDon't miss this opportunity to network with like-minded individuals in the field of cybersecurity, software security, and application security. Come share your experiences, ask questions, and connect with industry experts. This event is hosted by the OWASP New York City Chapter, known for organizing informative and interactive meetups that empower professionals to stay ahead of the ever-evolving cyber threats landscape. Grab a drink, network with peers, and enhance your knowledge of web application security."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-05-21",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780385",
        "timezone": "Pacific/Auckland",
        "description": "We've resumed our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for May will be **A02:2021 - Cryptographic Failures**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "What's in your AI code? Learn why SCA tools are wrong, and how to deal with it",
        "date": "2024-05-16",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/300788299",
        "timezone": "America/New_York",
        "description": "With the rise of AI-fueled by Python-based libraries, it has become of paramount importance to scan Python-based projects and their dependencies for OSS vulnerabilities. Python relies on package managers like pip or conda to manage declared dependencies. Dependencies are declared in manifest files which the package manager uses to install the correct version of the required dependency. However, Python’s dependency management system coupled with its dynamic type nature makes it an especially challenging language to deal with.\n\nOf particular focus is the phenomenon of phantom dependencies which are unreported dependencies in a project's manifest profile. These hidden dependencies, which are often provided dependencies (which is especially true for libraries such as tensorflow and pytorch which are essential for AI), challenge software composition analysis (SCA) of Python code, impacting the reliability of vulnerability results.\n\nFor example, in the case of OpenAI's baseline codebase, there is a dependency on tensorflow that is not explicitly declared and is hence a phantom dependency This can cause unexpected behavior and security vulnerabilities. We show how using type-aware program analysis to create call graphs and perform reachability helps us determine the correct dependency set for a codebase irrespective of what is in the manifest.\n\nProgram analysis aims to extract information from software programs to enhance reliability, security, and performance. This session explores program analysis, specifically reachability analysis in Python, and delves into phantom dependencies - often overlooked in Python applications.\n\nPython's dynamic typing and interpreted nature make it a challenging subject for reachability analysis. The lack of type information makes it hard to precisely determine what dependency/features are used in the code.\n\nIn summary, program analysis, including Python's unique challenges, is essential in software development. Phantom dependencies in Python underscore the significance of meticulous dependency management for code reliability and security. Understanding these concepts is vital for Python developers aiming to build robust software. This abstract sheds light on program analysis complexities and the pitfalls of phantom dependencies, offering valuable insights into Python development and software reliability."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Steps to Reduce Friction between Development and Security Teams",
        "date": "2024-05-30",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/300805662",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on May 26th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Abstract**\nIn an era where cloud security is critical, the delicate balance between rapid development and maintaining stringent security measures is more critical than ever. Join Doron Naim (DevOcean) as he addresses this challenge head-on, offering members of OWASP new actionable strategies and expert insights for enhancing collaboration and efficiency in cloud security and remediation efforts.\n**Key Insights:**\n\n* **Collaboration Techniques**: Learn proven collaboration methods to boost synergy across security, DevOps, and development teams.\n* **Smart Remediation**: Discover how intelligent workflows can significantly speed up the identification and resolution of security vulnerabilities.\n* **Ownership & Efficiency**: Gain insights on automating the assignment of fixes to the right team members, streamlining the remediation pipeline, and cutting down on ticket clutter.\n* **Preventive Measures:** Explore methods to ensure vulnerabilities are fixed right the first time, preventing future occurrences.\n\n**Why Attend:**\n\n* **Immediate Value**: Walk away with strategies you can implement now, no matter your platform or tools.\n* **Enhanced Security Posture**: Learn how to reduce friction and elevate your cloud security practices.\n* **Practical Knowledge**: Whether or not DevOcean is part of your toolkit, this session promises insights to help your organization thrive in cloud security.\n\n**Ready to Bridge the Gap between Security and Dev?**\nJoin us to unlock NextGen collaboration strategies that support secure, rapid development. Learn how to streamline workflows, elevate your cloud security posture, and achieve continuous innovation."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-05-30",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/300641588",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Managing Open Source Vulnerabilities for PCI DSS Compliance",
        "date": "2024-05-16",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/300869273",
        "timezone": "America/Los_Angeles",
        "description": "PCI DSS version 4.0 contains a host of new practices that will become requirements on March 31, 2025. In this talk, we focus on a change that looks — at first glance — to be minor, but in reality could have significant implications for Application Security teams: the requirement to manage all internal vulnerabilities, regardless of criticality.\n\nWe’ll focus on how to address open source software (OSS) vulnerabilities, including:\n\n* What it means to “manage vulnerabilities”\n* Why OSS presents the greatest risk to compliance with this new requirement\n* The security tool problem preventing organizations from addressing OSS risk\n* Getting accurate dependency inventories and prioritizing remediation\n* Setting up guardrails to ensure developers select safe OSS dependencies\n\nENTRY\nEnter from the door on Broadway and take the elevator to the 11th floor.\n\nSCHEDULE\nDoors open at 5:30. The talk will begin about 6pm.\n\nNO ENTRY AFTER 6:15 PM\nThe outer doors auto-lock at 6pm. We will station someone at the door to let people in until 6:15. It will not be possible to enter the building after 6:15.\n\nCONTACT INFORMATION REQUIRED TO ATTEND\nFor liability reasons, the building owner requires us collect names and contact info for each person in the building after normal business hours. You will have a choice of signing in with a phone and a QR code or on paper, but we will have to collect this info from all attendees. (If this requirement will prevent you from attending, please let us know. We can't change the rules for this venue, but we can take your feedback into account when we choose venues.)\n\nACKNOWLEDGEMENTS\n\n* Our host this month is NedSpace, a co-working space in downtown Portland.\n* Our sponsor this month is Endor Labs, who will be providing food (as well as the speaker!)"
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Secure the Supply Chain with Software Bill of Materials (SBOM's)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Are you being asked about the security of your software supply chain? This seems to be one of the hottest and most prominent topics, both from auditors and customer compliance requirements right now within application and software security.\n\nJoin us Wednesday, May 22nd from 6:30pm - 8:30pm to hear from the experts at Synopsys software integrity group on the best ways to utilize SBOM's to ensure your software supply chain is secure!"
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "OWASP South Florida Chapter Meeting May 2024 ",
        "date": "2024-05-29",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/300771107",
        "timezone": "America/New_York",
        "description": "We still haven't found a suitable in-person meeting venue. We'll be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.\n\nPlease join us virtually for our May 2024 Meeting.\n\nBYOB - Bring Your Own Beverage\n\n**Agenda**\n===\n\n* Chapter update/news\n* Talk by Rohini Sulatycki\n* Virtual Networking\n\n**Talk Title:** Securing the Digital Pipeline: Unveiling the Power of Software Bill of Materials (SBOM)\n**Talk Summary:** A significant increase in cyber attacks due to vulnerabilities within the supply chain has led to a heightened awareness of the security of supply chains and creating a software bill of materials (SBOM) is gaining traction as a good initial step. A SBOM is essentially the “ingredient list” that goes into the making of the software. In this talk, we will discuss:\n\n* What is an SBOM\n* The elements that make up an SBOM\n* The problems that can be solved by an SBOM\n* SBOM tooling\n* Future thoughts"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Pub evening - Summer OWASP meet up and after-work near Odenplan",
        "date": "2024-06-05",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/299591604",
        "timezone": "Europe/Stockholm",
        "description": "Time for a summer get together before we all disappear for the summer holidays . This is the perfect opportunity for all of us app-sec interested folks to get together and meet up in real life for a relaxed chat and maybe a beer or some other refreshments.\n\n When: 5th June, 2024 17:00\n Where: The Old Brewer - Public House & Dining Room at Luntmakargatan 98, 113 51 Stockholm\n\nExpect:\n Quick AppSec Tips\n Networking\n Drinks & Laughter\n\nThe meeting will start at 17:00, but it's a casual event so turn up when it suits."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - The EU Cyber Resilience Act and why the SBOM is so important",
        "date": "2024-05-21",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/300469641",
        "timezone": "Europe/Stockholm",
        "description": "EU is about to become a market leader in software cybersecurity regulation. With a large set of proposed and active laws, software development will be regulated like never before.\n\nWith the coming EU Cyber Resilience Act (CRA) all software and embedded systems will have to get a CE mark, which is now expanded to include cybersecurity aspects. It’s going to be a huge change and will mean that the manufacturers (and in some cases importers) will get responsibility for the user’s security and will have to provide free security patches for the lifetime of the product. Software developers will have to learn secure coding and the need for cyber security professionals will be very high.\n\nOne of the focus areas is vulnerability management. To keep a product secure during its lifetime, all 3rd party components will have to be monitored and up to date. At the heart of this process is the Software Bill of Materials, SBOM, which is used to monitor for known vulnerabilities in both Open Source and commercial components. The OWASP CycloneDX project fits right in and have been working with various kinds of bill-of-materials for a long time. CycloneDX is in the process of becoming an ECMA standard and thus fits better in to the EU regulation.\n\nIn this talk Olle E. Johansson will introduce the proposed EU CRA legislation and talk about the SBOM with a focus on the toolchain needed to manage vulnerabilities.\n\nWe will start the evening with a mingle at 17:30 followed by a presentation that will start at 18:00. The talk will be around 1 hour long followed by a further mingle/time for questions and answers.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcoming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "1st OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-06-06",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/300610888",
        "timezone": "Europe/Berlin",
        "description": "Join us at the inaugural OWASP Stuttgart Chapter Stammtisch and celebrate our revival. :-)\nWe are currently seeking contributors as the event does not yet have a designated topic or speaker. If you wish to contribute, please contact Sven Strittmatter (Weltraumschaf) or Johannes Merkert.\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation (TBD)\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Threat Modelling with Reliable Data",
        "date": "2024-05-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/299507519",
        "timezone": "Europe/Zurich",
        "description": "Reliable data is inherently critical for application threat models. As threat modelling continues to proliferate across security programs, bad habits in feeding threat models with relevant data is becoming prevalent. This session will explore top 3 mistakes of \"data starvation/ gluttony\" with respect to application threat models and how to achieve a contextualized, balanced data diet.\n\nJoin this OWASP Switzerland event to learn more from Tony about threat modelling and how to make sure you use quality data in doing so."
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #25: Firewalls, Product Security & Contingency plans [IN-PERSON]",
        "date": "2024-05-23",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/300712957",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\n\nTheme sessions - Theme: Firewalls, Product Security & Contingency plans.\n\n\\`Schedule\\` **\\`Time:\\`**\\` 18:00 to 20:30\\`\nIntroduction, OWASP News & Updates - Catalin Curelaru\nSecuring the Gates: The Hidden Flaws Behind the Firewall - Adrian Daniel BACANU (RAZDON)\nRunning a Product Security Assessment Program at scale - Alina NICULA (VISMA)\nContingency plan from security point of view - Adrian BARAN (VITESCO)\n\nLocation of the event: UBC3, et 10, Sediu VISMA, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by VISMA\n\nMore about the speakers and topics:\n**Adrian Daniel BACANU - CEO @ RAZDON,** is the CEO and co-founder of Razdon, a pioneering CyberSecurity startup. With 14 years of enterprise experience and a lifelong passion for hacking—now spanning two decades—Daniel brings a wealth of expertise to the cybersecurity field. He still offers some Security Architectural consultancy for different companies across Europe, and from time to time, he engages in bounty hunting. When not decoding the matrix of cyber threats, Daniel enjoys life with his wife and two boys, plays football twice a week, and maintains a spirited sense of humor—because in cybersecurity, sometimes, you really can't afford to joke.\n***\\~Securing the Gates: The Hidden Flaws Behind the Firewall\\~***\nEffective cybersecurity is not just about having defenses in place but ensuring they are properly designed. 'Securing the Gates: The Hidden Flaws Behind the Firewall' illuminates the common pitfalls in firewall implementations that often go unnoticed. This presentation will demonstrate typical design errors that compromise security and provide actionable insights on how to rectify these flaws to create robust defenses. Attendees will learn how to not only deploy but also optimize firewalls to safeguard their digital assets effectively.\n\n**Alina NICULA** - **VASP Lead and Product security assessment service owner and reviewer @Visma**. Alina has been working within product development teams as a software developer, security engineer, software and cloud service architect. In the last years she focused on software security by guiding Visma teams into securing their applications, data, cloud workloads, and delivery pipelines to avoid potential cybersecurity risks.\n***\\~Running a Product Security Assessment Program at scale\\~***\nHaving a product security assessment program is essential for any company. It is equally critical to ensure that this program remains relevant over the time and is scalable as the company grows.In this presentation, I will discuss how we ensure that our designed processes empower development teams to make informed security decisions while also giving them ownership over the remediation of the security aspects that impact their products.\nHowever, achieving this goal requires a strong and knowledgeable security review team that supports the delivery teams with informed security by design best practices.\nSo, how have we been able to grow our program? I hope you will leave this presentation with a clear understanding of our approach.\n\n**Adrian BARAN -** **Security Manager @ VITESCO**,\n\n***\\~ Contingency plan from security point of view \\~***\nAbstract:"
    },
    {
        "group": "Tirunelveli",
        "repo": "www-chapter-tirunelveli",
        "name": "Basics Of API - 101",
        "date": "2024-05-12",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-tirunelveli-chapter/events/300732125",
        "timezone": "Asia/Kolkata",
        "description": "Calling all OWASP and NULL enthusiasts in Tirunelveli!\nJoin us for an introductory session on APIs, led by Surya from the YouTube channel Cyterix. In this webinar, you'll gain a solid understanding of:\n=> What APIs are and how they work\n=> The role of APIs in app development\n=> Everyday applications of APIs\n=> How to make your first API request (with hands-on practice)\n\nThis session is perfect for anyone curious about how applications communicate and the power behind APIs. Whether you're a developer, security professional, or simply interested in tech, this workshop will equip you with the foundational knowledge to dive deeper into the world of APIs.\n\nDon't miss out on this chance to level up your tech skills!"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Ensuring Application Security Excellence in the Age of AI & CASA Framework",
        "date": "2024-05-16",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516396",
        "timezone": "America/Vancouver",
        "description": "**Ensuring Application Security Excellence in the Age of AI** with Michael Argast\n\nIn a time where artificial intelligence (AI) permeates every facet of digital existence, the imperative to ensure application security has reached unprecedented heights. In this talk, Michael Argast, Co-founder and CEO of Kobalt.io will delve into the essential strategies for ensuring application security excellence amidst the pervasive influence of AI. By exploring the intricate interplay between AI and cybersecurity, you will gain insights into how AI augments defensive strategies, mitigates vulnerabilities, and addresses emerging threats within application environments. Through real-world case studies and practical recommendations, this session equips you with the knowledge and tools needed to leverage AI effectively in the face of evolving challenges.\n\n**Michael** is an experienced cybersecurity professional with over 20 years of industry experience. He is the co-founder and CEO of Kobalt.io, a rapidly growing cloud-focused security services provider. Kobalt.io works with over 200 cloud-focused technology companies to help develop their cyber security programs and ensure the security of their organization.\n\n**Enhancing Cloud Application Security with the CASA Framework** with Farshad Abasi\n\nThis presentation will introduce the Cloud Application Security Assessment (CASA) framework, designed according to OWASP’s ASVS standards to secure cloud-based applications. We will explore CASA's tiered risk-based assessment model that categorizes applications into different risk tiers and applies appropriate security verifications. This systematic approach helps in effectively managing security risks associated with cloud applications, aiming to protect consumer data and conform to best practices in cybersecurity.\n\nWe would like to thank **Microsoft** for sponsoring this event."
    }
]