[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2024-01-30",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/297958036",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus and ITM8/Improsec are happy to invite you to the next OWASP Aarhus meetup.\n\n19:00 – 19:15 Welcome by Mathias Holdt, Improsec and Thomas Ljungberg Kristensen, OWASP Aarhus\n19:15 – 20:00 Mathias Holdt, Regional Director, Improsec and Adam Lane Brass, Security Advisor, Improsec will present an oversight of attackers and the general landscape as well as concrete examples of exploits found in customer environments.\n20:00 – 20:30 Networking break\n20:30 – 21:15 Lars Karlslund, Freelance Security Consultant, will present his open source attack graph mapping tool Adalanche. The tool shows an attackers view on Active Directory, in order to let defenders find and fix their misconfigurations.\nWhen Lars is not shitposting a lot on Twitter he works as freelance security consultant working for large enterprise customers, primarily assisting to uncover technical security problems on infrastructure components.\n21:15 – 21:30 Closing notes and goodbyes"
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Transforming Threat Modeling: Harnessing ChatGPT for Automated Security Analysis",
        "date": "2024-01-25",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/298291376",
        "timezone": "America/New_York",
        "description": "Traditional manual threat modeling is resource-intensive. This talk explores a game-changing approach using ChatGPT, an advanced language model, to automate and enhance threat modeling. Attendees will understand ChatGPT's potential in revolutionizing cybersecurity processes.\n\n**Session Highlights:**\n\n1. **Introduction to ChatGPT:** Uncover the versatility of advanced language models in cybersecurity. Explore their applications in threat modeling.\n2. **Automating Threat Modeling:** Learn how ChatGPT streamlines threat modeling, increasing efficiency by reducing manual efforts.\n3. **Generating Dynamic Threat Models:** See how ChatGPT assists in crafting threat models from system architecture, user stories, and design documents.\n4. **Elevating Accuracy and Scope:** Discuss techniques for refining accuracy and coverage of automated threat models generated by ChatGPT.\n5. **Integration and Synergy:** Explore seamless integration of automated threat modeling into existing security processes. Understand how collaboration between AI systems and security professionals can be encouraged.\n\n**Key Takeaway:** Attendees gain insights into leveraging ChatGPT for efficient threat modeling, enabling organizations to identify and mitigate security risks effectively."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "February 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-02-08",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298519268",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, February 8th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar @ Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Riscosity](https://www.riscosity.com/)\n*Riscosity is the data flow security platform that empowers teams to have full visibility of all data in transit and automates the redaction or redirection of sensitive events, simplifying how companies meet security and privacy requirements. With Riscosity teams can:*\n\n* *Track and pinpoint any data being sent to any 3rd-party APIs*\n* *Easily map data sub-processors and the information shared with them*\n* *Automatically replace detected sensitive data with redacted inputs*\n* *Continuously monitor and block APIs from data transfers that violate organizational policies*\n\n*For more information, please visit [www.riscosity.com](https://www.riscosity.com/).*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - January 2024 (Online)",
        "date": "2024-01-30",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298206929",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém Cesupa",
        "date": "2024-02-03",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/298368815",
        "timezone": "America/Boa_Vista",
        "description": "No dia 03 de fevereiro, a OWASP Belém realizará um Meetup presencial ( \\m/ ) com apresentações de extrema relevância no contexto do mercado de trabalho e de segurança da informação. Diariamente nos deparamos com notícias sobre vazamentos de dados. Por isso, a disseminação do conhecimento resultará em softwares, sistemas e procedimentos mais seguros, minimizando assim essa crise.\n\n**Informações do Evento**\n\n* **Data:** 03/02/2024\n* **Horário:** 8h30\n* **Local:** CESUPA ARGO\n* **Endereço**: Avenida Alcindo Cacela, 1523\n* **Inscrições:** Em breve."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Introduction and overview to OWASP",
        "date": "2024-02-04",
        "time": "11:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/298658258",
        "timezone": "Asia/Kolkata",
        "description": "Join us for the OWASP Bhopal Chapter meetup where we will discuss the latest trends and best practices in web application security. Our guest speakers will share their expertise on topics such as computer security, application security, open source technologies, and network security.\n\nAt this event, you will have the opportunity to learn about new technologies and tools aimed at improving software security and protecting sensitive information. Whether you are a beginner or an experienced professional in the field of cybersecurity, this meetup will provide valuable insights and a chance to network with like-minded individuals.\n\nDon't miss out on this opportunity to enhance your knowledge and skills in the ever-evolving field of web security. Join us for an engaging evening filled with informative talks, discussions, and networking opportunities. RSVP now for our OWASP Bhopal Chapter meetup and stay ahead in the world of web application security!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "AppSec: Where to Start, and Some Free, Easy Wins",
        "date": "2024-02-07",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/297749441",
        "timezone": "Australia/Brisbane",
        "description": "With a limited supply of potential hires and an already maxed security budget, how do we begin to tackle Application Security (AppSec)?\nThis talk will attempt to help provide some direction when it comes to solving this problem. It is aimed at security folks and developers of all skill levels who are interested in getting their feet wet with AppSec.\nDuring the talk we will first explore an industry framework that can help guide the first few steps in our journey. Then, we will dive into a demo and highlight some of the fantastic free and open-source tools that we can use to demonstrate value and rack up a few easy and impactful wins."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A night of Jim Manico",
        "date": "2024-01-23",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/297956007",
        "timezone": "Europe/Copenhagen",
        "description": "We're so incredibly lucky that Jim Manico, a global forerunner and huge capacity in appsec efforts within the OWASP organization and globally for decades and more recently in AI security, is moving to Copenhagen and is dedicated to giving back to our community.\n\nJim has offered to do not just one talk but bot a talk and a short course on his favorite topics: AI Security and appsec. And you're hereby cordially invited to join. As usually there'll be pizzas and drinks and as usually everything will be for the amazingly attractive price of nothing!\n\nSchedule:\n17.00: Introduction to OWASP Copenhagen\n17.05: Navigating the AI Labyrinth: Ethics, Security, and Best Practices\n18.00 Pizzas and drinks\n18.30: Appsec training\n\nHere's a description of both events:\n\n**Navigating the AI Labyrinth: Ethics, Security, and Best Practices**\nThis talk offers a comprehensive exploration of Artificial Intelligence (AI) from its historical evolution to the latest developments in AI security and ethics. Key topics include:\n\n* A Brief History of AI: A snapshot of the pivotal milestones in AI development.\n* AI and Ethics: Understanding AI's business impact, ethical guidelines, best practices, and risk mitigation strategies.\n* Robustness & Reliability of AI Code Generation: Addressing common misuse patterns and reliability metrics in AI systems.\n* Artificial Intelligence Security Introduction: Analyzing historical AI failures to draw lessons and improve future applications.\n* OWASP Top Ten for Large Language Models (LLMs): A deep dive into security considerations specific to LLMs, ranging from prompt injection to model theft.\n* Threat Modeling AI Systems: Outlining methodologies to assess and mitigate AI-related threats.\n* Hugging Face Open Source AI Tools: Exploring the utility and application of these tools in AI research.\n* Differential Privacy and AI: Discussing the principles of differential privacy in the context of AI.\n* NIST AI Risk Framework: An overview of NIST's guidelines for AI risk management.\n* EU AI Act: Analysis and impact on AI development and use.\n\nThe talk aims to provide attendees with a nuanced understanding of AI's ethical implications, security challenges, and practical approaches for secure and responsible AI deployment.\n\n**AppSec Training**\nIn the rapidly evolving realm of web development and application security, the OWASP Top 10 remains a cornerstone document, acting as a beacon for developers and security professionals alike. Reflecting a broad-based consensus, it spotlights the most critical security risks threatening web applications, thereby shaping the frontier of secure coding techniques.\nWith an ever-increasing emphasis on web-based interactions, the significance of a deep understanding of these risks is paramount. As developers etch lines of code giving life to web applications, a firm grasp of secure coding practices becomes not merely beneficial, but essential.\nThis immersive and engaging presentation seeks to equip attendees with a comprehensive understanding of the OWASP Top Ten 2022 release, intending to empower developers with the knowledge necessary to author secure, resilient software. As we navigate through this labyrinth, we shall focus on in-depth discussions around:\n\n* A01:2021-Broken Access Control\n* A02:2021-Cryptographic Failure\n* A03:2021-Injection\n* A04:2021-Insecure Design\n* A05:2021-Security Misconfiguration\n* A06:2021-Vulnerable and Outdated Components\n* A07:2021-Identification and Authentication Failures\n* A08:2021-Software and Data Integrity Failures\n* A09:2021-Security Logging and Monitoring Failure\n* A10:2021-Server-Side Request Forgery\n\nJoin us as we embark on this enlightening journey, delving into the unique intricacies of each risk, exploring defense strategies, and fostering a culture of security-minded web application development. This presentation aims to instill a robust defensive mindset, helping attendees to weave a narrative of secure coding that transcends the bounds of standard practices."
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "[on-prem] A beginner's guide to SSO (mis)configuration + Face recognition",
        "date": "2024-02-07",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/298504203",
        "timezone": "Europe/Berlin",
        "description": "Dear folks,\n\nlate happy new year!\n\nThis is a blocker for a new event, taking place @ New Work (formerly known as XING). We present two talks; Adina will talk about intricacies of SSO and IdPs. Kantorkel will present useful insights on his research and privacy implications on several aspects of face recognition. Both talks will be held in English.\n\nOver the next days we'll update the description. Stay tuned!\n\nCheers!\n\nDirk"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - February 2023",
        "date": "2024-02-06",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-israel/events/296831820",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  happy to invite you to our upcoming Meetup!\nJoin us for another AppSec community event and enjoy food, drinks, mingling, and great talks about security.\n\nThe event will be hosted by Bright Security!\n\n=====================================================================\nAgenda:\n 18:00 - 18:30 - gathering and food - We will gather at Bright Security Offices for drinks, great treats, mingling. Safe room free zone!\n 18:30 - 18:45 - Keynote + Microphone tuning\n\n 18:45 to 19:15 - Exploring the Risks of ChatGPT and Other Generative AI Applications\n\nBar Hofesh - Co-Founder & CTO @ Bright Security\n\nThe presentation emphasizes the critical need for security in the realm of AI-generated code, spotlighting common vulnerabilities. It presents the three main avenues of attack against Large Language Models (LLMs): direct attacks on the LLMs themselves, compromises in the infrastructure and integrations, and weaknesses in applications. The presentation offers in-depth examples, particularly focusing on \"social engineering\" methods, to illustrate the techniques and consequences of these security breaches.\n\n 19:15 to 19:45 - Top 5 Open Source Tools All Developers Should Know About!\n\nRaz Probstein - Solution Engineer @ Jit\n\nThe Minimum Viable Security (MVS) approach simplifies the integration of security measures into config files, apps, and CI/CD processes using open source tools. This talk focuses on incorporating five key security controls into the CI/CD pipeline, utilizing tools like Bandit, Gitleaks, OSV-Scanner, KICS, and OWASP’s ZAP. These controls, along with custom measures for enforcing Multi-Factor Authentication via Github Security, establish a foundational security framework from the initial code, allowing continuous improvement as applications evolve over time. Code examples and demos will be presented in the session.\n\n 19:45 - 20:15 - Recent Supply Chain Code Attacks\n\nYoad Fekete - Co-Founder & CEO @ Myrror Security\n\nJoin us for a deep-dive into the world of recent software supply chain attacks and how to defend against them.\nIn this lecture, we will discuss the difference between a supply chain attack and a vulnerability, and explore why there has been a significant increase in these types of attacks in the past couple of years.\nWe will showcase various vectors for these attacks with recent attacks examples.\nThe highlight? A technical demo of an attack, similar to the UA-Parser/Ledger Connect kit malicious package attacks.\n\n=====================================================================\n\nThis event is sponsored by Bright Security in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-02-12",
        "time": "18:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/298399889",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kolkata",
        "repo": "www-chapter-kolkata",
        "name": "OWASP KOLKATA MEETUP #10",
        "date": "2024-01-27",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/owasp-kolkata/events/298669765",
        "timezone": "Asia/Kolkata",
        "description": "#### Proposed sessions for this event:\n\n* Art of Threat Modelling by **Samkalpa Mukherjee**\n* Recon Resurgence: Level up your Recon skills for Maximum impact in Bug-Bounty by **Agnibha Dutta**\n* Immutable Desktop using Container Orchestration by **Mohammed Danish Amber**\n* Demystifying DNS Attacks by **Rakesh Seal**\n* Beginners guide to Hardware Hacking by **Asutosh Kumar**"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-01-30",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/298539374",
        "timezone": "America/Los_Angeles",
        "description": "Join us for a mixer with all the cybersecurity community in Los Angeles and Orange County, network and help celebrate the New Year!\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring OWASP LA events please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JAN 24, 2024",
        "date": "2024-01-24",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297383153",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Privacy by Design for Web Developers\nIn partnership with **CSA So Cal Chapter**, join us for great networking, dinner, drinks, and see a presentation by **Miguel (Mike) O. Villegas**, President and Founder of iSecurePrivacy, LLC.\n\n**ABSTRACT**: In today's digital landscape, the protection of user privacy has become a paramount concern. As web developers, it is our responsibility to ensure that the websites and applications we create not only deliver exceptional user experiences but also prioritize the privacy and security of user data. This lecture, \"Privacy by Design for Web Developers,\" explores the foundational principles and practical strategies that empower web developers to integrate privacy into every facet of their work.\nIn this lecture, we will delve into the concept of Privacy by Design (PbD) and its significance in the context of web development. We will examine how PbD serves as a proactive approach to safeguarding user data, fostering trust, and complying with evolving privacy regulations such as the GDPR and CCPA/CPRA.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "February 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-02-15",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/298627782",
        "timezone": "Europe/Amsterdam",
        "description": "This is an online meeting and will be streamed on YouTube. The meeting will start at 19:00.\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n**OWASP Dependency-Track**\n*Abstract:*\nSince its inception over a decade ago, OWASP Dependency-Track has pioneered many concepts in the realm of software supply chain security, and software bill of materials (SBOM).\n\nWith increasingly more governments, regulators and organizations asking for SBOMs, the project is more relevant than ever. On the other hand, a non-negligible portion of folks is still puzzled as to what to even do with SBOMs once they have them.\n\nIn this talk, we’ll explore what Dependency-Track is, how it can help organizations in identifying and reducing risk in their software supply chain, and give an outlook into what’s next!\n\n*Bio:*\nAfter years as Security Engineer for a large European payment service provider, Niklas currently works as Cloud Native Engineer for ControlPlane. He is passionate about AppSec, DevSecOps and Open Source. He co-leads the OWASP Dependency-Track project and is a contributor to the OWASP CycloneDX Bill of Materials standard, for which he maintains the official Go tooling."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Training Day - Hamilton (Jan 2024)",
        "date": "2024-01-27",
        "time": "08:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780340",
        "timezone": "Pacific/Auckland",
        "description": "We're pleased to announce that we'll be holding an OWASP Training Day event in Hamilton, on Saturday, 27th January.\n\nClasses will run 8:45 a.m. - 5:30 p.m. Tea breaks and lunch will be provided. Registration check-in opens at 8:00 a.m.\n\n**Registration Fee:** $99 per attendee (plus GST and booking fees)\n\n**Classes on offer:**\n\n* Threat Modelling: From None to Done (John DiLeo)\n* Like ISO/IEC27001, but Backwards (Stephen Coates)\n\n**To Register:** https://events.humanitix.com/owasp-training-day-hamilton-jan-2024"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2024-01-25",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296056640",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - AI+security",
        "date": "2024-01-30",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/298327716",
        "timezone": "Europe/Warsaw",
        "description": "*Join us for an engaging evening focused on securing web applications. In this meetup, we will dive into the world of application security, exploring the latest trends, best practices, and techniques to protect web applications from potential threats. Our knowledgeable speakers will cover a wide range of topics including....*\n\nOK - AI generated description is probably not working for our meetups  Let's do it old fashioned way:\n\nHi,\n[OWASP](https://owasp.org/) is a worldwide, non-profit organisation focused on application security issues and we are a Polish chapter of this initiative.\n\nThis time we want to talk about AI and it's influence on our industry and our work. We have invited Karol Przystalski from Codete, who will share his thoughts about security of ML models. Then we will have a discussion about how wide use of generative AI in coding will influence application security.\n\nAgenda:\n\n1. **Machine learning security (Karol Przystalski)**\nMachine learning (ML) and other terms related to it became buzzwords. Many companies would like to introduce machine learning models, even if there are simpler solutions. In the presentation, we show recent security issues related to machine learning models. Next, we do an overview of possible security issues that can happen during building such models. Finally, we demonstrate how to prevent the most popular security problems related to ML on the examples of applications in e-commerce, fintech, and other sectors.\n2. After the break, we will be hosting a **discussion on how AI and Generative AI impact the security of application code**. Are AI-powerd tools a boon or a potential risk? What risks emerge when software engineers start using GenAI? Is the code produced by GenAI more or less secure? Are tools designed for code, such as GitHub Copilot and AWS CodeWhisperer, superior to GPT? Everyone is welcome and encouraged to participate in the discussion. Share your experiences and thoughts, exchange the latest insights, and learn from each other. Whether you are an experienced software engineer, a newcomer to the world of AI, or simply curious about the influence of Generative AI on code security, your perspective is valuable.\n3. There will be also a room for **short lightning talks** with discussion (typical format is 5-10 minute talk followed by 5-10 minute discussion). [Please submit your ideas](https://forms.gle/7JFiD3z2tKifogvs5) or just show up.\n4. Job announcements. If you are an employer, there will be a chance to present who you are looking for.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this** with friends and in social media.\n\n**Sponsor wydarzenia**\n[Codete](https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fcodete.com%2F&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573255135%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=%2BYKLHBngHjVS6%2F0INX6RRWCdgE5XHx4jzAxrFguqwrI%3D&reserved=0) is a software company based in Poland that specializes in custom software development and IT consulting. Codete in numbers:\n\n* 350+ specialists\n* 3 offices in Krakow, Lublin, Berlin, and coworking spaces in major Polish cities (Warsaw, Wroclaw, and Gdansk).\n* 120+ projects\n* 70+ clients from around the world\n\nIn January 2022 Codete opened its own resto-bar Techie’s where we host the best tech events in town.\nJoin the Techies Space Group on [meetup.com](https://emea01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fmeetup.com%2F&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573255135%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=ksYG8qc5ObEQ7r3LgTe9PoDhCj1tYgbwkqfB6IhwPUs%3D&reserved=0) [Techie's Space \\(Kraków\\, Polska\\) \\| Meetup](https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.meetup.com%2Fpl-PL%2Ftechies%2F&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573255135%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=OymONNx5q3QuLtpZAa6vqDVMxbHdsQiVXJBtv2ai9CI%3D&reserved=0) or sign up to our mailing list [https://lp.codete.com/techies-space-event-form](https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Flp.codete.com%2Ftechies-space-event-form&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573411392%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=54zbp%2BQiF8Mu7P6uloIca0YgsjLmKA6rH6GSM8O4U78%3D&reserved=0)\nand never miss a meetup!"
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Hacking a SaaS: A Practical Guide to Understanding Attack and Defense",
        "date": "2024-02-15",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/298661513",
        "timezone": "America/Los_Angeles",
        "description": "*Hacking a SaaS: A Practical Guide to Understanding Attackers and Defending Against Them*\n\nIn this talk, we will delve into the mindset of an attacker and explore the vulnerabilities they exploit in SaaS systems. We will cover the following topics:\n\n* What motivates hackers to target SaaS systems (5%)\n* How hackers conduct reconnaissance on SaaS systems (50%)\n* The anatomy of exploit chains (40%)\n* Strategies for defending against attacks (5%)\n\nOur goal is to provide a practical guide to understanding attackers and defending against them. We will share lots of hacker tips and tricks, and provide plenty of quiz moments to train your intuition. Our focus will be on vulnerabilities that hackers actually care about, rather than theoretical ones. All of our examples will be based on real-world exploit chains, and we will explore multiple vulnerabilities chained together to create media-news-headline-worthy outcomes. By the end of this talk, you will have a better understanding of how attackers think and operate, and you will be better equipped to defend against their attacks.\n\nOur February host and sponsor is Solutional Inc, and the talk will take place in their Portland office at 301 SE 2nd Ave.\n\nPlease RSVP here if you are planning to attend.\n\nThis is a monthly event of OWASP's Portland chapter.\n\n*[This was our January event, which was canceled for weather. We have rescheduled it for February.]*"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC / Wasatch AppSec -January Meetup-In person @ (Cottonwood Heights, UT)",
        "date": "2024-01-25",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/297931007",
        "timezone": "America/Denver",
        "description": "**Agenda**:\n\n1. Introductions / Lunch\n2. Topic of Discussion: Building Security Pipelines that for developer experience and enabling Security self-service\n3. Q&A\n\nCome join us for a lunch meetup at the Aumni building in Cottonwood Heights.\nCasual group and anyone interested in Application Security is welcome to attend. We'll discuss software security tips and practices others are implementing to support their organization's AppSec efforts.\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-02-14",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/297834962",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    }
]