[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - June",
        "date": "2024-06-25",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460542",
        "timezone": "Europe/Copenhagen",
        "description": "**IMPORTANT:**\n\n* **You need to reverse into the parking spot!**\n* **Please please provide your email to Thomas to receive a private link to register in the guest system at Vesta before the event**\n* **Please register your car before the event. See the image for parking**\n\nAgenda:\n**19:00 – 19:10** Welcome by Vestas and OWASP Aarhus\n\n**19:10 – 20:00** ”Automated attack path discovery and alerting with Adalanche” by Rasmus Have.\n\nRasmus Have is a Senior Cyber Security Architect at Vestas where he works with security architecture across the IT and OT domains. Rasmus has a background from the startup world and military security over the last 25 years. He aims to close the gap between the theoretical architecture work and the practical engineering work with a hands on approach to security.\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** How to leverage AI in web protection - OWASP Juiceshop\" by Rasmus Dalsgaard Andersen, CheckPoint\n\nOWASP Juice Shop is probably the most modern and sophisticated insecure web application! I will show you how AI can be leveraged in a WAF to protect against attacks."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Attack Surface Mapping with OWASP Amass",
        "date": "2024-06-27",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/301614198",
        "timezone": "America/New_York",
        "description": "In the ever-evolving landscape of cybersecurity, understanding your attack surface and adopting an adversarial perspective are critical components for building a robust security program. This talk will delve into the strategic importance of these concepts, emphasizing how they can preemptively identify and mitigate potential security threats. We will explore the methodologies behind attack surface mapping, highlighting the necessity of viewing your infrastructure through the lens of an attacker to uncover vulnerabilities that might otherwise go unnoticed. By embracing this mindset, organizations can proactively defend against sophisticated attacks, ensuring their defenses are as robust and comprehensive as possible.\n\nThe talk will shift to a demonstration, centered around the Amass Project, OWASP’s powerful tool designed for in-depth attack surface mapping and asset discovery. Attendees will have the opportunity to gain hands-on experience with Amass, learning how to leverage its capabilities to uncover and visualize the full extent of an organization’s external exposure. The session will cover practical examples, showcasing how Amass can be integrated into security workflows to enhance situational awareness and threat intelligence. By the end of the presentation, participants will have a clear understanding of how to implement these strategies in their security programs, ultimately fortifying their defenses against potential adversaries."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "3. OWASP Augsburg Stammtisch",
        "date": "2024-06-26",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/301438471",
        "timezone": "Europe/Berlin",
        "description": "!WANTED! --> Women in IT Security <-- !WANTED!\n\nAgenda\n\nVortrag: SSL/TLS-Test, braucht man das noch? (Achim Hoffmann)\nDie Verschlüsselung der Übertragung von Daten (Data in Transit) mithilfe von TLS hat sich inzwischen als 'Best Practice' etabliert. Sobald ein Zertifikat erworben oder automatisch eingerichtet wurde, kann die Verschlüsselung inzwischen auch auf Servern meist relativ einfach 'eingeschaltet' werden.\n\nReicht das? Lohnt es sich nachzuprüfen, was da aktiviert wurde? Wie geht das? Achim zeigt uns am Beispiel des, von ihm als OWASP-Projekt entwickelten SSL/TLS-Test-Tools 'O-Saft (https://owasp.org/www-project-o-saft/)', wie wir diese Tests einfach für verschiedene Protokolle durchführen können. Die Interpretation der Ergebnisse und worauf es dabei ankommt, wird anhand von Beispielen aus der Praxis gezeigt und mit den Teilnehmern des Stammtischs diskutiert.\n\nAchim Hoffmann ist als 'OWASP-Urgestein' ein langjähriger (>25 Jahre), auf Web Application Security spezialisierter Berater, (Pen-)Tester, Trainer und Sprecher; Er ist Board Member von OWASP-Germany und OWASP-Project-Leader u.a. für O-Saft\n\nFreie Diskussion\nNetzwerken\n\nBitte gebt Bescheid, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!Wichtiges für Talks in aller Kürze:\n\nVerwende einen neutralen Foliensatz - ohne Logo, ohne WerbungAuf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit LogoGib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntestVertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-11",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301781798",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-04",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301645041",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-27",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301511246",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - June 2024 (Online)",
        "date": "2024-06-25",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207011",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation! Presentation begins at 12CDT!\n\nIf you would like to attend in person and have a free lunch, please register at [https://owasp-austin-2024-june.eventbrite.com](https://owasp-austin-2024-june.eventbrite.com)\n\nPresentation: **Full of SaaS and TOTALLY SECURE**\n\nManaging shadow IT in the age of SaaS application sprawl is an important component of managing risk, especially since so many of us depend on SaaS/PaaS as part of our critical infrastructure. However, traditional approaches (blocklisting, brute force, etc.) have proven ineffective and are, oftentimes, too late to prevent any real security issues.\nIn this session, we’ll discuss some of the psychology behind why we’re referred to as the “department of NO” as well as how to start shifting that perception. You will also learn of some tactics to identify and mitigate shadow IT as well as proactive measures that may help avoid future sprawl."
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combined Monthly Meet on 20 July 2024",
        "date": "2024-07-20",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/301657456",
        "timezone": "Asia/Kolkata",
        "description": "null/owasp combined meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n* Deepfakes Detection Techniques by **pretti Rajesh**\n* Block chain and Smart contracts by **Meera**\n* There's no honour among phishers: free phishing kits with hidden backdoors by **Anshuman**\n* Building your own threat intel sink by **Pavan Karthick M**\n\n### Session Schedule\n\n| Name | Speaker | Start Time | End Time | Resources |\n| ---- | ------- | ---------- | -------- | --------- |\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM | |\n| [Deepfakes Detection Techniques](https://null.community/event_sessions/4336-deepfakes-detection-techniques) | [pretti Rajesh](https://null.community/profile/48106-pretti-rajesh) | 09:40 AM | 10:10 AM | |\n| **Introduction to beginners** | 10:10 AM | 10:25 AM | |\n| [Block chain and Smart contracts](https://null.community/event_sessions/4338-block-chain-and-smart-contracts) | [Place Holder](https://null.community/profile/2-place-holder) | 10:25 AM | 11:20 AM | |\n| **Networking Session + Break** | 11:20 AM | 11:45 AM | |\n| [There's no honour among phishers: free phishing kits with hidden backdoors](https://null.community/event_sessions/4340-there-s-no-honour-among-phishers-free-phishing-kits-with-hidden-backdoors) | [Place Holder](https://null.community/profile/2-place-holder) | 11:45 AM | 12:40 PM | |\n| [Building your own threat intel sink](https://null.community/event_sessions/4341-building-your-own-threat-intel-sink) | [Pavan Karthick M](https://null.community/profile/37062-pavan-karthick-m) | 12:40 PM | 01:35 PM | |\n| **Feedback + Next Month’s Planning** | 01:35 PM | 01:55 PM |"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Thursday with Pacific Hackers & OWASP – CTF Time",
        "date": "2024-06-27",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/301426321",
        "timezone": "America/Los_Angeles",
        "description": "**Want to tap into your inner evildoer and test your skills in hunting down web application vulnerabilities?**\nJoin us at this joint event between Pacific Hackers and OWASP Bay Area to immerse yourself in the industry’s most authentic environment, where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense are all about thinking on your feet. For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard as you vie for the top spot!\n\n**About the Range:**\nThe CMD+CTRL Cyber Range is ideal for anyone interested in learning how web applications are attacked, furthering their cybersecurity acumen, or honing the skills needed to protect the enterprise. From curious bystanders to active practitioners to Risk and Security Executives, there’s something for everyone.\n\nRegistration:\nPlease register here to get more event details and help us organize food and drinks [https://web.securityinnovation.com/owasp-bayarea](https://web.securityinnovation.com/owasp-bayarea)\n\n**Agenda:**\n5 PM – Food & Networking\n5:30 PM – 8:30 PM – CTF Time\n8:30 PM – Prizes"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Bay Area OWASP June Meetup",
        "date": "2024-06-26",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/301448414",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming June meetup, which will be hosted by the wonderful **Traceable** team at **Harness** HQ in San Francisco. Refreshments will be sponsored by **Defy Security**. Get ready for insightful discussions and the chance to network with some of the brightest minds in the industry.\n\n**Agenda:**\n5:00 - 5:45: Doors open, networking and food\n\n5:45 - 6:30: Talk 1: API Security Blunders: Tales from the Cyber Trenches - Anjum Ahuja\n6:30 - 7:15: Talk 2: Had a Cyber Incident? Better Call Saul! - Daniel Davis\n7:15 - 8:00: Talk 3: Details to follow\n\n**Talk 1:**\nSpeaker:\nAnjum Ahuja\n\nTitle:\nAPI Security Blunders: Tales from the Cyber Trenches\n\nAbstract:\nIn this session, we dive into API Security by dissecting real-world blunders that have caused security breaches. We'll guide you through the process of identifying these anti-patterns and provide insights to effectively defend against such attacks.\n\nSpeaker Bio:\nAnjum is the Director of Security Research at Traceable.ai. He has worked on different aspects of security engineering specifically Detection engineering & Incident response, AppSec and Threat Intelligence. He has presented at conferences like BSidesSF, BSidesCharm, and has multiple patents issued for IOT Security.\n\n**Talk 2:**\nSpeaker: Daniel Davis\n\nTitle: Had a Cyber Incident? Better Call Saul!\n\nAbstract: If you’re a CISO, you’re already calling your lawyer. The rest of you are going - huh??? From the SEC’s legal action against Solarwinds to the looming specters of CMMC 2.0 and CIRCIA, when will cybersecurity’s transformation into a legal domain be complete?\n\nSpeaker Bio:\nNo, Daniel isn’t a lawyer, but he did stay at a Holiday Inn Express last night (does that one still hold up???). Cybersecurity isn’t the first technical discipline to be “legal-lite” as he learned running safety programs for military aerospace programs. When things go wrong, people will always want to know who “signed off on it”.\nThis experience led Daniel to Lyft’s autonomous vehicle division to create a public-private partnership to develop a framework for safety and cybersecurity for AVs. Today, he’s the founder of Mindpipe, which will be open sourcing a next generation, end-to-end RAG pipeline leveraging open knowledge graph frameworks."
    },
    {
        "group": "Belo Horizonte",
        "repo": "www-chapter-belo-horizonte",
        "name": "OWASP BH está de volta!",
        "date": "2024-06-29",
        "time": "10:00-03:00",
        "link": "https://www.meetup.com/owasp-belo-horizonte-chapter/events/301344829",
        "timezone": "America/Sao_Paulo",
        "description": "**OWASP BH está de volta!**\n\nJunte-se a nós no nosso primeiro meetup de 2024 e celebre a reabertura do capítulo OWASP BH!\n\nAgenda:\n**10h00 - 10h30:** Boas-vindas e reabertura oficial do capítulo OWASP BH: Apresentação da OWASP e dos planos do capítulo para 2024.\n**10h30 - 11h30:** Palestra \"IA Generativa e o Cenário da Segurança Cibernética\": Descubra os desafios e oportunidades da inteligência artificial na segurança.\n**11h30 - 12h00:** Palestra a definir\n**12h00 - 13h00:** Networking e encerramento"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Threat modelling software supply chains during a red team assessment.",
        "date": "2024-07-17",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/301741599",
        "timezone": "Australia/Brisbane",
        "description": "The software supply chain is under increasing threat. New attacks and threats have popped up that we couldn't have imagined even two years ago. Total attacks on the software supply chain are increasing by more than 730% year on year since 2019. One way for organizations to combat this growing threat is to empower their red teams to test the software supply chains for that organization. But many red teams are ill-prepared to tackle this new attack surface.\n\nThis talk will have three distinct parts:\n\n1\\. I will describe how security teams\\, red teams\\, or security researchers can quickly identify the multiple components in a particular applications software supply chain\\, and then how to find soft targets to focus on\\.\n2\\. I will describe my VBP framework \\(value\\, behaviour and patterns\\) which is an applied threat modelling framework for software supply chains\\.\n3\\. Finally\\, I will visually describe one of my red team operations on an open\\-source project and the tools that I use \\(or have written\\) to make that possible\\."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS June 2024",
        "date": "2024-06-27",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/301577788",
        "timezone": "America/Denver",
        "description": "Speaker: Jeff Tomkiewicz; \"InfluenceOps: Practical Pretexing\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Lessons from recent breaches",
        "date": "2024-07-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301083987",
        "timezone": "America/New_York",
        "description": "Jay Bobo from CoverMyMeds is speaking! I'll get an abstract up here shortly, but it will be fantastic.\n\nAnd we are at a NEW location! Check it out!"
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "La Sensibilisation à la Sécurité Informatique",
        "date": "2024-07-15",
        "time": "08:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/301698937",
        "timezone": "Africa/Lagos",
        "description": "Le Chapitre Cotonou de la fondation OWASP en partenariat avec l’Agence des Systèmes d’information et du Numérique (ASIN), organise du 15 au 19 Juillet 2024 une formation de 5 jours sur le thème : sensibilisation à la sécurité de l’information. Cette formation est destinée à toute personne qui désire approfondir ses connaissances en sécurité informatique pour ne pas demeurer le maillon faible du système de management de la sécurité de son organisation. N'hésitez pas à vous inscrire très rapidement à partir du lien sur l'affiche ([https://owaspformation.emes.bj](https://owaspformation.emes.bj) /) car le nombre de places est très très limité."
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - June 2024",
        "date": "2024-06-23",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/300284889",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is thrilled to announce our next Meetup event! \n\nGet ready for a vibrant gathering of the AppSec community, featuring delicious food, refreshing drinks, networking opportunities, and insightful security discussions.\n\nThis special occasion will be graciously hosted by Axonius!\n\n====================================================================\nAgenda:\n 18:00 - 18:30 - gathering and food - We will gather at Axonius's office for drinks, great treats and mingling.\n 18:30 - 18:35 - Meetup kickoff + Microphone tuning\n 18:35 to 19:20 - From Challenge to Triumph: Transforming AppSec with AI and Automated Code Reviews - A Journey of Lessons Learned\n*Michael Goberman - Director of Product Security and Aviad Feig - Product Security Architect @ Axonius*\nMaintaining a robust application security program with a lean team of experts is challenging. We’re eager to share with the community a practical and innovative approach that worked for us: How we were able to move away from manually reviewing every feature developed while increasing the thoroughness of our security oversight. We’ll explain how we succeeded at integrating generative AI tools using GitHub actions to automate the code review process and broaden security oversight in a highly efficient way. Attendees will learn from our journey and discover how they, too, can automate routine security checks, engaging human experts only when their expertise is truly needed.\n 19:20 to 19:30 - Beer Break\n 19:30 to 20:15 - Pains and advantages of application anomaly detection in containerized applications\n*Ben Hirschberg - CTO @ ARMO*\nIn this talk an open-source based application anomaly detection system to detect malicious activity. The solution focuses on applications running in Kubernetes orchestration system.\nIn the talk I will cover these points:\n\\* Main attack vectors to these kinds of applications: exploit remote vulnerabilities, supply-chain attacks\n\\* Anomaly detection dimensions: process, file, network and system-call activity\n\\* What detection dimension is working (or not working) with what kind of applications\n\\* What anomalies are bound to what kind of attacks\n\\* Live demo with the Kubescape project to show results\n\n 20:15 to 21:00 - The Dark Side of AI: The Hidden Risks in Open-Source AI Models\n*Jossef Harush Kadouri - Security Researcher @ Checkmarx*\nThis talk is for anyone who is using open source in their daily routine. The purpose is to bring awareness to the risks of software supply chain attackers lurking in some of our open-source code and to show how ridiculously easy it is for them to launch attacks.\nJoin me as we unravel the construction of AI models, focusing on their weak spots. Through multiple demos, witness how AI models can be manipulated to become malicious.\n\n====================================================================\nThis event is hosted by Axonius in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-07-15",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686440",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Phishing Unveiled: Malicious JavaScript and First-Stage Loaders",
        "date": "2024-06-28",
        "time": "16:30+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/301727458",
        "timezone": "Asia/Jakarta",
        "description": "Topic Name - Phishing Unveiled: Malicious JavaScript and First-Stage Loaders\n\nAbstract :\nPhishing attacks have become increasingly sophisticated, often using malicious JavaScript to initiate the first stage of infection. This session will explore how attackers deploy JavaScript within phishing campaigns to evade detection and deliver harmful payloads. We will examine real-world examples, identify key indicators of malicious activity, and discuss strategies for effective defense. Participants will leave with a clear understanding of the role of JavaScript in phishing and how to protect against these evolving threats.\n\nBio - Shrutirupa is an experienced Security Researcher with a proven track record in computer\nand network security. She currently works on the Threat and Detection Team at Seqrite.\nShrutirupa is also recognized as a Google Developer Expert in Web Technologies.\nShrutirupa is passionate about tackling challenges related to reverse engineering and\nconducts malware research both in her professional role and as a personal interest. In\naddition to her security work, she is a YouTuber, known for her channel \"CryptoW@re.\" She has shared her knowledge as a speaker and trainer at various conferences,\nincluding OWASP Foundation Virtual Appsec, Day Of Shecurity, BSides Singapore, Rootconf,\nOWASP Seasides, EnCypher20, Tech(k)now Day, COcON, Devfest, Google I/O Extended Kochi and numerous other meetings and webinars"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUN 26, 2024",
        "date": "2024-06-26",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/298386242",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: What's in your AI code? Learn why every SCA tool is wrong, and how to deal with it.\nJoin us for great networking, dinner and drinks, and see a presentation by **Darren Meyer**, Lead Solution Architect at Endor Labs.\n\n**ABSTRACT**: With the rise of AI-fueled by Python-based libraries, it has become of paramount importance to scan Python-based projects and their dependencies for OSS vulnerabilities. Python relies on package managers like pip or conda to manage declared dependencies. Dependencies are declared in manifest files which the package manager uses to install the correct version of the required dependency. However, Python’s dependency management system coupled with its dynamic type nature makes it an especially challenging language to deal with.\n\nOf particular focus is the phenomenon of phantom dependencies which are unreported dependencies in a project's manifest profile. These hidden dependencies, which are often provided dependencies (which is especially true for libraries such as tensorflow and pytorch which are essential for AI), challenge software composition analysis (SCA) of Python code, impacting the reliability of vulnerability results.\n\n**Thanks to our Sponsor**: *[Endor Labs](https://www.endorlabs.com/)*\n*Endor Labs’ Dependency Lifecycle Management Platform is designed to address the weakest link in software supply chain security: the ungoverned sprawl of open source software in the enterprise. Endor Labs’ mission is to help developers spend less time dealing with security issues and more time accelerating development through safe code reuse. With this solution, development and security teams are able to maximize software reuse by safely evaluating, maintaining, and updating dependencies at scale.*\n\n**Thanks to our Host**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "OWASP Summer Scavenger Hunt",
        "date": "2024-07-13",
        "time": "13:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/301505213",
        "timezone": "Europe/London",
        "description": "**To register for this you MUST go to our Eventbrite:** https://www.eventbrite.co.uk/e/owasp-summer-scavenger-hunt-tickets-921543680957?utm-campaign=social&utm-content=attendeeshare&utm-medium=discovery&utm-term=listing\n\nDo you like running round Manchester doing pointless challenges that may or may not be Hacker related for the chance of winning a £100 Amazon voucher?\n\nYes?!?\n\nThen this is the event for you!\n\nThis July OWASP Manchester will be hosting the first inaugural Charity Summer Scavenger Hunt. What you need to know:\n\nWho’s running it?\nManchester OWASP and Silverphish, you may have entered a similar one at one of the BSides or at Steelcon.\n\nWhere is it?\nOur base is the Piccadilly Central pub opposite Piccadilly Station, but the challenges will be all over the city centre.\n\nTeams\nYou can enter as a team of up to five people or as an individual. It costs £5 per person to enter and the proceeds will go to the Mustard Tree.\n\nRunning Time\nRegistration is between 1pm - 2pm at Piccadilly Central, closing and prizes will be at the pub at 7pm. We’re welcome to stay on at the pub after, and may take a turn round the Gay Village.\n\nPrizes\nThere will be £100 Amazon voucher PER TEAM for highest score and best submission, theres a £50 Amazon voucher for runner ups (second highest score).\n\nWho will Judge?\nSilverphish, Ben from OWASP and two exciting celebrity judges.\n\nAre there sponsors?\nHell yes there are! We’d like to thank PTP for supplying the prizes and FireDuck for sponsoring the infrastructure.\n\nWill we provide refreshments?\nNo. You’re on your own with that. Please eat before hand, and make sure to grab a Greggs during the hunt. Obvs as the base is a pub you’ll be able to buy a drink there too.\n\nIs the event suitable for Children?\nHell no. It’s in a pub. It’s also not totally safe for work either, so be prepared for some mild adult content.\n\nDo you need technical knowledge to enter?\nYou do not!!! There will be some mildly technical challenges but there will be plenty that are just silly or for fun.\n\nWhat should you bring with you? (These are suggestions, you’re grown-ups so we take zero responsibility for you)\n\n* A water bottle\n* Snacks\n* Comfortable shoes (preferably on your feet)\n* Sun cream\n* A brolly (it’s Manchester after all)\n* A sense of adventure\n* Probably some money\n\n**To register for this you MUST go to our Eventbrite:** https://www.eventbrite.co.uk/e/owasp-summer-scavenger-hunt-tickets-921543680957?utm-campaign=social&utm-content=attendeeshare&utm-medium=discovery&utm-term=listing"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - June 2024 Meetup",
        "date": "2024-06-26",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/301574282",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nOWASP Melbourne is (finally) meeting again. But, in a different format. Our sincere apologies for the silence these past few months; it's been a rough time, in many ways. The landscape and conditions for meetups have changed, especially in the last year, thus, we must adapt to carry-on.\n\nSo, what's happening?\nThe TLDR: We'd meet at 6pm on a Wednesday monthly (except Dec/Jan), at a (different) food place each meetup. Hangout, and together contribute and decide on the AppSec topics we'd want to discuss, while we all grab a bite to eat (at own cost). All these finishing up by 7pm.\n\nFor RSVPs, please do try to keep it updated so that whomever that arrives first at the food place, can try to grab a table/seats for us. We'd be trying to just walk-in and grabbing a table.\n\nPlease see this Google Form for the details, and a quick poll on which Wednesday y'all prefer: [https://forms.gle/U3ArrazUpt9R5EGH8](https://forms.gle/U3ArrazUpt9R5EGH8)\nWe'll close this poll by the 21st June 2024.\n\nWe've picked the first event's date and location, to get the ball rolling.\nSee you there.\nThank you."
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai Online Meetup - 29th June 2024",
        "date": "2024-06-29",
        "time": "12:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/301597640",
        "timezone": "Asia/Kolkata",
        "description": "#### Session Details:\n\nIntroduction to OWASP Mumbai\n\n**Talk:-** How to be a Malware Researcher\n**Speaker:-** Adhokshaj Mishra\n\nQnA and FeedBack"
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "Desvendando o ransomware ShrinkLocker",
        "date": "2024-06-24",
        "time": "21:00-03:00",
        "link": "https://www.meetup.com/owasp-natal-chapter/events/301699547",
        "timezone": "America/Fortaleza",
        "description": "Você está preparado para mergulhar no mundo da cibersegurança e desvendar os segredos por trás de um incidente envolvendo o ransomware ShrinkLocker? Não perca o evento imperdível do chapter da OWASP Natal!\nData: 24 de junho\nHorário: 21h\nAprenda com um dos melhores! Junte-se a nós para uma sessão online envolvente e informativa, onde o especialista Cristian Souza irá compartilhar insights valiosos sobre a análise de um incidente envolvendo o ransomware ShrinkLocker. Esta é uma oportunidade única para expandir seu conhecimento e aprimorar suas habilidades no campo da cibersegurança.\nMarque esta data em sua agenda e convide seus colegas e amigos para se juntarem a nós nesta jornada fascinante!\nNão perca esta chance de aprimorar suas habilidades e ficar um passo à frente no mundo da segurança cibernética. Esperamos vê-lo lá!"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-07-16",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297786381",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for July will be **A03:2021 - Injection**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Chapter Meeting",
        "date": "2024-06-27",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/300859951",
        "timezone": "America/New_York",
        "description": "This is an In-Person Event\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **Marc Frankel**\n\nTopic: AIBOM - summary TBD\n\nSpeaker 2: **TBD**"
    },
    {
        "group": "Penang",
        "repo": "www-chapter-penang",
        "name": "OWASP PENANG Virtual Meetup #1",
        "date": "2024-07-03",
        "time": "21:00+08:00",
        "link": "https://www.meetup.com/owasp-penang-chapter/events/301755490",
        "timezone": "Asia/Kuala_Lumpur",
        "description": "The OWASP Malaysia Federation is delighted to introduce the OWASP Penang Chapter to everyone. Join us for an online meet-and-greet event with OWASP Penang on July 3, 2024. We will feature young speakers who will present exciting and up-to-date topics related to the world of cybersecurity. Don't miss this opportunity!\n\nOWASP Malaysia Federation dengan berbesar hati ingin memperkenalkan OWASP Penang Chapter kepada semua. Sertai kami dalam acara suai kenal secara dalam talian bersama OWASP Penang pada 3 Julai 2024. Kami akan menampilkan penceramah muda yang akan mempersembahkan topik-topik menarik dan terkini berkaitan dengan dunia keselamatan siber. Jangan lepaskan peluang ini!\n\nTime: 03/07/2024 9:00PM\nPlatform: Microsoft Teams\nSpeaker 1 : Muhammad Fahimuddin Bin Mazlan\nTopic: Creating Your Own WiFi Jammer\nSpeaker 2: Mohammad Ezaly Iman Bin Ramli\nTopic: Cyber Security Drill With CTF"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-06-27",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/301347316",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "Secure Application Design: The Good, The Bad, and The Horrendous ",
        "date": "2024-06-25",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/301598509",
        "timezone": "America/New_York",
        "description": "For every application design \"best practice\", there is a matching \"worst practice\", or what some call security patterns and anti-patterns. Join us to review common anti-patterns, identify their accompanying secure design patterns, and commiserate about the worst offenders we've seen in the wild."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Designing an Efficient Penetration Test Suite",
        "date": "2024-07-18",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/301487187",
        "timezone": "America/Los_Angeles",
        "description": "How do you define the scope of penetration testing for a web application project? Is it the OWASP Top Ten, formal guidelines established by organizations such as NIST, security stories developed by the product owner and the security team, or recommendations made by your development team? The answer is all the above depending on the client, your development environment, and your capacity to take the risk.\n\nThis presentation will share experiences gained from penetration testing of a web application hosted by a Government agency providing professional licenses to its prospective clients. The nature of the project touched numerous areas such as CJIS (Criminal Justice Information Service), Personal Identifiable Information (PII), Access Control (Authorization in particular), and adherence to the security standard’s office guidelines. The challenge was to identify and prioritize the test suite that will cover these specific areas in a constrained time period. To enhance the coverage, the test suite had to include DAST (using ZAP) and some specific general scenarios.\n\nThe audience will take away some approaches that when applied can lead to a well balanced (both effective and efficient) penetration testing.\n\nSCHEDULE\nDoors open at 5:30. The talk will begin about 6pm.\n\nENTRY\nThere are doors on Washington and Broadway. Both of them auto-lock at 6pm. From 6 to 6:15pm, only the door on Broadway will be available. Take the elevator to the 11th floor.\n\nNO ENTRY AFTER 6:15 PM\nIt will not be possible to enter the building after 6:15.\n\nACKNOWLEDGEMENTS\nOur host again this month is NedSpace, a co-working space in downtown Portland--a friendly place to work when you don't want to work from home.\n\nFOOD\nWe don't yet have a sponsor for July, so there may not be food this time. Plan accordingly. (If you know a company that might like to sponsor, please put them in touch with us.)"
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro #15 [ONLINE]",
        "date": "2024-07-18",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/301724132",
        "timezone": "America/Sao_Paulo",
        "description": "Em julho teremos o nosso próximo encontro, online e com participação de todos através do **ZOOM**.\n\nVenha aprender e conversar **com um dos principais colaboradores** do OWASP Top 10 For LLM.\n\n**Link para a transmissão:**\nhttps://us06web.zoom.us/j/87962925968\n\n**Confira nossa agenda:**\n\n 19h30 \\~ 20h30\n**\"Segurança de IA na Prática: OWASP Top 10 para LLM Apps\"**\n\nNesta apresentação, exploraremos as melhores práticas de segurança para aplicações que utilizam Modelos de Linguagem de Grande Escala (LLM). Vamos discutir o OWASP Top 10, um guia essencial para identificar e mitigar os principais riscos de segurança nessas aplicações. Através de exemplos práticos e insights detalhados, você aprenderá como proteger suas implementações de IA, garantindo conformidade e segurança robusta. Esta sessão é fundamental para profissionais de segurança, desenvolvedores e líderes de tecnologia que buscam fortalecer suas defesas contra ameaças emergentes no campo da inteligência artificial.\n\n**Palestrante:** Emmanuel Guilherme Junior \\(Cybersecurity Leadership \\| AI & LLM Security \\| Cloud Security \\| OWASP Top 10 for LLM Core Team Member\\)"
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "OWASP San Antonio Chapter Monthly Meeting-July 19th 2024",
        "date": "2024-07-19",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/301446259",
        "timezone": "America/Chicago",
        "description": "Topics- See abstracts below\n\n* Securing API's in the Cloud\n* The top API threats seen in the first quarter of 2024\n* Salesforce Security Pen Testing\n\n**Lunch Provided**\n\nsmall fee for parking est $5-$7.50 Bauerle Road Garage at UTSA Campus\n\nUniversity Room 2.06.04 - Business Building, John Peace Library, 1 UTSA Circle, San Antonio, TX 78249\n\nZOOM link provided for remote attendees\n\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\nPlease reply **“ONSITE”** if you plan on attending in person so we can finalize headcount for food and room attendance \n\n**Presentations will include:**\n***I. Presentation on API Lifecycle-Optiv***\nAPI lifecycle graphic review-provided baseline understanding of API journey-Optiv\n***II. Securing APIs in the Cloud: Insights and Best Practices- Palo Alto***\nThis presentation explores the current state of API security in the cloud, covering industry trends and common challenges organizations face. It delves into effective strategies for API discovery, risk profiling, and real-time protection, providing practical insights and best practices to enhance API security. The discussion will highlight key concerns such as inadequate authentication, lack of visibility, and poor endpoint management, aiming to equip attendees with the knowledge to better secure their API ecosystems.\n***III. API ThreatStats™ Report Q1 2024 Spotlight: Why API Security Is The First Thing For Enterprise AI- Wallarm***\nThe Wallarm Research Team has analyzed billions of data points to identify the top API vulnerabilities and exploits for the 1st quarter of 2024, shining a spotlight on the rising threat of API attacks targeting AI applications. The report explores the top significant threats, identifies key trends, and provides actionable insights that can help you strengthen your API Security program, with an emphasis on identifying and protecting your AI applications from API security issues.\n***IV. Salesforce Pen-testing-Rodney***\nTopic 2-PaaS Cloud Goat is a simulated vulnerable Salesforce\nApplication providing hands-on experience with penetration testing of custom Salesforce applications. The tool is similar to other test tools like AWS CloudGoat, CloudFoxable, AzureGoat, GCPGoat, and Pen-Testing Cloud REST APIs in OpenStack. It is not, however, a tool for attacking [Salesforce.com](http://salesforce.com/) itself. It is novel because it focuses on custom applications deployed using the Salesforce platform and is the first tool to provide lab exercises with a collection of security tests. The main takeaways:\n1\\. Hands\\-on learning opportunity of security tests for a custom Salesforce application\n2\\. Detailed training documentation material about the underlying flaws to look for\n3\\. Single consolidated list of common Salesforce application vulnerabilities"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-07-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539096",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Practical Web App Pentesting for Beginners",
        "date": "2024-06-28",
        "time": "11:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/301592291",
        "timezone": "America/Los_Angeles",
        "description": "*Join us for a two-hour workshop designed to introduce you to the exciting world of web application penetration testing. This event is proudly delivered by [TCM Security Academy](https://academy.tcm-sec.com/), [OWASP Seattle](https://owasp.org/www-chapter-seattle/), and [WiCyS Western Washington](https://www.linkedin.com/company/women-in-cybersecurity-wicys-western-washington/).*\n*The workshop is perfect for beginners looking to start their journey in application security. You'll learn practical skills for identifying and exploiting common web vulnerabilities, with a focus on real-world scenarios and hands-on exercises.*\n*[Alex Olsen,](https://www.linkedin.com/in/alex-olsen-ase/) from [TMC Security](https://tcm-sec.com/) will be delivering this practical workshop focusing on the basics of web app pentesting, exploring the [OWASP Top 10 vulnerabilities](https://owasp.org/www-project-top-ten/), and diving into specific issues like injection flaws, logic problems, and access control weaknesses. We'll also discuss where to go next in your learning journey, including career paths in AppSec and resources for skill development. The event will conclude with a Q&A session, giving you the opportunity to ask questions and gain insights from experienced professionals.*\n*Whether you're a developer, IT professional, or simply curious about cybersecurity, this workshop will provide valuable knowledge and practical experience to kickstart your path in web application security.*\n*Google Meet link will be shared with all registered participants 24 hours prior to the event.*"
    },
    {
        "group": "Tallinn",
        "repo": "www-chapter-tallinn",
        "name": "OWASP Tallinn - Modern Cryptography - Vol. 2",
        "date": "2024-07-04",
        "time": "18:30+03:00",
        "link": "https://www.meetup.com/owasp-tallinn/events/301615501",
        "timezone": "Europe/Tallinn",
        "description": "** Welcome to the Summer Event of OWASP Estonia: Modern Cryptography - Vol. 2 **\n\n In this event we'll host two very special speakers:\n\n**Stefano Alberico**, tech lead mentor at **NATO DIANA** accelerator and founder at Skudo, is a technology visionary with 25 years of international experience.\n\nHe is very problem solving oriented and prefers to set up a demo with a Raspberry Pi rather than only explaining things on a PPT.\n\nHe is now focused on hardware encryption (HSM and PKI) for space and drone applications, based on Skudo's own FPGA implementation.\n\n Speech: **Practical use-cases of encrypted satellite communication**\n\nIn my 30-minute presentation, Stefano will discuss two key use-cases of encrypted digital satellite communication that his company has worked on.\n\nThe first use-case involves a project with the European Space Agency (ESA) last year. We remotely reprogrammed the OPS-SAT's onboard FPGA with our custom cores, adding a Hardware Security Module (HSM) and a RISC-V processor. We then developed an application that captured a satellite image, processed it on the RISC-V, encrypted it on the HSM, and sent it to our ground office. There, we decrypted the image using the appropriate key and displayed it, ensuring secure data transmission.\n\nThe second use-case is an ongoing project to create an encrypted satellite communication link. This involves integrating our HSM/FPGA with an Iridium modem using the Short Burst Data (SBD) service. This setup enables us to send end-to-end hardware-encrypted messages worldwide, ensuring secure and reliable communication.\n\nThese examples demonstrate our work in enhancing secure satellite communications through advanced encryption and processing technologies.\n\n\\-\\-\\-\n\n**Jelizaveta Vakarjuk** is a junior researcher in Cybernetica and industrial PhD student at Tallinn University of Technology. Her research focuses on post-quantum cryptography, privacy-preserving cryptography, and security of voting systems. Mainly she studies post-quantum digital signatures, but also focuses on the aspects of migration to post-quantum cryptography.\n\n Speech: **Obstacles of migration to post-quantum cryptography**\n\nWith the rising development of quantum technologies there is an urgent need to secure existing IT infrastructure against quantum threats. Introducing post-quantum cryptography to present systems could protect them against future quantum computer attacks. Still, post-quantum migration is a challenging process which requires systematic planning and years of execution. In this talk, I will share what are the main migration obstacles in example of Estonian e-services.\n\n **And That's Not All - More Surprises Await!** Whether you're a cybersecurity professional, a tech enthusiast, or just curious about cryptography, there's something for everyone!\n\n **Connect, Collaborate, and Create:** This event is more than just talks - it's a platform to connect with like-minded folks!\n\n **Mark Your Calendars:**\nThursday 04th July at 18:30 - 20:30\nWorkland Maakri 19\n\n **Limited seats, registration on Meetup required!** "
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Webauthn - WTF or FTW?",
        "date": "2024-07-18",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516371",
        "timezone": "America/Vancouver",
        "description": "**Webauthn - WTF or FTW?** with Don Burks\n\nWhile it has been around for a few years, the Web Authentication Standard (or Webauthn) is just starting to become mainstream. This talk will explore some of the real-world applications of this technology, in particular discussing adoption strategies, observability practices, and evaluating Webauthn against other strategies such as OAuth and 2FA.\n\n**Don Burks** is a technical leader who has been working in the industry for over 25 years. Former Head Instructor of Lighthouse Labs and with experience both in startups and FAANG companies, Don's background in software development and technical leadership has provided a wealth of experience which he shares in books, talks, and the great teams with which he gets to work. Currently, Don is the Director of Engineering for Bulletproof Studio Tools, based in Vancouver, BC."
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "Threat Modeling/Threat Intelligence: Como Ambas Podem Ser Utilizadas em Conjunto",
        "date": "2024-07-02",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/301758648",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: Caique Barqueta\nTema: Threat Modeling e Threat Intelligence: Como Ambas Podem Ser Utilizadas em ConjuntoData: 02/07/2024 às 19:30"
    }
]