[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - February",
        "date": "2023-02-28",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/288772226",
        "timezone": "Europe/Copenhagen",
        "description": "More information to come!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - February 2023 (Online)",
        "date": "2023-02-28",
        "time": "1:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705717",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- https://owasp\\-austin\\-2023\\-february\\.eventbrite\\.com\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nAppSecOps - a Scalable Approach to Application Security\nLuis Guzman\n\nToday many unforeseen factors are driving AppSec chaos...We have found about 3-4 TOP challenges every vertical is seeing in today's frugal market. The factors range from simple to hilariously unattainable! I aim to give you a few tips and steps to overcome some if not ALL and create an organization able to ship software fast and secure! All the while addressing current events happening in the market and how to avoid potential \"potholes.\""
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "OWASP Bay Area chapter February Meetup",
        "date": "2023-02-08",
        "time": "7:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/291146036",
        "timezone": "America/Los_Angeles",
        "description": "**Please fill the eventbrite registration link to reserve the spot.**\n\nSecurity time, The February OWASP Bay Area chapter meetup is sponsored by GitHub. It will be a great occasion to connect with other security researchers, developers and managers, by discussing all things security, sharing tips and tricks and networking. Enjoy tasty food and crafted cocktails too!\nThe host require everyone to be pre-registered and have to sign a NDA at the event. Your full name and email address will be shared with GitHub. This is for the registration purpose.\n\nPlease complete the form below to reserve your spot.\n[https://www.eventbrite.com/e/owasp-bay-area-chapter-february-meetup-tickets-523090266067](https://www.eventbrite.com/e/owasp-bay-area-chapter-february-meetup-tickets-523090266067)\n\n**Agenda**\n\n* 5:00 - Check in, grab some food/drinks and network\n* 5:45 - Introductions & free security features on GitHub\n* 6:00 - 6:45 - Building trust in your container supply chain\n* 6:45 - 7:30 - Every risk is not a CVE: Bolster up against software supply chain attacks\n* 7:30 - Networking\n* 8:00 - Conclusion\n\n**Talk#1 Building trust in your container supply chain**\n**Speakers:**\nSai Santosh Vernekar\\| Senior Information Security Analyst\\, Kohl’s\nSwarup Natukula \\| Senior Information Security Analyst\\, Kohl’s\n\n**Details:**\nApplications are made up of software components. The supply chain is at the heart of developing, delivering, maintaining, and scaling applications. It is critical to understand the risk in each component in order to safeguard the supply chain. End-to-end security is critical to mitigating the risks associated with open source software, regardless of the application that is being created.\nIn this talk, we will look at the challenges associated with the \"Container\" supply chain, as well as some of the technology, processes, and tools that you can use to create confidence in your container supply chain.\n\n**Talk#2** : **Every risk is not a CVE: Bolster up against software supply chain attacks**\n\n###\n\n**Speaker:** Varun Badhwar, Founder/CEO of Endor Labs\n3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\n\nWe will present a comprehensive, comprehensible and technology-agnostic[ ](https://arxiv.org/abs/2204.04008)taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy,[ ](https://riskexplorer.endorlabs.com/)available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\n\nFollowing, we will discuss the types of defenses you can put in place to detect and respond to such modern day attacks.\n\nLooking forward to connecting at the Security Meetup"
    },
    {
        "group": "Bellingham",
        "repo": "www-chapter-bellingham",
        "name": "OWASP Bellingham Chapter March Event (Online) ",
        "date": "2023-03-01",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-bellingham-chapter/events/291414271",
        "timezone": "America/Los_Angeles",
        "description": "Please join us on the evening of March 1st for a social gathering to talk about what we're working on, upcoming events, and hang out with other web security minded folks!"
    },
    {
        "group": "Bogota",
        "repo": "www-chapter-bogota",
        "name": "OWASP Bogotá - Ataques dirigidos a smartcontracts y Hack The Box:SQL Inyección",
        "date": "2023-02-16",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-bogota-meetup-group/events/291169276",
        "timezone": "America/Bogota",
        "description": "Nuestra primera reunión del 2023 - Modalidad presencial\n\nEn esta ocasión nos acompaña Jawy Romero y Jesus Suárez vamos hablar sobre ataques dirigidos a smartcontracts y DAO y una charla introductoria sobre sql injection en ambientes controlados.\n\nUn agradecimiento muy especial a la Fundación Universitaria San Mateo, recuerden que los asistentes deben enviar el número de cédula al correo luis.hernandez@owasp.org previamente para evitar problemas con el acceso a las instalaciones.\n\nNombre del ponente: Jawy Romero @JawyPinto\n\nTítulo de la charla: Ataques dirigidos a smartcontracts y DAO\n\nDescripción:\nDar a conocer los ataques conocidos en smartcontracts y cómo se han visto afectadas las aplicaciones en entornos blockchain.\n\nPúblico con conocimiento básico en tecnologías Blockchain\n\nDuración: 45 Min\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nNombre del ponente: Jesús Suárez\n\nLinkedIn: https://www.linkedin.com/in/jesussuarz/\n\nTítulo de la charla: Hack The Box: SQL Inyección SQLi\n\nDescripción de la charla: En esta charla conoceremos cómo funciona Hack The Box a nivel general, además completaremos un reto de Hack The Box Academy utilizando diversas técnicas, mostraremos técnicas de SQL Inyección realistas junto con recolección de información en entornos controlados, la idea es entender cómo funciona la plataforma y como se pueden completar los distintos retos propuestos si se quisiera dedicar a Ciberseguridad y Hacking Ético.\n\nPúblico objetivo: charla dirigida a informáticos que quieran comenzar en Hacking Ético y Ciberseguridad\n\nDuración: 1 Hora\n\nLos esperamos!!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "OWASP Brisbane - February **UPDATE**",
        "date": "2023-02-23",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/291301162",
        "timezone": "Australia/Brisbane",
        "description": "Hi All!\n\nWe are excited to confirm our speaker for the next event at Thoughtworks Brisbane!\n\n**Speaker:** Raafey Khan\n\n**Title:** Can AppSec testing really be automated?\n\n**Talk Description:** The capabilities of Application Security Testing (AST) tools are changing rapidly. As vendors continue to acquire and build new features, feature parity is on the horizon. For now, they're doing things in their own unique, sometimes odd way.\n\nOver the last few years, Raafey has used, analysed and compared various AppSec tooling. Running them against benchmarks and multiple applications.\nIn this talk, he will go through what makes an AST tool good, why there are SO many false positives, and when they actually make sense to use compared to a good old-fashioned pentest.\n\n**Bio:** Raafey has been a security consultant for many years and leads the AppSec team for CyberCX. His primary focus is working with organisations to understand how they build software and what they can do to make sure they’re protected.\n\nHaving recently moved over from NZ, he’s looking forward to getting to know the Brisbane security community."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - February 2022",
        "date": "2023-02-28",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/291234834",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC ",
        "date": "2023-02-21",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/288310192",
        "timezone": "Europe/London",
        "description": "tbc\n\nWe publish the recordings of our meetups on @YouTube.\nIf you would like to be notified when a new video is published, please subscribe to our channel at:\nhttps://www.youtube.com/@OWASPBristol"
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "Automation of digital crime investigation using Reinforcement Learning (RL)",
        "date": "2023-02-07",
        "time": "7:00Z",
        "link": "https://www.meetup.com/owasp-cambridge-meetup/events/290579034",
        "timezone": "Europe/London",
        "description": "Hosted by the Cyber Security & Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, & BCS Cybercrime Forensics SG\n\n**Background**\n\nThe BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.\n\nOWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.\n\nThe **Cyber Security and Networking** (**CSN**) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP & the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment. These will be achieved through the investigation of threats posed to information systems and understanding the impact of attacks and creation of cyber-based warning systems which gathering threat intelligence, automate threat detection, alert users and neutralising attacks. For network security we are researching securing the next generation of software defined infrastructures from the application API and control/data plane attacks. Other key work includes Computer forensic analysis, digital evidence crime scenes and evidence visualisation as well as Cyber educational approaches such as developing Capture the Flag (CTF) resources and application security programs.\n\n**Abstract : “Automation of digital crime investigation using Reinforcement Learning (RL)”**\n\nCurrent human-led Digital Investigation is reaching its limit, notably with the explosive increase in cybercrime. DFIR practitioners at law enforcement and corporate levels are facing severe challenges in coping with the demand. This talk will discuss the possible use of new Reinforcement Learning (RL) approaches to automate and optimise some of the processes in DFIR practice and thus off-load experts and increase efficiency.\n\n**Provisional Agenda**\n\n16:45 - Webinar waiting lobby opens\n17:00 - Start of Presentation\n17:50 – Questions & Answers"
    },
    {
        "group": "Charlotte",
        "repo": "www-chapter-charlotte",
        "name": "2023 Kickoff Meeting!",
        "date": "2023-02-16",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/owaspclt/events/289053091",
        "timezone": "America/New_York",
        "description": "Come join us for our First meeting of the year, Food and Drink Will be provided! The location and agenda are TBA."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS February 2023",
        "date": "2023-02-23",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/291207717",
        "timezone": "America/Denver",
        "description": "Speaker: TBD\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP SNOWFROC Conference",
        "date": "2023-03-02",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/290702464",
        "timezone": "America/Denver",
        "description": "SnowFROC 23 is on Thursday March 2nd - all day long. While billed as, \"Denver's premier application security conference\", SnowFROC's presentations and workshops focus on many facets of cybersecurity and over the years, SnowFROC has come to be known for its exceptional value: Hands-on training, excellent food, spectacular networking, great location/venue and professional orchestration.\n\nThis year, our Keynote will be given by Kevin Johnson!\n\nSnowFROC includes breakfast, lunch, presentations, vendor giveaways, a panel discussion and optional hands on training and workshops.\n\nThe location of this event is The Cable Center on the University of Denver campus near I-25 and University.\n\n**YOU MUST REGISTER AT** [https://www.eventbrite.com/e/owasp-2023-snowfroc-tickets-487925687867](https://www.eventbrite.com/e/owasp-2023-snowfroc-tickets-487925687867)\n\n**Our regular meetups are free, but this one-day only event/conference is not free:** Only $75 for the conference which includes breakfast, lunch, afternoon snacks and happy hour. Additional $30 for the hands-on track if desired.\n\nBY FAR THE BEST VALUE for any conference you will attend this year - Start 2023 off right and invest in yourself and your company!\n\nStay up-to-date with the latest information on speakers, sponsors, workshops and more: [https://snowfroc.com](https://snowfroc.com)"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "OWASP France - Bordeaux Meetup - Février 2023",
        "date": "2023-02-22",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/291313081",
        "timezone": "Europe/Paris",
        "description": "OWASP France se délocalise à Bordeaux pour le 1er MeetUp de la communauté sécurité hors de Paris !\n\nPour cette première rencontre, nous allons adresser un sujet chaud pour beaucoup d'organisations : le **DevSecOps**.\n\nComment inclure la sécurité dans les process de développement ?\n Quels outils ?\n Quels process ?\n‍ Quelles équipes ?\n Quelles compétences ?\nQue de questions...\n\nNotre premier sponsor Mirakl nous accueille dans le coworking Meetropolitan :\n** Mirakl Bordeaux**\n31 Allées de Chartres\n33000 Bordeaux\n\n** Voici le programme complet**\n 17h00 : Pot d'accueil sucré\n 17h30 : Début du MeetUp - Présentation de la communauté OWASP\n 17h45 : Intervention des speakers :\no Sébastien Gioria (DevSecOps Officer chez Lectra) : Les 4,2 facteurs de succès d'un déploiement DevSecOPS a grande échelle\no Tiana Razafindralambo (eShard) : Pourquoi intégrer les tests de sécurité d'apps mobiles dans votre CI/CD ?\no Alexis Cadoret (Security Operations Team Lead - Mirakl) : Implémentation du programme de Bug Bounty\n 18h45 : Questions réponses\n 19h15 : Fin du MeetUp\n\nAttention, nous ne pourrons accueillir que les **20 premiers d'entre vous** !\n\nLe Meetup sera retransmis sur Zoom (le lien sera donné le jour meme)\n\n Merci à Mirakl de nous permettre d'organiser cette première rencontre."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #59 Virtual Edition 2023",
        "date": "2023-02-22",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/290496214",
        "timezone": "Europe/Berlin",
        "description": "Hi folks, for our OWASP Frankfurt 2023 winter edition, we are looking forward to welcoming you to our next **virtual event**!\n\n_What's going to happen?\nWe look forward to welcoming you to our first OWASP Frankfurt Meetup in 2023.\n\n_What are we going to talk about?\nTalks to be announced!\n\n_When and Where?\nOur Meetup takes place via Zoom on 22.02.2022 from 18:00 to 20.30 o'clock CEST (ca. 2.5 hours)\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Leads (Dan Gora or Jonas Becker)\n\n_And now?\nPlease save the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this online event!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-02-13",
        "time": "8:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/290841105",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Limassol Meetup",
        "date": "2023-02-23",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/291266510",
        "timezone": "Asia/Nicosia",
        "description": "**Calling all tech and security enthusiasts!**\n\nWe are excited to announce our upcoming [OWASP Limassol](https://owasp.org/www-chapter-limassol/) meetup. Join us for an evening of cool new ideas and inspiring presentations from industry experts.\nWe'll discuss the latest trends in web application security, share best practices and explore different approaches to building a secure online environment. So come on out and learn something new!\n\nWe look forward to seeing you there and would be delighted to offer a complimentary gift to each attendee!\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19:00 — 19:30 — [Valeriy Shevchenko](https://krevetk0.medium.com), Semrush:\n***Use information about modern attacks to stay safe.***\n19:30 — 20:30 — Speaches TBA\n20:30 — 21:00 — Entertainment for all the attenders\n21:00 — 22:00 — Eat, drink, networking!\n\nMore information about the speakers is to come!\n[CFP is still open!](https://forms.gle/HSweZ7JtWwwe2FjaA)\n[You can also join us on Telegram.](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#02 Building Up",
        "date": "2023-02-28",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/291153982",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on February 28th, 2023, at 18:00, **sponsored by INESC-ID**.\n\nThe schedule is the following:\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n**18:15** \\- Surface Security: The experience so far and the road ahead by Gustavo Silva\n**19:00** \\- Is it private\\, is it public? Dependency Confusion by Francisco Santos\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Surface Security: The experience so far and the road ahead**\n\nSpeaker:\nGustavo Silva\n\nAbstract:\nAt Paddy Power Betfair (Blip.pt), throughout the years, we have developed a tool to help us have an inventory of all internal assets, from servers to DNS records to endpoint devices, but to also integrate other tools in it, like open source scanners to help us detect vulnerabilities, understand our exposure, weaknesses, and priorities, as well as leverage built-in notifications, a slack bot, and much more.\nThis talk is to talk about this project, which was open-sourced recently, and what the roadmap is for the future.\n\n[Gustavo Silva](https://www.linkedin.com/in/gsilvapt/) Bio:\nSoftware Developer by day, Security Researcher at night. I’m passionate about software security. The niche I am currently working on is engineering processes, tools, and internal interfaces to help companies secure their development lifecycles, do vulnerability management and increase overall awareness of the product's security risks.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Is it private, is it public? Dependency Confusion**\n\nSpeaker:\nFrancisco Santos\n\nAbstract:\nBy 2021, the number of components in the average application rose 77 % from 298 to more than 500 open-source packages. Those components are hosted on public repositories such as GitHub, NPM, or PyPI, while some organizations choose to operate proprietary packages inside private registries of those repositories. Private or public, the management is done by CLI (like npm). The CLI imports private or public packages via a simple precedence algorithm: If the package resides inside the private registry, import it. If not, import the public component. How can a bad actor play this to his advantage?\nThe \"is it private, is it public? Dependency Confusion\" talk explains what dependency confusion is, and teaches ways of finding dependency confusion vulnerabilities in js files via BurpSuite with an automated tool called jsminer, a real example of a dependency confusion bug I found, and recommendations to mitigate those issues. By the end, breakers and makers should acquire a fresh new perspective on this issue.\n\n[Francisco Santos](https://www.linkedin.com/in/francisco-santos-77917a210/) Bio:\nI'm Francisco Santos, 23 years old. I always liked to think out of the box and find weird solutions to problems. I like logic and solving puzzles. I enjoy being a breaker, and I want to add value to that community.\n\nTwitter: https://twitter.com/andr0idp4r4n0id"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - FEB 22, 2023",
        "date": "2023-02-22",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/290935113",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Every Risk is Not a CVE: Bolster up Against Software Supply Chain Attacks\nJoin us for great networking, dinner and drinks, and see a presentation by Jamie Scott - Product Manager\n\n**ABSTRACT**: 3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\nWe will present a comprehensive, comprehensible and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy, available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\nFollowing, we will discuss the types of defenses you can put in place to detect and respond to such modern day attacks.\n\n**Thanks to our Sponsor**: Endor Labs\nEndor Labs’ Dependency Lifecycle Management Platform is designed to address the weakest link in software supply chain security: the ungoverned sprawl of open source software in the enterprise. Endor Labs’ mission is to help developers spend less time dealing with security issues and more time accelerating development through safe code reuse. With this solution, development and security teams are able to maximize software reuse by safely evaluating, maintaining, and updating dependencies at scale.\n\n*Vendors interested in sponsoring send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Lovely Professional University",
        "repo": "www-chapter-lovely-professional-university",
        "name": "Cyber Security Roadmap",
        "date": "2023-02-10",
        "time": "1:00+05:30",
        "link": "https://www.meetup.com/owasp-lovely-professional-university-chapter-student/events/291400659",
        "timezone": "Asia/Kolkata",
        "description": "Exciting news for all the Cybersecurity enthusiasts out there! OWASP LPU - Student Chapter is hosting a webinar on \"Cyber Security Roadmap\" with the renowned speaker Mr. Aditya Rai.\n\nIn this webinar, Mr. Aditya will not only guide but also demonstrate a roadmap to help students navigate their way through the cybersecurity learning process and provide insight into the various opportunities available in the field.\n\nWhether you're a beginner or an experienced professional, this webinar is a must-attend for anyone looking to further their career in cybersecurity.\n\nDon't miss this opportunity to gain valuable insights and tips from an industry expert and kick-start your career in cybersecurity!\n\nRegister now for the OWASP LPU \"Cyber Security Roadmap\" webinar!\n#CybersecurityRoadmap #OWASPLPU #AdityaRai."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Every Risk is Not a CVE: Bolster up Against Software Supply Chain Attacks",
        "date": "2023-02-23",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/291352900",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\n3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\n\nI will present a comprehensive, comprehensible and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy, available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\n\nFollowing, I will discuss the types of defenses you can put in place to detect and respond to such modern day attacks.\n\n### **Code of Conduct**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)\n\n**Thanks to our Sponsor**: [Endor Labs](https://www.endorlabs.com)\nEndor Labs’ Dependency Lifecycle Management Platform is designed to address the weakest link in software supply chain security: the ungoverned sprawl of open source software in the enterprise. Endor Labs’ mission is to help developers spend less time dealing with security issues and more time accelerating development through safe code reuse. With this solution, development and security teams are able to maximize software reuse by safely evaluating, maintaining, and updating dependencies at scale."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-02-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/290988680",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-02-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/290988679",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-02-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/290988678",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - February 2023",
        "date": "2023-02-28",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291186385",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Modern Authentication - FIDO2 and Passkeys",
        "date": "2023-02-15",
        "time": "8:00+11:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/290887586",
        "timezone": "Australia/Sydney",
        "description": "Location: - Talenza Offices, Level 3, 7 Macquarie Place, Sydney NSW 2000\nYouTube link: TBA\nDiscord: https://discord.com/invite/uAWze2B - Questions in the Sydney Chapter channel.\nMeet at 6:00 with the talk starting at 6:30.\n\nAbstract: This presentation will discuss approaches to the modern authentication protocols. In particular, we will dive into the FIDO2 passwordless protocol and passkey, a strong candidate to finally replace passwords. Our session will cover both technical and usability aspects of those approaches. We will look at the current trends in authentication attacks as well as the latest research and developments."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter | Q1 2023 | Lunch and Speaker Event",
        "date": "2023-02-24",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/290897847",
        "timezone": "America/New_York",
        "description": "Welcome to OWASP Tampa Chapter \\| Q1 2023 \\| Lunch and Speaker Event\n\nTitle: **Build a Roadmap for Your Dream Career in Cybersecurity**\n\nAbstract: Don’t rely on luck or hope; create a strategy to navigate your path to your dream role in cyber. Whether you want to lead the top NSA Red Team, build software to mitigate zero-day attacks, become a CISO, take a startup to IPO, or have a seat in the Boardroom, you need a plan. Beyond core skills getting that dream role requires the right mindset, specific communication skills, and growing your personal brand.\n\nSpeaker: Joy Randels is an Entrepreneur, current CEO of Prowess Group & New Market Partners, she’s named Top 100 Female Speaker, Board Director and so much more in the Cybersecurity community! Joy was recently selected as one of only 54 of Florida’s most influential executives in the Finance & Insurance category and one of five in venture capital.\n\nRegistration Page: https://www.eventbrite.com/e/owasp-tampa-chapter-q1-lunch-and-speaker-event-2023-tickets-510875942697\n\nLocation:\n\n* This is an in-person event only, no streaming available.\n* **8th Floor, John P Lowth Entrepreneur Center, University of Tampa** -**Public (non-student, free) Parking available directly across from the John P Lowth Entrepreneur Center**\n\nAGENDA:\n\n* Announcements\n* Guest Speaker\n* Ajourn"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Building a Security Program & Preparing for a Breach",
        "date": "2023-02-23",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasptriangle/events/290897948",
        "timezone": "America/New_York",
        "description": "The world of technology is evolving, and so is the threat landscape. This talk will remind us that security initiatives may be seen as overhead for most companies and how we can change the narrative. We will discuss methods that will save the company money in the long run by partnering with Finance, Business Operations, and DevOps (Modern IT Function). This will provide a strategic roadmap curated through real-life experience and some of the best practices to prepare for 2023 and beyond. Let's succeed by understanding what's important to the shot callers!"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver - Scaling your Application Security program",
        "date": "2023-02-16",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248487",
        "timezone": "America/Vancouver",
        "description": "**Title**: How to avoid potholes when scaling your Application Security program\n**Speaker**: Jeevan Singh, Director of Product Security at Twilio\n\nHave you ever wondered what it is like to build an Application Security program at a very large organization? Or how to build it at an organization that had experienced hypergrowth and the security team’s hiring was not at the same pace as Engineering? What about an organization that had acquired a lot of different companies with vastly different tech stacks?\nJeevan Singh will show you how to build an Application Security program and avoid pitfalls at a hypergrowth organization. The talk will cover topics such as hiring, tooling, metrics, roadmapping, building allies and setting yourself up for success."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #59 Virtual Edition 2023",
        "date": "2023-02-22",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/290496214",
        "timezone": "Europe/Berlin",
        "description": "Hi folks, for our OWASP Frankfurt 2023 winter edition, we are looking forward to welcoming you to our next **virtual event**!\n\n_What's going to happen?\nWe look forward to welcoming you to our first OWASP Frankfurt Meetup in 2023.\n\n_What are we going to talk about?\nTalks to be announced!\n\n_When and Where?\nOur Meetup takes place via Zoom on 22.02.2022 from 18:00 to 20.30 o'clock CEST (ca. 2.5 hours)\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Leads (Dan Gora or Jonas Becker)\n\n_And now?\nPlease save the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this online event!"
    }
]