[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - March",
        "date": "2025-03-25",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299786153",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with LEGO Group.\n\nAgenda:\n**19:00 – 19:10** Welcome by LEGO Group and OWASP Aarhus\n\n**19:10 – 20:00** To be announced later (Presented by LEGO Group)\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** \"Phishing: How Attackers Exploit the Human Mind and Behavior\" by Ahmed Morrad\n\nPhishing attacks are the most common method used by threat actors to gain initial unauthorized access. They are forms of cyber deception that prey on the human psychology. By exploiting emotions like curiosity or fear, attackers can manipulate individuals to submit sensitive information. During this presentation, it will be disclosed what phishing is, how threat actors turn human behavior into a weapon, what tools they use and how to mitigate these attacks."
    },
    {
        "group": "Algiers",
        "repo": "www-chapter-algiers",
        "name": "Cyber Sahra | CyberSecurity Workshops [Cyber Defense | GRC | Cyber Offensive]",
        "date": "2025-03-13",
        "time": "21:00+01:00",
        "link": "https://www.meetup.com/owasp-algiers-chapter/events/306537120",
        "timezone": "Africa/Algiers",
        "description": "**Cyber Sahra: A Premier Cybersecurity Meetup for Experts, CISOs, and Industry Professionals**\n\nJoin us for **Cyber Sahra**, an exclusive cybersecurity meetup event designed for **Cyber Experts, CISOs, CIOs, and Industry Professionals**. Made in **collaboration** between **EKSec Group**, **CSA Algeria**, **OWASP Algiers**, and **iNET Academy**. This event brings together leaders and practitioners in cybersecurity to discuss cutting-edge topics, share insights, and explore strategies in **Offensive Security, Cyber Defense, and GRC**.\n\n###  **Why Attend?**\n\n **Expert-Led Discussions:** Gain insights from top industry professionals on the latest security trends, threats, and solutions.\n **Practical Workshops:** Participate in hands-on sessions focusing on **penetration testing, digital forensics, and governance frameworks**.\n **Networking Opportunities:** Connect with CISOs, security leaders, and domain experts to exchange knowledge and best practices.\n **Industry Insights:** Explore **real-world case studies** and learn from cybersecurity experiences across various industries.\n\n###  **Event Details**\n\n **Date:** Thursday 13 March 2025\n **Time:** Starting at 09:00 PM (21:00)\n **Location:** iNET Academy \\| GPS: [https://maps.app.goo.gl/4EvWUAX3y2LTiBrL6](https://maps.app.goo.gl/4EvWUAX3y2LTiBrL6)\n\n*** By Invitation Only – Limited Seats Available – Professionals Only!!***\n\nThis meetup is tailored for those who **shape cybersecurity strategies, lead security teams, and drive governance, risk management, and compliance** in their organizations. If you're looking to elevate your expertise and engage with like-minded professionals, **Cyber Sahra is the event to attend!**\n\n **RSVP Now to Secure Your Spot!**\n\nWe look forward to welcoming you to this **insightful and impactful cybersecurity gathering**."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Reducing AppSec Risk with ASPM (Application Security Posture Managament) ",
        "date": "2025-03-20",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304566000",
        "timezone": "America/New_York",
        "description": "In an era of increasingly sophisticated threat actors, application security has become a critical concern for most organizations. This talk, \"Reducing Application Security Risk with ASPM (Application Security Posture Management),\" will explore the emerging role of ASPM in fortifying application security and accelerating DevSecOps and cloud native adoption.\n\nAttendees will gain insights into the current state of application security and DevSecOps adoption trends: challenges and opportunities across people, process, and technology. This also includes the impact of AI.\n\nThe talk will have a focus on ASPM and how it will help overcome some of the challenges and capitalize on the opportunities. We will delve into key ASPM features and how each of these use cases could be leveraged to solve common application security & DevSecOps adoption challenges and further mature your program. Through practical examples and case studies, the session will highlight best practices for implementing ASPM in large scale application development ecosystems to reduce application security risks. Whether you're a developer, security professional, manager or executive, this talk will equip you with actionable strategies to improve your application security posture and accelerate DevSecOps adoption."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "10. OWASP Augsburg Stammtisch",
        "date": "2025-03-26",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/306015386",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda**\n**Vortrag von Rico: ISO/IEC 18974 der Standard für den Betrieb hochwertiger Open-Source-Sicherheitsprogramme**\n\nOpen Source Software ist allgegenwärtig. Besonders moderne – oftmals auch komplexere – Projekte profitieren vom Einsatz entsprechender quelloffener Bibliotheken. Dabei wurden bestimmte Funktionen von einem 3rd Party Entwickler entwickelt und vorab (unentgeltlich) der Allgemeinheit zur Verfügung gestellt. Dies bringt jedoch ein großes Risiko mit sich: Was passiert, wenn eine Sicherheitslücke in genau einer solchen Bibliothek entdeckt wird? Je nach Einsatz und Tiefe der Integration kann dies schwerwiegende Auswirkungen haben und je nach Verbreitungsgrad der Open Source Komponente kann es eine Vielzahl von Anwendungen betreffen.\nDas OpenChain Projekt hat genau dieses Problem erkannt und ein ISO-Standard entwickelt, der sich dem Thema Informationssicherheit bei Open Source Projekten widmet. Dabei bekommen sowohl Entwickler von Open Source Komponenten, als auch Entwickler die diese einsetzen und sogar Firmen, die Open Source Software vertreiben die Möglichkeit den Umgang mit Informationssicherheitsvorfällen zu zertifizieren.\nDieser Vortrag gibt ein Überblick über die Norm ISO/IEC 18974 und die damit verbunden Möglichkeiten seinen Kunden oder Anwendern ein sicheres Vorgehen nachzuweisen.\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - March 2025 (Online)",
        "date": "2025-03-25",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489292",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n(To Be updated)"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "March 2025 OWASP Happy Hour sponsored by DefectDojo",
        "date": "2025-03-13",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305995366",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, March 13th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [DefectDojo](https://defectdojo.com/)\n*DefectDojo is the engine that drives DevSecOps, providing an open, scalable platform that connects security strategy to execution. By aggregating data from over 180 security tools, automating manual processes, and delivering AI-powered insights, DefectDojo empowers organizations to have a unified view of security posture and compliance, automate operations to increase productivity and improve decision-making. For more information, visit defectdojo.com.*"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "NULL / OWASP Bangalore Combined 22 March 2025",
        "date": "2025-03-22",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/306530982",
        "timezone": "Asia/Kolkata",
        "description": "Join the [Null Bangalore](https://www.linkedin.com/in/nullblr/) & OWASP Bangalore Combined Meetup – March 22, 2025!\n\nGet ready for an exciting day filled with top-tier security talks, hands-on discussions, and networking with the best minds in cybersecurity!\n\n Date: Saturday, March 22, 2025\n Venue: TBD\n⏰ Time: 09:30 AM – 02:00 PM\n Free Entry \\| Open to All \\| No Registration Limits\n\nAgenda Highlights:\nWill share\n\nDon’t miss this opportunity to learn, share, and connect with the open security community!"
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": " OWASP Bhopal CTF: Hack, Learn, Secure! ",
        "date": "2025-03-09",
        "time": "12:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/306398588",
        "timezone": "Asia/Kolkata",
        "description": "Get ready for an exhilarating **Capture The Flag (CTF)** competition hosted by **OWASP Bhopal**! Whether you're a **cybersecurity enthusiast, ethical hacker, or a beginner**, this event is designed to **test your skills, enhance your knowledge, and challenge your problem-solving abilities**.\nExpect **real-world security challenges** covering **web exploitation, cryptography, forensics, reverse engineering, and more**. Compete with some of the best minds in security, **solve exciting puzzles, and climb the leaderboard** to prove your expertise.\n\n **Who Can Participate?** – Open to all security enthusiasts, students, professionals, and CTF lovers!\n **What’s in it for You?** – Hands-on experience, recognition, and bragging rights as a top ethical hacker!\nStay tuned for more details on **registration, format, and prizes!** Are you ready to **Hack, Learn, and Secure**? "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Stormy Seas of Supply Chain Security",
        "date": "2025-03-25",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/306455341",
        "timezone": "Europe/London",
        "description": "We have a joint event with WiTCH (Women in Tech & Cyber Hub), starting with a talk from David Archer on Supply Chain Security.\n\n\\-\\-\\-\n\n* **6:00** doors open, meet and greet\n* **6:30** Introduction to OWASP and news, followed by a warm welcome to WiTCH\n* **6:40** \"Ship Happens: The Stormy Seas of Supply Chain Security\" David Archer from Endor Labs\n* **7:30** Discussion led by WiTCH on the human element of open source and how to get involved in security\n* **8:30** wrap up\n\n\\-\\-\\-\n\n**Directions:**\nIn-person event, kindly **hosted by Ping Identity**, Prologue Works, 7th Floor, 25 Marsh Street, Bristol BS1 4AX"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "AppSec CTF with Black Duck",
        "date": "2025-03-19",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/306590622",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Black Duck](https://www.blackduck.com/)**\n\nCome and join us for an evening of fun with a Capture the Flag (CTF) event that walks you through the day and life of a security-focused developer. You will embark upon three hands-on labs that showcase everything from development in your IDE (“shift-left”) to automating your security scanning with GitHub actions.\n*No development experience is necessary to join in on this fun!*\n\n**There are a few pre-requisites:**\n\n* Windows/Mac/Linux Computer\n* Polaris Access (given at CTF)\n* GitHub Account (free account)\n* Visual Studio Code\n\n**Optional: CTF Lab 3 (Part 2) Requirements**\n\n* Java\n* Maven\n* If running on a Mac, Xcode must be installed\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments!\n4:15 - Activities begin!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Peace, Love and Hacking: How to Bring Security & Development Teams Together",
        "date": "2025-03-20",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/305977341",
        "timezone": "America/New_York",
        "description": "FEEL A LITTLE! It is an unlikely duo to pair with cold-hard-tech, but empathy and creativity are cornerstones to a successful vulnerability remediation effort. Although I have sat in on countless talks about empathy in the tech sector, the one thing ALL these talks miss is the language barrier when it comes to dealing with tech-savvy teams. If you are in a foreign country and cannot speak the language, it's going to be difficult to communicate regardless of the compassion in your heart. My unique art-&-technology background allows me to not only empathize with the strife of development teams, but helps facilitate a thriving pipeline of communication between security, developers and other hackers.\nIn this talk I will illuminate the perspective of a researcher participating in a bug bounty program, what to expect from researchers, and how to effectively escalate risks to development teams for remediation."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "SnowFROC 2025",
        "date": "2025-03-14",
        "time": "08:00-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/306309150",
        "timezone": "America/Denver",
        "description": "**SnowFROC 2025**\nMarch 14, 2025 (Pi Day)\n*Location:* The Cable Center at the University of Denver\nDoors open: 8:00 am\n\n*Registration and additional details*: www.snowfroc.com\n\n*Conference tickets:* $100\n*Workshops:* $31.41 each (conference ticket required)\n\n*Key Note:* HD Moore (The Metasploit Project)\n*Notable speakers:* Tanya Janca (@SheHacksPurple), Jim Manico (@Manicode)\n\nTalks and workshop schedule on www.snowfroc.com\n\nA CTF from Security Journey will start March 10th and run until 3:00 pm MT on March 14th.\n\nYou ***MUST*** register via EventBrite (link at www.snowfroc.com) to attend"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Mars 2025",
        "date": "2025-03-10",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/306433788",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **Deloitte** que nous remercions chaleureusement de leur soutien.\n\nPour des raisons de sécurité, une ***pièce d'identité*** vous sera demandée pour accéder à l'évènement.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter & Women in CyberSecurity Meetup #71",
        "date": "2025-03-20",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/306217609",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to joint **OWASP Frankfurt Chapter & Women in CyberSecurity** Meetup #71!\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\nWiCyS aims to break down barriers and promote diversity in cybersecurity by empowering women and other underrepresented groups with resources for professional growth. Additionally, the organization is committed to creating a safer digital environment by supporting vulnerable individuals and advocating for inclusivity in the cybersecurity community.\n\n*What are we going to talk about?*\n\n* **AI and Machine Learning im Cybersecurity: Weapon, shield, or both?:** We are excited to welcome **Sara Rahimi**, Concierge Security Engineer at Arctic Wolf - who will explore the dual role that Artificial Intelligence and Machine Learning play in the Cybersecurity area as a powerful tool for attackers and offensive purposes, also for enhancing the defense mechanisms and detection aspects.\n* **Web 3.0 security: same fundamentals, higher stakes** - **Dr. Gulnara Hein**, CISO at Chintai, will dive into how Web3, while introducing decentralization and new security challenges like smart contract vulnerabilities and irreversible financial losses, essentially reflects the same fundamental risks as in traditional systems. By focusing on core security controls, we can effectively address these challenges without adding unnecessary complexity.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?* Our Meetup takes place on **20.03.2025** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at Arctic Wolf, located at 19th floor of Messeturm, Friedrich-Ebert-Anlage 49, 60308 Frankfurt am Main\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Hong Kong",
        "repo": "www-chapter-hong-kong",
        "name": "Reverse Engineering and Binary Patching Lab",
        "date": "2025-03-28",
        "time": "14:00+08:00",
        "link": "https://www.meetup.com/owasp-hong-kong-chapter/events/306530683",
        "timezone": "Asia/Shanghai",
        "description": "A crash course in reverse engineering and binary patching for x86/x64 Windows/Linux\n\nPre-requisite: 64-bit Windows AND Linux OS/VM"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy @ Security Summit 2025",
        "date": "2025-03-13",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/305915839",
        "timezone": "Europe/Rome",
        "description": "   -    -  - ://.\n\nAnche quest'anno OWASP Italy è ospite del Security Summit Milano, con una sessione interamente dedicata all'Application Security.\n\nLa sessione è rivolta a professionisti della sicurezza delle applicazioni, sviluppatori di software professionali, ingegneri della qualità del software, ricercatori e studenti di informatica. L'obiettivo della sessione è stimolare l'interesse per le pratiche di ingegneria del software applicativo e sicuro e per le nuove iniziative all'interno delle organizzazioni.\n\nAll'interno della sessione, saranno ospitate 2 talk da 20 minuti ciascuna, per i quali è aperta la Call for Talks qui di seguito descritta.\n\nGli argomenti speciali di interesse sono i seguenti:\n\\- AppSec\n\\- Intelligenza artificiale \\(AI\\)\n\\- Sicurezza per applicazioni mobile\\, cloud e serverless\n\\- Blockchain e Internet of Things per usi legati alla sicurezza\n\\- Penetration testing e attacchi a livello applicativo\n\\- Threat modeling\\, architettura delle applicazioni e dei sistemi\n\\- DevSecOps\n\\- Pianificazione e implementazione di un programma di sicurezza applicativa\n\\- Creazione di un team e di una cultura dedicata alla sicurezza applicativa \\(AppSec\\)\n\nIncoraggiamo i professionisti della sicurezza delle applicazioni, gli sviluppatori di software professionali, gli ingegneri della qualità del software, i ricercatori e gli studenti di informatica a presentare proposte come opportunità per condividere le conoscenze e le lezioni apprese su argomenti rilevanti per la sicurezza delle applicazioni e del software con una precedente esperienza di presentazione alle conferenze sulla sicurezza.\n\n \nI candidati speaker possono inviare un abstract del loro intervento proposto tramite Easychair entro il 14 Febbraio 2025. Il link Easychair per l'invio è riportato di seguito.\n\nL'abstract deve essere in formato PDF e deve contenere le seguenti informazioni:\n\\- Nome e cognome del relatore\n\\- Istituzioni e ruoli ricoperti dal relatore\n\\- Breve biografia del relatore\n\\- Titolo del contributo\n\\- Abstract della presentazione\nLa presentazione non deve superare le 2 pagine complessive. Non sono previsti ulteriori requisiti di formattazione.\nLa durata prevista degli interventi proposti è di 20 minuti.\nLe presentazioni saranno esaminate dal comitato di programma e le proposte di intervento più interessanti saranno selezionate per la conferenza.\n\n  : 14 Febbraio 2025\n  : 21 Febbraio 2025\n: 13 Marzo.\n\n : [https://lnkd.in/dzGHvz7Q](https://lnkd.in/dzGHvz7Q)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Meeting ",
        "date": "2025-03-17",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/305846032",
        "timezone": "America/New_York",
        "description": "Monthly local meetup to discuss security related topics."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "OSINT for Cyber Offense",
        "date": "2025-03-13",
        "time": "14:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/306476264",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n• Tool dan standar keamanan aplikasi\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n• Kendali keamanan dan pustaka standar\n• Cabang lokal di seluruh dunia\n• Riset terkini\n• Konferensi lengkap di seluruh dunia\n• Mailing list\n• Dan banyak lagi … di www.owasp.org\nKali ini di OWASP ID akan membahas :\n1. OSINT for Cyber Offense\nSpeaker :\nHidayat - IT Security Analyst PT SGI ASIA\n\nabtract :\nOSINT memperkuat tahap reconnaissance dalam offensive security dengan mengidentifikasi vektor serangan potensial, termasuk eksposur aset digital, kebocoran kredensial, dan konfigurasi yang rentan sebelum dilakukan eksploitasi aktif. Dalam operasi red teaming, OSINT memungkinkan perancangan skenario serangan berbasis intelijen yang lebih presisi, mensimulasikan teknik, taktik, dan prosedur (TTPs) yang digunakan oleh Advanced Persistent Threats (APT). Pemanfaatan OSINT yang terstruktur dan berbasis automasi memungkinkan organisasi untuk melakukan threat modeling yang lebih akurat, mengantisipasi potensi risiko secara proaktif, serta merancang strategi mitigasi sebelum ancaman terealisasi.\n\nShort Bio:\nSaya Hidayat (26 tahun), seorang Security Analyst di PT Systech Global Informasi dan penulis di OSINT Ambition serta OSINT Team. Ia memiliki berbagai sertifikasi keamanan siber, termasuk OSCP, SecurityX, Security+, Pentest+, CySA+, CPSA, CRT, eWPTXv2, dan OSC (Osint Certified) dari OSMOSIS. Dengan keahlian di OSINT dan penetration testing."
    },
    {
        "group": "Klagenfurt",
        "repo": "www-chapter-klagenfurt",
        "name": "OWASP Klagenfurt Meetup #spring-edition ",
        "date": "2025-03-10",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-klagenfurt-chapter/events/306530301",
        "timezone": "Europe/Vienna",
        "description": " **Welcome to the third OWASP Meetup in Klagenfurt!**\n\n **Topic: ISO 27001 & Operational Technology (OT)**\nOur main talk will provide exciting insights into **ISO 27001**, presented by **Philipp Wernig**. Following that, **Andreas Happe** will introduce us to the world of **Operational Technology (OT)**.\nOf course, we’re not limited to these topics—we’re happy to discuss any security-related subjects that interest you!\n\n **Agenda:**\n **Welcome & Introduction** (10 min)\n **Talk: \"ISO 27001\"** – Philipp Wernig (20 min)\n **Talk: \"OWASP OT\"** – Andreas Happe (20 min)\n **Open Discussion & Networking** (30 min)\n\n‍ **Who is this Meetup for?**\nWhether you're a developer, a security professional, or just curious about cybersecurity, this event is for you! Beginners and experts alike are welcome. Our goal is to build an open and engaged community where knowledge and experiences in security can be shared.\nBring your questions, insights, and curiosity—together, we can make the internet a safer place!\n\nJoin us, learn, discuss, and connect—we’re looking forward to seeing you! "
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#09 The Truth",
        "date": "2025-04-02",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/306589128",
        "timezone": "Europe/Lisbon",
        "description": "We continue on track to meet our goal of doing at least one event per quarter so without further ado, it's time for our second OWASP Lisboa event of 2025 \n\nThe meetup takes place on April 2nd, 2025, at 18:00, and is sponsored by INSCALE and AP2SI.\n\nThe venue is the INSCALE Office at [Av. da Liberdade 36](https://maps.app.goo.gl/DkSqfPSvRb7XKjrN9), 8th floor.\n\n Enter the building and take the elevators on the left to the 7th floor. Go through the black door on the left and go up one flight of stairs to the 8th floor. You will have arrived at your destination.\n\nThe schedule is the following:\n18:00 - **Quick intro** by the OWASP Lisboa chapter leadership team\n18:15 - **APIs: The Silent Weapon of Social Engineering** by Teresa Pereira\n19:00 - **\\~Jedi\\~GenAI Mind Tricks - Are these the secure chatbots you’re looking for?** by Bruno Morisson\n20:00 - **Drinks & Dinner** by INSCALE\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks:**\n\nTitle: **APIs: The Silent Weapon of Social Engineering**\nSpeaker: **Teresa Pereira**\nAbstract:\nThis talk delves into the pervasive yet often overlooked role of APIs in the realm of social engineering. Through a comprehensive exploration of case studies, security vulnerabilities and ethical considerations, this talk uncovers the hidden risks associated with APIs and gives you proactive measures to mitigate the potential for social engineering attacks facilitated by these silent weapons.\n\nBio:\nTeresa Pereira, also known as starmtp, is a Cyber Threat Hunter at Siemens Energy with expertise in penetration testing, red teaming, API security, and threat hunting. Previously at KPMG Portugal, she specialized in vulnerability exploitation, OSINT, social engineering, and API pentesting.\n\nA dynamic and engaging speaker, Teresa has shared her expertise at prominent events, including apidays Paris 2023, apidays London 2024, the Geek Girls Portugal Conference 2024, apidays Paris 2024 and OWASP Porto Meetup. Her professional credentials include API Security Certified Professional (ASCP) and Certified in Cybersecurity (CC).\nRanked among the top 4% on TryHackMe, Teresa is a Women in Security and Privacy (WISP) Volunteer, an APIsec University Ambassador, and also co-leads the OWASP Leiria Chapter, where she actively supports the cybersecurity community. She developed the course \"Getting Started in API Pen-Testing\" for APIsec University and authored the insightful article \"How Can HTTP Status Codes Tip Off a Hacker?\".\n\nIn 2024, Teresa was named API Security Person of the Year (ASPY) by the APIsec University board. In 2025, she created a room on TryHackMe entitled \"Vulnerability Chaining\".\n\nWith a degree in Computer Engineering and a strong passion for mentoring, Teresa is dedicated to advancing cybersecurity awareness and resilience across diverse industries.\n\n[https://pt.linkedin.com/in/maria-teresa-pereira](https://pt.linkedin.com/in/maria-teresa-pereira)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **\\~Jedi\\~GenAI Mind Tricks - Are these the secure chatbots you’re looking for?**\nSpeaker: **Bruno Morisson**\nAbstract:\nAfter experimenting with various public challenges on LLM chatbots—like Gandalf, PromptAirlines, and more—I decided to build my own. Not just to understand how LLMs work, but to see how easily I could break them.\n\nIn this talk, I’ll dive into the security risks of Generative AI, particularly LLM chatbots, and explore vulnerabilities that are often overlooked. From sensitive information disclosure to prompt injections and jailbreaking, I’ll walk through real-world examples showing just how these systems can be manipulated.\n\nNo tinfoil hat required.\n\nBio:\nBruno Morisson is a seasoned cybersecurity expert with over two decades of experience in offensive security, penetration testing, and red teaming. As the Partner and Offensive Security Services Director at Devoteam Cyber Trust, he leads world-class security testing across web and mobile applications, IoT, OT/SCADA, and threat-led penetration testing frameworks like TIBER-EU and DORA.\n\nBeyond his professional work, Bruno is a driving force in the cybersecurity community. He is the founder and organizer of BSidesLisbon, Portugal’s top security conference, and serves as a CREST Europe Council member, helping shape industry standards. His research contributions include multiple CVE disclosures, Metasploit modules, and publications on SAP security, honeypots, and Linux audit systems.\n\nBruno holds an MSc in Information Security from Royal Holloway, University of London, alongside an impressive list of certifications, including OSCP, CISSP, CISA, and GIAC GPEN.\n\nAnd in case you were wondering—yes, this entire bio was generated by GenAI.\n\n[https://www.linkedin.com/in/morisson/](https://www.linkedin.com/in/morisson/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Mar 26, 2025",
        "date": "2025-03-26",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091939",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: The Attacker’s Distributed Supercomputer: Your Browser\nJoin us for great networking, dinner and drinks, and see a presentation by **Jerry Hoff,** Principal Security Strategist, **SquareX**\n\n**ABSTRACT**:\nAs the browser transforms into the primary computing platform, new vulnerabilities are surfacing that existing security architectures are not prepared to tackle. This gap leaves enterprises exposed to risks like client-side exploits, unmonitored communication channels, and last-mile reassembly tactics, which exploit the browser's complexity beyond the reach of traditional tools.\nThis talk explores how the shift to browser-centric workflows has uncovered a critical weak spot at the very heart of organizations around the world, currently unprotected by conventional security measures, allowing both internal and external threat actors to bypass controls\n\n**Thanks to our SPONSOR**: *[Mend.io](https://www.mend.io)*\n*PROACTIVELY MANAGE APPLICATION RISK*\n*Mend.io equips your dev and security teams with tools to build a mature AppSec program, reducing risk and boosting security.*\n\n**Thanks to our HOST**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Futurecon Cybersecurity Conference - Los Angeles, CA",
        "date": "2025-03-20",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306092077",
        "timezone": "America/Los_Angeles",
        "description": "OWASP LA invites our meetup membership to participate in the annual 2025 ***[Futurecon Cybersecurity](https://futureconevents.com/events/los-angeles-ca-2025/)*** conference which will take place March 20, 2025 at the Hilton Los Angles Airport. *Space is limited* so \\*\\*[Register Now](https://www.engagez.net/node/1842956?)\\*\\* using code **OWASPLA** to receive your complimentary ticket.\n\nJoin us for a day with multiple illuminating presentations and a panel discussion featuring C-level executives who have effectively mitigated the risk of Cyber Attacks, demo the newest technology, and discover the cutting-edge security approaches to prepare you for the future of the Cyber World. Check out the list of [[speakers and the agenda](https://futureconevents.com/events/los-angeles-ca-2025/#event-agenda)] and **don't forget** to visit the **OWASP LA** booth!\n\nYou will hear from our esteemed speakers while gaining up to 10 CPE credits. Immerse yourself in the latest cybersecurity developments to gain valuable insights in today’s dynamic threat landscape. Learn how to effectively manage risk, demo the newest technologies from an array of different sponsors, and network with your local community.\n\nDon't miss this amazing opportunity to attend this conference and expand your knowledge or brush up on what you already know. \\*\\*[Register Now](https://www.engagez.net/node/1842956?)\\*\\*"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "CIOArena   Conference - Los Angeles, CA",
        "date": "2025-03-12",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306092048",
        "timezone": "America/Los_Angeles",
        "description": "The **CIOarena** Annual Events for IT & CyberSec Leaders will take place on March 12th 2025 at Sheraton Grand LA, 711 S Hope St. CA.\n**Benefits**\n\n* Compact agenda with CIO panel discussion and industry experts covering the latest industry trends around AI, Cybersecurity, Cloud, Digital Transformation, Data & Analytics, and IoT\n* Excellent networking opportunities with local peers in a comfortable environment\n* 100% complimentary access with parking included\n* A certificate of completion good for 5 CPE credits\n* Invitation-only ensures there is zero solicitation from non-sponsor participants (no sales, marketing, consulting or similar is permitted)\n* Meet and learn about our select group of cutting edge solution providers & sponsors\n* Compare and contrast recent successes and pitfalls with peers at round tables\n* Enjoy a luxury venue accompanied by a five-star breakfast and lunch feast at no cost\n* A prize raffle with high-ticket items (past has included: Apple products, tablets, gift cards, drones, TVs, vacations, exotic car rentals, and more)\n* Walk away with fresh insights and new connections to propel you in your current role and benefit your organization\n\nThe event is free and by **invitation or referral only**. When registering be sure to enter \"OWASP\" in the referral section. **If qualified**, you'll receive further communication and details from **CIOarena**, please complete the [registration form](https://www.cioarena.com/in-person/) to be considered for attendance. Completing this form does not guarantee you a seat at CIOarena until a member of our team has contacted you with a confirmation email within 24 hours.\n\nDon't miss this amazing opportunity to attend this conference and expand your knowledge or brush up on what you already know. \\*\\*[Register Now](https://www.cioarena.com/in-person/)\\*\\*\n\n/\\*\\* APPROVAL REQUIRED after registration \\*\\*/\nAnd finally **don't forget** to visit us at the OWASP Los Angeles booth!"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Who’s Engineering Your Socials? Let's Talk About Social Engineering!",
        "date": "2025-03-21",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/306117364",
        "timezone": "Europe/London",
        "description": "Hello & Welcome!\n\nIn this session we'll be discussing social engineering with Holly Grace Williams!\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, **you will need to register with your full name** when signing up to the event.\n\nPlease note this event will be recorded so we can put these talks on our YouTube channel afterwards.\n\n**6:00 - Open doors & networking & drinks**\n\n**6:30 - MD Shafquat Hossain Khan - Social Engineering in**\n**the Age of Deepfakes**\nSocial engineering has long been one of the most effective\ntechniques for cyber attackers, exploiting human trust to\nbreach systems. With the rise of deepfake technology, attackers\nnow wield tools that blur the line between reality and\ndeception, and the stakes have never been higher. This talk\nexplores how deepfakes are revolutionizing social engineering\ntactics, providing real-world examples of deepfake-enabled\nphishing, impersonation, and disinformation campaigns.\n\n**7:15 - Refreshments (Food & Drinks & Networking)**\n\n**8:00 - Holly Grace Williams - Breaking into Computers and Buildings For a Living.**\nInformation Security these days has a strong focus on cyber security but you there's more to security than shouting at computers. In this talk Holly will cover how technical, social, and physical attacks can be combined to cause significant impact with low effort. This story covers how to break into buildings and hang out in other peoples offices in the name of c̷y̷b̷e̷r̷c̷r̷i̷m̷e̷ security testing.\n\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nGM Digital Security Hub (DiSH)\n47 Lloyd Street · Manchester\nM2 5LE\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**MD Shafquat Hossain Khan**\nA cybersecurity professional with a passion for offensive security, ethical hacking, and penetration testing. He holds a BSc in Computer Science from Swansea University and has earned certifications such as the Google Professional Cybersecurity Certificate, CompTIA Security+, and ISC2 Certified in Cybersecurity (CC). Currently studying for the CompTIA PenTest+, he actively develops his skills through hands-on projects, including building a phishing attack simulator, developing a host-based intrusion detection system, and diving deeper into the realm of ethical hacking.\nOutside of cybersecurity, Shafquat enjoys gaming—both as a player and a designer, working on his own surreal, narrative-driven video game. He also makes music, spends time discovering new artists, and is currently learning to play the guitar (though he won’t be headlining any concerts just yet). Whether it’s hacking, game design, or jamming out, he’s always looking for the next thing to master.\n\n**Holly Grace Williams**\nHolly Grace Williams is the Managing Director at Akimbo Core, a cybersecurity firm based in the UK. She has been working in cybersecurity since 2007, with a focus on penetration testing, training, and cybersecurity consultancy.\n\nHolly Grace is a CREST Fellow and has been a CREST Certified Application Tester since 2015. She has performed a significant number of penetration testing engagements for a wide range of companies from innovative start-ups to multinational corporations – in fields ranging from e-commerce to banking.\n\nHer expertise spans various areas of cybersecurity, such as web application security, infrastructure security, and cloud security.\n\nHolly is also an influential public speaker and media commentator, having appeared on platforms like Sky News and BBC, and she frequently speaks at cybersecurity conferences.\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**DiSH** \\- Venue Sponsor\n**Pen Test Partners** \\- Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - April 2025 Meetup",
        "date": "2025-04-02",
        "time": "18:00+11:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/306491717",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nHappy new year! We're back into the swing of things. We found the \"Lean Coffee-style\" format worked well in 2024, so we're back with it once again as a place for AppSec practitioners to share their knowledge. We're looking forward to the AppSec discussions we had once again.\n\nWe're starting the year again at [YOI Indonesian Fusion](https://yoirestaurant.com.au/) as our location for April. On Wed, 2nd April 2025 6PM, there we shall meet. We aim to meet the 1st Wednesday every month from April to October.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic. )*\n\n**Please remember to update your RSVP if you can no longer attend.** Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get. We will take note of no-shows, and to make sure we've got space for those that do actually attend, your RSVP may be deprioritised for future events.\n\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is[ inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics. *You are expected to participate in the AppSec/ProdSec conversations constructively if you attend*. This isn't the place for BizDev focused conversations.\n\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": " AI is here for business users. What does that mean for AppSec?",
        "date": "2025-03-12",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/304456309",
        "timezone": "America/Chicago",
        "description": "Gone are the days where you needed to have a coding background in order to create apps, automate processes, or reduce the need for manual tasks. Now, emails and communications are sent quicker, code is written faster, and applications are built en masse. Business users are enabled and empowered in ways we never dreamed of even 12 months ago. Thanks to the injection of AI into essentially every business productivity tool, from email to business intelligence to application development, business users are able to get more done without needing IT or dev teams to get involved. However, as is often the case, productivity and ease can come at the expense of security if not controlled properly. As people are brought closer to technology through the use of Gen AI tools and Copilots, security teams are facing difficult decisions on whether to clamp down on the use of these tools, or staring down increased likelihoods of data leakage and exfiltration. For a long time, security has been seen as a business blocker, but the introduction of Gen AI is forcing a reset on organizations that presents an opportunity for security to act as a business enabler."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "Cyber Booked 2025",
        "date": "2025-03-19",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/306114546",
        "timezone": "Europe/Amsterdam",
        "description": "  n o! \n\n Cyber Books + Boekenweek = a match made in literary cyber heaven \n\nWe are thrilled to announce the     in collaboration with the esteemed Dutch Chapters of [ISACA NL Chapter](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) [ISC2](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) and the [Secure Software Alliance](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) (SSA).\n\nThis event is unique in itself wherein it brings together the brightest minds in    to explore cutting-edge books and ideas. After a huge success from last year , this year, we are more excited to bring to you several renowned authors who will share their , ,   in the cybersecurity field.\n\n    :\n• [Ali Abdollahi](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) – A Beginner’s Guide to Web Application Penetration Testing\n• [Brenno de Winter](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) – De Validatiecrisis\n• [Geert Baudewijns](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) – Onderhandelen in het duister\n• [Mark Butterhoff](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) – Digital Security Leadership\n• [Ramses Sloeserwij MBA](https://www.linkedin.com/company/89220972/admin/page-posts/published/?share=true#) – Code Rood\n\nDont miss out this unique opportunity to learn from industry experts and connect with like-minded peers in IT, GRC and CyberSecurity. Plus, you'll have the chance to engage directly with the authors after the presentations!\n\n : 19 March 2025\n : 17:00 - 20:45 (3 CPE points)\n : Van der Valk Hotel Utrecht\n **Registration Link**: https://lnkd.in/eXGaQ6pv\n\nLooking forward to seeing you all there!\n\nPlease note : It is important that you register for the event via the registration link above with your full name to attend and to get the relevant CPE points.\n\nRegistering just via the Meetup page will not guarantee your admission."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2025-03-11",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/305744864",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2025, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe present an introductory talk about the OWASP Top 10 (2021 edition) with a new item each meeting.\n\nOur Top 10 topic for March 2025 will be **A06:2021 - Vulnerable and Outdated Components**.\n\n**Technical Topic Speaker:** Jagan Boda (Jay)\n**Talk Title:** OWASP IoT Top 10 and Wi-Fi Security Best Practices and Attacks\n\nIn my presentation, I will explore the growing interconnectedness of devices has brought both convenience and risk, especially with the rise of the Internet of Things (IoT). In this session, we’ll start by exploring the OWASP IoT Top 10 vulnerabilities. From there, we’ll transition into Wi-Fi security, discussing the critical role Wi-Fi networks play. We’ll dive deeper into both personal and corporate Wi-Fi attacks and examine common threats. Finally, we’ll touch on securing Wi-Fi networks, with a brief focus on both home and enterprise environments. By the end of the session, attendees will have a comprehensive understanding of the attack vectors targeting IoT and Wi-Fi networks, along with practical insights for mitigating these risks.\n\n\\-\\-\\-\\-\n\nWe're always looking for presenters and topics for future meetings - contact Austin (austin.chamberlain@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be Austin talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2025-03-11",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/305744832",
        "timezone": "Pacific/Auckland",
        "description": "This is the regular OWASP Auckland Meetup schedule.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for November will be **A06:2021 - Vulnerable and Outdated Components**.\n\n**Technical Topic Speaker:** Jagan Boda (Jay)\n**Talk Title:** OWASP IoT Top 10 and Wi-Fi Security Best Practices and Attacks\n\nIn my presentation, I will explore the growing interconnectedness of devices has brought both convenience and risk, especially with the rise of the Internet of Things (IoT). In this session, we’ll start by exploring the OWASP IoT Top 10 vulnerabilities. From there, we’ll transition into Wi-Fi security, discussing the critical role Wi-Fi networks play. We’ll dive deeper into both personal and corporate Wi-Fi attacks and examine common threats. Finally, we’ll touch on securing Wi-Fi networks, with a brief focus on both home and enterprise environments. By the end of the session, attendees will have a comprehensive understanding of the attack vectors targeting IoT and Wi-Fi networks, along with practical insights for mitigating these risks.\n\n\\-\\-\\-\\-\n\nWe're always looking for presenters and topics for future meetings - contact Austin (austin.chamberlain@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be Austin talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Adversarial Intelligence: Redefining AppSec through the eyes of an attacker",
        "date": "2025-03-27",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/306412934",
        "timezone": "America/Los_Angeles",
        "description": "We have our normal room back! No more attendance cap, so RSVP and come.\n\n**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, March 24th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: [http://twitch.tv/owaspoc](http://twitch.tv/owaspoc)\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Abstract**\nThis presentation explores Adversarial Intelligence - an approach that views application security from an attacker’s perspective. Drawing from vulnerability research experience at the NSO Group and building Pegasus, the speaker will highlight how overlooked low and medium vulnerabilities can be combined to execute successful attacks. By examining attack chains and application runtime behavior, attendees will see how gaps often missed by traditional methods are exposed. Attendees will learn about effective tools and techniques for detecting and mitigating these threats, especially in cloud-native and distributed systems. Designed for security practitioners and academics, this session provides a deeper understanding of defending against sophisticated attackers by adopting their mindset."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-03-13",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181943",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa March 19th 2025:  From SBOMs to xBOMs to Transparency",
        "date": "2025-03-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/306521237",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in-Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **\"From SBOMs to xBOMs to Transparency\" with Pavel Shukhman**\n\n**Abstract:**\nWe will discuss problems that are currently solvable by OWASP CycloneDX and its ecosystem (Vers, Purl, TEA) as well as use-cases that either don't have solutions or have inefficient solutions. The talk would include a brief demonstration of OWASP Dependency-Track showing real-world SBOM data from Reliza's open source Rebom project.\n\n**Speakers:**\n**Pavel Shukhman** is Co-Founder and CEO of Reliza. He leads company efforts in building a supply chain security system managing software and hardware metadata, including xBOMs, strict versioning, identification and various attachments. Previously, Pavel for more than ten years was leading software teams and supporting organizations in implementation of DevOps and DevSecOps best practices. He holds a Master of Computer Science degree from the University of Illinois Urbana-Champaign."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Argo Lounge",
        "date": "2025-03-27",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916102",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Social Drinks & Argo Lounge\n\n**When?**\n\n* \\- Thursday 27th March\n\nEverybody welcome!\nThank you,\nRyan & Mark"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "April 2025 Meeting",
        "date": "2025-04-01",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/306585306",
        "timezone": "America/Phoenix",
        "description": "**The Attacker’s Distributed Supercomputer: Your Browser**\n\nAs the browser transforms into the primary computing platform, new vulnerabilities are surfacing that existing security architectures are not prepared to tackle. This gap leaves enterprises exposed to risks like client-side exploits, unmonitored communication channels, and last-mile reassembly tactics, which exploit the browser's complexity beyond the reach of traditional tools.\n\nThis talk explores how the shift to browser-centric workflows has uncovered a critical weak spot at the very heart of organizations around the world, currently unprotected by conventional security measures, allowing both internal and external threat actors to bypass controls"
    },
    {
        "group": "Pittsburgh",
        "repo": "www-chapter-pittsburgh",
        "name": "Security Journey Secure Coding Tournament",
        "date": "2025-03-20",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-pittsburgh-chapter/events/306352530",
        "timezone": "America/New_York",
        "description": "Join us for a competitive experience for learners, where they will use the security journey platform to complete hands-on lessons or coding exercises in exchange for tournament points. This tournament welcomes developers and non-developers alike."
    },
    {
        "group": "Sao Paulo",
        "repo": "www-chapter-sao-paulo",
        "name": " OWASP SP - Meetup Virtual - 2025",
        "date": "2025-03-11",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-sao-paulo-chapter/events/306425104",
        "timezone": "America/Sao_Paulo",
        "description": "**Palestra: Trusted Exploits: Escalando Ataques Usando Superfícies Confiáveis e Bypass de WAFs**\n\n**Palestrante**: Ricardo Martin\n**Descrição:** Nesta palestra, exploraremos como atacantes utilizam superfícies confiáveis para bypassar WAFs e escalar ataques a partir de vulnerabilidades subestimadas, como Open Redirects, HTML Injection e XSS. Serão apresentados cenários reais onde empresas aceitam determinadas falhas, permitindo que invasores abusem da confiança em domínios legítimos para explorar aplicações de forma avançada. Além disso, discutiremos técnicas modernas de elevação de injeção, mostrando como pequenas brechas podem se tornar vetores críticos para comprometimento de sistemas.\n\n**SOBRE A OWASP SÃO PAULO**\nA OWASP São Paulo é um dos capítulos brasileiros entre os mais de 270 ativos em todo o mundo. O objetivo é disseminar a missão da fundação, tornando a segurança das aplicações visível para que as pessoas e as organizações possam tomar decisões conscientes sobre os verdadeiros riscos que correm.\n\nSão realizados encontros periódicos para compartilhamento de conhecimentos, discussão de temas e aprendizado sobre segurança de software."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "OWASP Seattle Cyber Social Mixer",
        "date": "2025-03-20",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306480968",
        "timezone": "America/Los_Angeles",
        "description": "Join us for the **a Cyber Mixer Social**, hosted by **OWASP Seattle**! This is your chance to connect with the **AppSec and broader cybersecurity community** in a fun, relaxed atmosphere, with great conversations and new connections.\n\nThanks to our generous sponsors, **[Red Canary](https://redcanary.com/) and [Palo Alto](https://www.paloaltonetworks.com/)**, we’ll have **free drinks and food**—so come hungry, come thirsty, and come ready to meet fellow security pros from across the industry.\n\nWhether you're deep in **application security**, part of the **broader cyber community**, or just looking to expand your network, this is the perfect place to mix, mingle, and unwind.\n\nCasual, low-key, and all about the people—**don't miss out!**\n\nAny questions or suggestions, message the [OWASP Seattle Chapter](https://www.linkedin.com/company/owasp-seattle-chapter/) or contact [Eva Benn](https://www.linkedin.com/in/evabenn/)."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Vana Khurana: Data Protection in the Cloud",
        "date": "2025-03-12",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306111347",
        "timezone": "America/Los_Angeles",
        "description": "Data protection issues specific to the cloud include challenges like shared responsibility, multi-tenancy risks, data sovereignty, and insufficient encryption practices, which can lead to data breaches, loss, or unauthorized access. Additionally, risks such as vendor lock-in, lack of visibility, misconfigurations, and insider threats require careful management of access controls, compliance, and security practices to safeguard sensitive data in cloud environments. This session will focus on data protection specific to cloud.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Mar 2025 OWASP Meetup: Securing AI Deployment: Overcoming Challenges in Security",
        "date": "2025-03-18",
        "time": "18:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/306550441",
        "timezone": "Asia/Singapore",
        "description": "This session will focus on addressing the key deployment and security challenges faced by enterprises when integrating AI technologies. We will explore strategies to optimize training data throughput, simplify inference data management, and ensure robust security to protect AI models and sensitive data. Join us to learn how to unlock the potential of AI while safeguarding your organization's assets.\n\nMany thanks to F5 Singapore for sponsoring the venue and food! Come early, enjoy free food and inter-mingle with OWASP enthusiasts."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - Tools and research @ Detectify",
        "date": "2025-03-20",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/306491096",
        "timezone": "Europe/Stockholm",
        "description": "**Join us** for the first OWASP event of 2025, where we'll explore the incredible potential of open source tools in security! This time we will have 2 speakers, and the possibility to join either in person or remote (please specify your preference during registration as seats are limited!)\n\n **When:** 20th of March, 17:30 - 21:00\n **Where:** Medborgarplatsen 25, Detectify AB\n\n **Agenda:**\n17:30 - 18:00 Gathering and mingling\n18:00 - 18:05 Doors close and intro\n18:05 - 18:50 First speaker (Guillaume Valadon - Scapy in 0x30 Minutes)\n18:50 - 19:10 Break, light food will be provided\n19:10 - 19:55 Second speaker (Dr. Emre Süren - Offensive security in the AI revolution)\n19:55 - 20:00 Closing words\n20:00 - 20:55 Mingle\n\n**More about the talks:**\n\n**Scapy in 0x30 Minutes**\nScapy ([https://www.scapy.net](https://www.scapy.net/) & [https://github.com/secdev/scapy](https://github.com/secdev/scapy)) is a powerful Python-based interactive packet manipulation program and library. It can be used to forge or decode packets for a wide number of protocols, send them on the wire, capture them, match requests and replies, and much more. This presentation will describe its main features step by step, and will give you hints to experiment by yourself.\n\n**Offensive security in the AI revolution**\nVulnerability research on the AI attack surface is not just important—it is the thin line between innovation and catastrophe. The AI revolution has granted everyone unprecedented power, so the arm race is on between whitehat and blackhat actors. By embedding AI into the core of vulnerability research, we don’t just strengthen digital defenses—we redefine resilience. This presentation will explore real-world examples of how mainstream LLMs can be poisoned and will introduce the research currently being conducted in our lab to uncover weaknesses before malicious actors can exploit them.\n\n**‍About the speakers:**\n\n**Guillaume Valadon**\nJoining us remotely, Guillaume is a Cybersecurity Researcher at GitGuardian. He likes looking at data and crafting packets. In his spare time, he co-maintains Scapy and learns reversing embedded devices. Also, he still remembers what AT+MS=V34 means! Guillaume regularly gives technical presentations, classes and live demonstrations, and write research papers for conferences and magazines.\n\n**Dr. Emre Süren**\nDr. Emre Süren is a researcher at Cybercampus Sweden, the National Cybersecurity Research Center. As the manager of the Royal Hacking Lab, he leads research teams focused on LLM security, IoT hacking, threat intelligence, and memory forensics. In addition to his research, he teaches digital forensics at KTH Royal Institute of Technology."
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "5th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-04-01",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305623607",
        "timezone": "Europe/Berlin",
        "description": "**TBD**\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-March Lunch and Learn",
        "date": "2025-03-28",
        "time": "11:15-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/306053484",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-March Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\n* 11:15am - Registration and Lunch\n* 12:00pm - Speaker - Chris Fago - AI is here for business users. What does that mean for AppSec?\n* 1:00pm - Depart\n\n**Speaker**:\nChris Fago is a cybersecurity sales guy at Zenity with a knack for pretending to be more technical than he probably should.\n\nAt Zenity he's focused on helping solve the emerging security challenges tied to AI agents and low-code development—showing enterprises “How to fail at AppSec” or what didn’t work for others so they can close gaps often overlooked by traditional security tools in this new threat vector.\n\nPreviously, as a founding team member of Prisma Cloud (now part of Palo Alto Networks), he helped grow it into a market-leading CNAPP. During that time, Chris worked with major U.S. brands on complex digital transformations, helping them secure their cloud migrations and maybe even picking up a thing or two about Kubernetes.\n\nOutside of work, Chris loves spending time with his family, hanging out at Atlanta’s botanical gardens and aquarium, obsessing over UFOs, and staying hopelessly devoted to Atlanta’s sports teams (despite the emotional toll they consistently deliver).\n\n**Abstract**:\n**AI is here for business users. What does that mean for AppSec?**\nGone are the days when coding skills were needed to create apps, automate processes, or reduce manual tasks. With AI now embedded in tools like email, business intelligence, and app development, business users can accomplish more without relying on IT or dev teams. However, this boost in productivity can come at the expense of security if not properly managed. As Gen AI, Copilots, and Agentic AI bring users closer to technology, security teams face tough choices: limit tool usage or risk data leakage. Traditionally seen as blockers, security teams now have the chance to transform into business enablers thanks to AI.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W,\nSTE 600\nTampa, FL\n33607\n\n**Sponsors**:\nZenity - [https://www.zenity.io/](https://www.zenity.io/)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "How to Utilize AI in Offensive Security—An Intro to Offensive AI Tooling",
        "date": "2025-03-19",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/305752677",
        "timezone": "America/Toronto",
        "description": "Want to learn how to effectively apply AI to offensive security at scale while getting real, practical results? Set sail with Dreadnode Staff Security Researcher and Founding Member of the OWASP Top 10 for LLM Applications, Ads Dawson, as he explores the various offensive AI tools that could change the game for today’s security teams.\n\nJoin us for an interactive demo of AI red team tools, Burp Suite extensions, as well as tools that assist you in building and deploying your own offensive AI agents (see: `dyana`, `robopages`, `rigging`). Plus, get a live walkthrough of a challenge in `Crucible`, Dreadnode’s CTF environment where you can practice and learn to exploit vulnerabilities in AI systems—then try it yourself!\n\nWhether you're a seasoned AI red teamer or just getting started in offensive AI, Ads will share relevant resources and knowledge to help you navigate the inevitable shift to an AI native future.\n\nhttps://crucible.dreadnode.io/\nhttps://github.com/dreadnode/dyana\nhttps://github.com/dreadnode/burpference\nhttps://github.com/dreadnode/robopages"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP UY Meetup - Marzo",
        "date": "2025-03-13",
        "time": "18:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/306231898",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY te invita a su próximo Meetup!**\n\n**Diego Franggi:** Hands-On Dive into the OWASP Top 10 for LLMs\n*En esta sesión práctica exploraremos el OWASP Top 10 for LLMs, analizando las principales vulnerabilidades en modelos de lenguaje y cómo atacantes pueden explotarlas.*\n\n**Sebastián Passaro:** OWASP Top 10 para aplicaciones de LLM 2025\n*Se recorrerá la versión 2025 del OWASP Top 10 para aplicaciones de LLM, recientemente traducida al español. Se analizará brevemente cada categoría con ejemplo de riesgo o vulnerabilidad, escenario de ataque y recomendaciones de remediación o mitigación.*\n\n**¿Cuándo?** Jueves 13/03, 18:00.\n**¿Dónde?** Qubika, José Agustín Iturriaga 3597.\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Blocking with Confidence and TRACE: a tool for supply chain security",
        "date": "2025-03-20",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510170",
        "timezone": "America/Vancouver",
        "description": "*We are doing a double header this month!*\n\n**Blocking with Confidence** with **Raphael Theberge**\nWe know that security can be cumbersome for parts of an organization. How can we lower the existing friction white maintaining our high standards?\nLearn how Relativity approached this question and reduced developer burden without sacrificing our security posture.\n\n**Raphael** is Director of Security Enablement at Relativity, where he owns all of Application Security, Vulnerability Management, AI Security and secure M&As. Previously spent time at Salesforce, Demonware, Booking.com and otherwise travelling the world.\n\n**TRACE: Securing Supply Chain One Repository at a time** with **Vrushal Nedungadi**\nThe talk will cover the motivation behind and the working of TRACE, a tool that helps detect anomalies in open source repositories that could result in vulnerabilities. This is an attempt to identify and minimize supply chain attacks and threats.\n\n**Vrushal** is a passionate software developer with a keen interest in security.\n\n**This event is sponsored by [Endor Labs](https://www.endorlabs.com/) and [Forward Security](https://forwardsecurity.com/).**"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | From Basics to Burp - Part 3: Navigating PortSwigger Academy ",
        "date": "2025-03-13",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/306014796",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter is pleased to partner with UVIC VikeSec to host the third iteration of a hands-on introduction to Burp Suite and the PortSwigger Web Security Academy. Wyatt Harvey and Sebastian Bethell will be presenting a workshop titled \"From Basics to Burp - Part 3: Navigating PortSwigger Academy\".\n\nThe event will be held on March 13, 2025 from 5:30 PM to 8:20 PM at The University of Victoria in Room 116 of the Engineering and Computer Science building.\n\nThe event will feature the workshop, an introduction to PortSwigger's Web Security Academy, and working through some of the introductory labs using Burp Suite, a comprehensive tool for performing security testing on web applications.\n\nPortSwigger's Web Security Academy is an online platform offering interactive learning materials and labs focused on web application security and instructions on how to identify and exploit a wide range of web application vulnerabilities.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and develop hands-on skills in web application hacking. If you would like to attend, please click the RSVP button to reserve your spot as we have limited seats available.\n\nBring your laptop with Burp Suite installed, your PortSwigger account ready, and join us for a hands-on evening of web application hacking and networking fun!\n\nBurp Suite Community can be installed from the following link:\n\n* https://portswigger.net/burp/communitydownload\n\n‎\nYou can register your PortSwigger account at the following link:\n\n* https://portswigger.net/users/register\n\n‎\nOnce you have Burp Suite installed and a PortSwigger account created, browse through Web Security Academy to get an idea of the content offered on the platform in preparation for the event:\n\n* https://portswigger.net/web-security\n\nWe would also like to give a special thanks to UVIC VikeSec for helping facilitate this event."
    },
    {
        "group": "Warwick",
        "repo": "www-chapter-warwick",
        "name": "OWASP Warwick Chapter ",
        "date": "2025-03-12",
        "time": "18:30Z",
        "link": "https://www.meetup.com/owasp-warwick/events/306395993",
        "timezone": "Europe/London",
        "description": "OWASP Warwick is back for the 1st event in 2025. Please come and join us for some good talks and food.\n\n#### TALKS ####\n\n#1: ** Security Culture - From “Full Metal Jacket” to “The Avengers” - Vincent Gilbert (Fundapps)\n#2: ** Threat Modelling in Engineering pipelines - Kreshnik Rexha (IBM)"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Monthly Community Call (Europe-Asia)",
        "date": "2025-03-14",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/305752916",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\n\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "March community call - OWASP SAMM",
        "date": "2025-03-12",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/306053378",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter & Women in CyberSecurity Meetup #71",
        "date": "2025-03-20",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/306217609",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to joint **OWASP Frankfurt Chapter & Women in CyberSecurity** Meetup #71!\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\nWiCyS aims to break down barriers and promote diversity in cybersecurity by empowering women and other underrepresented groups with resources for professional growth. Additionally, the organization is committed to creating a safer digital environment by supporting vulnerable individuals and advocating for inclusivity in the cybersecurity community.\n\n*What are we going to talk about?*\n\n* **AI and Machine Learning im Cybersecurity: Weapon, shield, or both?:** We are excited to welcome **Sara Rahimi**, Concierge Security Engineer at Arctic Wolf - who will explore the dual role that Artificial Intelligence and Machine Learning play in the Cybersecurity area as a powerful tool for attackers and offensive purposes, also for enhancing the defense mechanisms and detection aspects.\n* **Web 3.0 security: same fundamentals, higher stakes** - **Dr. Gulnara Hein**, CISO at Chintai, will dive into how Web3, while introducing decentralization and new security challenges like smart contract vulnerabilities and irreversible financial losses, essentially reflects the same fundamental risks as in traditional systems. By focusing on core security controls, we can effectively address these challenges without adding unnecessary complexity.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?* Our Meetup takes place on **20.03.2025** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at Arctic Wolf, located at 19th floor of Messeturm, Friedrich-Ebert-Anlage 49, 60308 Frankfurt am Main\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    }
]