[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - October",
        "date": "2024-10-29",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299786128",
        "timezone": "Europe/Copenhagen",
        "description": "**19:00 – 19:10** \\- Welcome and Introduction by Cloud\\-Native and OWASP Aarhus\n\n**19:10 – 19:55** \\- \"Securing the DevOps Pipeline: CI/CD Flaws and Supply Chain Threats\" by Mike Larsen\n\n“The software supply chain is under siege by sophisticated adversaries. High-profile breaches, such as 3CX's compromised CI/CD pipeline—where the North Korean Lazarus Group injected malicious code into widely used apps—the JetBrains TeamCity exploit, where Russian state-sponsored actors gained unauthorized admin control without user interaction, and Sisense's exposure of critical credentials through unsecured GitLab repositories, highlight alarming vulnerabilities in development workflows.\nWe'll explore how these threat actors exploit flaws in CI/CD processes. Drawing on CloudNative's experience, we'll provide strategies to strengthen your DevOps pipeline without sacrificing agility.”\n\n**19:55 – 20:10** \\- Network break with coffee\\, tea\\, water and snacks\\.\n\n**20:10 – 20:55** \\- \"Bring diversity and inclusion to tech\" by Lise Lystlund\n\n\"The tech community excels at knowledge sharing and supporting one another. Without hesitation, people from across the globe dedicate time to help others solve coding problems. To me, this reflects a welcoming and collaborative community that anyone would want to be a part of. Tech is also an appealing field, offering numerous workplace benefits and opportunities for growth. Yet, despite these advantages, the industry continues to struggle with attracting women. How is it that a group representing 50% of the population remains so underrepresented in tech—and, more importantly, what can we do to change this?\"\n\n**20:55 – 21:00** \\- Closing Remarks by OWASP Aarhus and Cloud Native"
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "The State of Secure Code + Tournament ",
        "date": "2024-10-23",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/303144193",
        "timezone": "America/New_York",
        "description": "This presentation delves into the current state of secure coding practices, focusing on technical aspects and the challenges faced by developers and security professionals. We will highlight prevalent issues such as the increasing complexity of software systems, the evolving nature of cyber threats, and the persistent gap between development and security teams. Emphasizing the importance of integrating security into the software development lifecycle, the discussion covers best practices, common vulnerabilities, and the need for continuous education and collaboration to build a robust approach to secure coding across the industry.\n\nThe presentation will be followed by a Secure Coding Tournament for any interested members."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "5. OWASP Augsburg Stammtisch",
        "date": "2024-10-23",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/304002943",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Speaker Christoph Niehoff** wird uns etwas erzählen!\n\nÜber Christoph \\(Senior Consultant \\| TNG Technology Consulting\\):\n\nIn seiner Rolle als Senior Consultant bei TNG Technology Consulting entwickelt Christoph Niehoff tagtäglich Softwareprodukte für seine Kunden. Als Fullstack-Entwickler l(i)ebt er DevOps und betreut alle Schritte des Entwicklungszyklus: angefangen bei Konzeptionierung und Architektur, über die konkrete Implementierung bis zum automatisierten Cloud-Deployment mittels CI/CD. Dabei ist ihm insbesondere die Sicherheit der Produkte eine Herzensangelegenheit. Er ist Project Lead des Threat Modeling Kartenspiels OWASP Cumulus.\n\n**Vortrag: Threat Modeling the Clouds**\n\nIn diesem Vortrag geben wir eine Einführung ins Threat Modeling als proaktive Security-Maßnahme:\n\n* Was ist es?\n* Wie macht man es?\n* Warum möchte man es machen?\n* Was sind Patterns und Antipatterns?\n\nAm Ende betrachten wir, wie man Threat Modeling speziell in agile DevOps Prozesse einbinden kann. Dabei zeigen wir einen Gamification-Ansatz, den wir am Beispiel von OWASP Cumulus erläutern.\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "OWASP Bay Area October Meetup with Pacific Hackers",
        "date": "2024-10-23",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/303802220",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming October meetup in conjunction with **Pacific Hackers**, which will be hosted by the awesome **Backslash** team at **Hacker Dojo in Sunnyvale**. Get ready for insightful discussions and the chance to network with some of the brightest minds in the industry.\n**Agenda:**\n5:30 - 6:00: Doors open, networking and food\n6:00 - 6:45: Panel discussion: **AppSec vs AppSec: Compliance-Driven Security vs. Real World Risk-Focused Innovation**\n6:45 - 7:30: **From Flat 2D to Full-Dimensional 3D: The Journey of AppSec**\n7:30-8:00: **Payment Page Security & Compliance 101**\n\n**Panel Discussion:** In today’s rapidly evolving digital landscape, application security (AppSec) professionals are often torn between meeting compliance requirements and implementing security practices that genuinely reduce risk and foster innovation. This panel will explore the tension between two competing approaches: compliance-oriented AppSec, which focuses on ticking regulatory boxes, and real-world AppSec, which prioritizes proactive risk management and innovation to address dynamic threats.\nThrough lively discussion and real-world case studies, experts from diverse backgrounds will examine the impact of compliance-heavy frameworks on security outcomes. Does compliance help or hinder organizations in effectively mitigating risk? How can security teams balance the need to meet regulatory demands while adopting cutting-edge practices that drive meaningful security improvements? Join us to gain insight into how organizations can navigate these two competing forces, ensuring that both security and innovation thrive in the evolving threat landscape.\nModerator: Trupti Shiralkar\nPanelists: Kunal Bhattacharya , Sara A, Prashant KV\n\n**Talk1: From Flat 2D to Full-Dimensional 3D: The Journey of AppSec**\nRemember when AppSec was all about flagging everything? Back in the 90s, it was like looking at security in 2D—find a vulnerability, flag it, and move on. But as applications grew more complex and moved to the cloud, this “flag everything” mindset became more of a hassle than a help. Modern apps are built differently, and with AI now writing code, there’s more of it than ever before—bringing new vulnerabilities along for the ride.\nToday, we need a 3D approach to AppSec. It’s no longer just about spotting issues but understanding their context, reachability, and real impact. Modern architecture, cloud environments, open-source software (OSS), and the rise of AI-generated code have changed the game. We need smarter tools to handle this complexity. In this talk, we’ll explore how AppSec has evolved from its humble beginnings to a dynamic, AI-aware discipline and the implications for security teams.\n**About the speaker:**\nWith a deep background in cybersecurity and cloud security, Eric Gold serves as Head AppSec Evangelist at Backslash Security. He played a pivotal role in building the evangelism efforts at Orca Security and Aqua Security. Eric has also advised startups like Panoply.io and ScyllaDB, and held executive sales roles at Couchbase, Aerospike, and DeviceScape.He began his career at Oracle and Sun Microsystems and holds a B.S. in Information and Decision Systems from Carnegie Mellon University.\n\nTalk2: **Payment Page Security & Compliance 101**\n**Abstract:** PCI DSS 4.0.1 has introduced new requirements—6.4.3 and 11.6.1—to address concerns about card skimming activities on payment pages. This has become a hot topic, with experts debating the best approach to tackle these issues. In this talk, I'll guide you through all the technical approaches you can use to address these requirements. We'll explore the pros and cons of each method.\n\n**Speaker:** Sukesh is the Co-founder of Domdog.io. He specializes in data security and privacy for web pages. Prior to Domdog, most of his work focused on web application security research and building tools in this space."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE chapter meeting (14/11/2024, Mechelen)",
        "date": "2024-11-14",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/303275189",
        "timezone": "Europe/Brussels",
        "description": "On November 14th, we organize our next OWASP Belgium chapter meeting in Lamot (Mechelen).\n\nThis event is co-located with the [CyberSecurity event \"Strategic Research and Industry Impact\"](https://cybersecurity-bites.be/cybersecurity-strategic-research-industry-impact-2nd-edition/).\n\n**Agenda**:\n\n* 17h30-19h: networking drink\n* 19h-19h10: **OWASP update**\n* 19u10-19h50: **TBD**\n* 19h50-20h30: **TBD**\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Boulder",
        "repo": "www-chapter-boulder",
        "name": "Boulder OWASP October Meetup",
        "date": "2024-10-23",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-boulder/events/303995144",
        "timezone": "America/Denver",
        "description": "The OWASP Boulder Chapter is excited to announce our October Chapter Meeting! Scheduled for Wednesday, October 23rd at the Rule4 office at 6 PM, with complimentary food, beer, and soft drinks. Join us for networking with your peers and a featured talk from Dan Moore presenting:\n\n**Protecting your API with OAuth**\n\nOAuth is a well known standard and is useful for delegating authentication and authorization decisions to a central identity provider. As a developer, you’ve given a token when a grant completes.\n\nBut what happens then? This talk will discuss client and server side code and logic needed when calling an API after you have a token. This will include how to store a token in the API client and what your API code should examine when presented with a token. discuss the building blocks for deploying a secure development process for detecting, remediating, and ultimately preventing security vulnerabilities in your software.\n\nSpecial thanks to the Rule4 Team for hosting and sponsoring, we couldn't do these events without our sponsors. If you're interested in sponsoring the #1 AppSec organization and our Boulder Chapter meetings, please reach out to alex.brown@owasp.org.\n\nPlease follow us on LinkedIn: https://www.linkedin.com/company/owasp-boulder\n\nAnd join our Slack: https://join.slack.com/t/boulder-owasp/shared_invite/zt-2qnxnmmts-IQDaobNC1rcUbpaH1ip8Lg\n\n**AGENDA**\n6:00 - 6:30 Food, Drinks, Networking\n6:30 - 7:15ish Main Topic Presentation\n7:15ish - 7:30 Q&A and Discussion\n7:30 - 8:00 More Networking"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "Cultivating Cybersecurity: Building and Sustaining a Security Champions Program",
        "date": "2024-10-30",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/303723924",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nIn an era where cyber threats are rapidly evolving and increasingly targeting application vulnerabilities, organizations face significant challenges in maintaining robust security practices. Traditional security models often lead to bottlenecks, stifling the agility needed in today's fast-paced development environments. This talk introduces the **Security Champions program**—a strategic initiative that empowers development teams to take ownership of security responsibilities, fostering a culture of proactive security throughout the software development lifecycle.\n\nWe will explore the essential components of a successful Security Champions program, including its definition, the critical role of Security Champions within development teams, and the importance of cultivating a supportive culture grounded in principles of a \"just culture.\" Attendees will learn practical strategies for building, maintaining, and scaling their own Security Champions programs, ensuring that security becomes an integral part of their organizational fabric.\nJoin us to discover how implementing a Security Champions program not only enhances security posture but also drives collaboration and innovation, ultimately safeguarding your organization against emerging threats.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments!\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "German OWASP Day 2024",
        "date": "2024-11-12",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/304040492",
        "timezone": "Europe/Berlin",
        "description": "**\\*\\*This is a paid event\\*\\***\n\nDear all,\n\nWe're proud to present a cool lineup of talks for the German OWASP Day in Leipzig on November 13th! The program committee got a solid amount of high quality submissions and thus the agony of choice.\n\n\\* Frederik Braun will present \"Modern solutions against Cross-Site Leaks (xs-leaks) and CSRF“\n\\* Thomas Barber will give us insights into the project Foxhound, a taint tracking project using a patched Firefox\n\\* Malte Wessels will display results of his research on SSRF\n\\* Shubham Agarwal will raise his voice against \"Double-Edged Crime: How Browser Extension Fingerprinting Might Endanger Users and Extensions Alike\"\n\\* Björn Kimminich is celebrating the \"OWASP Juice Shop 10th anniversary\"\n\\* While Dr. Daniel Fett will be talking about \"How (Not) to Use OAuth in 2024“,\n\\* Kristina Yasuda will tell you \"The Crucial Role of Web Protocols and Standards in Digital Wallet Ecosystems\" (EUDI Wallet)\n\\* Tim Philipp Schäfers will demystify NIS2 and hopefully NIS2UmsuCG\n\\* Diana Calderón will explore strategies for creating and implementing Security Champion programs in organisations\n\\* Hanno Böck will tell not-so-good stories about private keys\n\\* Stephan Pinto Spindler will share his experiences wrt \"Network Fingerprinting for Securing User Accounts\"\n\\* Behnaz Karimi will give us an overview of the OWASP AI Exchange project\n\\* Niklas Bunzel and Raphael Antonius Frick will explore the security challenges and opportunities posed by GenAI\n\\* Clemens Hübner will amend that showing how GenAI can help identifying threats\n\\* Florian Hantke and Sebastian Roth will show how to scan for Vulnerabilities Without Getting Into Trouble\n\\* Nicolas Schickert, Ole Wagner and Matthias Göhring will tackle most companies problem child \"SAP from an Attacker’s Perspective – Common Vulnerabilities and Pitfalls\"\n\nThe full program is on the web site [https://god.owasp.de/](https://god.owasp.de/) .\n\n**Registration is open. [Reserve your spot](https://god.owasp.de/2024/#tickets)! \\*\\*This is a paid event\\*\\***\n\nOn the 12th of November we also offer three trainings — those have to be booked separately:\n\\* OWASP Juice Shop: Advanced Demos & For-fun CTF by Björn Kimminich + Jannik Hollenbach\n\\* Getting started for establishing your Security Champions Program by Juliane Reimann + Michael Bernhardt\n\\* Building Secure Software: A Hands-On OWASP SAMM Training by Daniel Kefer.\n\nAs usual on the evening before the conference day (November 12th) there’s a get-together with food and drinks.\n\n**\\*\\*THIS IS A PAID EVENT\\*\\***"
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Indy OWASP November 2024 Meetup",
        "date": "2024-11-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/indyowasp/events/303946344",
        "timezone": "America/New_York",
        "description": "**Talk 1**\n\n**Title:** Prompt Injection with Damn Vulnerable LLM\n\n**Synopsis:** Join us for an insightful OWASP event dedicated to exploring the OWASP Top 10 for Large Language Model Applications! Dive into the latest vulnerabilities impacting GenAI-driven systems, focusing on prompt injection attacks. We'll also showcase the Damn Vulnerable LLM, a hands-on tool designed to illustrate prompt injection in real-time specifically. This meetup is perfect for developers, security professionals, and anyone interested in safeguarding GenAI applications. Don't miss this opportunity to enhance your understanding of LLM security and network with fellow enthusiasts!\n\n**Speaker:** Justin Baxtron\n\n**Bio:** Bio: Justin Baxtron has worked in the information security field for over 10 years as a consultant and engineer. He holds a GIAC Web Application Penetration Tester (GWAPT) certification and focuses on application security assessments, as well as software engineering.\n\n**Talk 2**\n\n**Title:** I Hope No One Finds Out I'm a Fraud: Dealing with Imposter Syndrome\n\n**Synopsis:**\nImposter syndrome is a real issue in professional life. It can seriously impact mental health and professional growth—especially in the security industry, surrounded by ever-changing technologies and other super-smart people. I will discuss the aspects of this issue, its impacts, and some strategies to overcome it, both for yourself and others.\n\n**Speaker:** Damian (@integrisec) Profancik\n\n**Bio:** Damian Profancik has worked as a server/network infrastructure and security consultant for more than 24 years with over the last 14+ years solely focused on information security as an Application Security Manager at Match Group, Technical Director at Optiv Security, Inc. focused on Application Security, Global Security Associate Partner and North American Regional Lead at IBM X- Force Red, Director of Application Security at Lares Consulting, Director of Security Services at iLAB, and a Principal Security Consultant at both NCC Group (formerly iSEC Partners) and Trustwave SpiderLabs.\n\nHis main focus has been on application security and vulnerability research. He has worked in this capacity both independently and for numerous companies ranging from small businesses to Fortune 100 enterprises. His work has included application penetration testing, network penetration testing, design review, and code review in 28 different computer languages.\n\nHe is actively involved in the Information Security community through speaking engagements at events such as DerbyCon, ShmooCon, CircleCityCon, OWASP, and ISSA, and he is a co-leader for the local OWASP chapter, one of the organizers for CircleCityCon, and co-founder for BSides Bloomington.\n\nVenue, food, and refreshments provided by Guidepoint."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-11-18",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242791",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-10-21",
        "time": "17:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242790",
        "timezone": "America/New_York",
        "description": "OWASP topic:\n\nWe will be discussing Capture The Flags, Juice Shop, and general cybersecurity topics."
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "A engenharia de softwares \"X\" privacidade de dados",
        "date": "2024-10-23",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/303988778",
        "timezone": "America/Fortaleza",
        "description": "**MEETUP PRESENCIAL**\n\nA OWASP se concentra muito em práticas que ajudam a mitigar os riscos de engenharia social, como a conscientização sobre ataques, treinamento de usuários e desenvolvimento de aplicações seguras. Embora a engenharia social não seja diretamente uma vulnerabilidade de software, ela pode ser uma porta de entrada para explorar outras vulnerabilidades de uma aplicação e sua correlação pode ser encontrada em A01:2021 - Broken Access Control, 04:2021 - Insecure Design e A07:2021 - Identification and Authentication Failures."
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Halloween Meetup [IN-PERSON]",
        "date": "2024-10-31",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-london/events/304059146",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted by Civo Tech Junction and sponsored by Apiiro. There is limited seating available for in-person attendees. Registration required.**\n\n**This event will be live-streamed on YouTube.**\n\n**Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Civo Tech Junction, First Floor, 32-37 Cowper Street, London, EC2A 4AW\n**Nearest Tube:** Old Street (Northern Line), Cowper Street exit - 1 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n\n**\"AI and AppSec: Are We Finally on the Verge of the Big Breakthrough?\"** - **Petra Vukmirović**\n\nIn cybersecurity, AI has made significant advances, especially in threat detection, risk quantification, and remediation automation. However, in Application Security (AppSec), it hasn’t fully reached its potential—yet.\nThis talk will explore why the next big breakthrough in AI is poised to revolutionize threat modeling and security reviews, areas traditionally plagued by manual processes, high complexity, and slow adoption in fast-moving development environments.\nWe are at the tipping point where AI can understand code deeply enough to automate threat modeling, shifting it left and removing bottlenecks in the security review process. By using AI to derive data flows, identify threats and controls, and continuously update threat models, we can potentially integrate security into the development lifecycle more effectively.\nJoin this session to discuss and discover how AI could potentially take threat modeling as code (and from code!) to the next level.\n\n\"**Proactive Risk Detection at the Design Stage\" - Ella Bor**\n\nSecurity risks can be costly when discovered late in development, and the “shift left” movement seeks to address this. This talk explores strategies for identifying potential risks during the design phase, even before coding begins. By analyzing ticketing systems with AI, development teams can identify potential risks such as insecure data handling or problematic third party integrations early on—without slowing development velocity. The discussion will highlight methods to uncover design-phase risks while using AI to propose security review questions and automatically generate threat stories on a large scale. This approach not only simplifies the design review process but also helps prevent the creation of insecure code.\n\n**Guest Talk - Speaker TBC**\n\n**RAFFLE - win a prize kindly donated by our sponsors!**\n\n**SPEAKERS:**\n\n**Petra Vukmirović (**[@PetraVuk1311](http://twitter.com/PetraVuk1311))\n\nTechnology enthusiast, leader, public speaker, believer in radical candor, ex-emergency medicine doctor, competitive athlete (volleyball) and ex-sports scholar. Petra started her cyber security career as a security engineer, climbed up the ladder to Director of Cyber Security. Love creating order out of chaos, learning and overcoming any challenges that come along my way. Always leveraging innovation and looking to implement improvements in processes and systems.\n\n**Ella Bor**\n\nElla Bor is an experienced data scientist, honed her skills across diverse industry domains, including legal-tech, e-commerce, and application security. At Apiiro, she harnesses her extensive expertise to drive innovation in application security. Ella specializes in leveraging artificial intelligence to tackle real-world challenges, developing and implementing end-to-end algorithmic solutions that automate complex tasks. Throughout her career, Ella has been dedicated to bridging the gap between theoretical research and practical application, ensuring that AI-driven solutions are both technically sound and aligned with business goals.\n\n**TICKETS:**\n\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security.\n\n**CODE OF CONDUCT:**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)\n\n**DRESS CODE:**\n\n Halloween costumes are encouraged, but not required. Feel free to get into the spooky spirit if you'd like, or come as you are!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - OCT 23, 2024",
        "date": "2024-10-23",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300687509",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Program Analysis: From Difficult to Impossible\nJoin us for great networking, dinner and drinks, and see a presentation by **Brandon Wu**, Program Analysis Engineer at **Semgrep**\n\n**ABSTRACT**: This talk is a cursory introduction into the field of static application security testing (SAST), which concerns the verification of source code for security purposes. In particular, this talk concerns the field of static analysis (a sub-field of program analysis), the art of analyzing, diagnosing, and remediating source code with computers. We will discuss the techniques and mathematical limitations of the field, which seek to answer the question: \"How can we solve a problem which is fundamentally impossible?\". An understanding of compilers will be helpful, but not necessary.\n\n**Thanks to our Sponsor**: *[CATO Networks](https://www.catonetworks.com/)*\n*One platform to connect all edges, everywhere*\n*CONNECT, PROTECT, DETECT, RUN*\n*Cato is architected to deliver on the promise of SASE: secure and optimized access for everyone, everywhere, at any scale, and to any application. Cato is focused on offloading day-to-day work from the customers' IT and minimizing the dependency on scarce skills and resources.*\n\n**Thanks to our HOST**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-10-22",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/303775946",
        "timezone": "America/Los_Angeles",
        "description": "Join us for our 4th mixer with participating cybersecurity communities in Southern California, enjoy beautiful weather, amazing sunset, great conversations, network with your peers, make new friends!\nYou **don't** have to be a member of any group to participate. Mark your calendars; see you there!!\n\n**VENDOR Opportunities Available**\n*Vendors interested in attending please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n#CSA #ISSALA #OWASPLA #CyberJutsu #ISC2LA #Cybersecurity #SafeNetworking #BuildingCommunity #Murphie #BallastPoint"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": " OOOOOOWASP - Ghosts in the Machine: A Halloween Cybersecurity Spooktacular ",
        "date": "2024-10-24",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/303387636",
        "timezone": "Europe/London",
        "description": "Hello & Welcome \n\nIn this spooky session we'll be discussing AI & it's impact on the different aspects of cyber security.\n\nAs it's so close to Halloween, costumes are encouraged, but not required ‍\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name when signing up to the event AND show photo ID when checking in to the event on the night.\n\nPlease note this event will be recorded so we can put these talks on our YouTube channel afterwards. We will also be trying out our live streaming capabilities.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**6:00 - Open doors & networking & drinks**\n**6:30 - Alsa Tibbit - Digital Fossils: Bones of APTs**\nThis talk takes the audience on a captivating journey through the speaker’s explorations in cybersecurity research. It highlights how a blend of critical thinking and Explainable Artificial Intelligence (XAI) has paved the way for an innovative approach to addressing complex cyber threats. Focusing on Advanced Persistent Threats (APTs) as a prime example, the speaker illustrates how a solution-driven mindset, enhanced by XAI, has led to groundbreaking cybersecurity advancements. This novel methodology garnered substantial support from Sheffield Hallam University and La Trobe University in Australia, creating new avenues to detect and counter cyber threats.\n\n**7:15 - Refreshments (Food & Drinks & Networking)**\n**8:00 - Leum Dunn -** **AI AIEEEE (the revenge - re-deux)**\nA fusion of mischievous ideas, distilled from presentations at B-Sides Leeds and Lancs, exploring the playful and slightly chaotic potential of AI tools. Buckle up, it’s going to be a wild ride!\n\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBooking.com\n6 Goods Yard Street Manchester\nM3 3BG\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Alsa Tibbit**\nAs a seasoned cybersecurity professional with extensive experience in academia and industry, Alsa has excelled in teaching, research, and leadership. Her notable accomplishments include authoring a £100k technical proposal and leading an Innovate project focused on machine learning, malware analysis, and data mining. In 2023, she was involved in a research project for DSIT addressing the cybersecurity skills gap in the UK, further underscoring her dedication to advancing the field.\n\nAlsa is currently involved in two key projects: one focusing on Advanced Persistent Threats (APTs) and Explainable Artificial Intelligence (XAI), and another tackling ARM architecture and Java vulnerability research. These endeavours highlight her commitment to personal and professional development as she continues contributing to the ever-evolving cybersecurity world.\n\n**Leum Dunn** *has been lurking in the shadows of the tech world for over 20 years, with the last decade spent fortifying defenses in the cybersecurity realm. His expertise shines brightest in the betting and gaming industry, though he’s also dabbled in critical national infrastructure and print manufacturing, just for fun. When he’s not safeguarding digital kingdoms, Leum can be found playing bass guitar (badly, by his own admission) or immersing himself in gothic rock and jazz noir. His talk today is a fusion of mischievous ideas, distilled from presentations at B-Sides Leeds and Lancs, exploring the playful and slightly chaotic potential of AI tools. Buckle up, it’s going to be a wild ride!*\n\n*Yes, I asked ChatGPT to write that. No, I'm not ashamed. I'm not even going to correct the spelling!*\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Booking.com** \\- Venue Sponsor AND Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Maribor",
        "repo": "www-chapter-maribor",
        "name": "Lov na zlobce",
        "date": "2024-10-22",
        "time": "21:00+02:00",
        "link": "https://www.meetup.com/maribor-owasp-meetup-group/events/303916690",
        "timezone": "Europe/Belgrade",
        "description": "Akterji, ki bi se radi dokopali do naših podatkov ali jih zašifirirali ne spijo. Iščejo (in najdejo) nove in nove načine, kako se infiltirati v naša okolja in zaobiti implementirane varnostne kontrole. Pri tem puščajo sledi, katere lahko z \"threat huntingom\" odkrijemo. V predavanju bomo spoznali threat hunting ogrodje PEAK in ga aplicirali na realne primere."
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourn October 2024 Meetup",
        "date": "2024-10-30",
        "time": "18:00+11:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/303504379",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nIt was great to see new faces last month. Thank you to those that attended.\n\nIn our last meetup, attendees voted for [YOI Indonesian Fusion](https://yoirestaurant.com.au/) as our location for next month. On 30th October 2024 6PM, there we shall meet.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic. )*\n\n**Please remember to update your RSVP if you can no longer attend.** Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get.\n\nWe're looking forward to the discussions we had once again.\n\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is[ inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics. You are expected to participate in the AppSec/ProdSec conversations constructively if you attend. This isn't the right place for BizDev focused conversations.\n\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Patients at Risk: Investigating The Healthcare Cybersecurity Crisis",
        "date": "2024-11-13",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885957",
        "timezone": "America/Chicago",
        "description": "Want to learn more about the most successfully attacked industry in the world? Here’s your chance!\n\nHealthcare organizations are facing a digital storm. Cyberattacks are increasingly successful, targeting sensitive patient data, disrupting critical services, and putting lives at risk. Facing a growing threat landscape due to increasing reliance on interconnected technologies (including IoT, IoMT, OT and IT systems), many hospitals are struggling to recover from decades of accumulated cybersecurity debt.\n\nThis presentation will explore the root causes of healthcare cyberattacks, providing real-world examples and discussing the technical vulnerabilities that make organizations prime targets. Attendees will gain insights into the emerging guidance and strategies for improving healthcare cybersecurity, as well as the debate surrounding the need for regulation in this critical sector. We will also examine the significant financial and reputational costs associated with cyberattacks and delve into the motivations and tactics of the attackers themselves.\n\nJoin OWASP Nashville and Chad Holmes as we dive deep into the world of healthcare cybersecurity. We'll explore the root causes of cyberattacks, examine real-world examples, and discuss the technical vulnerabilities that make hospitals prime targets."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "The Dark Side of Open Source Productivity with Endor Labs",
        "date": "2024-10-22",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/302832496",
        "timezone": "America/Chicago",
        "description": "Join us to meet [Jamie Scott from Endor Labs ](https://www.linkedin.com/in/james-m-scott-iii/)as we talk about The Dark Side of Open Source Productivity. We'll learn how to think through all the potential risk you inherit when using open source software and how to handle upgrade anxiety, whether that comes from breaking changes or from the unknown of the software supply chain."
    },
    {
        "group": "Noida",
        "repo": "www-chapter-noida",
        "name": "OWASP Noida October Meetup",
        "date": "2024-10-26",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/owasp-noida-chapter/events/304022117",
        "timezone": "Asia/Kolkata",
        "description": "Join us for the **OWASP Noida October Meetup**, a community-driven gathering focused on the latest trends in cybersecurity and application security. This event is an excellent opportunity for security enthusiasts, developers, and professionals to come together and share knowledge, best practices, and insights on web and mobile application security.\n**What to Expect:**\n\n* **Expert Talks:** Hear from seasoned security professionals who will share their experiences and discuss the latest techniques in cybersecurity.\n* **Networking:** Meet like-minded individuals from the security community to exchange ideas and expand your professional network.\n* **Q&A Sessions:** Engage with the speakers in interactive Q&A sessions to deepen your understanding of the topics covered.\n\nWhether you are a beginner eager to learn about cybersecurity or an experienced professional looking to stay updated on the latest developments, this meetup is for you.\n**Event Details:**\n\n* **Date:** Saturday, October 26, 2024\n* **Time:** 10 AM to 3 PM\n* **Location:** TBA\n* **Registration:** This event is free, but registration is required.\n* Also Register on: https://lu.ma/zjgb9wwg\n\nDon’t miss out on this opportunity to enhance your cybersecurity knowledge and skills! Register now and be a part of the OWASP community."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2024-11-07",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181930",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-10-31",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/303804732",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Rewa",
        "repo": "www-chapter-rewa",
        "name": "Decoding OWASP Top 10: A Blueprint for Secure Application Development",
        "date": "2024-10-20",
        "time": "16:00+05:30",
        "link": "https://www.meetup.com/owasp-rewa-chapter/events/304037499",
        "timezone": "Asia/Kolkata",
        "description": "**Decoding OWASP Top 10: A Blueprint for Secure Application Development** is a comprehensive guide aimed at developers, security professionals, and IT teams focused on building secure applications. The OWASP (Open Web Application Security Project) Top 10 is a widely recognized list of the most critical security risks in web applications. This topic unpacks each risk, explaining its relevance, potential impact, and how attackers exploit vulnerabilities.\nThe \"Decoding\" aspect emphasizes breaking down these risks in a clear, digestible manner, helping teams understand how to mitigate threats like SQL injection, cross-site scripting (XSS), and insecure deserialization. By exploring real-world examples and best practices, this blueprint equips developers with actionable strategies to enhance security throughout the software development lifecycle. It also underscores the importance of integrating security from the ground up—preventing common flaws that could lead to data breaches, system compromises, or financial loss."
    },
    {
        "group": "Scotland",
        "repo": "www-chapter-scotland",
        "name": "OWASP Scotland Chapter Meeting - October",
        "date": "2024-10-24",
        "time": "17:45+01:00",
        "link": "https://www.meetup.com/owasp-scotland-chapter/events/303941386",
        "timezone": "Europe/London",
        "description": "Join us at the OWASP Scotland Chapter Meeting where we have three talks lined up for our October session - see talk details below.\n\nPizza and drinks will be provided to the attendees.\n\nThis event is perfect for software developers, ethical hackers, and cybersecurity enthusiasts interested in learning about the latest trends in cyber security.\n\n#### *Talk 1 - A tale of two Fortiinets*\n\n**Speaker:** Jim Slaughter\n\n**Blurb:** Most large organizations monitor their brand space for infringement from things like typosquating. This can turn up interesting results at different times.\nIn July 2024, FortiGuard Labs came across one such typosquatted domain, Fortiinet.com. The domain was registered a few months prior and did an excellent job impersonating our trade dress. In addition to being an excellent facsimile, the site was also dropping an infostealer, Lumma. The goal of this presentation is to detail the efforts we took to find and investigate the domain and infostealer.\n\n**Speaker bio:**\nWho Am I?\nI'm Canadian, eh!\nCurrently a Senior Threat Intel Engineer at Fortinet\nDay-to-day responsibility for looking for \"interesting samples\", reversing them and then passing the results on to our customers and government partners.\nPrior to Fortinet:\n8 years at NatWest as the Cyber Threat Hunting and Analytics Tech Lead\n10 years at BlackBerry as a Dev\nMy hobbies match my vocation. You can usually find me tinkering with malware or code that I stick up on GitHub - https://github.com/slaughterjames\n\n#### *Talk 2 – Global Insights from Security Leaders across the Globe*\n\n**Speaker:** James Walsh\n\n**Blurb:** Explanation of findings from Hays Global Cyber Survey, looking at Talent, AI, Cyber Budgets and Risks.\n\n**Speaker bio:**\nJames Walsh CISMP- Director of Cyber Security Practice UK&I has over 14 years of experience working specifically within the Cyber Security sector supporting a variety of industries with there Talent and Project Requirements.\n\n#### *Talk 3 – Cross-Site Scripting Beyond Alert(1)*\n\n**Speaker:** Paul Johnston\n\n**Blurb:** XSS is one of the most common web application vulnerabilities. Most proof-of-concept exploits simply display an alert box, proving that JavaScript code has been executed. This talk explores what an attacker can do beyond an alert box, to maliciously exploit an XSS flaw. We investigate how browser security features such as HttpOnly cookies and Content-Security-Policy can be bypassed, in certain circumstances. And we look some difficult XSS scenarios, that are not detected by leading scanners, but can be exploited with a carefully crafted payload.\n\n**Speaker bio:**\nPaul is a security consultant at Pentest, specialising in web applications, and particularly in securing cloud-native, multi-tenant, SaaS platforms. He has worked in security for a number of year, and previously was a software developer and sys-admin."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-11-13",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539101",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - Secure Software Development Evening",
        "date": "2024-10-29",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/304021162",
        "timezone": "Europe/Stockholm",
        "description": "It's time for our next OWASP monthly event and on this occasion in keeping with security awareness month we will be looking at a core concern of OWASP; secure development.\n\nWe will have 2 speakers. First up is Johan Persson from Consid, talking about:\n\n**Principles for Secure Development**\nIn this session Johan will provide a 45min overview of how a development team should think and work around security throughout the entire life cycle of system development. The presentation will go through things like security connected to development environments, code repos, pipelines, etc.\n\nJohan will be followed by Fredrik Klasén from Snyk discussing:\n\n**Commonly Observed AI Security Issues While Using GenAI Tools in Software Development**\nFredrik will spend around 30 minutes discussing how AI-assisted coding increases your delivery speed and efficiency, but also bring risks. Fredrik will present an overview of AI in software development and commonly observed AI security issues while using GenAI tools to produce code and then exploit it. You’ll also get an insight into strategies for mitigation of AI introduced threats.\n\nWe will start the evening with a mingle at 17:30 followed by the first presentation that will start at 18:00. After the first talk there will be a 5 min break followed by the second presentation. The second talk will be followed by a further mingle/time. Light refreshments and snacks will be provided\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcoming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "Authentication is easy",
        "date": "2024-10-24",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/303642531",
        "timezone": "Europe/London",
        "description": "**The talk:** Authentication might seem simple, but implementing it securely comes with several challenges that developers need to address. In this talk I'll highlight the key pitfalls to watch out for and discuss good practices for building a secure authentication system. We'll focus on best practices, you’ll gain insights into how to avoid common mistakes and build a more robust and secure authentication process.\n\n**Speaker:** Wojciech is a software engineer with over 10 years of experience, specialising in defending applications against security threats. His focus on application security (AppSec) has led him to develop and implement secure coding practices that safeguard systems from vulnerabilities. He is passionate about building resilient software, ensuring that security is integrated into every stage of development.\n\nAgenda:\n\n* OWASP Suffolk updates\n* Authentication is easy talk\n* Q&A"
    },
    {
        "group": "Tirunelveli",
        "repo": "www-chapter-tirunelveli",
        "name": "Online Self Hosting Webinar Tamil - OWASP & Null - Tirunelveli",
        "date": "2024-10-20",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-tirunelveli-chapter/events/304093887",
        "timezone": "Asia/Kolkata",
        "description": "“Unlock the Power of Self-Hosting”\n\nJoin us for an exclusive webinar where you'll learn how to take control of your online presence by self-hosting your own applications and services! Whether you're a developer, startup founder, or tech enthusiast, discover the benefits of hosting on your own servers—offering more privacy, flexibility, and cost-efficiency.\n\nThis Event Is hosted by the Combined Community of OWASP and Null chapters of Tirunelveli"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Inference Servers: new technology, same old security flaws.",
        "date": "2024-10-30",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/303805690",
        "timezone": "America/Toronto",
        "description": "\\*\\* The event is hosted at 111 Peter St Suite 804, Toronto, ON M5V 2H1 \\*\\*\n\n**TALK**\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\n\n**Inference Servers: new technology, same old security flaws.**\n\n**Summary:**\n\nAI and LLM based applications are taking the industry by storm. While a lot time is spent on evaluating prompt injection, there is an entire ecosystem of applications that allow models to be run and used. These applications have their own important security considerations that you may not be aware of.\nInference Servers are used to host machine learning models and expose APIs that allow other components to perform inference on those models. These servers often expose additional APIs that allow users to load new models. Often, this can be abused to perform remote code execution. While this technology is new, the baseline security configurations for many of these products are a relic from the past.\nIn this talk we’ll learn about what an inference server is, how they work, and how you can achieve remote code execution in them. This talk is mainly focused on the practical security risks involved in this ecosystem. Finally, I will share details about a couple of CVEs related to TorchServe\n\n**Presenters:**\n\nPratik Amin has been an Application Security practitioner for over 15 years. He currently works as a Principal Security Consultant at Kroll (previously Security Compass Advisory). In this role, he spends most of his time performing AppSec pentests and digging into interesting technology."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup - Octubre",
        "date": "2024-10-29",
        "time": "17:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/304077194",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY te invita a su próximo Meetup!**\n\n**Diego Rosa y Guillermo Jacobi**\n¿Qué conocen de nuestra organización que nosotros no sabemos? – Huella Digital\n\n**Gerardo Canedo**\nSecure Coding Dojo: El primer paso en el desarrollo seguro\n\n**¿Cuándo?** Martes 29/10, 17:00.\n**¿Dónde?** Willinn, Zonamerica, Ruta 8 km 17.500 Edificio Explora.\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Warwick",
        "repo": "www-chapter-warwick",
        "name": "OWASP Warwick Chapter ",
        "date": "2024-10-30",
        "time": "18:30Z",
        "link": "https://www.meetup.com/owasp-warwick/events/303783244",
        "timezone": "Europe/London",
        "description": "OWASP Warwick is back for the 2nd event this year. Please come and join us for some good talks and free food !!!\n\n#### TALKS\n\n#1: **Breaking and Defending LLMs: security of state-of-the-art AI systems** \\- Lukasz Bartoszcze \\(University of Warwick\\, Cyber Security Research Group\\)\n#2: **Come to me** \\- Neil Lines \\(NCC\\)"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "German OWASP Day 2024",
        "date": "2024-11-12",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/304040492",
        "timezone": "Europe/Berlin",
        "description": "**\\*\\*This is a paid event\\*\\***\n\nDear all,\n\nWe're proud to present a cool lineup of talks for the German OWASP Day in Leipzig on November 13th! The program committee got a solid amount of high quality submissions and thus the agony of choice.\n\n\\* Frederik Braun will present \"Modern solutions against Cross-Site Leaks (xs-leaks) and CSRF“\n\\* Thomas Barber will give us insights into the project Foxhound, a taint tracking project using a patched Firefox\n\\* Malte Wessels will display results of his research on SSRF\n\\* Shubham Agarwal will raise his voice against \"Double-Edged Crime: How Browser Extension Fingerprinting Might Endanger Users and Extensions Alike\"\n\\* Björn Kimminich is celebrating the \"OWASP Juice Shop 10th anniversary\"\n\\* While Dr. Daniel Fett will be talking about \"How (Not) to Use OAuth in 2024“,\n\\* Kristina Yasuda will tell you \"The Crucial Role of Web Protocols and Standards in Digital Wallet Ecosystems\" (EUDI Wallet)\n\\* Tim Philipp Schäfers will demystify NIS2 and hopefully NIS2UmsuCG\n\\* Diana Calderón will explore strategies for creating and implementing Security Champion programs in organisations\n\\* Hanno Böck will tell not-so-good stories about private keys\n\\* Stephan Pinto Spindler will share his experiences wrt \"Network Fingerprinting for Securing User Accounts\"\n\\* Behnaz Karimi will give us an overview of the OWASP AI Exchange project\n\\* Niklas Bunzel and Raphael Antonius Frick will explore the security challenges and opportunities posed by GenAI\n\\* Clemens Hübner will amend that showing how GenAI can help identifying threats\n\\* Florian Hantke and Sebastian Roth will show how to scan for Vulnerabilities Without Getting Into Trouble\n\\* Nicolas Schickert, Ole Wagner and Matthias Göhring will tackle most companies problem child \"SAP from an Attacker’s Perspective – Common Vulnerabilities and Pitfalls\"\n\nThe full program is on the web site [https://god.owasp.de/](https://god.owasp.de/) .\n\n**Registration is open. [Reserve your spot](https://god.owasp.de/2024/#tickets)! \\*\\*This is a paid event\\*\\***\n\nOn the 12th of November we also offer three trainings — those have to be booked separately:\n\\* OWASP Juice Shop: Advanced Demos & For-fun CTF by Björn Kimminich + Jannik Hollenbach\n\\* Getting started for establishing your Security Champions Program by Juliane Reimann + Michael Bernhardt\n\\* Building Secure Software: A Hands-On OWASP SAMM Training by Daniel Kefer.\n\nAs usual on the evening before the conference day (November 12th) there’s a get-together with food and drinks.\n\n**\\*\\*THIS IS A PAID EVENT\\*\\***"
    }
]