[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "The Dark side of AI: Developing unsecure applications in minutes!",
        "date": "2025-07-24",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/306977980",
        "timezone": "America/New_York",
        "description": "AI is the ultimate accelerant for application development - its power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - July 2025 (Online)",
        "date": "2025-07-29",
        "time": "11:50-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489307",
        "timezone": "America/Chicago",
        "description": "Starting with Chapter information, then the Presentation!\n\nCyber Resilience and Business Impact: Findings from the 2025 LevelBlue Futures Report\nby Theresa Lanowitz\n\nComputing is advancing at blistering speeds. With so much change, there must be a balance of innovation and risk. The 2025 LevelBlue Futures Report: Cyber Resilience and Business Impact, finds that AI is a disrupting force. This research examines the pivotal changes advancing cybersecurity as a business priority and how cyber resilience increases the chance of business success.\n\nThis presentation covers:\n Why cyber resilience is essential\n What makes a cyber-resilient organization\n How AI is impacting the readiness of cybersecurity teams\n How the software supply chain impacts risk"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 26 July 2025 Null/OWASP",
        "date": "2025-07-26",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/308811300",
        "timezone": "Asia/Kolkata",
        "description": "Join the OWASP® Foundation Bangalore & Null Bangalore Combined Meetup – July 26th, 2025\n\n Date: July 26th, 2025\n Location: Bangalore\n Venue: Linkedin\n4th floor, Mantri Commercio Tower-A, Global Technology Park, Devarabisanahalli Rd, next to Intel, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka 560103\n\n⏰ Time: 09:30 AM – 02:00 PM\n Open to Everyone \\| Free Entry \\| No Registration Limits\nJoin us for an exciting meetup featuring top-notch security talks, hands-on discussions, and networking opportunities!\n​ Proposed Sessions\n\n* ​Top 10 LLM attacks - OWASP top 10 by @Meenakshi Ganesh\n* ​SCCM Exploitation by @**Nandhakumar**\n* ​NeMo Guardrails - and Demo by @Dilip Sai R & @Manav talreja\n* ​Mobile device forensics by @**Zero2Infinite** (Pradhan V)"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "July OWASP Bay Area Meetup",
        "date": "2025-07-15",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/308712465",
        "timezone": "America/Los_Angeles",
        "description": "We’re excited to announce that our **July OWASP Meetup** will be Sponsored by **Endor Labs**\n\nJoin us for an evening of great conversations, community networking, and insightful security discussions — all in an awesome venue provided by **Endor Labs**. And yes, there will be **delicious food and drinks** generously provided by our sponsors!\n\n5:00 PM : Doors open, Networking, food and drinks\n5.30 PM :- Chapter introductions\n5.45-6.15 PM :- **Evolving Your AppSec Program in the Era of AI**\n6.15-7.00 PM :- **Role mining for AppSec with AI and Open policy agent**\n7.0-7.45 PM :- **MCP Security: Securing the newest API Standard Behind ChatGPT, Claude & Copilot**\n\nTalk#1 :- Evolving Your AppSec Program in the Era of AI\n\n**Description:** AI is already transforming how software is built—but for security teams, it’s mostly just making life harder. Developers are shipping AI-generated code at breakneck speed, while security teams struggle to keep up. The challenge isn’t just securing AI-generated code and systems—it’s evolving your AppSec program to keep pace with software development.We'll explore how security teams can evolve their programs across two key dimensions: securing AI-driven software development and using AI to enhance security workflows. You’ll learn:\n\n* Strategies for managing risks from AI-generated code and autonomous agents\n* How security teams can use AI to reduce work and improve security outcomes\n* Where AI can enhance security—and where human expertise remains irreplaceable.\n\nAI isn’t just a security challenge; it’s a chance to build a smarter, more efficient security program. Join us to learn how to make AI work for security, not against it.\n\n**Speaker:-** **Andrew Stiefel** is a product marketing manager at Endor Labs, where he focuses on open source security. He previously led product marketing for developer security products at 1Password and API security at NGINX. His writing on software supply chain security, DevSecOps, and API security has appeared in the CNCF blog, The New Stack, and Help Net Security.\n\n**Talk#2:** Role mining for AppSec with AI and Open policy agent\n**Description**: Sultan will share his experience how to use AI to create RBAC roles and ways to enforce them with OPA on large microservices deployments\n**Speaker:** Sultan is a Product Security engineer at Zoox, where he is working to secure the infrastructure for the future of autonomous mobility. Previously, Sultan has worked at Roblox and Palo Alto Networks, building software in the IAM and IoT security space.\n\n**Talk#3:** MCP Security: Securing the newest API Standard Behind ChatGPT, Claude & Copilot\n**Description:** MCP is the new API standard behind tools like ChatGPT, Claude, GitHub Copilot, and Cursor powering over 5,000 servers. But this new protocol brings new risks: tool poisoning, shadow tools, rug pulls, and credential leaks that traditional AppSec tools weren’t built to detect.\n\nJoin us to learn:\n\n1. What Are MCPs and Why They Matter?\n2. Why “prompt → reasoning → tool” changes everything\n3. Real-world attacks like tool poisoning, shadow tools, and token misuse\n4. How leading AppSec teams are starting to secure this emerging layer?\n5. A solution to MCP Security in action\n\n**Speaker:** Ankita is the Co-founder and CEO of Akto - the fastest growing API Security Solution for Modern Appsec Teams. She has 15 years of experience working at JP Morgan, VMware, Linkedin across engineering, security, GTM teams. She completed her engineering undergraduate from IIT Roorkee and Masters from Dartmouth College. She founded Akto in 2022 with a mission to secure APIs, apps and everything in between for appsec teams. She is leading her company to empower appsec teams with AI-first security practices and technology."
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Mobile Unama Parque Shoping",
        "date": "2025-07-12",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/308993893",
        "timezone": "America/Boa_Vista",
        "description": "DESENVOLVIMENTO MOBILE EM 360º: CARREIRA, INOVAÇÃO E IMPACTO NO MERCADO\n\nPrepare-se para um dia inteiro de imersão no universo do desenvolvimento mobile! O evento \"Desenvolvimento Mobile em 360º: Carreira, Inovação e Impacto no Mercado\" reúne especialistas, profissionais e entusiastas da tecnologia para discutir tendências, oportunidades e os desafios do setor mobile em todas as suas dimensões — da carreira à inovação, passando por segurança, diversidade e transformação digital.\n\nLocal: Unama Parque Shopping\nData e Horário: das 09h00 às 17h00\n\nProgramação\nEm breve\n\nInscrição:\nhttps://www.sympla.com.br/evento/desenvolvimento-mobile-em-360-carreira-inovacao-e-impacto-no-mercado/3019985?referrer=www.google.com"
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "Securing the Future: OWASP, the Top 10, and LLM Risks",
        "date": "2025-07-17",
        "time": "13:00+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/308967739",
        "timezone": "Europe/London",
        "description": "Join ISACA and OWASP Belfast for an online session that explores how the OWASP community is shaping the future of application security—from foundational best practices to emerging AI threats.\n**Agenda:**\n\n1. **Introduction to OWASP**\nLearn what OWASP is, how it operates, and why it matters. We'll cover key projects, community impact, and how both technical and non-technical audiences benefit from OWASP's open and collaborative approach.\n2. **The OWASP Top 10 – Evolution and Direction**\nDiscover the origins and evolution of the OWASP Top 10. We’ll explain how it's compiled, why it remains a critical tool for secure development, and what changes are expected in the next release.\n3. **The OWASP Top 10 for LLMs**\nExplore OWASP’s latest initiative focused on Large Language Models (LLMs). We’ll highlight key risks, real-world implications, and why LLM security is quickly becoming a priority for organizations adopting AI technologies.\n\nThis webinar is ideal for developers, security professionals, and technology leaders looking to stay ahead of today’s and tomorrow’s application security challenges."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - July 2025",
        "date": "2025-07-09",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/308633206",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Jerry Hoff, a lifetime member of OWASP, to our meetup. Doors open at 6:30pm and the presentation starts at 7pm. Pizza and soda will be provided.\n\nIn this session Jerry will be talking about **The AI AppSec Nightmare**.\n\nThe era of AI-powered attackers is no longer theoretical. Autonomous and semi-autonomous tools are now capable of identifying, exploiting, and adapting to vulnerabilities at a scale and speed that surpass human capacity. This talk explores the implications of a world where AI-driven threats are a permanent part of the landscape.\nWe begin with a candid look at the current state of application security, where manual processes and outdated risk models struggle to keep pace with modern development. At the same time, AI-generated code is entering environments at an unprecedented rate, often with little to no review, expanding the attack surface in ways few organizations are prepared for.\nCompounding the problem is a growing wave of global regulations pushing organizations to demonstrate security readiness, often without providing practical paths to achieve it. Within this context, the traditional approach of prioritizing and fixing only critical and high-severity issues is breaking down. Attackers, especially those leveraging AI, no longer view low or medium vulnerabilities as difficult hurdles. Most vulnerabilities should now be treated as easily exploitable.\nThis session offers a sharp, forward-looking assessment of the challenges ahead and outlines key shifts that application security teams must make to stay relevant and effective in the age of AI.\n\nJerry Hoff has decades of experience in technology and security, specializing in application security at an enterprise scale. He holds a Master’s in Computer Science from Washington University in St. Louis and has evaluated the security of applications for some of the largest financial, defense, and commercial organizations in the world.\n\nAs a security entrepreneur, Jerry founded and led a static application security testing startup, which was acquired by WhiteHat Security in 2011. He has been an active member of the security community for nearly twenty years as a lifetime member and long-time volunteer with OWASP.\n\nJerry has held key leadership roles in global organizations, including serving as the Global Head of Security for Sony Electronics and as a Group Senior Security Architect for NTT. His expertise spans secure software development, application security strategy, and enterprise security architecture. He now leads [AppSecTraining.com](http://appsectraining.com/), a company dedicated to training organizations on secure software development. Jerry also is highly involved in cybersecurity startups, and is an investor in multiple startups and funds, and is a strategic advisor to Pixee.ai."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Bristol, July 2025 Meetup",
        "date": "2025-07-15",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/308810349",
        "timezone": "Europe/London",
        "description": "OWASP Bristol Meetup for Tuesday 15th July 2025.\n\nIn-person event, kindly hosted by **Intigriti**, at the Dareshack function room; Vintry Building, 20 Wine St, Bristol BS1 2BD.\n\nOur first talk is \"**Implementing a bug bounty program**\", by Ashley Dunn. He is the information security lead for Super Awesome.\n\nOur second talk is \"**Don't tell Mum I joined up (she thinks I'm a bicycle repair man)**\", by David Greeney, on the “Reflections on risk management from the perspective of surviving bomb disposal operations.”\n\n\\-\\-\\-\n\n* **6:00** Doors open, meet and greet\n* **6:30** Introduction to OWASP and news.\n* **6:40** Talk 1: Implementing a bug bounty program\n* **7:30** Talk 2: Don't tell Mum I joined up (she thinks I'm a bicycle repair man)\n* **8:30** Wrap up"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "The Dark Side of AI: Writing Insecure Apps in Minutes",
        "date": "2025-07-17",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/307693769",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Ox Security](https://www.ox.security/)**\n\nAI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments!\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Synthetic Souls: How Criminals are Hijacking Identity in Modern Crime",
        "date": "2025-07-17",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/308650589",
        "timezone": "America/New_York",
        "description": "Identity: once the bedrock of trust—now just another data point to be manipulated. In today's digital underground, identities are stitched together from stolen scraps, deepfakes, and AI-generated personas. Welcome to the world of synthetic identities—where fraud has evolved into a scalable business model.\nIn this talk, you'll dive into the anatomy of identity crime: how synthetic IDs are built, sold, and used by organized criminal networks to fuel fraud at industrial scale. We'll unpack real-world tactics, explore how deepfake tech and AI are reshaping identity-based attacks, and expose the twisted innovation cycles driving this threat landscape.\nForget the usual buzzwords—this isn't a session on passwords or MFA. This is about stepping into the mind of a modern fraudster and asking: what *they're* afraid of. More importantly, we'll cover how OWASP members and developers can shift from passive defenders to active disruptors in the identity war."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP July Meetup - Join Us!",
        "date": "2025-07-16",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/308564016",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on July 16th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:30 pm - announcements and presentation starts at 6:00pm .\n\nThis month's presentation is brought to you by Endor Labs!\n\n**Presentation:**\nSecure Vibe Coding: 5 Key Lessons\n\n**Abstract**:\nAI coding assistants like Cursor, Copilot, and Windsurf significantly increase productivity and assist with mundane coding tasks. But while powerful, these tools carry risks: trained on vast public datasets, they inherit bad patterns without necessarily ensuring secure application development. In this talk, we'll share five key lessons for security engineers and developers to improve code security:\n\n* Implement guardrails\n* Get real-time security signal\n* Watch your dependency blast radius\n* Compensate for non-determinism\n* Invest in prompt engineering"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter Meetup #72",
        "date": "2025-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/308736460",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to the **OWASP Frankfurt Chapter** Meetup #72!\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics.\nAnyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n* **Title to be announced:** We are excited to welcome **Alexander Steinbrecher,** Cyber Security Specialist at DZ BANK AG and **Patrick Eisenschmidt**, Red Team Manager / TIBER-TLPT Lead at NVISO Security.\n* **Let's talk vulnerabilities in plain sight** by **vin01:** For our second talk we are welcoming **vin01**, an independent security researcher. He will be talking about vulnerabilities and security risks hiding in plain sight. Also, let's try to figure out how secure is the web infrastructure used by our governments, universities and small businesses? All through publicly available data.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?* Our Meetup takes place on **31.07.2025** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at codecentric AG, located at Lise-Meitner-Straße 4, 60486 Frankfurt am Main, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Gurugram",
        "repo": "www-chapter-gurugram",
        "name": "Protecting Your Web Applications: Best Practices in Web Security",
        "date": "2025-08-02",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/owasp-gurugram-chapter/events/308503571",
        "timezone": "Asia/Kolkata",
        "description": "Join us at the OWASP Gurugram Chapter event where we will dive deep into the best practices for incorporating cybersecurity into software development processes. Our expert speakers will cover topics such as cloud security, computer security, information security, application security, and software security. Learn how to effectively secure your applications, protect your networks, and defend against cyber threats. Whether you're a developer, security professional, or IT enthusiast, this event will provide valuable insights and practical tips to enhance your software security skills. Don't miss this opportunity to network with peers, ask questions, and stay updated on the latest trends in cybersecurity."
    },
    {
        "group": "Harrisburg",
        "repo": "www-chapter-harrisburg",
        "name": "Joint Meetup with ISC2 Central PA Chapter - Sponsored by Check Point!",
        "date": "2025-07-23",
        "time": "17:30-04:00",
        "link": "https://www.meetup.com/owasp-harrisburg/events/308527420",
        "timezone": "America/New_York",
        "description": "To help support our other local cybersecurity groups and help bring awareness to our initiatives, we are sponsoring with ISC2's Central PA Chapter! Check Point has graciously agreed to sponsor the event. This will be a great opportunity to mingle with even more like-minded cybersecurity individuals in the Harrisburg area! More details on the topic and event information to follow!"
    },
    {
        "group": "Hermosillo",
        "repo": "www-chapter-hermosillo",
        "name": "OWASP API Security Top 10",
        "date": "2025-07-15",
        "time": "16:00-07:00",
        "link": "https://www.meetup.com/owasp-hermosillo-chapter/events/308883408",
        "timezone": "America/Hermosillo",
        "description": "**Panorama actual:** Estadísticas de ataques y tendencias 2025\n**Tipos de arquitecturas de APIs:** REST, GraphQL, gRPC, etc\n**Códigos HTTP:** más comunes y su significado\n**API Security Top 10**\n**Código seguro:** Ejemplos prácticos de vulnerable vs. implementación segura"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston TX Chapter Study Group - Power up with PowerShell",
        "date": "2025-07-09",
        "time": "19:15-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/308593400",
        "timezone": "America/Chicago",
        "description": "This weekly one hour study group series is designed to help you learn how to use Windows PowerShell 5.1 and cross-platform PowerShell 7.x.\n\nThe focus will be on real world scenarios and learning by doing. The first sessions will focus on Windows but later sessions will cover 7.x on Linux.\n\nSince 5.1 is the default on Windows servers, we will start there. The primary IDE will be VS Code as it is the officially supported current PowerShell editor. Since you can't normally install it on production servers, though, running and debugging scripts in it will also be covered as it overcomes the \"it works on my system\" issue."
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup",
        "date": "2025-07-17",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/308850519",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted by Civo Tech Junction and sponsored by Black Duck . There is limited seating available for in-person attendees. Registration required.**\n**This event will be live-streamed on YouTube.**\n**Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Civo Tech Junction, First Floor, 32-37 Cowper Street, London, EC2A 4AW\n**Nearest Tube:** Old Street (Northern Line), Cowper Street exit - 1 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n\n**\"Server-Side Cross-Site Scripting\" - Balazs Bucsay**\n\nCross-Site Scripting is no longer a new or hot topic, but as new technologies are introduced rapidly, and with the expansion of cloud solutions and containerisation, classic vulnerabilities may take on new forms. Server-Side XSS is an unusual method to execute malicious payloads on the server rather than the client.\nThe talk includes multiple demos that walk the audience through an attack chain utilising multiple vulnerabilities and misconfigurations to escalate privileges, and to transform a seemingly benign vulnerability into a powerful tool for cloud account takeover. In addition to explaining the issue with Server-Side XSS, its limitations and capabilities will also be discussed. Recommendations will be provided to prevent others from making the same mistakes that are already widespread.\n\n**\"Securing the Software Supply Chain in the Age of AI, Malware, and Compliance\" - Matthew Brady**\n\nModern development teams rely heavily on third-party code, AI-generated content, and rapid release cycles—making the software supply chain a growing target for attackers. At the same time, security teams are expected to manage increasing compliance demands and prevent threats like dependency confusion and malicious packages, all without slowing down developers. This talk focuses on how AppSec teams can build practical, scalable approaches to securing the software supply chain, drawing from real-world challenges and lessons learned across the industry.\n\n**RAFFLE - win a prize kindly donated by our sponsors!**\n\n**SPEAKERS**\n\n**Balazs Bucsay**\n\nBalazs Bucsay is the founder & CEO of Mantra Information Security that offers a variety of consultancy services in the field of IT Security. With decades of offensive security experience he is focusing his time mainly on research in various fields including red teaming, reverse engineering, embedded devices, firmware emulation and cloud. He gave multiple talks around the globe (Singapore, London, Melbourne, Honolulu) on different advanced topics and released several tools and papers about the latest techniques. He has multiple certifications (OSCE, OSCP, OSWP) related to penetration testing, exploit writing and other low-level topics and degrees in Mathematics and Computer Science. Balazs thinks that sharing knowledge is one of the most important things, so he always shares it with his peers. Because of his passion for technology he starts the second shift right after work to do some research to find new vulnerabilities.\n\n**Matthew Brady**\n\nMatthew has a unique combination of technical knowledge with commercial awareness in many areas including Software Application Security, DevOps and software development lifecycle solutions and services across multiple vertical markets. Matthew currently leads a team of Solution Engineers in EMEA and is subject matter expert in Black Duck supply chain solutions. Prior to that he has worked for CISCO/AppDynamics and Hewlett Packard Enterprise.\n\n**TICKETS:**\n\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security.\n\n**CODE OF CONDUCT:**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Jul 23, 2025",
        "date": "2025-07-23",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091956",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** The Carrot vs. The Stick: Making a Positive Impact on the Security + Developer Relationship\nJoin us for great networking, dinner and drinks, and see a presentation by **Eitam Arad,** Sr. Solutions Engineer, **Arnica**\n\n**ABSTRACT:**\nSecurity and development teams often work toward the same goal but rarely in sync. Misaligned incentives, late-stage scans, and noisy alerts lead to friction and slow remediation. This talk explores how shifting security earlier in the SDLC and aligning with developer workflows can improve outcomes across the board.\nYou'll learn how developer empowerment, real-time feedback, and actionable guidance reduce alert fatigue, shorten MTTR, and drive better collaboration between teams.\n\n**Thanks to our SPONSOR**: *[Arnica](https://www.arnica.io/)*\n*Pipelineless AppSec. Developer-Native Workflows.*\n*Surface the right risk to the right owner at the right time with pipelineless, developer-native workflows that foster collaboration, increase development velocity, and reduce overall risk.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "SoCal Cyber Luau Social - Saturday July 19, 2025",
        "date": "2025-07-19",
        "time": "10:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/308598390",
        "timezone": "America/Los_Angeles",
        "description": "Join us for the first ever **SoCal Cyber Summer Luau Social**, hosted by participating cybersecurity communities in Southern California:\n**ISSA SoCal**, **CSA LA/SoCal**, **OWASP LA, ISC2LA, ISACA OC, OWASP OC,** and **Women's Society of CyberJutsu** Chapters.\n\nPLEASE (1) RSVP here on our meetup and (2) remember you **must** get a ticket here **\\*\\*REGISTER\\*\\*** at https://lu.ma/1szig7el\n\nOWASP LA Members: use code **OWASPLA-HOAHUI** during check-out in Luma to receive your complimentary passes.\n\n**Members of Sponsoring Chapters**\nYour membership provides you with up to **4 complementary tickets**. Please contact your chapter leadership for your code.\n\n​**Not a Member of a Sponsoring Chapter?**\nYou can still attend by purchasing a General Admission ticket. We encourage you to join one of the sponsoring organizations for complementary access.\n\nNo slides, no panels - just a classic picnic to facilitate connection and community, and to get to know each other.\nWhether you're a seasoned pro or just dipping your toes into cybersecurity, join us and build lasting connections.\nThis is a family friendly event - so bring your loved ones! Pets are also welcome.\n\n**Come for:**\n\n* ​Aloha inspired food\n* ​Hawaiian T-Shirt Competition\n* ​Games - including some friendly chapter competition\n* ​Great company!\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n#CSA #ISSASoCal #OWASPLA #CyberJutsu #ISC2LA #Cybersecurity #SafeNetworking #BuildingCommunity"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "AISVS: A Developer-Centric Standard for Securing AI Applications",
        "date": "2025-07-16",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/308767382",
        "timezone": "America/Los_Angeles",
        "description": "We are thrilled to share this timely talk by **Jim Manico** and presented by **The [OWASP Virtual Chapter](https://owasp.org/www-chapter-virtual/)**\n\n**RSVP** at https://www.meetup.com/owasp-virtual-chapter/events/307914301/\n\n**Abstract:**\nAs artificial intelligence systems become integrated into mainstream applications, their attack surface expands dramatically—introducing new threats and compounding existing vulnerabilities. The **OWASP Artificial Intelligence Security Verification Standard (AISVS)** is a new community-driven project designed to define **clear, actionable security requirements** for developers, architects, and testers building AI-enabled software.\nIn this session, OWASP leader and security educator **Jim Manico** will introduce AISVS 1.0, walk through its structure and key categories, and explain how it complements traditional application security standards like ASVS. You’ll learn:\n\n* Why we need AISVS: the unique threats AI systems face\n* The structure and scope of AISVS and how it supports different security assurance levels\n* Key controls across AI data governance, model development, and deployment\n* How AISVS integrates with NIST AI RMF, ISO/IEC 42001, and the OWASP LLM Top 10\n* How to start using AISVS in your organization today\n\nWhether you're building AI-driven apps, managing security risk for machine learning models, or curious about adversarial ML and secure prompt engineering—this talk will equip you with the foundation to develop and verify **secure and trustworthy AI systems.**\n\n**Target Audience:**\nDevelopers, AppSec professionals, DevOps teams, AI/ML engineers, and anyone interested in the future of secure software development."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Workshop OWASP LA - July 9, 2025",
        "date": "2025-07-09",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/308574443",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Hands-on Application Security Workshop with Runtime Security IAST Technology and Secure Code Training\nJoin us for an action-packed hands-on workshop event led by **Will Derksen**, Sr. Solutions Engineer, **Contrast Security**.\nEarn 2 hours of CPE credit!\\*\n\n**ABSTRACT:**\nTogether, we will...\n\n* Unify around a precise definition of a vulnerability, as well as understand the challenges current application testing methodologies have in detecting vulnerabilities, and how to change the way we interact with them\n* Get hands-on-keyboard experience leveraging Contrast training to find a vulnerability in code, learn how to fix said vulnerability, and proactively go and remediate the vulnerability\n\nWho should attend?\n\n* AppSec professionals\n* Security engineers\n* Software engineers\n* DevOps/DevSecOps professionals\n* Anyone wanting to learn more about identifying and fixing code vulnerabilities, discover the most efficient ways to execute on a DevSecOps program, and become proactively more knowledgeable around secure coding techniques.\n\n**\\*\\* PLEASE NOTE \\*\\*** \\- for the lab portion of this event\\, you must bring a laptop \\(phones or other personal devices will NOT work for the lab\\)\\.\n\\*This workshop qualifies for 2 hours of hands-on training for Continuing Professional Credits (CPE). For CISSP holders this would be in the Application Security Discipline and you will receive a certificate of completion after the workshop.\n\n**Thanks to our SPONSOR**: *[Contrast Security](https://www.contrastsecurity.com/)*\n*You can't stop what you can't see*\n*Novel attacks can appear harmless without visibility into the grey areas of your application layer.Stop attacks in your applications and APIs from development to production.*\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Demystifying SOC 2 for Your AppSec Program",
        "date": "2025-07-24",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/308612693",
        "timezone": "America/New_York",
        "description": "In this talk, we’ll walk through how SOC 2 maps to modern application security programs. Attendees will learn how to implement key controls in ways that support both audit readiness and meaningful security outcomes. Whether you’re building a program from scratch or improving an existing one, this session offers practical guidance."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Charters Bar! ",
        "date": "2025-07-23",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916303",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Social Drinks @ Charters bar\n\n**When?**\n\n* \\- Weds 23rd August from 6:30pm\n\nThank you,\n\nRyan & Mark\n\n\\*This date was a formal event - this has been changed and moved to October - see https://www.meetup.com/owasp-peterborough/events/305916317/?utm_medium=referral&utm_campaign=share-btn_savedevents_share_modal&utm_source=link&utm_version=v2 to sign up."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Balance Security & Scalability while enabling a high growth, fast paced business",
        "date": "2025-07-16",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/308482201",
        "timezone": "America/Denver",
        "description": "Join us as Ty Ravsten, the Director of DevOps and Security at Nectar, talks to us about how to balance scalability and security while enabling the business to move fast!\n\nVirtual meeting this month. We will meet together in August at our annual campout!\n\nZoom info to be updated soon."
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Secure Coding Workshop & CTF (with prizes!)",
        "date": "2025-07-10",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/santa-barbara-owasp-chapter/events/308691863",
        "timezone": "America/Los_Angeles",
        "description": "NOTE: You need to RSVP here in the OWASP SB meetup group and also register in [Security Journey's tournament page](https://forms.office.com/r/pS5YAA4Tc6) in order to participate and be eligible for prizes. See details below.\n\n**Event Agenda**\n06:00pm -- Event kickoff & announcements, by W. Martín Villalba (OWASP SB).\n06:15pm -- Secure Coding Workshop & CTF kickoff, by Security Journey.\n07:45pm -- Workshop & CTF end / announcement of prize winners.\n08:00pm -- Event end.\n\n**Secure Coding Workshop & CTF**\n[Security Journey](https://www.securityjourney.com/) brings you a defensive security tournament designed for developers and AppSec practitioners. Compete in a series of vulnerable code challenges where you identify, locate, and fix security flaws. This is a great way to learn secure coding basics and beyond, without requiring deep programming experience. Choose your preferred language: C, C++, C# / .NET, Java, JavaScript, Kotlin, PHP, Python, Rust, TypeScript.\n\nCome prepared!\n\n* Watch Security Journey's [demo video](https://www.securityjourney.com/coding-training-solutions/custom-demo-form).\n* Try out Security Journey's [hands-on training lesson](https://info.securityjourney.com/security-journey-try-our-training25).\n\nPlease make sure to RSVP here in this group and also register in [Security Journey's tournament page](https://forms.office.com/r/pS5YAA4Tc6) in order to participate and be eligible for prizes.\n\n**Prizes, courtesy of OWASP Santa Barbara & Security Journey**\nThe top 3 winners will receive Amazon gift cards, and we may have some swag from Security Journey as well.\n\n1. $125\n2. $75\n3. $50\n\nLooking forward to seeing you all online!\n\nMartín\nOWASP SB Leader"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-07-09",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306142423",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sri Sairam Engineering College",
        "repo": "www-chapter-sri-sairam-engineering-college",
        "name": "CTF 101",
        "date": "2025-07-13",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-sri-sairam-engineering-college-student-chapter/events/308918347",
        "timezone": "Asia/Kolkata",
        "description": "This is a online session about what is CTF and how it can impact your career"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-July Lunch and Learn",
        "date": "2025-07-18",
        "time": "11:15-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/308270253",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-July Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\n* 11:15am - Registration and Lunch\n* 12:00pm - Speaker - Mic McCully - Deep Application Inspection\n* 1:15pm - Depart\n\n**Speaker**:\nMic McCully is currently Field CTO at Oligo Security and the former Field CTO at Snyk. His background spans over 30 years in the software industry and 20 years of that focused in the security space. Mic’s background in security spans across multiple disciplines including SAST and DAST in the application security space, network security leveraging anomaly based detection, data level security leveraging digital rights management, mobile security leveraging proactive attack detection and most recently developer focused security enabling organizations to scale and address modern cloud native application security concerns. This diverse background has given him an appreciation for the multitude of risks and competing priorities facing organizations today.\n\n**Abstract**:\nDeep Application Inspection - a very specific type of runtime, a nonintrusive, lightweight way to observe applications in realtime to observe realtime behavior and attacks as well as provide mitigating controls inside the app. If you’re tired of proactively spending countless hours trying to find and fix issues before an application is released just to find out the majority of the issues you focused on posed no real security risk or after the application is deployed, waiting for a successful exploitation by an attacker to trigger some reactive scramble to seeing what happened, join us to learn about a new technology providing a layer of visibility not previously available.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W\nSTE 600\nTampa, FL 33607\n\n**Sponsors**:\noligo security \\| [oligosecurity.io](https://oligosecurity.io)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Secure Vibe Coding: 5 Key Lessons | The AI Appsec Nightmare",
        "date": "2025-07-16",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/308560869",
        "timezone": "America/Toronto",
        "description": "**Format**:\nDual (2-talk) and Hybrid (in-person and online) event\n\n**In-person location**:\nStartuptive\n123 Edward St, Suite 205 (2nd Floor), Toronto, ON, Toronto, ON M5G 1E2\n\nNote: In-person attendance to **70 people**, in a **first-come, first-serve basis**.\nDoors will open at **6:00 PM**, with the event will start at **6:30 PM** (EDT).\nFor those who cannot attend in person, please join us virtually via the livestream!\n\n**Presentation #1: Secure Vibe Coding: 5 Key Lessons -** **Matt Brown**\n\nAI coding assistants like Cursor, Copilot, and Windsurf significantly increase productivity and assist with mundane coding tasks. But while powerful, these tools carry risks: trained on vast public datasets, they inherit bad patterns without necessarily ensuring secure application development. In this talk, we'll share five key lessons for security engineers and developers to improve code security:\n\n* Implement guardrails\n* Get real-time security signal\n* Watch your dependency blast radius\n* Compensate for non-determinism\n* Invest in prompt engineering\n\n**Presentation #2: The AI Appsec Nightmare - Jerry Hoff**\n\nThe era of AI-powered attackers is no longer theoretical. Autonomous and semi-autonomous tools are now capable of identifying, exploiting, and adapting to vulnerabilities at a scale and speed that surpass human capacity. This talk explores the implications of a world where AI-driven threats are a permanent part of the landscape.\n\nWe begin with a candid look at the current state of application security, where manual processes and outdated risk models struggle to keep pace with modern development. At the same time, AI-generated code is entering environments at an unprecedented rate, often with little to no review, expanding the attack surface in ways few organizations are prepared for.\n\nCompounding the problem is a growing wave of global regulations pushing organizations to demonstrate security readiness, often without providing practical paths to achieve it. Within this context, the traditional approach of prioritizing and fixing only critical and high-severity issues is breaking down. Attackers, especially those leveraging AI, no longer view low or medium vulnerabilities as difficult hurdles. Most vulnerabilities should now be treated as easily exploitable.\n\nThis session offers a sharp, forward-looking assessment of the challenges ahead and outlines key shifts that application security teams must make to stay relevant and effective in the age of AI."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Secure Code Training Tournament",
        "date": "2025-07-17",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510713",
        "timezone": "America/Vancouver",
        "description": "Join us for a hands-on **Secure Code Training Tournament** hosted by OWASP Vancouver and powered by **Security Journey**. Whether you’re a seasoned AppSec pro or just getting started, this interactive tournament will challenge your secure coding skills across multiple languages in a gamified environment. Participants will tackle real-world vulnerabilities, compete on a live leaderboard, and gain valuable insight into modern software security best practices.\n\nExpect prizes, bragging rights, and some light-hearted competition—all while leveling up your AppSec game.\n\n**Note:** In-person participants must bring their own laptop to access the tournament."
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "AISVS: A Developer-Centric Standard for Securing AI Applications",
        "date": "2025-07-16",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/307914301",
        "timezone": "America/New_York",
        "description": "**Abstract:**\nAs artificial intelligence systems become integrated into mainstream applications, their attack surface expands dramatically—introducing new threats and compounding existing vulnerabilities. The **OWASP Artificial Intelligence Security Verification Standard (AISVS)** is a new community-driven project designed to define **clear, actionable security requirements** for developers, architects, and testers building AI-enabled software.\n\nIn this session, OWASP leader and security educator **Jim Manico** will introduce AISVS 1.0, walk through its structure and key categories, and explain how it complements traditional application security standards like ASVS. You’ll learn:\n\n* Why we need AISVS: the unique threats AI systems face\n* The structure and scope of AISVS and how it supports different security assurance levels\n* Key controls across AI data governance, model development, and deployment\n* How AISVS integrates with NIST AI RMF, ISO/IEC 42001, and the OWASP LLM Top 10\n* How to start using AISVS in your organization today\n\nWhether you're building AI-driven apps, managing security risk for machine learning models, or curious about adversarial ML and secure prompt engineering—this talk will equip you with the foundation to develop and verify **secure and trustworthy AI systems.**\n\n**Target Audience:**\nDevelopers, AppSec professionals, DevOps teams, AI/ML engineers, and anyone interested in the future of secure software development."
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "The Schrödinger’s AD CS ESC1 Vulnerability",
        "date": "2025-07-22",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/308974227",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: Matheus Vilachã\nTema: The Schrödinger’s AD CS ESC1 Vulnerability\nData: 22/07/2025(Terça-feira) às 19:00"
    },
    {
        "group": "Yaounde",
        "repo": "www-chapter-yaounde",
        "name": "OWASP Yaounde July 2025 Chapter Meeting",
        "date": "2025-07-26",
        "time": "14:00+01:00",
        "link": "https://www.meetup.com/owasp-yaounde-chapter/events/308752774",
        "timezone": "Africa/Douala",
        "description": "[English]\nJuly 2025 OWASP Yaounde chapter meeting.\n\nSchedule:\n\n* Introduction and Chapter Updates\n* Special Guest\n* Workshop: \"Understanding the OWASP Top 10 (2021) - Part 2 of 5\" by Ernest Mougoue\n* Networking\n\nSpeakers:\nErnest Mougoue\nErnest is a Chapter Lead for OWASP Yaounde. He has 12+ years of experience in the software security field, having worked as a consultant or cybersecurity team leader for some of the largest companies in the United States. More recently, he is the co-CEO of MBOA DIGITAL, building the Cybersecurity practice.\n\nSpecial Guest\nFor the first time, we will have a special guest to our meetup that will share their experience with Application Security. You do not want to miss it! Information on the guest will be shared a few days before the event.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n[French]\nReunion de Juillet 2025 chapitre OWASP Yaoundé.\n\nProgramme :\n\n* Introduction et mises à jour du chapitre\n* Invité Spécial\n* Atelier : \"Comprendre l'OWASP Top 10 (2021) - Partie 2 sur 5\" par Ernest Mougoue\n* Réseautage\n\nIntervenants:\nErnest Mougoue\nErnest est un chapter lead pour OWASP Yaoundé. Il a plus de 12 ans d'expérience dans le domaine de la sécurité informatique, ayant travaillé comme consultant ou chef d'équipe de cybersécurité pour certaines des plus grandes entreprises aux États-Unis. Plus récemment, il est le co-CEO de MBOA DIGITAL, où il développe le pôle cybersécurité.\n\nInvité Spécial\nPour la première fois, nous aurons un invité spécial à notre rencontre qui partagera son expérience en sécurité applicative. A ne pas manquer! Les informations concernant cet invité seront communiquées quelques jours avant l'événement."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter Meetup #72",
        "date": "2025-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/308736460",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to the **OWASP Frankfurt Chapter** Meetup #72!\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics.\nAnyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n* **Title to be announced:** We are excited to welcome **Alexander Steinbrecher,** Cyber Security Specialist at DZ BANK AG and **Patrick Eisenschmidt**, Red Team Manager / TIBER-TLPT Lead at NVISO Security.\n* **Let's talk vulnerabilities in plain sight** by **vin01:** For our second talk we are welcoming **vin01**, an independent security researcher. He will be talking about vulnerabilities and security risks hiding in plain sight. Also, let's try to figure out how secure is the web infrastructure used by our governments, universities and small businesses? All through publicly available data.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?* Our Meetup takes place on **31.07.2025** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at codecentric AG, located at Lise-Meitner-Straße 4, 60486 Frankfurt am Main, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    }
]