[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2024-01-30",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/297958036",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus and ITM8/Improsec are happy to invite you to the next OWASP Aarhus meetup.\n\nITM8/Improsec will be the host and we will provide more information as we get closer to the event."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Transforming Threat Modeling: Harnessing ChatGPT for Automated Security Analysis",
        "date": "2024-01-25",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/298291376",
        "timezone": "America/New_York",
        "description": "Traditional manual threat modeling is resource-intensive. This talk explores a game-changing approach using ChatGPT, an advanced language model, to automate and enhance threat modeling. Attendees will understand ChatGPT's potential in revolutionizing cybersecurity processes.\n\n**Session Highlights:**\n\n1. **Introduction to ChatGPT:** Uncover the versatility of advanced language models in cybersecurity. Explore their applications in threat modeling.\n2. **Automating Threat Modeling:** Learn how ChatGPT streamlines threat modeling, increasing efficiency by reducing manual efforts.\n3. **Generating Dynamic Threat Models:** See how ChatGPT assists in crafting threat models from system architecture, user stories, and design documents.\n4. **Elevating Accuracy and Scope:** Discuss techniques for refining accuracy and coverage of automated threat models generated by ChatGPT.\n5. **Integration and Synergy:** Explore seamless integration of automated threat modeling into existing security processes. Understand how collaboration between AI systems and security professionals can be encouraged.\n\n**Key Takeaway:** Attendees gain insights into leveraging ChatGPT for efficient threat modeling, enabling organizations to identify and mitigate security risks effectively."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - January 2024 (Online)",
        "date": "2024-01-30",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298206929",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 20 January 2024",
        "date": "2024-01-20",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/298410409",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 20 January 2024 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* Cryptography, Threat Modelling and IAM by **Aditi Rai**\n* Dark Web Crawler by **Abhishek Kumar**\n* Exploiting the Firebase Login Mechanism and APIKEY's by **Devendra**\n* Fortifying Security Pipeline by **Rakesh Paruchuri**\n* Security Aspects of Gen AI by **Prashant Kumar Jha**\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "January meetup",
        "date": "2024-01-17",
        "time": "17:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/298342170",
        "timezone": "America/Los_Angeles",
        "description": "Host(Synopsys) requires full name and email address to pre-register the attendees. Host has assured that this data will not be used for marketing or any other purpose. Kindly use use the below link to register:\n\n**[https://www.eventbrite.com/e/january-meetup-tickets-790684256897?aff=oddtdtcreator](https://www.eventbrite.com/e/january-meetup-tickets-790684256897?aff=oddtdtcreator)**\n\nHappy New year, Please join us at Synopsys HQ in Sunnyvale to Meet-Up and discuss some of the challenges that we face securing software and building TRUST into the products/services that we use daily. Along with informative talks around AppSec, there will also be some awesome food & drinks, as well as access to an outdoor patio for network throughout the event.\n\nBrief agenda below:\n5:00 – 6:00: Networking/Food\n6:00 – 6:25: What is Application Security Posture Management (ASPM)?\n6:30 – 6:55: Coverage - The Missing Link of WebApp/API Security Testing\n6:55 – 7:10 : Short Break\n7:10 – 7:35: How AI will empower and hurt security\n7:35 – 8:00: Networking\n\n**What is Application Security Posture Management (ASPM)?**\nCompanies adopt many application security testing (AST) tools to pinpoint critical software issues and keep compliant with OWASP standards. Yet despite this AppSec investment, they still fail to get an accurate view of risk, and struggle integrate testing, triage, and remediation within developer workflows. This has driven the evolution of application security posture management (ASPM).\nIn this session, we’ll dive into:\n\\- What is ASPM\\, and capabilities that a comprehensive solution should have\n\\- Best practices on using ASPM to accelerate AppSec transformation and consolidate data\\, workflows\\, and visibility\n\\- How ASPM is central to helping your teams keep up with OWASP compliance and mitigate software risk at scale\\.\n\n**Speaker:-** Natasha is a Senior Product Marketing Manager at Synopsys, driving go-to-market strategy for Software Risk Manager, an ASPM solution. She has worked for ten years in the cybersecurity and enterprise networking space. Prior to Synopsys, Natasha was with ServiceNow, where she managed product marketing initiatives for ServiceNow Security Operations, a SOAR platform for incident and vulnerability management. She has also held roles in product marketing and software product management at Imperva and A10 Networks.\nTalk#2: **Coverage - The Missing Link of WebApp/API Security Testing**\nMost DAST tools will boast about how many hundreds of thousands of attacks/checkers/vulns they scan for. But most still have a hard time automatically finding all of the pages/endpoints/actions in modern applications (e.g. SPAs) and APIs. Not to mention figuring out how to test everything they find in both a meaningful way and a reasonable amount of time. After all these years and entire markets built on web scraping, why is crawling for security testing still so hard? Why isn't an OpenAPI/Swagger spec enough to properly test an API? And what are we doing about it? In this session we'll dive in to those missing links and explore how we can actually feel confident in our automated testing coverage.\n\n**Speaker2**: Steve Chappell, SW Manager & API Security Evangelist\nSteve has done a little bit of everything in his 10 years at Synopsys (R&D, Sales, and yes, he even got suckered into Marketing for a while), but currently loves his role as a SW Engineering Manager, leading a team developing novel dynamic testing engines targeting webapps and APIs. When he's not evangelizing Application/API security, you might find him playing or creating word/puzzle games at the top of a multi-pitch climb drinking a craft or Belgian beer... or coaching youth sports.\n\n**Talk3#** How AI will empower and hurt security\n\n* How AI will help security teams:\n* Things we've seen work such as cross team collaboration, empowering security teams to remediate, freeing up engineering etc.\n* Thing we've seen not work in the market and might take a long time to mature for example complex log analysis\n\nHow adversaries will use AI to breach systems\n* rewriting malware signatures\n* more complex supply chain attacks that are harder to detect\n* more advanced social engineering and spoofing\n* more advanced phishing\n* more sophisticated penetration and reconnaissance\n\n**Speaker**: Ahmad Sadeddin is a 3x founder (1x exit). He lead various products at Coupa for over 6 years after they acquired his last startup (Riskopy). Corgea was born from his frustration at the manual and inefficient processes that companies take around data protection."
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém Cesupa",
        "date": "2024-02-03",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/298368815",
        "timezone": "America/Boa_Vista",
        "description": "No dia 03 de fevereiro, a OWASP Belém realizará um Meetup presencial ( \\m/ ) com apresentações de extrema relevância no contexto do mercado de trabalho e de segurança da informação. Diariamente nos deparamos com notícias sobre vazamentos de dados. Por isso, a disseminação do conhecimento resultará em softwares, sistemas e procedimentos mais seguros, minimizando assim essa crise.\n\n**Informações do Evento**\n\n* **Data:** 03/02/2024\n* **Horário:** 8h30\n* **Local:** CESUPA ARGO\n* **Endereço**: Avenida Alcindo Cacela, 1523\n* **Inscrições:** Em breve."
    },
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "Finding Your Niche",
        "date": "2024-01-16",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-bonita-springs-chapter/events/297926252",
        "timezone": "America/New_York",
        "description": "We're cohosting an event with SWFLSec and SpaceCoastSec!\n\nOne of the most difficult questions about getting started in a cybersecurity career is \"Where do I start?\". Our presenter recently made the transition from an HR / Talent Acquisition role to a cybersecurity role and will present their unique perspective on finding your niche in the cybersecurity realm."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "AppSec: Where to Start, and Some Free, Easy Wins",
        "date": "2024-02-07",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/297749441",
        "timezone": "Australia/Brisbane",
        "description": "With a limited supply of potential hires and an already maxed security budget, how do we begin to tackle Application Security (AppSec)?\nThis talk will attempt to help provide some direction when it comes to solving this problem. It is aimed at security folks and developers of all skill levels who are interested in getting their feet wet with AppSec.\nDuring the talk we will first explore an industry framework that can help guide the first few steps in our journey. Then, we will dive into a demo and highlight some of the fantastic free and open-source tools that we can use to demonstrate value and rack up a few easy and impactful wins."
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "OWASP Chennai Offline Meetup - Jan 20,2024",
        "date": "2024-01-20",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/298322892",
        "timezone": "Asia/Kolkata",
        "description": "**Title**: Unveiling Vulnerabilities: Hacking Adult entertainment and dating sites\n\n**Abstract:** Explore the hidden world of cybersecurity exploits in adult entertainment and dating sites. Our presentation reveals bug bounty findings, exposing vulnerabilities like SSRF, Authentication Bypass, BAC and much more. Real-world case studies shed light on security gaps, providing insights into bug bounty challenges. Beyond exploits, gain practical strategies for stability and persistence in theme-based bug bounty hunting.\n\n**Title:** Attack Surface Management Role in Ransomware Defence\n\n**Abstract:** Amidst rising ransomware threats, this study explores Attack Surface Management (ASM) as a pivotal defense. Delving into ASM's strategies, tools, and real-world successes, it equips organizations to fortify against evolving cyber risks. Covering vulnerabilities, risk mitigation, and future trends, this research empowers proactive defense in today's dynamic threat landscape.\n\n**Registration Form**: https://forms.gle/ER4LesKYrf5ouj7J9"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "How to File Upload for Developers",
        "date": "2024-01-18",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295118782",
        "timezone": "America/New_York",
        "description": "Woah I totally forgot to update this.\n\nDavid will be chatting about some recent research he has done into File Upload. I wouldn't miss it."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A night of Jim Manico",
        "date": "2024-01-23",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/297956007",
        "timezone": "Europe/Copenhagen",
        "description": "We're so incredibly lucky that Jim Manico, a global forerunner and huge capacity in appsec efforts within the OWASP organization and globally for decades and more recently in AI security, is moving to Copenhagen and is dedicated to giving back to our community.\n\nJim has offered to do not just one talk but bot a talk and a short course on his favorite topics: AI Security and appsec. And you're hereby cordially invited to join. As usually there'll be pizzas and drinks and as usually everything will be for the amazingly attractive price of nothing!\n\nSchedule:\n17.00: Introduction to OWASP Copenhagen\n17.05: Navigating the AI Labyrinth: Ethics, Security, and Best Practices\n18.00 Pizzas and drinks\n18.30: Appsec training\n\nHere's a description of both events:\n\n**Navigating the AI Labyrinth: Ethics, Security, and Best Practices**\nThis talk offers a comprehensive exploration of Artificial Intelligence (AI) from its historical evolution to the latest developments in AI security and ethics. Key topics include:\n\n* A Brief History of AI: A snapshot of the pivotal milestones in AI development.\n* AI and Ethics: Understanding AI's business impact, ethical guidelines, best practices, and risk mitigation strategies.\n* Robustness & Reliability of AI Code Generation: Addressing common misuse patterns and reliability metrics in AI systems.\n* Artificial Intelligence Security Introduction: Analyzing historical AI failures to draw lessons and improve future applications.\n* OWASP Top Ten for Large Language Models (LLMs): A deep dive into security considerations specific to LLMs, ranging from prompt injection to model theft.\n* Threat Modeling AI Systems: Outlining methodologies to assess and mitigate AI-related threats.\n* Hugging Face Open Source AI Tools: Exploring the utility and application of these tools in AI research.\n* Differential Privacy and AI: Discussing the principles of differential privacy in the context of AI.\n* NIST AI Risk Framework: An overview of NIST's guidelines for AI risk management.\n* EU AI Act: Analysis and impact on AI development and use.\n\nThe talk aims to provide attendees with a nuanced understanding of AI's ethical implications, security challenges, and practical approaches for secure and responsible AI deployment.\n\n**AppSec Training**\nIn the rapidly evolving realm of web development and application security, the OWASP Top 10 remains a cornerstone document, acting as a beacon for developers and security professionals alike. Reflecting a broad-based consensus, it spotlights the most critical security risks threatening web applications, thereby shaping the frontier of secure coding techniques.\nWith an ever-increasing emphasis on web-based interactions, the significance of a deep understanding of these risks is paramount. As developers etch lines of code giving life to web applications, a firm grasp of secure coding practices becomes not merely beneficial, but essential.\nThis immersive and engaging presentation seeks to equip attendees with a comprehensive understanding of the OWASP Top Ten 2022 release, intending to empower developers with the knowledge necessary to author secure, resilient software. As we navigate through this labyrinth, we shall focus on in-depth discussions around:\n\n* A01:2021-Broken Access Control\n* A02:2021-Cryptographic Failure\n* A03:2021-Injection\n* A04:2021-Insecure Design\n* A05:2021-Security Misconfiguration\n* A06:2021-Vulnerable and Outdated Components\n* A07:2021-Identification and Authentication Failures\n* A08:2021-Software and Data Integrity Failures\n* A09:2021-Security Logging and Monitoring Failure\n* A10:2021-Server-Side Request Forgery\n\nJoin us as we embark on this enlightening journey, delving into the unique intricacies of each risk, exploring defense strategies, and fostering a culture of security-minded web application development. This presentation aims to instill a robust defensive mindset, helping attendees to weave a narrative of secure coding that transcends the bounds of standard practices."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP January Meetup - Join Us!",
        "date": "2024-01-17",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/298208909",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on in the new year on January 17th for food, drinks, networking and an exciting presentation on \"**Threat Modeling the AI Pipeline**\". Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Presentation Title:** Threat Modeling the AI Pipeline\n\n**Presentation Details:** Rapid advancements in AI technologies have opened up a plethora of opportunities, but they’ve also introduced significant risks and challenges. One crucial yet often overlooked aspect of AI development is threat modeling. Threat modeling AI systems gives companies an edge in secure by design principles. This session aims to illuminate these potential threats within the AI pipeline and provides strategies for identifying, analyzing, and mitigating them."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "[InterSec] OWASP IoT Top 10 Rists",
        "date": "2024-01-17",
        "time": "15:45+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/297500599",
        "timezone": "Asia/Dubai",
        "description": "OWASP Dubai Chapter is announcing an upcoming event about \"OWASP IoT Top 10\"\nEveryday, technology gets more helpful yet more complex\nEveryday, we relay more and more on technology and software solutions\nEveryday, new cyber threats and attacks are created and activated.\nIn this session, we will discuss:\n\\- The new Era of IoT and how it is changing the daily life of people around the globe\n\\- The top 10 security risks associated with IoT and how IoT is expanding the attack surface according to OWASP guide\n\\- How to mitigate IoT associated security risks to design and build more resilient IoT products\nEvent Speaker is [Mahmoud Hussein](https://www.linkedin.com/company/90810901/admin/#), OWASP Dubai Chapter Leader.\nEvent is online and Free on Monday, 20th March 2023 @ 9:00am - 11:00am Dubai time.\nRegistration is now open on the link below\nJoin our meetup group to keep up with all updates and events.\n**#IoT** **#security** **#design** **#events** **#software** **#cybersecurity** **#technology** **#cyber** **#business** **#business** **#dubai** **#safety** **#event**"
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "[InterSec] Secure Digital Transformation in the Al Era",
        "date": "2024-01-17",
        "time": "15:35+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/298436726",
        "timezone": "Asia/Dubai",
        "description": "Embark on a transformative exploration at our session titled \"Secure Digital Transformation in the AI Era,\" where cutting-edge insights and strategies converge to illuminate the path towards a secure and resilient digital future.\nThis session will bring together industry leaders, cybersecurity experts, and pioneers in artificial intelligence to delve into the intricacies of navigating the evolving landscape of digital transformation while prioritizing security imperatives.\nParticipants can expect in-depth discussions on leveraging the potential of AI in transformative initiatives, while concurrently addressing the escalating challenges related to cyber threats, data privacy, and ethical considerations.\nEngage in a dynamic exchange of ideas, best practices, and case studies, as we collectively forge a roadmap to harness the benefits of digital transformation without compromising on the paramount importance of security in this AI-driven era."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "[InterSec] AI and LLM Security Challenges ",
        "date": "2024-01-17",
        "time": "15:15+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/297500567",
        "timezone": "Asia/Dubai",
        "description": "The event on LLM (Large Language Models) and AI security challenges convened experts and professionals from diverse fields to address the pressing issues surrounding the deployment and use of advanced language models. Participants engaged in insightful discussions on the ethical implications, privacy concerns, and potential risks associated with the increasing capabilities of LLMs.\n\nThe event delved into the intricate balance between harnessing the power of language models for innovation and confronting the security challenges they pose.\n\nKey topics included mitigating biases, ensuring robust encryption, and implementing responsible AI practices to safeguard against misuse. The collaborative atmosphere fostered an exchange of ideas, laying the groundwork for future collaborations and strategies to navigate the evolving landscape of AI security."
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "[on-prem] A beginner's guide to SSO (mis)configuration + Face recognition",
        "date": "2024-02-07",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/298504203",
        "timezone": "Europe/Berlin",
        "description": "Dear folks,\n\nlate happy new year!\n\nThis is a blocker for a new event, taking place @ New Work (formerly known as XING). We present two talks; Adina will talk about intricacies of SSO and IdPs. Kantorkel will present useful insights on his research and privacy implications on several aspects of face recognition. Both talks will be held in English.\n\nOver the next days we'll update the description. Stay tuned!\n\nCheers!\n\nDirk"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - February 2023",
        "date": "2024-02-06",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-israel/events/296831820",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  happy to invite you to our upcoming Meetup!\nJoin us for another AppSec community event and enjoy food, drinks, mingling, and great talks about security.\n\nThe event will be hosted by Bright Security!\n\n=====================================================================\nAgenda:\n 18:00 - 18:30 - gathering and food - We will gather at Bright Security Offices for drinks, great treats, mingling. Safe room free zone!\n 18:30 - 18:45 - Keynote + Microphone tuning\n\n 18:45 to 19:15 - Exploring the Risks of ChatGPT and Other Generative AI Applications\n\nBar Hofesh - Co-Founder & CTO @ Bright Security\n\nThe presentation emphasizes the critical need for security in the realm of AI-generated code, spotlighting common vulnerabilities. It presents the three main avenues of attack against Large Language Models (LLMs): direct attacks on the LLMs themselves, compromises in the infrastructure and integrations, and weaknesses in applications. The presentation offers in-depth examples, particularly focusing on \"social engineering\" methods, to illustrate the techniques and consequences of these security breaches.\n\n 19:15 to 19:45 - Top 5 Open Source Tools All Developers Should Know About!\n\nRaz Probstein - Solution Engineer @ Jit\n\nThe Minimum Viable Security (MVS) approach simplifies the integration of security measures into config files, apps, and CI/CD processes using open source tools. This talk focuses on incorporating five key security controls into the CI/CD pipeline, utilizing tools like Bandit, Gitleaks, OSV-Scanner, KICS, and OWASP’s ZAP. These controls, along with custom measures for enforcing Multi-Factor Authentication via Github Security, establish a foundational security framework from the initial code, allowing continuous improvement as applications evolve over time. Code examples and demos will be presented in the session.\n\n 19:45 - 20:15 - Recent Supply Chain Code Attacks\n\nYoad Fekete - Co-Founder & CEO @ Myrror Security\n\nJoin us for a deep-dive into the world of recent software supply chain attacks and how to defend against them.\nIn this lecture, we will discuss the difference between a supply chain attack and a vulnerability, and explore why there has been a significant increase in these types of attacks in the past couple of years.\nWe will showcase various vectors for these attacks with recent attacks examples.\nThe highlight? A technical demo of an attack, similar to the UA-Parser/Ledger Connect kit malicious package attacks.\n\n=====================================================================\n\nThis event is sponsored by Bright Security in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-02-12",
        "time": "18:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/298399889",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-01-30",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/298539374",
        "timezone": "America/Los_Angeles",
        "description": "Join us for a mixer with all the cybersecurity community in Los Angeles and Orange County, network and help celebrate the New Year!\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring OWASP LA events please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JAN 24, 2024",
        "date": "2024-01-24",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297383153",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Privacy by Design for Web Developers\nIn partnership with **CSA So Cal Chapter**, join us for great networking, dinner and drinks, and see a presentation by **Miguel (Mike) O. Villegas**, President and Founder of iSecurePrivacy, LLC.\n\n**ABSTRACT**: In today's digital landscape, the protection of user privacy has become a paramount concern. As web developers, it is our responsibility to ensure that the websites and applications we create not only deliver exceptional user experiences but also prioritize the privacy and security of user data. This lecture, \"Privacy by Design for Web Developers,\" explores the foundational principles and practical strategies that empower web developers to integrate privacy into every facet of their work.\nIn this lecture, we will delve into the concept of Privacy by Design (PbD) and its significance in the context of web development. We will examine how PbD serves as a proactive approach to safeguarding user data, fostering trust, and complying with evolving privacy regulations such as the GDPR and CCPA/CPRA.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation to create secure by design software.",
        "date": "2024-01-27",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "January 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-01-18",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/297919320",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Trend Micro Nederland\n\n**Address:** Herikerbergweg 92, 1101 CM Amsterdam\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Challenges in modern Red Teaming, external vs internal point of view** by **Marcin Wolak**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Red Teaming on MacOS** by **Ahmed Sherif & Ivan Kozlov**\n\n**Challenges in modern Red Teaming, external vs internal point of view**\n***Abstract***:\nThe presentation will try to demonstrate limitations of external red teaming and show how internal red teaming could possibly fill in identified gaps.\n\n***Bio***:\nMarcin is a well renowned ethical hacker / red teamer, blogger & researcher with over twenty years experience in IT and cybersecurity\n\n**Red Teaming on MacOS**\n***Abstract:***\nThe focus of the Red Teaming has predominantly been on Windows environments, reflecting its widespread use in corporate settings. However, the recent shift in corporate preferences towards MacOS necessitates a reevaluation and development of Red Teaming strategies specific to this. Our presentation delves into the challenges in MacOS during the red teaming excercises (i.e. initial foothold, persistence, lateral movement, etc.).\n\n***Bio:***\n*Ahmed Sherif*: A professional offensive security expert with 7 years of experience in pentesting / red teaming. Ahmed is working at ING global CISO.\n*Ivan Kozlov*: Red teamer at Global CISO of ING who hated macOS so hard that decided to dedicate his spare time in finding vulnerabilities and new red teaming tricks on Apple workstations. Reverse engineered and decrypted state actor malware using MS Paint."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Training Day - Hamilton (Jan 2024)",
        "date": "2024-01-27",
        "time": "08:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780340",
        "timezone": "Pacific/Auckland",
        "description": "We're pleased to announce that we'll be holding an OWASP Training Day event in Hamilton, on Saturday, 27th January.\n\nClasses will run 8:45 a.m. - 5:30 p.m. Tea breaks and lunch will be provided. Registration check-in opens at 8:00 a.m.\n\n**Registration Fee:** $99 per attendee (plus GST and booking fees)\n\n**Classes on offer:**\n\n* Threat Modelling: From None to Done (John DiLeo)\n* Like ISO/IEC27001, but Backwards (Stephen Coates)\n\n**To Register:** https://events.humanitix.com/owasp-training-day-hamilton-jan-2024"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Learn why every SCA tool is wrong / Leveraging personal effectiveness to build..",
        "date": "2024-01-18",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/298366758",
        "timezone": "America/Los_Angeles",
        "description": "**Title**: What's in your AI code? Learn why every SCA tool is wrong, and how to deal with it.\n**Abstract**: With the rise of AI-fueled by Python-based libraries, it has become of paramount importance to scan Python-based projects and their dependencies for OSS vulnerabilities. Python relies on package managers like pip or conda to manage declared dependencies. Dependencies are declared in manifest files which the package manager uses to install the correct version of the required dependency. However, Python’s dependency management system coupled with its dynamic type nature makes it an especially challenging language to deal with.\n\nOf particular focus is the phenomenon of phantom dependencies which are unreported dependencies in a project's manifest profile. These hidden dependencies, which are often provided dependencies (which is especially true for libraries such as tensorflow and pytorch which are essential for AI), challenge software composition analysis (SCA) of Python code, impacting the reliability of vulnerability results.\n\nFor example, in the case of OpenAI's baseline codebase, there is a dependency on tensorflow that is not explicitly declared and is hence a phantom dependency This can cause unexpected behavior and security vulnerabilities. We show how using type-aware program analysis to create call graphs and perform reachability helps us determine the correct dependency set for a codebase irrespective of what is in the manifest.\n\nProgram analysis aims to extract information from software programs to enhance reliability, security, and performance. This session explores program analysis, specifically reachability analysis in Python, and delves into phantom dependencies - often overlooked in Python applications.\n\nPython's dynamic typing and interpreted nature make it a challenging subject for reachability analysis. The lack of type information makes it hard to precisely determine what dependency/features are used in the code.\n\nIn summary, program analysis, including Python's unique challenges, is essential in software development. Phantom dependencies in Python underscore the significance of meticulous dependency management for code reliability and security. Understanding these concepts is vital for Python developers aiming to build robust software. This abstract sheds light on program analysis complexities and the pitfalls of phantom dependencies, offering valuable insights into Python development and software reliability.\n\n\\-\\-\\-\n\n**Title**: Leveraging personal effectiveness to build your life and career.\n**Abstract**: In an age of generative Ai, we no longer rely on our technical prowess or mastery of tools to sustain our careers. Through careful personal growth careers, not only do we maximize our career potential, but likely yield more satisfying and fulling lives. Curtis outlines 3 strategies to maximize personal growth.\n\n\\-\\-\\-\n**Schedule:**\n6:00pm - 6:30pm Networking, Food & Drink\n6:30pm - 6:50pm Leveraging personal effectiveness to build your life and career.\n6:50pm - 8:00pm What's in your AI code? Learn why every SCA tool is wrong, and how to deal with it."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa January 17th 2024: Disruptive Technologies in Security 2024",
        "date": "2024-01-17",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/298475758",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\n**Live Stream**:\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=kFjMhOIALi0\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **Panel Discussion: Disruptive Technologies in Security**\n\n**Abstract:**\nOWASP Ottawa starts 2024 with something different. On January 17th we invite members of the security community from industry, academia, and the trenches for an interesting discussion to opine on the greatest technology influences on the security industry in 2024.\n\n**Panellists:**\n**Guy-Vincent Jourdan** joined the University of Ottawa in June 2004, after 7 years in the private sector as C.T.O. and then C.E.O. of Ottawa based Decision Academic Graphics. He received his PhD from l'université de Rennes/INRIA in France in 1995 in the area of distributed systems analysis. He has over 15 years’ experience in leading research and industry collaborations. He has co-authored over one hundred scientific publications and 15 patents. For the past decade, his main research area has been cybersecurity, specifically, cybercrime detection and prevention.\n**Adam Lomas** has spent more than 15 years designing, building, securing, testing, supporting, and selling software solutions. He has a passion for building effective and resilient software in scrum based and lean agile development. He is currently the DIrector of Information Security and Privacy for Formstack, a leading SaaS suite vendor.\n**Dmitriy Beryoza** is a Senior Security Researcher with Vectra AI, working on threat detection in the cloud and on-prem networks. Before that he was a penetration tester and secure software development advocate at IBM. He has been a software developer for many years, before switching to security full-time. Dmitriy presented talks at security conferences such as DEF CON Cloud Village, HackFest, BSides, and others.\n**Adam Janzen** is a senior cybersecurity manager and currently a lead for cyber incident response at Bell Canada. In his role at Bell, he provides technical leadership and guidance to the information security team and senior management. He is actively involved with the information security community, including volunteering with the OWASP Ottawa Chapter.\n**Abdulrasaq Lawani** is a Web developer working through NVision-IT. He writes software but has often been called on to recover hacked sites, harden and secure applications. Abdulrasaq hails from Lagos, Nigeria"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2024-01-25",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296056640",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - AI+security",
        "date": "2024-01-30",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/298327716",
        "timezone": "Europe/Warsaw",
        "description": "*Join us for an engaging evening focused on securing web applications. In this meetup, we will dive into the world of application security, exploring the latest trends, best practices, and techniques to protect web applications from potential threats. Our knowledgeable speakers will cover a wide range of topics including....*\n\nOK - AI generated description is probably not working for our meetups  Let's do it old fashioned way:\n\nHi,\n[OWASP](https://owasp.org/) is a worldwide, non-profit organisation focused on application security issues and we are a Polish chapter of this initiative.\n\nThis time we want to talk about AI and it's influence on our industry and our work. We have invited Karol Przystalski from Codete, who will share his thoughts about security of ML models. Then we will have a discussion about how wide use of generative AI in coding will influence application security.\n\nAgenda:\n\n1. **Machine learning security (Karol Przystalski)**\nMachine learning (ML) and other terms related to it became buzzwords. Many companies would like to introduce machine learning models, even if there are simpler solutions. In the presentation, we show recent security issues related to machine learning models. Next, we do an overview of possible security issues that can happen during building such models. Finally, we demonstrate how to prevent the most popular security problems related to ML on the examples of applications in e-commerce, fintech, and other sectors.\n2. After the break, we will be hosting a **discussion on how AI and Generative AI impact the security of application code**. Are AI-powerd tools a boon or a potential risk? What risks emerge when software engineers start using GenAI? Is the code produced by GenAI more or less secure? Are tools designed for code, such as GitHub Copilot and AWS CodeWhisperer, superior to GPT? Everyone is welcome and encouraged to participate in the discussion. Share your experiences and thoughts, exchange the latest insights, and learn from each other. Whether you are an experienced software engineer, a newcomer to the world of AI, or simply curious about the influence of Generative AI on code security, your perspective is valuable.\n3. There will be also a room for **short lightning talks** with discussion (typical format is 5-10 minute talk followed by 5-10 minute discussion). [Please submit your ideas](https://forms.gle/7JFiD3z2tKifogvs5) or just show up.\n4. Job announcements. If you are an employer, there will be a chance to present who you are looking for.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this** with friends and in social media.\n\n**Sponsor wydarzenia**\n[Codete](https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fcodete.com%2F&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573255135%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=%2BYKLHBngHjVS6%2F0INX6RRWCdgE5XHx4jzAxrFguqwrI%3D&reserved=0) is a software company based in Poland that specializes in custom software development and IT consulting. Codete in numbers:\n\n* 350+ specialists\n* 3 offices in Krakow, Lublin, Berlin, and coworking spaces in major Polish cities (Warsaw, Wroclaw, and Gdansk).\n* 120+ projects\n* 70+ clients from around the world\n\nIn January 2022 Codete opened its own resto-bar Techie’s where we host the best tech events in town.\nJoin the Techies Space Group on [meetup.com](https://emea01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fmeetup.com%2F&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573255135%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=ksYG8qc5ObEQ7r3LgTe9PoDhCj1tYgbwkqfB6IhwPUs%3D&reserved=0) [Techie's Space \\(Kraków\\, Polska\\) \\| Meetup](https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.meetup.com%2Fpl-PL%2Ftechies%2F&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573255135%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=OymONNx5q3QuLtpZAa6vqDVMxbHdsQiVXJBtv2ai9CI%3D&reserved=0) or sign up to our mailing list [https://lp.codete.com/techies-space-event-form](https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Flp.codete.com%2Ftechies-space-event-form&data=05%7C01%7C%7C6abbe7bee00040f7795508db2938e5da%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638149096573411392%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=54zbp%2BQiF8Mu7P6uloIca0YgsjLmKA6rH6GSM8O4U78%3D&reserved=0)\nand never miss a meetup!"
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Hacking a SaaS: A Practical Guide to Understanding Attack and Defense",
        "date": "2024-01-18",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/297889289",
        "timezone": "America/Los_Angeles",
        "description": "*Hacking a SaaS: A Practical Guide to Understanding Attackers and Defending Against Them*\n\nIn this talk, we will delve into the mindset of an attacker and explore the vulnerabilities they exploit in SaaS systems. We will cover the following topics:\n\n* What motivates hackers to target SaaS systems (5%)\n* How hackers conduct reconnaissance on SaaS systems (50%)\n* The anatomy of exploit chains (40%)\n* Strategies for defending against attacks (5%)\n\nOur goal is to provide a practical guide to understanding attackers and defending against them. We will share lots of hacker tips and tricks, and provide plenty of quiz moments to train your intuition. Our focus will be on vulnerabilities that hackers actually care about, rather than theoretical ones. All of our examples will be based on real-world exploit chains, and we will explore multiple vulnerabilities chained together to create media-news-headline-worthy outcomes. By the end of this talk, you will have a better understanding of how attackers think and operate, and you will be better equipped to defend against their attacks.\n\nOur January host and sponsor is Solutional Inc, and the talk will take place in their Portland office at 301 SE 2nd Ave.\n\nPlease RSVP here if you are planning to attend.\n\nThis is a monthly event of OWASP's Portland chapter."
    },
    {
        "group": "Pune",
        "repo": "www-chapter-pune",
        "name": "OWASP Pune Meetup 20-Jan-2024",
        "date": "2024-01-20",
        "time": "11:00+05:30",
        "link": "https://www.meetup.com/owasp-pune-chapter/events/298503627",
        "timezone": "Asia/Kolkata",
        "description": "It's 2024!!! Let's meet again with our information security community and learn from each other and also have some fun moments.\n\n**Agenda:**\n11AM - 11:15AM - Introduction to OWASP by Jyoti Raval, Prasad Salvi & Pramod Rana\n\n11:15AM - 12:00PM - Session 1 - **Securing the Modern App: Unleashing the Power of Interactive Application Security Testing (IAST)** by **Amol Gangurde**\n\n* Introduction to IAST\n* Traditional DAST vs. IAST\n* Overview of IAST\n* Advantage of IAST\n* Key Features of IAST\n* Benefits of IAST for Developers\n* Challenges and Considerations\n* IAST tools available in market\n* Demo\n* IAST demo using Contrast Community Edition tool\n* Q/A\n\n12PM - 12:15 PM - Networking Break\n\n12:15PM - 01:00 PM - Session 2 - **DevSecOps- Why Should We Embrace It?** by **Kamal Boolchandani**\n\n* Cloud Security\n* Challenges for Cloud Security\n* Case Study: Famous Cloud Attacks\n* Misconfiguration in Cloud\n* Why DevSecOps?\n* DevSecOps vs DevOps\n* DevSecOps RoadBlocks\n* DevSecOps Model (AWS)"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC / Wasatch AppSec -January Meetup-In person @ (Cottonwood Heights, UT)",
        "date": "2024-01-25",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/297931007",
        "timezone": "America/Denver",
        "description": "**Agenda**:\n\n1. Introductions / Lunch\n2. Presentation by TBA:\n3. Q&A\n\nCome join us for a lunch meetup at the Aumni building in Cottonwood Heights.\nCasual group and anyone interested in Application Security is welcome to attend. We'll discuss software security tips and practices others are implementing to support their organization's AppSec efforts.\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-02-14",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/297834962",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Top 10 for LLM:s",
        "date": "2024-01-17",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/297944649",
        "timezone": "Europe/Stockholm",
        "description": "Artificial Intelligence is reshaping nearly every sector and will influence our society in ways that we are only now starting to comprehend. Rapid evolvement of tools, methods, and novel approaches is prompting businesses to swiftly adopt fresh solutions to harness the potential of this emerging paradigm. However, as new technologies, methodologies, and work practices are introduced, hackers also adapt and innovate, always staying one step ahead.\nThis session led by cybersecurity specialist Krister Hedfors will explore the techniques that hackers use to leverage, manipulate, and exploit GenAI systems, such as ChatGPT and Code Llama. He will also give an introduction to OWASP top 10 list for Large Language Models (LLM).\n\nThe meeting will start with a mingle at 18:00, the main presentation beginning (with online attendees) at 18:30"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Building an AppSec program from scratch",
        "date": "2024-01-18",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516358",
        "timezone": "America/Vancouver",
        "description": "**Building an AppSec program from scratch** with **Lucas Amorim**\n\nJoin us to learn about the journey of building an Application Security (AppSec) program from scratch.\nIn this talk, we'll delve into the challenges, motivations, and key lessons learned in establishing a robust AppSec initiative.\nDiscover how to set objectives, build the right team, select tools, develop policies, engage stakeholders, assess risks, conduct testing, promote education, and continuously improve.\n\nLucas Amorim is a seasoned Application Security engineer with more than 12 years of hands-on experience in both application security and software engineering.\nWith a diverse career spanning multiple industries, including cloud computing, marketing, fintech, and ticketing systems.\nThroughout his career, Lucas has contributed to securing and actively participated in crafting robust solutions in various domains."
    }
]