[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - March 2024 (Online)",
        "date": "2024-03-26",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298206989",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "March 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-03-14",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299104332",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, March 14th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [IriusRisk](https://www.iriusrisk.com)\n*We make secure design the standard, scalable practice for all digital teams. IriusRisk makes secure design fast, reliable and accessible, even to non-security users, thanks to our automated and intelligent Threat Modeling Solution.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-03-14",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299385052",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-03-07",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299385377",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "AppSec: Where to Start, and Some Free, Easy Wins",
        "date": "2024-03-14",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/298999635",
        "timezone": "Australia/Brisbane",
        "description": "With a limited supply of potential hires and an already maxed security budget, how do we begin to tackle Application Security (AppSec)?\n\nThis talk will attempt to help provide some direction when it comes to solving this problem. It is aimed at security folks and developers of all skill levels who are interested in getting their feet wet with AppSec.\n\nDuring the talk we will first explore an industry framework that can help guide the first few steps in our journey. Then, we will dive into a demo and highlight some of the fantastic free and open-source tools that we can use to demonstrate value and rack up a few easy and impactful wins."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "March Meetup - Threat Dragon",
        "date": "2024-03-05",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/299254390",
        "timezone": "Europe/London",
        "description": "Jon Gadsden is going to start with a talk on **Threat Dragon**, as Project leader and contributor for the OWASP Threat Dragon tool, he knows a thing or two about what it does, and how it can be used.\n\nAfter the break, we will have a semi-structured **discussion** on **The Effects of our Decisions**; the intention is to draw on the experiences of everyone in the room to learn more about the subject. While the example will be about bcrypt cost, it's more about how security professionals must properly consider the decisions they make, and the effects those decisions have (see also changing passwords every 90 days).\n\n\\-\\-\\-\n\n**OWASP Threat Dragon**\n\nThreat Modeling is becoming more and more prominent in the security community; it is recognised as an important part of compliance, pipelines and software development.\n\nThis talk provides the reasons for doing threat modeling, what to look for in threat modeling, and how to threat model using the OWASP Threat Dragon tool.\n\nIt will introduce the various features of Threat Dragon and show how to use them to create a complete threat model.\n\nThe talk will include illustrations of Threat Dragon as it goes along, and if time permits then a demonstration can be given of creating a complete threat model using Threat Dragon.\n\n**Jon** is a software security engineer with Ping Identity, a company that provides Identity and Access Management services.\n\nHe is also a Co-Leader for the OWASP chapter in Bristol.\n\nJon splits his time between security engineering and software development; he says that he likes it this way because it reminds him that developers are always under time pressure and that product security engineers require a whole load of tact.\n\nJon has been involved with the open source software community since Linux 2.0.28, and he is a leader of the OWASP Threat Dragon project and also the OWASP Developer Guide."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "From SBOMs to F-Bombs: Vulnerability Analysis, and False Positives & Negatives",
        "date": "2024-03-21",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295370660",
        "timezone": "America/New_York",
        "description": "Managing vulnerabilities in third party software has become an important application security activity. Vulnerabilities like Log4Shell and various supply chain attacks such as SolarWinds or CodeCov and numerous others have given many of us haunting nightmares resulting us sleeping with one eye open. Fortunately, Software Composition Analysis (SCA) tools coupled with Software Bill of Materials (SBOMs) have done so much to relieve that anxiety. Or not. This talk explores the vulnerability management process through the eyes of a FOSS security library provider and examines what we can do as AppSec engineers and developers to make the whole process a bit less painful."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP March Meet - In person",
        "date": "2024-03-19",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/299474646",
        "timezone": "America/Chicago",
        "description": "\\*\\*\\*\\*Appsec in an AI-powered world\\*\\*\\*\\*\\*\n\nIn this bold new age of artificial intelligence, software is evolving at a blistering pace. From AI-generated code to automated devops to ingenious new AI applications, innovation is accelerating. Businesses across every industry stand to gain enormously in productivity and efficiency. However, with such great power comes great risk. As AI accelerates the pace of software innovation, it also increases the prevalence of vulnerabilities and exploits.\nGiven that application security teams are often under-resourced and equipped with weak technologies... What can they do to manage the inevitable complexity introduced by AI? This interactive talk will lay out the escalating challenges for application security and engineering teams while offering some practical solutions."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "OWASP SnowFROC Conference: GREAT talks, workshops, networking, food and drinks!",
        "date": "2024-03-07",
        "time": "08:00-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/299034782",
        "timezone": "America/Denver",
        "description": "SnowFROC (Front Range OWASP Conference) is Denver's premier application security conference. It is an annual, one-day conference which draws about 400 people. For SnowFROC 2024 the event will be held Thursday March 7th. While billed as, \"Denver's premier application security conference\", SnowFROC's presentations and workshops focus on many facets of cybersecurity and over the years, SnowFROC has come to be known for its exceptional value: Hands-on training, excellent food, spectacular networking, great location/venue and professional orchestration.\n\n**REGISTER HERE**: [https://www.eventbrite.com/e/owasp-snowfroc-2024-tickets-788326514827](https://www.eventbrite.com/e/owasp-snowfroc-2024-tickets-788326514827)\n\n2024 TICKET PRICES:\n\n* General Admission Tickets: $95 (required to attend)\n* Premium Workshops: $30 (optional)\n* Basic Workshops: $20 (optional)\n\nSnowFROC includes breakfast, lunch, presentations, vendor giveaways, a panel discussion and optional hands on training and workshops."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Protecting Our Tech: Fortinet's OT Security Talk at OWASP Edm 5PM mst! 🌐🔒🎤",
        "date": "2024-03-26",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/299499883",
        "timezone": "America/Edmonton",
        "description": "**Time:** 5:00PM - 7:00PM MST\n**Date:** March 26th 2024\n**Location:** Concordia University Robert Tegler Hall\n\n**ISC2 will be offering 1 CPE** credit to all attendees at this event and you must RSVP.\n\n**Event Description:**\n Join us for an exhilarating evening at OWASP Edmonton hosted amidst the picturesque setting of Concordia Universities Robert Tegler Hall!  **Fortinet** is thrilled to bring you an unforgettable experience, complete with insightful discussions, delightful refreshments, and exciting door prizes! \n\n Get ready to delve into the fascinating world of Operational Technology (OT) Security with our distinguished speaker, Jeff Brown! With over two decades of invaluable experience in the field, Jeff serves as the Regional Manager of Operational Technology at Fortinet.  His expertise promises to enlighten and empower attendees with profound insights into the intricacies of OT Security.\n\n**Culinary Note:**\n Prepare your taste buds for a culinary journey as **Fortinet** brings in a top-notch catering company to ensure that every attendee is well-fed and energized throughout the event! \n\n**Final Notes:**\nDon't miss out on this incredible opportunity to expand your knowledge, connect with industry peers, and indulge in delectable treats!  Remember to **RSVP to secure your spot** for catering and to stand a chance to win exciting door prizes! \n\nMark your calendars and join us for an evening of education, networking, and fun at OWASP Edmonton! See you there! "
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "Software-Supply-Chain Security in Practice",
        "date": "2024-03-19",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/299235247",
        "timezone": "Europe/Berlin",
        "description": "Moin in die Runde,\n\nwe will continue with a talk in German.\n\nIm März haben wir Stephan Kaps zu Gast. Er ist engagiert in der Java User Group Bonn und arbeitet für eine Bundesbehörde. Er hatte einen ähnlichen Vortrag beim letzten German OWASP Day gehalten.\n\nZu Gast sind wir wieder zentral bei Check24, am Anfang der Außenalster (Nähe Hotel Atlantic) In Fußmarschentfernung vom Hauptbahnhof.\n\nAus planungstechnischen Gründen unseres Hosts sag mir bitte per Mail oder hier bei Meetup Bescheid, wenn du dazustoßen möchtest.\n\n# **TL;DR**\n\nTitel: „Software-Supply-Chain Security in Practice“\nSprecher: Stephan Kaps\nLokation: Check24, An der Alster 64, 20099 Hamburg\nStart: 19.3.2024, Einlass ab 18:30 Uhr, Start 19:00 Uhr . *Bitte pünktlich sein!*\nNetworking danach: TBD\n\n# **Abstract**\n\nSchwachstellen in Bibliotheken sorgen spätestens seit Log4J aus Dezember 2021 regelmäßig für Überstunden in IT-Abteilungen. Doch was haben wir daraus gelernt? Haben wir Erkenntnisse gewonnen oder Maßnahmen ergriffen, um bei der nächsten Zero-Day Vulnerability effizienter agieren zu können? Können wir schneller herausfinden, in welchen Produkten eine Bibliothek in einer bestimmten Version verwendet wird (SBOM)?\n\nIn diesem Vortrag zeige ich euch, wie ihr einen Beipackzettel für eure Software erstellen könnt und diese Aktion in euren Build- oder Deploy-Prozess integriert (DevSecOps). Darüber hinaus stelle ich ein Open-Source Werkzeug vor, um diese Infos aus diversen Produkten an einer zentralen Stelle auf Verwundbarkeiten hin zu überprüfen und wie ein solches Tool bei der kontinuierlichen Software Composition Analysis (SCA) unterstützt, um Risiken in der Software Supply Chain frühzeitig zu identifizieren.\n\nZusätzlich werde ich zeigen, welche Maßnahmen noch sinnvoll und notwendig sind, um eine sichere Software-Supply-Chain zu etablieren: vom ersten Commit bis zum Deployment in Produktion.\n\n# **Generelles zum OWASP-Stammtisch**\n\nBei unseren offenen Treffen geht es um Software und deren Sicherheit im Internet und/oder IT-Security allgemein. Hier treffen sich Menschen, die sich beruflich oder privat mit IT-Sicherheit beschäftigen: Entwickler, Manager, „Pentester“ und alle an (Web)sicherheit interessierte. Die Atmosphäre ist offen und locker. Uns geht's um den Erfahrungsaustausch, Technikschnack und um's Netzwerken. Wer Produkte oder Dienstleistungen verkaufen will, ist hier falsch. Ihr seid herzlich willkommen, euren Kollegen oder Bekannten einen Hinweis auf unsere Treffen weiterzuleiten. Alle Treffen sind frei, für jeden offen und kostenlos.\n\nSchönen Gruß, Björn / Dirk"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg PyPI security and TruffleHog Disclosure",
        "date": "2024-03-21",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/299361118",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Omegapoint's office for an intriguing evening with food and drinks, and talks about PyPI security and a disclosure of security issues in TruffleHog!**\n\n**Where:** Omegapoint, Rosenlundsgatan 3, 411 20 Göteborg\n\n**Agenda:**\n**17:00 - 17:30:** Welcome to Omegapoint\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n**17:45 - 18:30:** *PyPI Security: Past, Present & Future*\nThe talk will be about PyPI's security stance, from the point of view of a\nfree software maintainer: 2FA, tokens and authentication.\nThe changes they did, the mistakes along the way, changes that are a work in progress and speculation on changes they will introduce in the future.\n**Salvo Tomaselli** is the sole maintainer of a critical python library.\nAlso small time free software contributor, Debian developer, IRC dweller, GPG holdout. Has worked in Gothenburg for a network security company for the past years.\nEnjoys jamming music, participating in flame wars and talking too loud.\n\n**18:30 - 19:15:** Food & Drinks\n\n**19:15 - 20:00:** *TruffleHog Security Issue Disclosure*\nThis presentation covers a set of security issues in TruffleHog, an open source, automated security tool that scans code repositories and configuration files for active secrets. The session provides a detailed walkthrough with several live demos, showing how the tool can be exploited to remotely harvest credentials from anyone running a default installation of TruffleHog v3. This presentation is part of a coordinated disclosure together with Truffle Security, the team behind TruffleHog.\n**Helena Rosenzweig** is a security researcher and software engineer at Omegapoint, focusing on application security for client projects. She has a keen interest in building secure and scalable software but is equally intrigued by all the things that can go wrong.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy March 2024 Online Meetup ",
        "date": "2024-03-08",
        "time": "16:00+01:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/299400128",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy online Meetup is a 2 hours conference focused on web application and software security, application security testing tools and technologies.\n\nNext 8th March 2024 we will 3 great speakers:\n\n* **Tommaso Innocenti** \\- Ph\\.D\\. student working as a Secure Systems Lab \\(SecLab\\) member at Northeastern University\\.\n* **Luca Demetrio -** Ph.D Assistant Professor at the University of Genoa.\n* **Andrea Valenza -** Ph.D, Application Security Engineer at Prima Assicurazioni.\n\nThis Meetup provided a unique opportunity to learn about application security topics and to network with application security professionals/managers, software engineers, software quality engineers/testers and computer science students.\n\nSecure now your spot for the upcoming online event!\n\nMore information and the Agenda at the following URL:\nhttps://owasp.org/www-chapter-italy/events/owaspitaly2024-03-08"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-03-18",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/298995347",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#06 - The Eggs",
        "date": "2024-03-05",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/298504205",
        "timezone": "Europe/Lisbon",
        "description": "Join us for the first event of the year, with two great speakers!\n\nThe OWASP Lisboa chapter meetup will be held on Mar 5th, 2024, at 18:00, **and is** **supported by [Celfocus](https://www.celfocus.com/) and [AP2SI](https://ap2si.org/).**\n\nThe schedule is the following:\n**18:00** - **Welcome notes** by the OWASP Lisboa chapter leadership team\n**18:15** - **LLM Security: The OWASP Top 10 Journey** by Jorge Pinto\n**19:10** - **SBOM, SBOM, you're an SBOM** by Diogo Sousa\n**20:00** - **Drinks & Dinner** by Celfocus\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **LLM Security: The OWASP Top 10 Journey**\n\nSpeaker: **Jorge Pinto**\n\nAbstract:\nJoin me for a journey into the development of the OWASP Top 10 for Large Language Model Applications. In this presentation, we will uncover the background, challenges, and collaborative efforts that led to the creation of this resource for the cybersecurity community.\n\nThe presentation will be around 20\\~30 minutes incl. Q&A and will have the following structure:\n\n(1) Introduction\n\nIntroduce the audience to Large Language Models (LLMs) and their significance.\nExplain why creating an OWASP Top 10 for LLMs was necessary to address LLM security concerns.\n\n(2) Project Development\n\nDescribe the inception of the OWASP Top 10 for LLMs project and key contributors.\nHighlight any challenges faced during its development and how they were overcome.\n\n(3) Top 10 LLM Security Risks and Mitigation\n\nPresent the identified top security risks associated with Large Language Models.\nOffer practical recommendations and mitigation strategies to address these risks.\n\n(4) Conclusion and Future Outlook (2-3 minutes)\n\nSummarize the main takeaways from the presentation.\nDiscuss the ongoing relevance and future of LLM security and the OWASP Top 10 for LLMs.\n\nBio:\nWith more than 25 years of experience, Jorge Pinto is a professional in the area of information security in Portugal. With a degree in Computer Engineering from the University of Lisbon, he is a Senior Engineer and has several certifications such as CISSP, CISA, CISM and CRISC. Throughout his career he has played several roles, contributing to the effective response of various entities to security, privacy and business continuity challenges. Founder and president of AP2SI, co-organizer of BSidesLisbon and active member of several associations, including OWASP, he is a committed professional dedicated to promoting good practices and knowledge of information security in Portuguese society.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **SBOM, SBOM, you're an SBOM**\n\nSpeaker: **Diogo Sousa**\n\nAbstract:\nSoftware Bill of Materials (SBOM) is a concept that recently has been making waves in SDLC spaces but it isn't entirely new. Most mature languages have a (sometimes) mature package management system, either built-in (e.g., Rust's cargo) or de facto (e.g., Maven) that allows developers to define dependencies, resolve conflicts and do composition analysis.\n\nSBOMs, however, allow you to take this one step further, making it language-agnostic and allowing components from different ecosystems to use a common language for comparisons and analysis. However, we don't get those features out of the box. For example, consider common libraries in different package repositories - are all OpenSSL packages created equally and equivalent?\n\nOWASP is playing a part in this via its support for projects like CycloneDX which aims to provide a full-stack BOM standard to cover specific scopes such as the CBOM (Cryptography) and HBOM (Hardware) among others.\n\nThis shift towards software being more transparent and traceable is not without its detractors, as entire business models are predicated on customers using purely opaque boxes.\n\nIn the spirit of the topic, here is a Talk Bill of Topics:\n\n\\- Are BOM requirements burdensome?\n\\- Are we revealing too much of the \"secret sauce\"?\n\\- Does having an SBOM instantly make a piece of software more secure?\n\\- If we take a piece of software and replace every entry in its BOM with fully equivalent packages\\, one by one\\, is it still the same software in the end?\n\nThis talk targets a beginner to intermediate audience and will provide an overview of (S)BOMs, their ongoing challenges, and what they can bring to the table in terms of security.\n\nBio:\nAn opinionated individual with an interest in cryptography and its intersection with secure software development.\n\nLinkedIn: [https://www.linkedin.com/in/0xdsousa/](https://www.linkedin.com/in/0xdsousa/)"
    },
    {
        "group": "Ljubljana",
        "repo": "www-chapter-ljubljana",
        "name": "Do WAFs make sense?",
        "date": "2024-03-21",
        "time": "16:30+01:00",
        "link": "https://www.meetup.com/owasp-ljubljana-chapter/events/299194709",
        "timezone": "Europe/Belgrade",
        "description": "You might have heard about 'WAFs' (web application firewalls) from someone cold emailing you a commercial offer, or you might have heard about mod_security. Not sure what they are about and how they “secure” you? Say no more. In this presentation, we will delve into the realm of Web Application Firewalls, sparked by encounters with commercial vendors and open-source solutions like mod_security. Join us as we unravel the intricacies of WAFs, understanding what and how they 'firewall', and some techniques on how to bypass them, all in an effort to demystify their role in today’s security landscape."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Vulnerability Reachability Analysis Using OSS Tools w/ OWASP LA",
        "date": "2024-03-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/299456168",
        "timezone": "America/Los_Angeles",
        "description": "**Hands on Workshop** \"Vulnerability Reachability Analysis Using OSS Tools\"\n\nHello AppSec teams and tech enthusiasts! We're thrilled to roll out an exceptional DevSecOps workshop in collaboration with **OWASP LA** and offered by [Deepfactor](https://www.deepfactor.io/). This workshop will walk you through the process of using runtime analysis using OSS (Open Source Software) tools to identify which vulnerable components in an application are actually loaded into memory and, therefore, represent a higher risk to your business. You’ll learn how to be a hero in your organization by helping your dev teams save time and fix a significantly smaller number of high-risk vulnerabilities!.\n\n## **Abstract**\n\nNew vulnerabilities are disclosed every day in dependencies that you or your team may be using. But how do you know if you are actually using the vulnerable code? This workshop will show you how to use two different types of tools to analyze reachability (1) static call graphs and (2) runtime analysis, and help in deciding if the vulnerability needs to be prioritized based on your own code usage.\n\n## **Workshop Overview**\n\nThe workshop will be broken into several modules; introductory modules will cover the workshop organization and administrative matters (installing and configuring the tools used in the workshop). Subsequent modules will give an outline of what vulnerability reachability is and why it is important and compare/contrast the two main ways of understanding reachability (static call graphs and runtime analysis).\n\nNext, the workshop will present two short exercises, intended for the attendees to gain hands-on experience using both types of tools against real applications with real vulnerabilities. Interpreted languages (Java) and compiled languages (C/C++/Go) will be covered. Subsequently, the following module will walk through how to interpret the results obtained from the exercises and draw conclusions. The languages chosen are merely representative; the skills learned in the workshop are equally applicable to other languages.\n\nThe workshop will conclude with two modules which will present a short overview of commercial tools and a conclusion/wrap-up/Q&A session.\n\n## **Outcome/Learnings**\n\n* Understand what vulnerability reachability is and why it is important\n* Compare/contrast the two main ways of understanding reachability (static call graphs and runtime analysis)\n* Via hands-on experience, use both types of tools against real applications with real vulnerabilities. Interpreted languages (Java) and compiled languages (C/C++/Go) will be covered.\n* Learn how to interpret the results obtained from the exercises and draw conclusions\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAR 27, 2024",
        "date": "2024-03-27",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297895073",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Decoding Compliance to Empower Developers\nJoin us for great networking, dinner and drinks, and see a presentation by **Karina Klever**, President and Founder, **Klever Compliance**\n\n**ABSTRACT**: You just got asked to implement controls supporting HIPAA. Or GLBA. Or GDPR. Or SOX. Or ISO27001. Or whatever other acronym soup regulation or framework pertinent at your company. What now?! Most companies have requirements to be compliant, but lots of us working at these companies don’t know where to start or how to show that we are following these guidelines.\nJoin us to understand guideline constructs, their purpose, and how to best appropriate to your company. We’ll go over a high-level lifecycle of the GRC process to understand the significance of specificity and supportive evidence gathering instructions within your own published documents. As a bonus, we’ll quickly review some recent regulations and publications that may impact your role directly – Everyone is talking about the AI related ones!\nThis session will aim to equip you with a compass that will help you navigate GRC regulations, frameworks, conversations, requirements, preparedness and remediations involved with this frequently ethereal topic. Bring your questions for this interactive event!\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "March meetup: The Monsters in your Software Supply Chain",
        "date": "2024-03-06",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/298803400",
        "timezone": "America/Chicago",
        "description": "**The Monsters in your Software Supply Chain that traditional App Sec tools can't find**\n**Matt Rose, Field CISO at ReversingLabs, Security Practitioner**\n\nThe Solar Winds, 3CX and CircleCI software supply chain attacks exposed gaps in the current application and software supply chain security paradigm, highlighting the need for orgs to zero in on issues unique to software supply chain attacks. Join Field CISO Matt Rose as he unpacks recent attacks, the need to better prioritize secrets, malware, tampering, SBOMs, and application/software behaviors. You will learn some simple steps that application security and third party risk management teams can take to level up their Software Supply Chain Security Initiatives.\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n6:30 - Q&A\n\nPlease remember to register and keep your registration up to date so we know how many to expect."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "March 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-03-21",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/299257952",
        "timezone": "Europe/Amsterdam",
        "description": "See [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **How to get Dev(Ops) teams to start adopting DevSecOps** by **Sebastiaan Rijnbout**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Cracking the API: Challenges in IoT and Modern Applications** by **Yianna Paris**\n\n**How to get Dev(Ops) teams to start adopting DevSecOps**\n*Abstract:*\nIn many development environments, security has long been seen as an afterthought or even a right-out hindrance. And forcing security onto developers often has an adverse effect. In this talk we will share the journey we have been making at the Dutch Chamber of Commerce (KVK) to get Development teams to adopt DevSecOps in a way that works best for them. Topics that will be discussed include Secure Development training, Security Champions, Threat Modeling and using the right tooling.\n\n*Bio:*\nSebastiaan Rijnbout has a background as .NET developer and has worked in that field for over 12 years, but since 2017 he has started focusing on AppSec and Dev(Sec)Ops.\n\nWhen getting teams and organisations to adopt DevSecOps, Sebastiaan will look at all aspects of DevSecOps (People, Process and Technology) like setting up developer training programs and security champion programs, rolling out company-wide Security tooling and improving working processes. But always keeping a focus on making things easy and efficient for developers.\n\nIn his current role at the Dutch Chamber of Commerce (KVK) Sebastiaan acts as Product Owner for 4 Dev(Sec)Ops support teams. These teams are responsible for enabling all development teams at KVK to deliver secure and high-quality software as efficiently as possible.\n\n**Cracking the API: Challenges in IoT and Modern Applications**\n*Abstract:*\nSecuring API’s is about more than just an endpoint, it’s about the data shared, customer privacy, and the access we give to unauthorised parties. Now as we are connecting more devices than ever, to more third parties than ever, securing APIs needs an offensive mindset from the design phase.\n\nIn this talk I’ll go over some of the techniques I use when testing, common issues I’ve found and their impact, and the state of IoT and modern web applications.\n\nSecurity issues can arise from misconceptions early in the software process, so I’ll also discuss how we might mitigate some of these with thoughtful design, architecture and development.\n\n*Bio:*\nFrom user experience to software engineering, Yianna has a diverse background with one thing in common - exploring the intersection between human interaction and technology. Currently she is an Offensive and Application Security Engineer at Xebia. Working in tech teams and researching new offensive techniques remains a daily drive for her. She’s passionate about giving back to the community, having presented at DEFCON, hosted security meetups, delivered workshops, contributed to OWASP Low Code / No Code, as well as building and contributing to open source tooling."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2024-03-12",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780380",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe'll be restarting our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for March will be **A01:2021 - Broken Access Control**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the second Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle March 2024",
        "date": "2024-03-13",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/299466332",
        "timezone": "Europe/London",
        "description": "We're back with our first event of 2024! We’ll be doing our usual two talks and pizza format.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1820 OWASP Newcastle Welcome\n1820 - 1920 Talk one\n1920 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk 1\n**Title:** TBC\n**Speaker:** TBC\n**Speaker Bio:** TBC\n\nTalk 2\n**Title:** TBC\n**Speaker:** TBC\n**Speaker Bio:** TBC\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Orange County Cybersecurity Mixer",
        "date": "2024-03-04",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/299351836",
        "timezone": "America/Los_Angeles",
        "description": "We had so much fun last time, we decided to do it again!\n\nJoin us for our JOINT Cyber Mixer at Left Coast Brewing all Cyber groups welcome.\n\nAre you a vendor? We welcome you as well, please plan to open a small tab for appetizers and drinks. Thanks in advance!\nThanks so much to Ray Burgess at Mimecast, as well as Crowdstrike and AppOmni- we appreciate your support of our community!\nLooking forward to seeing everyone there plus new faces as well! See you in March!\n\nThe Orange County (OC) cybersecurity organizations and groups that will participate in this event are:\n\n* **OWASP Orange County**\n* **Irvine Underground**\n* **Women's Society of Cyberjutsu SoCal Chapter**\n* **Cloud Security Alliance Orange County**\n* **ISSA of Orange County**\n* **ISACA Orange County**"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-03-28",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/298926492",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "March Meeting",
        "date": "2024-03-05",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/299251813",
        "timezone": "America/Phoenix",
        "description": "OWASP is a non-profit dedicated to application security. Our meetings are free to attend and you do not need to be a member, nor have any experience with application security. All are welcome!\n\nFor our March meeting, we will be discussing OWASP SAMM (Software Assurance Security Model), which you can use to assess your application security program for gaps, identify opportunities for your future roadmap, and understand how mature your appsec program really is. You can read more about OWASP SAMM here: https://owasp.org/www-project-samm/\n\nFree Parking:\n1 N Macdonald St, Mesa, AZ 85201\nhttps://downtownmesa.com/parking/green-lot\nNote that the parking lot is across the street from HeatSync Labs"
    },
    {
        "group": "Recife",
        "repo": "www-chapter-recife",
        "name": "Detecção de Vulnerabilidades em Código-Fonte com I.A",
        "date": "2024-03-13",
        "time": "20:00-03:00",
        "link": "https://www.meetup.com/owasp-recife-meetup-group/events/298972631",
        "timezone": "America/Recife",
        "description": "**[O que vai rolar?]**\nO próximo meeting do OWASP Recife ocorrerá no dia 13/03/2024 às 20:00 com o título: \"Detecção de Vulnerabilidades em Código-Fonte com I.A\" conduzida por Maria Fernanda Rodrigues, da Tempest Security Intelligence.\n\nA palestrante demonstrará uma forma de detecção de vulnerabilidades em código-fonte, utilizando o modelo não supervisionado de aprendizado de máquina FICS (Functionally-similar yet Inconsistent Code). O primeiro detector de bugs 'machine learning-based' que identifica e aponta inconsistências no código como indicadores de possíveis vulnerabilidades de segurança.\n\n**[Formato do encontro]**\nPalestra online\n\n**[Shortbio de Maria]**\nMaria Fernanda Rodrigues\nEstagiária em Pesquisa e Desenvolvimento\nTempest Security Intelligence\n\n**[Inscrições]**\nTOTALMENTE GRATUITO!\nEm breve iremos disponibilizar um link para o even3 para um credenciamento que será disponibilizado o link para a palestra."
    },
    {
        "group": "Sastra University",
        "repo": "www-chapter-sastra-university",
        "name": "Quiz time ",
        "date": "2024-03-02",
        "time": "09:00+05:30",
        "link": "https://www.meetup.com/owasp-sastra-university-meetup-group/events/299335823",
        "timezone": "Asia/Kolkata",
        "description": "**Get ready for an exhilarating test of knowledge and wit! Join us for the quiz where participants will engage in a battle of brains, tackling questions ranging from cybersecurity to general trivia.**"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-03-13",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/298337300",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - March Event @ Kivra",
        "date": "2024-03-20",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/299483018",
        "timezone": "Europe/Stockholm",
        "description": "Spring is quickly aproaching and OWASP Stockholm is hosting a meetup at Kivra featuring Mathias Karlsson, who will delve into the intriguing world of subdomain takeover within the Google Cloud Platform.\n\nThe meetup will start with a mingle with food and drinks at 17:30 and the main presentation will begin at 18:00.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcomming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter ](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\n\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "In a perfect DevSecOps world...",
        "date": "2024-03-21",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516364",
        "timezone": "America/Vancouver",
        "description": "**In a perfect DevSecOps world...** with Aleksandr Krasnov\n\nEmbark on a journey into the heart of DevSecOps with a focus on maturity and practical implementation. This talk unveils the symbiotic relationship between development, security, and operations, illustrating how their harmonious integration fortifies the software development lifecycle. Through real-world examples, attendees will gain a deep understanding of DevSecOps maturity, discovering its transformative impact on organizational resilience.\nThe session provides actionable strategies for attendees to enhance their DevSecOps proficiency, encompassing automated security testing, continuous monitoring, and rapid incident response. This concise exploration equips participants with a roadmap to ascend the DevSecOps maturity ladder, fortifying their software development practices against evolving threats. Join us for an engaging discussion on demystifying DevSecOps, empowering you with the tools to cultivate a secure and high-performing software ecosystem.\n\n**Aleksandr Krasnov** has been a leading industry expert in DevSecOps. He's been working on implementing various DevSecOps initiatives in companies like Palo Alto Networks, Dropbox, and Meta. You can find Aleksandr doing independent security research, advising, writing articles, and giving talks like this one."
    }
]