[
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "15. OWASP Augsburg Stammtisch",
        "date": "2025-09-24",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/310993061",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda: tbd -> Wir suchen noch Vorträge!**\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2025 (Online)",
        "date": "2025-09-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489315",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n*Note: if attending in person, sign up at [https://owasp-austin-2025-september.eventbrite.com](https://owasp-austin-2025-september.eventbrite.com))*\n\n**Terraforming Your Way To Better Security**\nby Mark Spears\n\nTerraforming isn’t just for cloud infrastructure. There are security considerations and providers that also are on Terraform. In this presentation, we will look and demo at how to Terraform our security pieces like Web Application Firewall and Zero Trust into our environments along with the cloud infrastructure keeping our OWASP environments safe(r)."
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP AppSec Days Bangalore Conference - 2025",
        "date": "2025-10-18",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/310289288",
        "timezone": "Asia/Kolkata",
        "description": " OWASP AppSec Days Bangalore 2025\n\n Event Date: October 18, 2025\n Website: [https://bangalore.appsecdays.org/](https://bangalore.appsecdays.org/)\n Submit your proposal today and be a part of the movement that’s shaping the future of secure development:\n[https://sessionize.com/owasp-appsec-days-bangalore-2025-cfp-co4791/ ](https://sessionize.com/owasp-appsec-days-bangalore-2025-cfp-co4791/)\n\nRegistration Link - [https://www.eventbrite.com/e/owasp-appsec-days-bangalore-2025-tickets-1353371623959?aff=oddtdtcreator](https://www.eventbrite.com/e/owasp-appsec-days-bangalore-2025-tickets-1353371623959?aff=oddtdtcreator)\n\nWe are thrilled to announce the Call for Papers (CFP) for OWASP AppSec Days Bangalore 2025, one of India’s premier gatherings for application security professionals, developers, researchers, and thought leaders!\nWhether you're building secure systems, breaking them to uncover their flaws, or creating a culture of security in your organization, this is your chance to share your knowledge and insights with a vibrant global audience.\n\n What We’re Looking For:\nTalks, demos, case studies, and workshops on application security, DevSecOps, cloud security, AI/ML security, SBOMs, mobile security, supply chain security, secure development, and everything in between. If it's advancing the mission of secure software, we want to hear it!\n CFP Opens: 01 April 2025, 12:00 AM IST\n CFP Closes: 31 July 2025, 11:59 PM IST\nLocation: Bangalore, India\n\n Get ready for a day packed with cutting-edge insights, leading speakers, hands-on learning, and the unmatched energy of the OWASP community.\n\nLet’s secure the future together."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "September joint meetup with CSA",
        "date": "2025-09-23",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/310983022",
        "timezone": "America/Los_Angeles",
        "description": "Join us for the Bay Area OWASP group's upcoming event. Event is jointly hosted with CSA SF Chapter and sponsored by Corgea.\n\nJoin us for an evening of great conversations, community networking, and insightful security discussions — all in an awesome venue provided by **Corgea**. And yes, there will be **delicious food and drinks** generously provided by our sponsors\n\n5:00 PM : Doors open, Networking, food and drinks\n5.30 PM :- Chapter introductions\n5.40-6.25 PM :- **Vibe coding in action: When AI meets creativity -Ahmad**\n6.25-7.10 PM :- **How to do MCP security right**\n7.10-7.55 PM :- **Panel discussion : Panel Topic: AI on day one: Building Trust , Busting Myths, and Dodging Pitfalls Abhishek Bansal , Ahmed Sadeddin and Badari Kalagi**\n\n**Talk:-** **How to do MCP security right**\nThe **Model Context Protocol (MCP)** is emerging as a standard for connecting LLMs to tools and data sources. But while it unlocks powerful capabilities, its approach to security leaves much to be desired. In this post, I’ll walk through the problems with MCP security, why we need a stronger model, why “biscuits” are a surprisingly effective foundation, and how we’re demonstrating this with a proof-of-concept on healthcare data.\n\n**Speaker:** Eugene Weiss is a cybersecurity and AI leader who has pioneered Zero-Trust architectures, deep-learning threat detection, and secure AI frameworks integrating human and machine identities. Currently CTO at Stash Global."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE chapter meeting (30/09/2025, Louvain-La-Neuve)",
        "date": "2025-09-30",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/310746669",
        "timezone": "Europe/Brussels",
        "description": "On September 30th, we organize our next OWASP Belgium chapter meeting at The Gate (Mont-Saint-Guibert).\n\n**Agenda**:\n\n* 17:30 - 18:20 : Welcome (drinks + sandwiches)\n* 18:20 - 18:30: **OWASP update**\n* 18:30 - 19:30: **Learning to Detect Malware: Features, Pitfalls, and Adversarial Threats** (by Charles-Henry Bertrand Van Ouytsel, UCLouvain)\n* 19:30 - 19:45 : break\n* 19:45 - 20:45 : **Integrating Security Without Slowing Development: A Pragmatic DevSecOps Approach** (by Steve Mihy, Approach Cyber)\n* 20:45 - 21:30 : Refreshments\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP & WiTCH: Distributed Security Champions",
        "date": "2025-09-30",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/311042301",
        "timezone": "Europe/London",
        "description": "Another joint event with WiTCH (Women in Tech & Cyber Hub), starting with a talk from Jon Gadsden titled 'Distributed Security Champions: working for developers'\n\n* **6:00** Meet and greet with light refreshments\n* **6:30** Introduction to OWASP and news, with a warm welcome to WiTCH\n* **6:40** Talk \"Distributed Security Champions\" by Jon Gadsden from Ping Identity\n* **7:15** Discussion led by Chloe Gibbs from WiTCH\n* **7:45** Wrap up with any final comments and discussion\n\nMost of us are familiar with Security Champions programs and how they can help bridge the gap between the developers and security teams.\nIdeally with a Security Champions program is in place the development team can ensure the Secure Development LifeCycle is effective, but what about in practice?\n\nThis talk seeks to identify problems with existing Security Champions programs and suggests a new paradigm: Distributed Security Champions.\n\n**Location**:\nHybrid event hosted by Ping Identity, 7th Floor, Prologue Works, 25 Marsh Street, Bristol BS1 4AX\nIf you can not attend in person then there is the option of attending remotely, the link to join the meeting will be shared on registration.\nIt is intended that the meeting will be recorded"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP Colorado Springs Social Hour - SEP 25th",
        "date": "2025-09-25",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/310944853",
        "timezone": "America/Denver",
        "description": "**OWASP Colorado Springs Social Hour – Save the Date!**\nHere’s your chance to connect with the local security community, share ideas, and find out what's new with OWASP projects.\n\nCome for the community, stay for the conversations.\n\nJoin us **September 25th, 6 to 8 PM** (in person) for a casual evening of networking, conversations, and community.\n\nWe’ll also highlight ongoing **OWASP projects** you can still jump in on, this is a great chance to connect and contribute!\n\n TRiNiTY Brewing at Forge Road Brewery\n\n** September 25th, 6 - 8 PM (in person)**"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "WebRTC forFun and Profit",
        "date": "2025-10-16",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/311140640",
        "timezone": "America/New_York",
        "description": "The most successful enterprises implement the most cutting-edge technology - especially if it is already embedded in every major web browser AND is free of charge! But with great power of WebRTC comes great responsibility! And great opportunities as well, both for business and for hackers. This October, we discuss:\n\\- Technical advantages of WebRTC\n\\- Security Highlights in 3D: client\\-side\\, server\\-side\\, and MITM perspectives\n\\- Security vs Performance: avoid the compromise and choose both\\.\nMany people think that security only blocks people from doing new cool things. Sam Lyhin believes this is not always the case, because security made right enables technology to be implemented faster. Join us at OWASP Columbus to get a safe intro into the world of modern telecommunication."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A Night of AI Hacking",
        "date": "2025-10-09",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/311153967",
        "timezone": "Europe/Copenhagen",
        "description": "**Want to learn about hacking LLMs?**\n**Then you're in luck!**\n\nWe're so lucky to have **Kevin Joensen** from *Baldur Security* coming to tell us about the recent challenge he made where he invited our community to hack the LLM he created for the chance to win tickets for BSides Copenhagen.\nHe'll talk about the basics of hacking LLMs, how he made the BSides CTF, how to defeat it - and how you can (try) to hack the new LLM CTF he created just for us!\n\nHere's the schedule and description he sent us:\n\n**17:00**: Welcome\n**17:10**: Talk about common vulnerabilities and misconfigurations seen in LLM/AI enabled systems.\n**18:00**: Pizza!\n**18:30**: LLM CTF\n\nWe’ll start with an in-depth talk on vulnerabilities in Large Language Models (LLMs) and AI-powered systems, exploring topics like prompt injection, data leakage, model manipulation, and real-world attack scenarios inspired by cases from Microsoft and others. Following the talk, you’ll get to apply what you’ve learned in a hands-on CTF with AI-focused challenges. These range from bypassing chatbot safeguards to exploiting misconfigured AI systems. This event is perfect for anyone looking to better understand, identify, and mitigate emerging AI security risks."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP October In-Person Meet - The AI Appsec Nightmare",
        "date": "2025-10-14",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/310496751",
        "timezone": "America/Chicago",
        "description": "The era of AI-powered attackers is no longer theoretical. Autonomous and semi-autonomous tools are now capable of identifying, exploiting, and adapting to vulnerabilities at a scale and speed that surpass human capacity. This talk explores the implications of a world where AI-driven threats are a permanent part of the landscape.\n\nWe begin with a candid look at the current state of application security, where manual processes and outdated risk models struggle to keep pace with modern development. At the same time, AI-generated code is entering environments at an unprecedented rate, often with little to no review, expanding the attack surface in ways few organizations are prepared for.\n\nCompounding the problem is a growing wave of global regulations pushing organizations to demonstrate security readiness, often without providing practical paths to achieve it. Within this context, the traditional approach of prioritizing and fixing only critical and high-severity issues is breaking down. Attackers, especially those leveraging AI, no longer view low or medium vulnerabilities as difficult hurdles. Most vulnerabilities should now be treated as easily exploitable.\nThis session offers a sharp, forward-looking assessment of the challenges ahead and outlines key shifts that application security teams must make to stay relevant and effective in the age of AI.\n\nJerry Hoff has decades of experience in technology and security, specializing in application security at an enterprise scale. He holds a Master’s in Computer Science from Washington University in St. Louis and has evaluated the security of applications for some of the largest financial, defense, and commercial organizations in the world."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "OWASP DevSecOps in Action: Secure by Design – From Containers to AI Agents",
        "date": "2025-10-09",
        "time": "08:30+04:00",
        "link": "https://www.meetup.com/owasp-dubai-chapter/events/311061896",
        "timezone": "Asia/Dubai",
        "description": "Join us for a high-impact event hosted by **OWASP Dubai Chapter, Docker, JFrog, and Codification**. Cybersecurity professionals and decision makers will explore how to embed security into every stage of the SDLC through **DevSecOps and Secure-by-Design practices**.\n\n**Agenda:**\n **OWASP Dubai Chapter - Ahmed Abdallah** – From SDLC to DevSecOps: Learn how automation, integration, and OWASP tools (DefectDojo, CycloneDX, Dependency Check, Dependency Track) streamline vulnerability management and risk tracking.\nhttps://linkedin.com/in/ayossef\n\n **Docker** \\- Juan José Fernández – Securing the SDLC: Discover how hardened images and lessons from container security apply to emerging **AI agent vulnerabilities** and supply chain threats.\nhttps://www.linkedin.com/in/juanjofernandez/\n\n **Codification** \\- Richard Smith – Applying OWASP in Practice: See how OWASP Top 10\\, Dependency\\-Check\\, and SAMM can be embedded into CI/CD pipelines with Docker and JFrog\\, enabling continuous assurance without slowing developers down\\.\nhttps://www.linkedin.com/in/richwsmith/\n\n Gain actionable insights, learn from industry leaders, and network with peers driving **DevSecOps transformation**.\n **Seats are limited — register today to secure your place!**"
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Security Journey - Secure Coding Tournament",
        "date": "2025-10-10",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/310632689",
        "timezone": "America/Edmonton",
        "description": "Ready to test your secure coding chops? \n\n[Checkout our promotional video for the upcoming Secure Coding Tournament 2025!](https://youtu.be/gefYXrQySDc)\n\nRegister for the platform in the link below \n[Secure Coding Tournament - OWASP Edmonton](https://forms.office.com/pages/responsepage.aspx?id=nN3Ry-FltUypN_LSEfnjS-wndSb2oFRKmSBpP7AHiUdURDNLTUE3T0pXVFlBODZBNkIxUUVXSEJGVC4u&route=shorturl)\n\nOWASP Edmonton is teaming up with **[Security Journey](https://www.securityjourney.com/)** and the **University of Alberta’s CHADS Club** (Cybersecurity, Hacking, and Digital Security) to bring you an engaging learning experience via hands-on **Secure Coding Workshop and Tournament** — and yes, there will be **prizes**! \n Swag boxes for placing 1-3\nChallenge coins for placing 4-10\n\nWhether you're a student looking to flex your skills, a developer passionate about building secure apps, or a security pro who loves a good challenge, this event is for **you**.\n\n What to Expect:\n\n* A fun and competitive (Coding CTF) secure coding workshop/tournament powered by **Security Journey**\n* Real-world secure coding scenarios across multiple languages and technologies\n* Swag, and prizes for top performers\n* Networking with Edmonton’s cybersecurity community\n* A chance to hang out with fellow developers, hackers, and security enthusiasts\n\n **All skill levels welcome** – come to learn, compete, or just connect!\n This will be a hybrid event\n University of Alberta - ETLC E1 - 003 - First Floor (Engineering Teaching and Learning Centre )\n **Free to attend** – but spots may fill up fast, so RSVP early!"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter Meetup #73 - Hands-On OWASP Workshop",
        "date": "2025-09-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/309088867",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to the **OWASP Frankfurt Chapter** Meetup #73!\n\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to do?*\n\n* We’re excited to welcome **Javan Rasokat** for a 2-hour **hands-on OWASP workshop** that tackles the challenges of modern web security – *moving from reactive patching to proactive prevention.*\n\n**IMPORTANT NOTE:** As this is a hands-on workshop, **you'll be expected** to **bring along a laptop with** **a pre-configured environment** (nodeJS or Docker) and a code editor of your choice (see further information below).\n\nIn this interactive session, you’ll explore how to eliminate entire classes of web vulnerabilities using modern browser security features such as:\n\n* Content Security Policy Level 3 (CSPv3)\n* Trusted Types\n* Sec-Fetch Metadata\n\nThrough group-based, hands-on exercises using a pre-secured demo application, you’ll test real-world security features, analyze their effectiveness, and learn how to enforce them at scale across your own environments. This workshop is designed to be language-agnostic and accessible – whether you're a developer, security engineer, or architect.\n\n*What To Bring?*\n\n* A **laptop** capable of running either a **NodeJS-based** web app or a **Docker container**\n* A **code editor** of your choice\n* Note: **No programming knowledge** is needed.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?*\nWe will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?*\nOur Meetup takes place on **24.09.2025** from **18.00 to 21.00** o'clock CEST.\n\n*Where?* The event will be held at usd AG, located at Frankfurter Str. 233/Haus c1, 63263 Neu-Isenburg, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "Business Logic Abuse: Technology Agnostic Mapping of Attack Types",
        "date": "2025-10-20",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/310150422",
        "timezone": "America/New_York",
        "description": "OWASP's technology specific top 10 lists have provided a ton of value, but it's time for a different approach to business logic abuse. The rise of APIs and complex business logic attacks requires a new taxonomy that isn't tied to a specific technology. In this talk we'll explore the newly published Business Logic Abuse Top 10 list, including the methodology behind it."
    },
    {
        "group": "Jaihind College Of Engineering Kuran",
        "repo": "www-chapter-jaihind-college-of-engineering-kuran",
        "name": "National Level CTF Competition Round 1",
        "date": "2025-10-10",
        "time": "19:00+05:30",
        "link": "https://www.meetup.com/owasp-jcoe/events/310793893",
        "timezone": "Asia/Kolkata",
        "description": "https://unstop.com/o/j7E3ecI?lb=EReYUW1&utm_medium=Share&utm_source=parthpat6682&utm_campaign=Online_coding_challenge\n\nJoin us at OWASP Jaihind College of Engineering Kuran Chapter for an exciting workshop on Penetration Testing and Capture the Flag challenge. Following the success of our Chapter Inauguration and Cybersecurity Seminar, this event will dive deeper into practical aspects of cybersecurity with hands-on exercises. Our expert speakers will discuss the latest trends in cybersecurity, focusing on tools and techniques for securing Linux systems. Participants will have the opportunity to test their skills in a Capture the Flag competition, learning how to think like an attacker while improving their defensive strategies. Whether you're a beginner or an experienced professional, this workshop promises to enhance your knowledge and real-world cybersecurity abilities. Don't miss out on this opportunity to network with like-minded individuals and advance your career in the field of cybersecurity.\n\nRegister Here: [Hacker's Gambit :- An OWASP National Level CTF - 2025 | 1554173 // Unstop](https://unstop.com/hackathons/hackers-gambit-an-owasp-national-level-ctf-jaihind-college-of-engineering-kuran-narayangaon-maharashtra-1554173)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [In-Person]",
        "date": "2025-09-22",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/310823103",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted at Aon by LevelBlue Cyber Solutions and sponsored by SecureFlag. There is limited seating available for in-person attendees. Registration required.**\n**This event will be live-streamed on YouTube.**\n**Recordings will be available on the [OWASP London YouTube channel](https://www.youtube.com/OWASPLondon).**\n\n**Venue Location**: Aon/LevelBlue, The Leadenhall Building, 122 Leadenhall Street, London EC3V 4AN\n**Nearest Tubes:** Bank (6 minute walk), Liverpool Street (7 minute walk), Aldgate (7 minute walk)\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n\n**\"Protecting your Generative AI App from the Five Deadly Risks** **\\- STOIC Security\"** \\- Jeff Watkins\n\nGenerative AI offers incredible opportunities, but comes with significant cybersecurity challenges. As adoption accelerates, so do the risks - data theft, model manipulation, poisoned training data, operational disruptions, and supply chain vulnerabilities.\n\n**\"Scaling Threat Modeling with a Developer-Centric Approach\"** \\- Andrew Hainault & Andrea Scaduto\n\nThis talk introduces Rapid Developer-Driven Threat Modeling (RaD-TM), a lightweight, tool-agnostic approach designed for developers to embed threat modeling into the SDLC without relying on security experts. RaD-TM focuses on targeted assessments of specific functionalities rather than application-wide models, enabling iterative and efficient risk mitigation.\n\n**RAFFLE - win a prize kindly donated by our sponsors!**\n\n**SPEAKERS:**\n\n**Jeff Watkins**\n\nJeff Watkins is Chief Technology Officer at CreateFuture, where he leads AI strategy, engineering, and cloud to deliver secure, human-centred digital products for global brands. A veteran technologist with over 25 years’ experience across financial services, healthcare, and retail, he is a recognised leader in cybersecurity and AI, championing “secure-by-design” practices for generative AI. A sought-after keynote speaker, Jeff has headlined international conferences including Webinale, AppDevCon, and the International JavaScript Conference. He co-hosts the award-winning “Compromising Positions” podcast and contributes regularly to publications such as Wired, Forbes, and Raconteur. His mission is clear: to build technology that elevates people.\n\n**Andrew Hainault**\n\nAndrew has over 25 years’ experience working in Information Security, Information Technology and Software Engineering, for public and private sector organisations in many sectors - including financial services / fintech, energy utilities, media, entertainment and insurance. With extensive application security and software engineering experience, Andrew has delivered secure SDLC programmes and penetration testing projects. He has designed and overseen information security programmes, enterprise-level cyber risk and incident response readiness assessments, as well as delivering board-level training.\nAfter beginning his career at Capgemini, Andrew worked at Cassini Division before running his own consultancy. He joined Gotham Digital Science in 2014 and then Aon in 2016 after its acquisition of Stroz Friedberg. He has led the Security Advisory Practice in UK & EMEA within Aon since 2019(and is now at LevelBlue).\n\n**Andrea Scaduto**\n\nWith a strong foundation in cybersecurity, Andrea holds an MSc in Computer Engineering, multiple IT Security certifications, and more than a decade of industry experience. His expertise spans breaking, building, and securing web, mobile, and cloud applications, with extensive knowledge of secure coding techniques aimed at reducing the cost of fixing vulnerabilities at scale.\n\n**TICKETS:**\n\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security. Your name will be checked against the guest list and a photo ID might be required.\n\n**CODE OF CONDUCT:**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Authenticate 2025 Conference (FIDO Alliance)",
        "date": "2025-10-13",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/310511791",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** has organized an exceptional offer for our meetup membership to participate in ***FIDO Alliance Authenticate 2025 Conference***, October 13 - 15, 2025 in Carlsbad, CA and **Virtual**. Join us for deep insight in new tools and technology, training, and take advantage of this great opportunity to network with industry professionals - Check out the full [Agenda ](https://authenticatecon.com/event/authenticate-2025/#agenda:~:text=No%20PDF%20selected.-,AGENDA,-This%20is%20the)and session details.\n/\\*\\* THIS IS A PAID CONFERENCE \\*\\*/\n\n\\*\\* **[Register Now](https://cvent.me/942o0y)** \\*\\* using code **OWASP15** to receive a **15% discount off registration!** Prices vary based on FIDO Alliance membership, in-person, and remote. **Single day options** are also available.\n\nHosted by FIDO Alliance, **Authenticate** is the **only** conference dedicated to all aspects of user authentication – with a focus on the FIDO standards-based approach.\n\n**Now in its 6th year**, the **FIDO Alliance**-hosted Authenticate Conference has become renowned for its high-quality content and vibrant community of professionals committed to advancing passkeys and related technologies to create a more secure web.\nThe focus of the program for the Authenticate 2025 conference is “achieving usable security across the account lifecycle,” with a focus on deeper dives on how to achieve phishing-resistant authentication with passkeys and the adjacent areas necessary to achieve end-to-end account security with usability in mind.\n\n2025 keynotes will be delivered by speakers with extensive experience bringing **#passwordless** experiences to workforces and consumers alike from organizations including Amazon, FIDO Alliance, Google, Microsoft, Sony and Yubico. The conference features content on four stages broken into 11 content tracks to suit attendees’ knowledge base, interests and phase of implementation, along with an interactive expo hall to discover solutions providers, and networking events to connect with peers and subject matter experts.\n\nThe agenda features content tracks that collectively build upon one another – covering topics such as FIDO fundamentals, business cases, and in-depth case studies. Attendees can expect to gain the latest insights and how-to information on FIDO authentication and passwordless deployments.\n\nWhether you are new to FIDO, in the midst of deployment or somewhere in between, Authenticate 2025 will have the right content – and community – for you, so **don't wait** \\*\\* **[Register Now](https://cvent.me/942o0y)** \\*\\*\n\n/\\*\\* THIS IS A PAID CONFERENCE \\*\\*/\n\nAnd finally **don't forget** to visit us at the OWASP Los Angeles booth!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Workshop OWASP LA - OCT 9, 2025",
        "date": "2025-10-09",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/310624498",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** API Security Hands-on Workshop\nJoin us for an action-packed hands-on workshop event led by **Dan Barahona**, Founder, **APIsec University**.\n\n**ABSTRACT:** APIs are now the top target for attackers, who exploit logic flaws, authorization gaps, data exposure, and other hidden vulnerabilities. These threats often slip past traditional defenses such as WAFs, code scanners, and testing tools.\n\nThis API Security Workshop will feature:\n\n* An exploration of why APIs are a prime target for attackers\n* Case studies of real-world API breaches\n* A guided review of the OWASP API Security Top 10\n* Proven best practices for securing APIs\n* An interactive, hands-on lab\n\nIn this lab, we’ll explore how to conduct comprehensive API testing from start to finish. Participants will gain hands-on experience in manual testing and learn how to accelerate their efforts through advanced automation tools. Together, we’ll tackle the key question: How can AI help us build safer applications while making our organizations more efficient?\n\nWhat You’ll Need\n\n* A device for taking notes or following along if you’d like too (laptop ideally)\n* Software Used\n* Firefox\n* Burp Suite Community Edition\n* APIsec - Downloaded from [apisec.ai](http://apisec.ai/) by signing up for a free account.\n\nWhat We’ll Learn\n\n1. How modern applications are leveraging APIs\n2. How vulnerabilities are created within those APIs\n3. How we can test for those vulns efficiently and comprehensively\n\n**Thanks to our SPONSOR**: *[APIsec University](https://www.apisecuniversity.com/)*\n*You can't stop what you can't see*\n*Novel attacks can appear harmless without visibility into the grey areas of your application layer.Stop attacks in your applications and APIs from development to production.*\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "The 2025 California Technology Summit",
        "date": "2025-10-08",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/308527392",
        "timezone": "America/Los_Angeles",
        "description": "OWASP LA has organized an exceptional offer for our Meetup membership to participate in the **2025 California Technology Summit** on **October 8th in Anaheim, CA**. Join us for a full day of professional development, technical insight, and networking with top minds in IT and cybersecurity.\n\n[Register](https://technologysummit.net/register.html) now using code **CTS25OWASP** for your **complimentary** pass! Check the full schedule at [2025 California Technology Summit Agenda](https://technologysummit.net/register.html)\n\n### Conference Highlights:\n\n* **Opening Keynote**: Fred Donatucci, CTO – San Bernardino County\n* **AI vs AI**: Exploring how artificial intelligence is being used to fight AI-driven cyber threats\n* **CISO & CIO Forums**: Executive roundtable sessions for strategic leadership and resilience planning\n* **Tech & Security Theaters**: Covering deepfake detection, wireless architecture, cyber insurance, observability, compliance, and more\n* **Lunch Sessions**: Including presentations on cybersecurity tactics inspired by Sun Tzu, Layer 2 vulnerabilities, and the evolving threat landscape\n* **Networking & Happy Hour** with live sponsor demos and discussions\n* **Earn CPE Credits** while attending technical and executive sessions\n* **Exhibit Hall** featuring over 30 leading technology sponsors\n* **Sponsor Giveaways** including gift cards, tech swag, and security services\n* **Grand Prize Drawing**: Attend the conference for your chance to **win the dream vacation you always wanted**, plus other exclusive giveaways!\n\nAnd finally don't forget to stop by the **OWASP Los Angeles booth** and connect with our local chapter members."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "First Annual Security Champions Summit",
        "date": "2025-10-01",
        "time": "08:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/311041156",
        "timezone": "America/Los_Angeles",
        "description": "**Build Your Program. Grow Your Champions.**\nKick off Cybersecurity Awareness Month with a virtual conference built exclusively for the people—and programs—leading security from within.\n\nWhether you're stepping into your role as a Security Champion or you're looking to upscale your champion program, this virtual summit equips you with the strategies, insights, and practical tools to confidently lead security within your team.\n\n**Why Attend?**\nSecurity Champions Summit is designed for developers, engineers, AppSec leads, and program owners who embed security into the way software gets built—team by team, sprint by sprint.\n\nThis is your opportunity to:\n\n* **Level up your role as a Security Champion** or launch a new program from scratch\n\n* **Learn directly from Champions and program leaders** who’ve built successful initiatives across industries\n\n* **Get tactical insight** into what works, and what doesn’t, when driving secure development from within teams\n\n* **Network with peers and leaders** who are shaping security culture in their organizations\n\n* **Leave with a practical playbook** for championing security at every stage of your development lifecycle"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Sep 24, 2025",
        "date": "2025-09-24",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091964",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** **From input-handling flaws to crashables: Security lessons from LLM-based coding tools**\n\nJoin us for great networking, dinner and drinks, and see a presentation by **Mahesh Babu**, is a former VP of Information Security turned company builder who now leads growth at **Kodem Security**.\n\n**ABSTRACT**: Claude Code illustrates how LLM-based coding tools expand the attack surface. Design choices around approvals, parsing, and error handling can turn into security flaws. We present specific findings Kodem uncovered in Claude Code. Both issues highlight how LLM-based coding tools introduce new misconfiguration and input-handling risks. This talk dissects the issues, their broader implications for AI developer tools, and practical mitigations.\n\n**Thanks to our SPONSOR**: *[Kodem Security](https://www.kodemsecurity.com/)*\n*The AppSec chase is over.*\n*Swap endless alerts with focused action. Simplify the remediation of your most exploitable issues through runtime security.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**Thanks to our HOST**: *[Accenture](https://www.accenture.com/)*\n*Assisting our customers in creating their future*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Modern Security Strategy and Safeguarding the Public Services Sector ",
        "date": "2025-09-24",
        "time": "15:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/310752199",
        "timezone": "America/Los_Angeles",
        "description": "If you plan on joining OWASP LA's event on Sep 24, 2025, consider joining an exclusive event (right before ours) with [Accenture](http://accenture.com/) and [Nozomi Networks](https://www.nozominetworks.com/); bring your expertise to the table and contribute to the discussion from an **AppSec** perspective.\n\nDiscover how a modern security strategy can safeguard the Public Services sector against evolving Operational Technology (**OT**) and **IoT** security threats, as traditional approaches like segmentation and air gapping fall short in the face of human error, physical sabotage, and increasingly complex cyberattacks.\n\n**Wednesday, September 24th**\n3 – 4:15 pm Presentation\n4:15 – 5:30 pm Refreshments, Light Bites, Networking\n**Accenture Los Angeles Office**, 1003 E. 4th Place, 8th Floor, Los Angeles, CA 90013\n**What to expect:**\n\n* Emerging threats and vulnerabilities in OT/ICS/IoT environments\n* How Accenture and Nozomi Networks deliver end-to-end OT security solutions\n* Real-world case studies and deployment insights\n* Gaining full asset visibility and identifying network blind spots\n* Advanced threat detection and vulnerability assessment techniques\n* Predicting and detecting OT process and stability issues to prevent downtime\n* Live Q&A with our OT security experts\n* Wrap up the event with an opportunity to connect with fellow attendees over refreshments and light bites\n\n**Space is limited.** **[Register today](https://web.cvent.com/event/bda8928b-2676-427b-a84b-381d0a76b186/summary?RefId=Home)**. \\*\\* **Make Sure** \\*\\* after you fill out your information, select the registration for **the Los Angeles Office** on the 2nd page.\n\n**Arlene Mordeno**\nSecurity, Public Services - California"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Future-Proofing Your Application Security for 2025 and Beyond",
        "date": "2025-09-24",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/307681800",
        "timezone": "America/Chicago",
        "description": "Software development has undergone seismic shifts over the last 20 years: the Agile movement, the rise of DevOps and cloud native practices, and now the AI and generative development era. With AI code assistants and “vibe coding” on the rise, we’re seeing faster delivery—along with new and complex risks. Over the last 10 years of DevSecOps journey, shift-left also achieved little success. Application Security needs a fundamental reset for the future. In this talk, we will discuss how modern approaches and technology innovations that are built to solve three of the biggest challenges in application security that must evolve for the AI Era – Speed, Coverage & Scale, and Context. We will explore three common scenarios: (1) Inventory and Secure net new applications, (2) Reduce risk and volume of existing security backlog by prioritizing and fixing what matters, and (3) Expand coverage to address emerging blind spots in AI-assisted application development"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "OWASP NYC Chapter NYC Hackfest with a Secure Code Showdown ",
        "date": "2025-10-09",
        "time": "11:00-04:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/311099155",
        "timezone": "America/New_York",
        "description": "**Join the OWASP NYC Chapter for a NYC Hackfest with a Secure Code Showdown Tournament**\n\nDate: Thursday - October 9th 2025\nWhere: AWS NYC Office - 7 W 34th St., New York, NY 10001 (near 5th Ave)\nTime: 11:00 am to 4:00 pm\nLunch: Provided\nRegister Required:\n\nhttps://tinyurl.com/OWASP-Hackfest-Tournament\n\nCome and test your wonderful skill against others in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability. You don’t need extensive programming knowledge, as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but also secure. Players can choose to compete in their preferred software language, including Java Spring, C# MVC, C# WebForms, Go, Ruby on Rails, Python Django & Flask, Scala Play, Node.js, React, and both iOS and Android development languages.\n\nJoin industry experts and fellow cybersecurity enthusiasts to share knowledge and experiences in this ever-evolving field. Don't miss this opportunity to network, learn, and stay updated on the latest in application security."
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Demystifying SOC 2 for Your AppSec Program",
        "date": "2025-10-21",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/311088576",
        "timezone": "America/New_York",
        "description": "In this talk, we’ll walk through how SOC 2 maps to modern application security programs. Attendees will learn how to implement key controls in ways that support both audit readiness and meaningful security outcomes. Whether you’re building a program from scratch or improving an existing one, this session offers practical guidance."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Stop Threats Before They Reach Your Network",
        "date": "2025-09-25",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/311134254",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: We will email attendees the address.**\n\n**The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Tuesday, September 23rd, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Brewery Tap! ",
        "date": "2025-09-25",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916309",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Social Drinks @ The Brewery Tap!\n\n**When?**\n\n* \\- Thursday 25th September\n\nEverybody welcome!\n\nThank you,\nRyan & Mark"
    },
    {
        "group": "Saint Louis",
        "repo": "www-chapter-saint-louis",
        "name": "OWASP Saint Louis In-Person Meetup",
        "date": "2025-09-30",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-saint-louis-chapter/events/310505152",
        "timezone": "America/Chicago",
        "description": "**OWASP Saint Louis Chapter Relaunch – First Meeting**\n\nThe OWASP Saint Louis Chapter is back! Join us for our first meeting as we officially restart the local chapter. Whether you’re a security professional, software developer, technology leader, or simply curious about application security, this is your chance to connect with like-minded peers in the Saint Louis area.\n\n**What to Expect**\n\n* Meet the new chapter co-leaders, **Andre Van Klaveren** and **Nathan Byrd**.\n* Learn about OWASP’s mission and the vision for our local chapter.\n* Help shape the future of OWASP Saint Louis by sharing what topics, speakers, and activities you’d like to see in upcoming meetings.\n* Network with fellow professionals who care about building and securing great software.\n* **Food & Drink provided!**\n\n**Speakers**\nOur first session will focus on introductions and planning, with featured speakers for future meetings to be announced soon.\n\n**Event Details**\n **Location:** RubinBrown, 7676 Forsyth Blvd., Suite 2100, Saint Louis, MO 63105\n **Date/Time:** September 30, 2025 / 6:00pm CDT\nℹ **Parking Directions:**\n\n* Google map to “North Lyle Avenue & Forsyth Boulevard, Clayton, MO 63105” Link: https://maps.app.goo.gl/WYqyZ3Jv9cUBBF289\n\n* Enter the **Parking Garage #4** (from Forsyth Blvd) next to Dry Bar\n* **Pull a ticket at the gate** and proceed into the garage, turning right.\n* Up the ramp is visitor parking. **You may have to go up past the 6th floor.**\n* **Take elevator to \\*L** (Lobby of Centene Plaza C)\n* Check in at the OWASP sign-in table in the lobby; you'll be escorted up\n* **Bring your parking ticket with you** to get validated at the meetup.\n\n**Who Should Attend**\n\n* Application & security professionals\n* Software engineers and developers\n* IT leaders and managers\n* Anyone with an interest in application security\n\n**About OWASP**\nThe Open Worldwide Application Security Project (OWASP) is a nonprofit foundation dedicated to improving the security of software. Local chapters provide opportunities to learn, network, and collaborate with others in the field.\n\nCome be part of the restart - your voice will help shape what OWASP Saint Louis becomes next."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec/OWASP-SLC - Hosting a CTF using OWASP Juice Shop",
        "date": "2025-09-24",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/310875546",
        "timezone": "America/Denver",
        "description": "Learn how to set up a CTF using OWASP Juice Shop and use it as a training tool in your organization. We will be reviewing Juice Shop, configuring a Juice Shop CTF, and talking about the logistics for the players.\n\nZoom Link: https://us06web.zoom.us/j/82871949172?pwd=WbhgOa2AzHh1WSStB0ws1UL4Sa3GW0.1\n\nResources:\n[OWASP Juice Shop](https://owasp.org/www-project-juice-shop/)\n[Pwning OWASP Juice Shop CTF-mode](https://pwning.owasp-juice.shop/companion-guide/latest/part4/ctf.html)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-10-08",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/307831829",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": " OWASP Seoul Chapter 9 :    ",
        "date": "2025-09-23",
        "time": "19:00+09:00",
        "link": "https://www.meetup.com/owasp-seoul/events/310919925",
        "timezone": "Asia/Seoul",
        "description": " OWASP Seoul Chapter 2025 9   !\n\n OWASP   9     .           .                 .\n\n**!         .       .**\n\n       !\n\n   (All sessions will be equipped with AI-powered real-time translation.)\n**      (5)**\n\n* OWASP Foundation  Seoul Chapter \n* OWASP   \n\n** #1: ComplOps . (ft. Integration & Automation) (40)**\n‍  -  Security Compliance Analyst\n IT             .      Security Compliance Team             .      'ComplOps'  .\n\n** #2: Security Compliance Engineer:      (30)**\n‍  -  Security Compliance Engineer\n IT      AI    ,      'Security Manager'       .   Security Compliance Engineer   ,  Security Compliance Engineer  3      .\n\n  \n\n*  : 2025 9 23() 19:00 \\~ 21:00 (KST)\n*  :  13 -   https://naver.me/GmbM1R74 (  )\n*  : \n* Meetup     .      meetup    .     .\n\n OWASP Seoul Chapter   \n        OWASP Slack   .\n\n*     : [https://open.kakao.com/o/gS5IxXxh](https://open.kakao.com/o/gS5IxXxh)\n* OWASP Slack    ([https://owasp.org/slack/invite](https://owasp.org/slack/invite))   ,   (#chapter-Seoul) .\n\n    \n\n* OWASP         .     seoul-leaders@owasp.org        .\n*    - https://forms.gle/xvEJCjDMEmYr1rKN7"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "7th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-09-25",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584789",
        "timezone": "Europe/Berlin",
        "description": "**All about MCP Security**\n\nImagine giving your AI assistant a universal plug to access all your tools and data - sounds convenient, right? That's what the Model Context Protocol (MCP) offers, acting like a USB-C for AI integrations. However, this convenience comes with significant security risks.​\n\nIn this session, we'll explore how MCP's open connections can be exploited, leading to issues like unauthorized data access and malicious command execution. We'll discuss real-world examples of vulnerabilities, such as command injection flaws and tool poisoning attacks, that have been identified in MCP implementations\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "Practical approach to building AI multi-agent systems",
        "date": "2025-10-02",
        "time": "19:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/311099441",
        "timezone": "Europe/London",
        "description": "**Practical approach to building AI multi-agent systems: examples, pitfalls, and a cloud security use case.**\n\nJoin our Ilya Kudryavtsev for an engaging session where he'll walk us through common pitfalls in AI programming.\n\nWe’ll explore how multi-agent AI systems can collaborate using RAG over internal knowledge and other data sources. The talk will cover practical challenges, potential pitfalls, and key considerations around data privacy and security. As a example, we’ll look at how AI agents can be used to simulate a cloud security audit.\n\nAfter the talk, enjoy the opportunity for insightful networking, accompanied by Thai food snacks prepared by resident chef Sonia of Bangkok Heightz restaurant and bar. This session aims to equip you with actionable ideas and a deeper understanding of multi-agent AI systems.\n\n**Agenda;**\nGreetings and updates - WTC\nShort talk - Ilya\nProfessional networking over food and beer (food provided).\n\nThis talk will be hybrid. You may join online but we cannot guarantee the quality - in person would is preferred. The video may be recorded and posted online at a later date."
    },
    {
        "group": "Universidad Politecnica De Yucatan Student Chapter",
        "repo": "www-chapter-universidad-politecnica-de-yucatan-student-chapter",
        "name": "OWASP Student Chapter UPY Inauguration",
        "date": "2025-09-23",
        "time": "10:00-06:00",
        "link": "https://www.meetup.com/owasp-universidad-politecnica-de-yucatan-student-chapter/events/311095375",
        "timezone": "America/Merida",
        "description": "¡Únete a nosotros para celebrar la inauguración de nuestro capítulo estudiantil de OWASP! Este evento marca el inicio de un espacio dedicado a la ciberseguridad, la privacidad digital y la colaboración entre estudiantes interesados en proteger el mundo digital.\nDurante la inauguración contaremos con una **charla principal** a cargo de expertos en seguridad, **palabras del rector** de la universidad, una presentación sobre **oportunidades y participación en OWASP**, y un **taller práctico sobre el OWASP Top 10**, donde aprenderás las principales vulnerabilidades web y cómo mitigarlas.\nEste es un evento ideal para estudiantes de todas las carreras que quieran introducirse en la seguridad informática, conectar con profesionales del área y comenzar a formar parte de la comunidad OWASP.\n**¡No te lo pierdas y asegura tu lugar!**"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP UY Meetup - Setiembre",
        "date": "2025-09-30",
        "time": "18:30-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/311079530",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY** te invita a su próximo Meetup, último evento antes del **OWASP AppSec Days Uruguay** (con aún lugar para sponsors y cerrando la lista de charlas y talleres preparando la publicación de la grilla)**:**\nhttps://owasp-uruguay.github.io/\n\n***Caminos en ciberseguridad,***\n**Sebastián Passaro - OWASP UY**\nComo sabrás, hay más en ciberseguridad que hackers, ¿pero qué más? En esta charla interactiva mostramos diversas carreras/puestos en ciberseguridad, divididas en los campos ofensivo, defensivo y de construcción. Vamos a charlar sobre los distintos roles, tareas y habilidades necesarias para cada uno.\nNo se trata de una charla formal, sino de un espacio para compartir. Si ya trabajas en el área, te invitamos a que compartas tu experiencia. Si estás empezando o simplemente tenés curiosidad, vení a escuchar y preguntar. Quién dice que no encuentres tu lugar…\n\n***De la idea al producto: creando soluciones seguras para el mercado de ciberseguridad en EE. UU.***\n**Marcos Martínez - CTO @LoopStudio**\nCompartiremos cómo pasamos de ser una empresa generalista a ayudar a founders a transformar ideas en productos de ciberseguridad, hasta implementar un proceso completo de Secure Software Development.\nHablaremos de cómo llevar frameworks como NIST SSDF a la práctica, threat modeling, desarrollo seguro y el uso de herramientas como Snyk, SonarQube y CodeRabbit, mostrando ejemplos reales de proyectos en el mercado de EE. UU.\nSumate a escuchar nuestra experiencia y compartir tu visión.\n\n**¿Cuándo?** Martes 30/9, 18:30.\n**¿Dónde?** ISACA, Cerrito 420 oficina 505.\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-10-16",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305511170",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "OWASP Virtual Chapter with Guest Speaker Aaron Lord",
        "date": "2025-10-15",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/309892530",
        "timezone": "America/New_York",
        "description": "Coming soon!"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call",
        "date": "2025-10-10",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309730265",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "October community call - OWASP SAMM",
        "date": "2025-10-08",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309874114",
        "timezone": "America/New_York",
        "description": "**Join us for the SAMM Monthly Community Call,** a regular space to hear what’s new with the project, share experiences, and talk about all things SAMM.\n\nWhat to expect:\n\n* Project updates and what’s coming next\n* Occasional podcast-style chats with community guests\n* Open discussion + Q&A: bring your thoughts, questions, or challenges\n\nWhether you’re just starting with SAMM or are already involved, your voice matters. Everyone’s welcome!"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter Meetup #73 - Hands-On OWASP Workshop",
        "date": "2025-09-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/309088867",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to the **OWASP Frankfurt Chapter** Meetup #73!\n\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to do?*\n\n* We’re excited to welcome **Javan Rasokat** for a 2-hour **hands-on OWASP workshop** that tackles the challenges of modern web security – *moving from reactive patching to proactive prevention.*\n\n**IMPORTANT NOTE:** As this is a hands-on workshop, **you'll be expected** to **bring along a laptop with** **a pre-configured environment** (nodeJS or Docker) and a code editor of your choice (see further information below).\n\nIn this interactive session, you’ll explore how to eliminate entire classes of web vulnerabilities using modern browser security features such as:\n\n* Content Security Policy Level 3 (CSPv3)\n* Trusted Types\n* Sec-Fetch Metadata\n\nThrough group-based, hands-on exercises using a pre-secured demo application, you’ll test real-world security features, analyze their effectiveness, and learn how to enforce them at scale across your own environments. This workshop is designed to be language-agnostic and accessible – whether you're a developer, security engineer, or architect.\n\n*What To Bring?*\n\n* A **laptop** capable of running either a **NodeJS-based** web app or a **Docker container**\n* A **code editor** of your choice\n* Note: **No programming knowledge** is needed.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?*\nWe will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?*\nOur Meetup takes place on **24.09.2025** from **18.00 to 21.00** o'clock CEST.\n\n*Where?* The event will be held at usd AG, located at Frankfurter Str. 233/Haus c1, 63263 Neu-Isenburg, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    }
]