[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - August",
        "date": "2023-08-24",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/294346390",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus and EAAA are hosting the next meetup on August 24th, 18:30 – 21:30 where we will be doing lighting talks.\n\nThe agenda is therefore still open and feel free to reach out, if you would like to make a short presentation (approx. 20 minutes). It does not have to be a technical presentation, we are open to and welcome presentations about war stories, personal stories, experiences or just cool stuff.\n\nEAAA will provide snacks and drinks!"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 19 August 2023 ",
        "date": "2023-08-19",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/294827514",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 19 August 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n**Session:-**\n\n### Session Schedule\n\n| | | | | |\n| --- | --- | --- | --- | --- |\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM | |\n| [Block chain and smart contract Audit](https://null.community/event_sessions/3809-block-chain-and-smart-contract-audit) | [Swayam Gupta](https://null.community/profile/37563-swayam-gupta) | 09:40 AM | 09:55 AM | |\n| [Block chain , smart contract Audit](https://null.community/event_sessions/3810-block-chain-smart-contract-audit) | [Gururaj Dalawai](https://null.community/profile/35364-gururaj-dalawai) | 09:56 AM | 10:16 AM | |\n| [Block chain , smart contract Auditor](https://null.community/event_sessions/3811-block-chain-smart-contract-auditor) | [Abhishek Jain](https://null.community/profile/30456-abhishek-jain) | 10:16 AM | 10:30 AM | |\n| **Intro** | 10:35 AM | 10:55 AM | |\n| [Product Security](https://null.community/event_sessions/3813-product-security) | [namrata MAhajan](https://null.community/profile/37494-namrata-mahajan) | 10:55 AM | 11:40 AM | |\n| **Networking Session + Break** | 11:40 AM | 12:10 PM | |\n| [10k feet view on banking & fintech security](https://null.community/event_sessions/3815-10k-feet-view-on-banking-fintech-security) | [utkarsh sawant](https://null.community/profile/37384-utkarsh-sawant) | 12:10 PM | 12:30 PM | |\n| [10k feet view on banking & fintech security](https://null.community/event_sessions/3816-10k-feet-view-on-banking-fintech-security) | [Karan Raheja](https://null.community/profile/10893-karan-raheja) | 12:30 PM | 12:55 PM | |\n| [Deeplink Exploitation](https://null.community/event_sessions/3817-deeplink-exploitation) | [Sunita](https://null.community/profile/35834-sunita) | 12:55 PM | 01:40 AM | |\n| [AWS IAM Privilege Escalation](https://null.community/event_sessions/3818-aws-iam-privilege-escalation) | [Ankit Sharma](https://null.community/profile/37636-ankit-sharma) | 01:40 PM | 02:10 PM | |\n| **Feedback + Next Month’s Planning** | 02:10 PM | 02:30 PM |\n\nNOTE: Please make sure to RSVP. On the door registration, not possible for this event.\n\n| |\n| --- |\n|"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- API Security Workshop with OWASP crAPI (hands-on)",
        "date": "2023-07-27",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/294625016",
        "timezone": "America/Los_Angeles",
        "description": "We are happy to announce a Hacker days on API security on 27th July.\nFood and awesome courtesy of our host Traceable.\n\n**Abstract**:\nIn today's rapidly digitalizing world, Application Programming Interfaces (APIs) are the backbone\nof communication in the vast landscape of web services, cloud applications, and microservices.\nWith this increased usage comes the inevitable rise of security threats targeting APIs. This\nworkshop aims to arm participants with practical knowledge and hands-on experience to secure\nAPIs effectively.\nIn this workshop, we will be using OWASP crAPI (completely ridiculous API), a purposely\ninsecure API, to demonstrate common API vulnerabilities and their mitigations. We will discuss\nthe 'Shift Left' approach in API security, emphasizing the importance of integrating security\nmeasures early in the development lifecycle. Participants will learn to identify, exploit, and\nsecure API vulnerabilities, equipping them with the necessary skills to build more secure\napplications\n\n**Presenter Bio:**\n1\\. Jayesh Ahire is the Product Manager at TraceableAI where he works on the Company’s\nAPI Security initiative. He is the maintainer of OWASP crAPI, Hypertrace, and many\nother notable OSS Projects. He is AWS ML Hero, Twilio champion, and runs API\nSecurity Global Community. He also runs AWS UG, Elastic UG, TensorFlow UG, and\nmany other communities in US and India. His research interest involved Distributed\nneural computers and Defi. In his free time, he likes to read and these days he is\nlearning to play the piano.\nLinkedin: https://www.linkedin.com/in/jayesh-ahire/\n\n**Requirements**:\n1\\. Active Participation: The workshop will be highly interactive\\. Questions\\, comments\\, and\nsharing of experiences are strongly encouraged.\n2\\. Laptop: As this is an in\\-person workshop\\, please bring along your laptop with any API\ntesting tool installed.\n3\\. Pre\\-workshop Material: On confirmation of your attendance\\, you will receive some\npre-workshop reading materials. We recommend reviewing these before the event to\nmaximize your learning experience."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-08-14",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/294925671",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kolkata",
        "repo": "www-chapter-kolkata",
        "name": "OWASP KOLKATA MEETUP #7",
        "date": "2023-08-06",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-kolkata/events/295013384",
        "timezone": "Asia/Kolkata",
        "description": "#### Proposed sessions for this event:\n\n* Evolution of Hacking, Hackers and Cyber Attacks by **Ronit Chakraborty**\n* C&C Frameworks: An Overview by **Ayan Saha**\n* Demystifying Cyber Threat Intelligence by **Debraj Dey**"
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "OWASP Community Day",
        "date": "2023-08-19",
        "time": "0:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/294165322",
        "timezone": "Asia/Karachi",
        "description": "**OWASP Community Day Lahore**\n\nJoin us for the highly anticipated OWASP (Open Web Application Security Project) Community Day in Lahore! This event is a gathering of cybersecurity enthusiasts, professionals, students, and experts who are passionate about web application security and its importance in today's digital landscape.\n\nDuring this day-long event, you will have the opportunity to engage with like-minded individuals, learn from industry leaders, and expand your knowledge in the field of web application security. The OWASP Community Day Lahore aims to promote collaboration, knowledge sharing, and awareness of the latest trends and best practices in securing web applications.\n\n_**Highlights of the OWASP Community Day Lahore:_**\n\n1. Expert Talks: Listen to renowned cybersecurity experts and thought leaders as they share their insights and experiences in web application security. Gain valuable knowledge about emerging threats, vulnerabilities, and effective countermeasures.\n\n2. Hands-on Workshops: Participate in interactive workshops conducted by industry professionals where you can enhance your practical skills in areas such as secure coding, penetration testing, threat modeling, and secure software development.\n\n3. Networking Opportunities: Connect with fellow cybersecurity enthusiasts, professionals, and students in a collaborative and engaging environment. Expand your professional network, share ideas, and forge valuable connections with individuals who share your passion for web application security.\n\n4. Capture The Flag (CTF) Challenges: Test your skills and compete in exciting Capture The Flag challenges designed to simulate real-world scenarios. Solve security puzzles, find vulnerabilities, and demonstrate your expertise to win attractive prizes.\n\n5. Lightning Talks and Demos: Engage in quick-paced lightning talks and live demonstrations, where participants showcase innovative tools, techniques, and research findings related to web application security. Discover new solutions and gain inspiration from cutting-edge projects.\n\n6. Community Projects and Initiatives: Learn about ongoing OWASP projects and initiatives, and find out how you can contribute to the community. Explore opportunities to collaborate on open-source security tools, research papers, and resources that benefit the broader cybersecurity ecosystem.\n\nDon't miss out on this incredible opportunity to be part of the OWASP Community Day Lahore! Mark your calendars and join us for a day filled with knowledge sharing, skill-building, and networking in the vibrant world of web application security. Together, let's make the web a safer place for everyone.\n\n**Note: Please stay tuned for updates on speakers, workshops, and additional event details on our official website and social media channels.**\n\nWe look forward to welcoming you to the OWASP Community Day Lahore!"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Limassol Meetup 2.0",
        "date": "2023-07-28",
        "time": "8:30+03:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/294232592",
        "timezone": "Asia/Nicosia",
        "description": "[Location](https://www.google.com/maps/place/BrainRocket/@34.6979542,33.0460735,20z/data=!4m6!3m5!1s0x14e733f291b01fad:0x5ff57bb6ed3f9838!8m2!3d34.6979152!4d33.0461381!16s%2Fg%2F11q_08mvzb?entry=ttu) is the restaurant at the Brain Rocket office.\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the second meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/)! We cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19:00 — 19:30 Maksim Gall, Exness:\n**How are Apples cracked?**\n19:30 — 19:55 Vlad Bychenkov, Semrush:\n**Malware in the life of SOC analyst: how to improve detection?**\n19:55 — 20:05 A short break\n20:05 — 20:30 Dmitry Vershinin, InDrive:\n**SMS flood prevention**\n20:30 — 21:00 Andrey Leonov, Semrush:\n**10255 Shades of k8s**\n21:00 — 22:00 — PvP Battles!\n22:00 — 23:00 — Eat, drink, networking!\n\nWe'll have catering, a cocktail bar, a DJ, and a shisha zone all set up to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2023-08-03",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/294874131",
        "timezone": "Europe/London",
        "description": "**DO NOT RSVP on Meetup: PLEASE REGISTER FOR THIS EVENT USING [EventBrite](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu) here: [https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu)**\nThis meetup will take place at Licel Corporation London offices in Stratford Olympic Park (in-person) and will also be live-streamed on the OWASP London YouTube Channel: [https://youtube.com/OWASPLondon](https://YouTube.com/OWASPLondon)\n\n\\-\\-\\-\\-\n**TALKS:**\n\n**OWASP Introduction, Welcome and News - Sam Stepanyan**\nWelcome and a brief update on OWASP Projects & Conferences\n\n**Talk 1: \"DevSecOps Maturity Model (DSOMM): From Theory to Enforcement \"** - **Raz Probstein**\nThe OWASP DevSecOps Maturity Model provides an excellent framework for companies looking to truly apply security in a cloud native and fast-paced engineering world. However, like all things Dev+Ops related, whatever isn't automated is much more difficult to apply to our systems. We'll show you how.\n\n**Talk 2: \"Doing More with Less: Practical Applications for Generative AI in Cybersecurity\" - Matt Adams**\nThis talk will demonstrate how generative AI can act as a productivity multiplier for cybersecurity teams, enabling them to do more high-value work with the same resources. Through live demos, attendees will see AI-powered tools that can automatically generate threat models, create security awareness materials, and automate security scanning and reporting - saving security teams valuable time. Attendees will come away with an understanding of how generative AI can be applied to help cybersecurity teams “do more with less” and elevate their capabilities.\n\n**SPEAKERS:**\n**Raz Probstein (@RazProbstein), Solution Engineer, Jit.io**\nRaz Probstein comes with years of experience is both leadership and technology, having served not only as Young Ambassador to the state of Israel, as well as headhunted and selected as Young Researcher at the prestigious Weizmann Institute for multi-disciplinary scientific research. Today she serves as a Fullstack Engineer at Jit, coming to the role with years of experience in a diversity of programming languages from Python, to Javascript and C/C#, from the elite Israel Defense Forces(IDF) Unit 81 - where she was not only one of a handful of women serving in a cybersecurity role, she also mentored women to help drive more gender diversity in the unit. Today she is studying Biotechnology at the Open University, and is passionate about building cloud native security tooling developers will love.\n\n**Matt Adams (@mattrwa), Security Architect, Santander UK**\nMatt is a highly experienced Security Architect with nearly 20 years of professional experience in the field of cybersecurity. He has worked with renowned organisations such as Costa Coffee and Santander UK, where he has led security architecture and engineering teams, and played a crucial role in defining global information security strategies. By drawing on his extensive knowledge in areas such as Security Architecture, Cloud Security, and Generative AI, Matt brings insightful perspectives on emerging technologies and their potential to reshape the cybersecurity landscape.\n\n**TICKETS:**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST [book your place on EventBrite](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu) to be admitted to the event by the building security - your name will be checked against the guest list. Please bring a Photo ID as this is the Amazon's building security requirement.\n\n**CODE OF CONDICT:**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\nOWASP aims to provide a harassment-free experience for everyone, regardless of gender, sexual orientation, disability, physical appearance, body size, race, age, or religion. We do not tolerate harassment of event participants in any form.\nAdditionally, participating in OWASP events means you shall also adhere to the OWASP Code of Conduct which you can find here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - AUG 23, 2023",
        "date": "2023-08-23",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294355732",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: AppSec 2.0: Reimagine AppSec With Runtime Analysis\n\nJoin us for great networking, dinner and drinks, and see a presentation by Kiran Kamity, CEO and Founder of Deepfactor.\n\n**ABSTRACT**: SCA tools (container and dependency scans) generate too much noise. Runtime security tools don’t understand SCA findings, and don’t come in until production. What if you could marry SCA with runtime analysis during dev, test, and prod?\n\nIn this session, we will discuss how the next generation of AppSec needs to go beyond just integrating static SCA into your CI pipeline, to analyzing insecure behaviors inside running apps and correlating that back to SCA to understand which vulnerable components are actually loaded into memory and used by your application. This new approach to AppSec will detect both known vulnerabilities/CVEs with SCA scans and unknown vulnerabilities with runtime analysis. It will then prioritize known vulnerabilities with runtime correlation of SCA findings. End result: you catch most of the key risks in your app, prioritize the key items your devs need to work on without flooding them with alerts, and remove unused components from your containers to burn down your CVE debt rapidly….and achieve the true mission of AppSec…to empower engineering and security teams to create secure applications.\"\n\n**Thanks to our Sponsor**: *[Deepfactor](https://www.deepfactor.io/)*\n*Deepfactor Developer Security is a new approach to AppSec that is cloud-native and developer-friendly. It helps enterprises address supply chain and DevSecOps initiatives with a unique technology approach that combines SCA (Software Composition Analysis), SBOM (Software Bill of Materials) and Runtime Security.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Architecting Database Activity Monitoring(DAM) Solution for an Organization",
        "date": "2023-08-17",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/295055267",
        "timezone": "America/New_York",
        "description": "This session would give the group an overview of Database Activity Monitoring(DAM) and high-level overview of Architecting DAM solutions to protect the Onprim and Cloud Databases, enforce regulatory compliance, supporting audit and building continuous lifecycle for implemented DAM solution."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Reducing Alert Fatigue with Container Scans",
        "date": "2023-08-24",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/295035051",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Speaker:** Kiran Kamity, Founder & CEO, Deepfactor\n\n**Topic:** Reducing Alert Fatigue with Container Scans: Correlate, Prioritize and Filter Based on Usage\n\n**Abstract:**\nScenario: Your application is composed of 12 docker containers. Together they have 400 packages. When you run a container scan with an SCA (Software Composition Analysis) tool, you notice that 120 of them have vulnerabilities. Your security team is asking you to fix all the critical and high vulnerabilities, but your dev/DevOps team doesn’t have the cycles. What do you do?\n\nToday, developers and DevOps engineers are being asked to address vulnerabilities and supply chain risks in container images. However, the volume of noisy security alerts often leads to developers ignoring them entirely or wasting valuable sprint time researching “false positives.” This session will focus on how security and engineering teams can correlate vulnerabilities with runtime information, prioritize alerts based on usage, and filter out false positives that don’t represent a true exposure of a vulnerability. Understanding runtime information can provide intelligence such as applicability of the CVE to the running environment, reachability, and usage. This session will focus on usage. Prioritizing security updates to only used packages in your container image is a highly effective approach to reducing alert fatigue with your container scans. In addition, your DevOps team can even consider removing some of the unused packages and shrink your container images.\n\nAs an example, the session will include a demonstration of a typical SCA static container scan of a sample open-source test application and then show how an engineering team can filter alerts to reduce the number of vulnerable and used alerts that actually need to be fixed by developers by up to 90%.\n\n**Bio:**\nKiran Kamity is the Founder & CEO of Deepfactor. He is a serial Silicon Valley entrepreneur with a passion for building products that meet a need and make a business impact—with Deepfactor that’s empowering engineering teams to create secure cloud native applications. Prior to Deepfactor, Kiran was the Head of Product at Cisco Cloud BU, Founder/CEO at ContainerX (acquired by Cisco), and the Founder/VP at RingCube (acquired by Citrix). Kiran is a TEDx speaker and loves nature, travel, and food.\n\n**Schedule:**\n6:00pm - 6:40pm Networking, Food & Drink\n6:40pm - 7:40pm Presentation\n7:40pm - 8:00pm Networking\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Disinformation: malware of a free society / How Volunteer Work Can Work for You",
        "date": "2023-07-27",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/294627454",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Speaker 1:** Brandon Soroudi, Visiting fellow at National Security Institute\n[https://nationalsecurity.gmu.edu/](https://nationalsecurity.gmu.edu/)\n\n**Topic1 :** Disinformation is the malware of a free society - Part 2\n**Abstract:**\nThe future of information security is not protecting networks or endpoints. A new and unique security condition has emerged that has no IOC’s or TTP’s. However, it is arguably the most dangerous of all emerging threats. If exploited, it can alter elections, destabilize governments, and bring a swift end to truth and the institutions that rely on truth. The future of information security is detecting and preventing the spread of “disinformation”.\n\nPart 1 of this series focused on the origins of “active measures” in the Cold War and the events leading up to January 6th 2021. Part 2 of this series, will focus on a new framework to map disinformation tactics and techniques, and the impact AI based chatbots and “deepfake” technology will have on the future of democracy.\n\nWithout trust, democracy has no future. Can the security community help to restore trust in information and save democracy for posterity?\n\n**Bio:**\nBrandon has over 12 years of IT/InfoSec experience working as a server admin, network engineer, and security engineer. Brandon currently serves as Senior Threat Detection Engineer for BlackBerry Cybersecurity unit. Brandon is also a visiting fellow at *The National Security Institute (NSI) at George Mason University's Antonin Scalia Law School.* Brandon received his B.A. in Business Economics from the University of California, Irvine. Outside of InfoSec, Brandon is an avid hunter, backpacker, and “beach bum”.\n\n**Speaker 2:** Lori Barfield, ShellCon RaiseMe / US Coast Guard Auxiliary\n**Topic 2:** How Volunteer Work Can Work for You\n\n**Abstract:**\nThere’s a crushing Catch-22 in the technology world that keeps people from realizing their career dreams. Career consultants often hear this exasperated plea for help: “How do I get experience doing something new, when the companies I am talking to only want to hire people who already have experience?” Lori is a former computer engineer and technology executive who will explain how candidates can gain key engineering work experience by volunteering. Volunteers participate in a very wide range of opportunities: from meetups to open source projects to service to the country. This talk will explain how to leverage a volunteer accomplishment with strategic integration into resumes and job interviews.\n\n**Bio:**\nLori Barfield joined her first Internet startup during the original .com boom as a Senior System Administrator, at a company that eventually went public. After moving into leadership there, she started an international executive consulting practice.\nLori’s volunteer career began as a Chair for the Southern California Linux Expo. She has been a conference organizer and speaker in the Open Source world for 15 years. She also co-founded the cyber security conference ShellCon in 2017, and RaiseMe IT along with that. Through RaiseMe she has spoken and taught about career development at dozens of technical events across the country. Five years ago, Lori answered the call to duty and joined the Coast Guard Auxiliary. She is a Division Vice Commander and serves on the National Cybersecurity Penetration Testing team.\n\n**Schedule:**\n6:00pm - 6:30pm Networking, Food & Drink\n6:30pm - 7:30pm First Presentation\n7:30pm - 8:15pm Second Presentation\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-07-27",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/294627572",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro 012 [ONLINE]",
        "date": "2023-08-17",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/294883770",
        "timezone": "America/Sao_Paulo",
        "description": "Em agosto teremos o nosso próximo encontro, será no dia 20/07 (quinta-feira), a partir das 19h30, online em nosso canal do YouTube.\n\n*Link para a transmissão:* *[https://www.youtube.com/watch?v=DaSarcPUym4](https://www.youtube.com/watch?v=DaSarcPUym4)*[ ](https://www.youtube.com/watch?v=DaSarcPUym4)\n\n**Confira a agenda:**\n\n**19h30-20h30**\n***\"Como fazer um secure code review na sua empresa\"***\n*O Secure Code Review é uma prática essencial para evitar que as vulnerabilidades cheguem em produção. A revisão de código antes do seu commit traz muitos beneficios. Na apresentação será mostrado algumas dicas de como realizar de forma eficiente um secure code review e como começar a fazer isso na sua empresa.*\n***Francisco Silva*** *(AppSec Engineer na Amazon)*\n*AppSec Engineer na Amazon, trabalha com segurança de aplicações e segurança de cloud. Com foco em ajudar desenvolvedores a descomplicar a segurança no código.*"
    },
    {
        "group": "Sao Paulo",
        "repo": "www-chapter-sao-paulo",
        "name": "OWASP Sao Paulo Primeiro Meetup Virtual de 2023",
        "date": "2023-08-02",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-sao-paulo-chapter/events/295015583",
        "timezone": "America/Sao_Paulo",
        "description": "Nosso próximo encontro virtual será no dia 02 de Agosto. Faremos um painel com o tema: **\"A Importância da OWASP para os Times de Ataque e Defesa\"**. Um encontro obrigatório para profissionais de segurança, desenvolvedores, e qualquer pessoa interessada em aprender mais sobre a segurança na web.\n\nNossos convidados para esse bate papo são: ***Paulo Baldin, do Stark Bank***, ***Ana Tessaro, do Jusbrasil*** e **Jonathan Coradi, do Banco Safra** todos com vasta experiência em Segurança da Informação.\n\nVeja mais sobre os nossos convidados no nosso post do linkedin: https://www.linkedin.com/pulse/owasp-s%25C3%25A3o-paulo-primeiro-meetup-virtual-de-2023/\n\nSerá um momento de grande aprendizado e troca de experiências. Prepare-se para ampliar seus conhecimentos e habilidades em segurança da web! A troca de ideias e experiências é um dos alicerces da nossa comunidade, por isso, reserve um espaço na sua agenda para esse encontro!\n\n**SOBRE A OWASP SÃO PAULO**\n\nA OWASP São Paulo é um dos 9 capítulos brasileiros entre os mais de 270 ativos em todo o mundo. O objetivo é disseminar a missão da fundação, tornando a segurança das aplicações visível para que as pessoas e as organizações possam tomar decisões conscientes sobre os verdadeiros riscos que correm.\n\nSão realizados encontros periódicos para compartilhamento de conhecimentos, discussão de temas e aprendizado sobre segurança de software.\n\n**Participe!**"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-08-09",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/294771597",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Unpacking the Present State of Application Security",
        "date": "2023-07-27",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/294671576",
        "timezone": "America/New_York",
        "description": "Enjoy an industry practitioner's view of the state-of-the-art in AppSec today and over the next few years. Explore the state of the industry, from attackers, threats, and vulns to tools and tech. Learn successful strategies and roadmaps to build a solid foundation and future-proof AppSec programs, including ten future-looking areas for examination."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "Introducción a la seguridad de aplicaciones - Edición Julio 2023",
        "date": "2023-07-27",
        "time": "8:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/294654645",
        "timezone": "America/Montevideo",
        "description": "Esta será la reunión de julio de una serie de reuniones **presenciales**, enfocadas en lo **práctico** y en inspirar a nuevas generaciones y a personas que no están involucradas aún con la comunidad. Se llevará a cabo en [Technisys Uruguay](https://goo.gl/maps/coqZwLRqsrevrs976) (Dionisio Oribe 3071).\n\nEs importante destacar que **no se requieren** conocimientos previos en seguridad de aplicaciones para participar. Si bien tener conocimientos de web/frontend/backend ayuda, la idea es aprender en la marcha, así que sin timidez :)\n\nLa dinámica de *esta jornada* será la siguiente:\n\n* Pueden armarse grupos para compartir ideas y ayudarse en los ejercicios.\n* Los grupos tendrán desafíos/objetivos comunes basados en el proyecto [OWASP Juice Shop](https://owasp.org/www-project-juice-shop/).\n* Cada grupo tendrá **al menos un** **referente/facilitador** disponible, colaborador de la comunidad con experiencia para apoyar en cualquier duda y generar conocimiento, mano a mano.\n\nEl requerimiento para poder participar es **traer tu notebook**, cada asistente tendrá su ambiente de trabajo. Se proporciona a los asistentes una imagen virtual de Kali Linux preconfigurada con las herramientas necesarias para realizar el taller. Se necesita Virtualbox o VMWare para ejecutarla. Si tus recursos no son suficientes tendrás que seguir tutoriales para instalar un proxy de ataque (Burp Suite Community u OWASP ZAP) y Juice Shop (servidor local o con Docker).\n\nLa imagen se puede descargar de acá: [https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/](https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/)\nPara quienes usen MacOS con chip M1-M2 y VMWare está esta máquina virtual con Kali Linux, OWASP ZAP y Juice Shop en Docker:\n[https://drive.google.com/file/d/1MKrx8efu0L4Bg71Rw8XUUxjqBiVigb8m/](https://drive.google.com/file/d/1MKrx8efu0L4Bg71Rw8XUUxjqBiVigb8m/)\nEl usuario y contraseña es \"kali\". En la imagen para MacOS se levanta Juice Shop con el comando \"sudo docker start juice-shop\".\n\nPara aprovechar mejor el tiempo y el ancho de banda se recomienda asistir con todo pronto. Para verificar la estabilidad y acceso al ambiente local se compartirá una presentación (que se mostrará el día del evento) con algunas instrucciones.\n\nA registrarse, **los cupos son limitados** (se pedirá confirmación para dar lugar a quienes estén en lista de espera). ¡Los esperamos!\n\n***NOTAS***:\n\n* *Para quienes hayan asistido a jornadas anteriores, pueden seguir con desafíos más complejos.*\n* *Se pedirá en el ingreso a las oficinas de Technisys nombre completo y documento de identidad para registrar los asistentes, en caso de alguna eventualidad.*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Rating API Business Risks based on OWASP Top-10 API Security Vulnerabilities",
        "date": "2023-08-17",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248511",
        "timezone": "America/Vancouver",
        "description": "Web APIs are a common glue that connect people and processes with digital systems all across the globe. Not surprisingly, Web APIs contribute more than 80% of the Internet traffic today. Given the importance of APIs, OWASP has recommended top-10 API specific security vulnerabilities (such as Broken Authentication/Authorization and Excessive Data Exposure problems) that organizations must address to strengthen their security posture. Albeit useful, these API specific vulnerabilities do not necessarily translate to the same business risks. For instance, two APIs from an organization with Broken Object Level Authorization (BOLA) may pose very different business risks to that organization.\n\nIn this session, we'll talk about API Risk Rating System (ARRS) that maps API specific vulnerabilities to business risks such as Legal/Contractual, Operational, Financial, Reputational and Regulatory. Similar in-principle yet different than Common Vulnerability Scoring System (CVSS), the main objective of ARRS is to prioritize API specific vulnerabilities based on their business risks. We'll describe the methodology behind the system developed using thousands of APIs that are being tracked at a global scale. We’ll also share some hands-on practical scenarios.\n\nThe work presented was done by Samantha Sanchez, Jun Hee Lee, Alberto Ciconi and Baljeet Malhotra. Samantha, Jun Hee and Alberto are MSc Cybersecurity students at NYIT. Baljeet is an Adjunct Professor at NYIT, UBC, UVic, UNBC, and CEO of TeejLab Inc.\n\n**Location TBD**"
    }
]