[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2023-01-31",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/289490322",
        "timezone": "Europe/Copenhagen",
        "description": "Hi All,\nPlease note, that this is a physical event hosted by Github and OWASP Aarhus may share a list of participants with Github for the sole purpose of hosting the event.\nAs we have been talking about, OWASP Aarhus wanted to try out the “lightning talk” format. All the details are still not complete, but the schedule is: (TBD – To Be Decided)\n\n19:00 – 19:15 Welcome by Github and OWASP Aarhus, Karl Krukow, Github and Thomas Ljungberg Kristensen, OWASP\n19:20 – 19:35 Leveraging CVEs to improve the CodeQL security analysis, Esben Andreasen, Sr. Software Engineer, GitHub\n19:40 – 19:55 OWASP for dummies Martin Duedahl\n20:00 – 20:15 Live demo - Heap Exploit in Glibc Oliver Thomas\n20:15 – 20:45 Break\n20:50 – 21:05 TBD Klaus Agnoletti\n21:10 – 21:25 Using storytelling Jens Roed Andersen\n21:25 – 21:30 Goodbyes OWASP and Github\n\nLooking forward to it!"
    },
    {
        "group": "Aligarh",
        "repo": "www-chapter-aligarh",
        "name": "Hi to 2023!!",
        "date": "2023-01-20",
        "time": "7:00+05:30",
        "link": "https://www.meetup.com/owasp-aligarh-meetup-group/events/290325991",
        "timezone": "Asia/Kolkata",
        "description": "As we entered 2023, let get together to say a Hi.\nAgenda:\nWelcome new and old members\nAnalyze the survey results\nPlan forward\nAlso talk about the Core committee of researching latest advancements and talk with W3LC Team that we have been discussing since June'22"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - January 2023 (Online)",
        "date": "2023-01-31",
        "time": "1:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705619",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* --\n[https://owasp-austin-2023-january.eventbrite.com](https://owasp-austin-2023-january.eventbrite.com)\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n**Presentation: Cryptoparty (various speakers)**\n\nIn 1996, John Perry Barlow, co-founder of the Electronic Frontier Foundation (EFF) wrote 'A Declaration of the Independence of Cyberspace' where he stated \"We are creating a world that all may enter without privilege or prejudice accorded by race, economic power, military force, or station of birth. We are creating a world where anyone, anywhere may express his or her beliefs, no matter how singular, without fear of being coerced into silence or conformity.\" The Internet of today is an amazing place of knowledge and opportunity, but it unfortunately falls short of Mr. Barlow's original vision.\n\nIn the 21st century we face problems of climate change, energy crisis, state censorship, mass surveillance, and on-going wars. We must be free to communicate and associate without fear. To realize our right to privacy and anonymity online, we need peer-reviewed, crowd-sourced solutions. CryptoParties provide the opportunity to meet up and learn how to use these solutions to give us all the means with which to assert our right to privacy and anonymity online. Topics include technologies like TOR, full-disk encryption, GPG, and many more. CryptoParties are free to attend, public, and not commercially aligned.\n\nAt our January 31, 2023 OWASP Austin meeting, we will host a CryptoParty with the goal of inviting others to join us in learning about the tools and technologies that enable an individual's right to privacy. When the time comes, we will encourage you all to invite your family, friends, and peers to attend this event, but for now, I am looking for others who are willing to give a 10 minute max presentation on a crypto-oriented subject. The presentation will need to be laid out so that novice and experienced alike can take action based on the data presented. All tools must be free and open source. If you are interested in presenting, please e-mail me directly (do not reply to the list) with your name, bio, talk title, and abstract for consideration. This is going to be EPIC!"
    },
    {
        "group": "Baku",
        "repo": "www-chapter-baku",
        "name": "OWASP Baku Meetup",
        "date": "2023-01-30",
        "time": "5:00+04:00",
        "link": "https://www.meetup.com/owasp-baku-chapter/events/290945502",
        "timezone": "Asia/Baku",
        "description": "We are celebrating foundation of Baku chapter of OWASP."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "January Meet",
        "date": "2023-01-19",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/290897623",
        "timezone": "America/Los_Angeles",
        "description": "Happy New Year, Security time, We will have two exciting talks, lots of people to meet, and great food. Come join us at Hacker dojo mountain view. This is a joint meetup with Pacific Hackers group(www.phack.org).\n\nCourtesy of our host **[Tromzo](https://tromzo.com/)** . Tromzo accelerates remediation of risks, from code to cloud. Built by security practitioners & backed by 25+ CISOs.\n\n**Talk#1:** Frictionless API Observability.Visibility of API assets, and their underlying JSON structure is a critical requirement for any security initiative that manages attack surfaces.This live session will demonstrate how Microservices in a Kubernetes environment can be instrumented by a no-code/agentless sensor to auto-discover, and auto-generate OpenAPI docs for all APIs present.\n\nSpeaker: Harish Natraj, co-founder of Levo.ai. He has deep experience in the APIs, microservices, and Kubernetes space. He has spent the last 10 years building and operating API Observability and Security solutions. He is passionate about empowering modern development teams to build secure and robust applications.\n\n**Talk#2:** Shadow Access has emerged as the most potent attack vector in the Cloud that creates exploitable pathways to an organization's crown jewels. Adversaries are shifting their attention to attacking DATA, Applications and software supply chains by weaponizing exploitable access pathways.\n\nWhat is Shadow Access?\nThe widespread use of cloud services and the increase in data-centric applications has led to the proliferation of data stores containing sensitive information. There is a high demand for access to this large volume of data, but it has also created a new problem called Shadow Access, which refers to unauthorized, unregulated, and invisible access to cloud data, applications, and software. In simple terms, shadow access must not exist and should be removed.\nWhat creates Shadow Access? Cloud identities, roles, permissions, policies, entitlements and vulnerabilities combine to create exploitable access pathways to DATA and applications. SEC-2 and SEC-5 of the OWASP Top 10 Security Risks are examples of Shadow Access impacting CI CD systems.\nThis talk will describe the problem of Shadow Access using the AWS Cloud as an exemplar. It will differentiate between status quo and the state of the art in detection engineering for Shadow Access. The talk will cover more 20+ detections of Shadow Access describing various techniques to detect and remove shadow access and its impact on audit, compliance and governance.\n\nSpeaker Bio\nVenkat Raghavan is the founder and CEO at Stack Identity. He is an operator, builder, and entrepreneur with over 25 years of enterprise software experience spanning big tech and start-ups. Venkat has held a variety of senior operational roles in products, research and development and general management. His areas of expertise include incubating, developing, and scaling businesses in Cyber Security, Cloud Native technologies and AI/ML."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston February 2023 Meetup - Hybrid Attendance",
        "date": "2023-02-01",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owaspboston/events/290724616",
        "timezone": "America/New_York",
        "description": "Agenda still TBD"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - December 2022",
        "date": "2023-01-24",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/290421029",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "Automation of digital crime investigation using Reinforcement Learning (RL)",
        "date": "2023-02-07",
        "time": "7:00Z",
        "link": "https://www.meetup.com/owasp-cambridge-meetup/events/290579034",
        "timezone": "Europe/London",
        "description": "Hosted by the Cyber Security & Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, & BCS Cybercrime Forensics SG\n\n**Background**\n\nThe BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.\n\nOWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.\n\nThe **Cyber Security and Networking** (**CSN**) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP & the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment. These will be achieved through the investigation of threats posed to information systems and understanding the impact of attacks and creation of cyber-based warning systems which gathering threat intelligence, automate threat detection, alert users and neutralising attacks. For network security we are researching securing the next generation of software defined infrastructures from the application API and control/data plane attacks. Other key work includes Computer forensic analysis, digital evidence crime scenes and evidence visualisation as well as Cyber educational approaches such as developing Capture the Flag (CTF) resources and application security programs.\n\n**Abstract : “Automation of digital crime investigation using Reinforcement Learning (RL)”**\n\nCurrent human-led Digital Investigation is reaching its limit, notably with the explosive increase in cybercrime. DFIR practitioners at law enforcement and corporate levels are facing severe challenges in coping with the demand. This talk will discuss the possible use of new Reinforcement Learning (RL) approaches to automate and optimise some of the processes in DFIR practice and thus off-load experts and increase efficiency.\n\n**Provisional Agenda**\n\n16:45 - Webinar waiting lobby opens\n17:00 - Start of Presentation\n17:50 – Questions & Answers"
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "Is the digital forensic tool user interface broken?",
        "date": "2023-01-19",
        "time": "7:00Z",
        "link": "https://www.meetup.com/owasp-cambridge-meetup/events/290578087",
        "timezone": "Europe/London",
        "description": "**Abstract**\n\n**Is there a better way of interacting with digital forensic data from a user interface and user experience standpoint?**\n\nThe NPCC (2020, p.5) states that: “Digital forensic (DF) science - examining digital evidence to support investigations and prosecutions - was once niche but is now very much mainstream.\n\nOver 90% of all crime is recognised as having a digital element, and society’s accelerating use of technology means the critical role DF science plays will only grow”. They identify three core challenges:\n\n1\\. the sheer volume of data and devices leading to backlogs and delays in investigations\\.\n\n2\\. the complexity of digital examinations including the variety of devices available\\, use of encryption\\, the number of data formats used\\, and the increasing use of cloud storage;\n\nand\n\n3\\. the need to maintain the legitimacy of the police in the digital landscape given 1 and 2 and law enforcement’s need to work in new ways to deal with these issues\\. \\(ibid\\.\\)\n\nGiven the volume of data and complexity of the examinations digital forensic (DF) practitioners work with regularly, this research interviewed 12 DF practitioners in an attempt to understand how the user interface of DF tools may exacerbate these issues, and what their suggestions may be to mitigate these. This work explores the responses, provides and initial analysis, and provides suggestions for how these findings may feed into the next generation of DF tools.\n\nNPCC (2020) Digital Forensic Science Strategy (PDF) (Accessed: 06 October 2022).\n\n**Provisional Agenda**\n\n16:45 - Webinar waiting lobby opens\n17:00 - Start of Presentation\n17:50 – Questions & Answers\n18:00 – Estimated Finish"
    },
    {
        "group": "Charlotte",
        "repo": "www-chapter-charlotte",
        "name": "2023 Kickoff Meeting!",
        "date": "2023-02-16",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/owaspclt/events/289053091",
        "timezone": "America/New_York",
        "description": "Come join us for our First meeting of the year, Food and Drink Will be provided! The location and agenda are TBA."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS January 2023",
        "date": "2023-01-19",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/290180872",
        "timezone": "America/Denver",
        "description": "Speaker: Adam Wilson\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Join us LIVE and IN-PERSON for Denver/Boulder OWASP's February Meetup!",
        "date": "2023-02-01",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/291010905",
        "timezone": "America/Denver",
        "description": "**As always, everyone is welcome! You do NOT have to be an OWASP member to attend. Bring a laptop if you plan to participate hands-on.**\n\nFor our February meetup, the focus will be on Hacking the OWASP Top 10 - 2023 Edition. We'll have a presenter, food, drinks, and networking. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to your sponsor [SpyderSec ](https://spydersec.com)**\n\n**Presentation Title:** Hacking the OWASP Top 10 - 2023 Edition\n\n**Presentation Details:**\nCurious what the latest OWASP Top 10 looks like? Wondering what the changes mean for developers, testers, and auditors? Come dive into it with our own Aaron Cure as he talks about each of the issues and his theories on the updates. Make sure to bring a laptop so you can hack along on several of the issues. Worried you don’t have the chops? Don’t be, we’ll give you enough info to hack it whether you’re a beginner or a pro!"
    },
    {
        "group": "Dindigul",
        "repo": "www-chapter-dindigul",
        "name": "Identifying Web Application Vulnerabilities",
        "date": "2023-01-26",
        "time": "8:00+05:30",
        "link": "https://www.meetup.com/dindigul-owasp-meetup-group/events/290782618",
        "timezone": "Asia/Kolkata",
        "description": "**Speaker Name:** Premkumar S\nFounder & Director of ORBIT INFOSEC\n**Organizer:** Arun sakthivel\n**Owasp Dindigul leader**\n\nRegistration URL: [https://forms.gle/h4sRnviA3KcBbUep7](https://forms.gle/h4sRnviA3KcBbUep7)"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Janvier 2023",
        "date": "2023-01-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/290848644",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **GitGuardian** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-02-13",
        "time": "8:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/290841105",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Flash memory dumping",
        "date": "2023-01-30",
        "time": "9:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/290913180",
        "timezone": "Asia/Jakarta",
        "description": "Topic: Flash memory dumping\n\nAbstract:\n\nThe test case objective is to dump the Flash Memory off the \"JTAG\" Protocol using \"Attify badge\" as the Attacking hardware against the DIVA (Damn Insecure and Vulnerable App).\n\nShort Bio:\n\nUjval Patel (Hax04)\n\ni have 2 total experience in security consulting & auditing. I’m currently working in EY. I started my career as a researcher at Indian Space Research Organisation (ISRO). I’m active member of the Seasides Security Community. I’m most passionate about hardware hacking since i like to grt my hands dirty.\n\nNote\n\nThis Session deliver in English\n\nJoin By zoom :\n\nTopic: OWASP Jakarta - Flash memory dumping\nTime: Jan 30, 2023 07:00 PM Jakarta\n\nJoin Zoom Meeting\nhttps://us06web.zoom.us/j/87689121285?pwd=Z0dlS2lGRlJRZDFjOUZRUTFRMllSUT09\n\nMeeting ID: 876 8912 1285\nPasscode: OWASPJKT"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Modelagem de Ameaças",
        "date": "2023-01-26",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/290874767",
        "timezone": "America/Fortaleza",
        "description": "Tudo o que você queria saber, mas tinha medo de perguntar… porque sabia que virariam requisitos."
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "OWASP-KC Jan 24th All About SBOM",
        "date": "2023-01-24",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-kansas-city/events/290919824",
        "timezone": "America/Chicago",
        "description": "Mat Caughron will be speaking on the topic of Software Bill of Materials (SBOM) and how it's relevant to application security and development!\n\nSBOM's are becoming more and more important in the application security and development space due to the White House's Executive Order around Software Supply Chain and NIST's newest guidance, SP 800-218 Secure Software Development Framework (SSDF).\n\nCome join us for drinks, snacks, and help contribute to the conversation about this topic and how it will effect application security and development for the foreseeable future!"
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "January Meetup 2023",
        "date": "2023-01-28",
        "time": "7:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/290789247",
        "timezone": "Asia/Karachi",
        "description": "TBD"
    },
    {
        "group": "Las Vegas",
        "repo": "www-chapter-las-vegas",
        "name": "Understanding Executive Order 140248",
        "date": "2023-01-21",
        "time": "4:45-08:00",
        "link": "https://www.meetup.com/owasp-las-vegas-chapter/events/290325291",
        "timezone": "America/Los_Angeles",
        "description": "**Join [OWASP Las Vegas](https://www.meetup.com/owasp-las-vegas-chapter/) as we kick off the new year right on January 21st at 2:45pm as we partner with [Vegas Programmers](https://www.meetup.com/vegas-programmers/) at [Tech Alley](https://www.techalley.org/) Las Vegas.**\n\n**We will have Leslie Ruthe from Google, and Tyler Sorensen from Aqua Security. They will discuss Executive Order 140248, what it means for your application, timelines for compliance, and what you can start doing now.**\n**You won't want to miss this one!**\n\n**This will be a hybrid event, so you have the option to join us through Zoom or in-person at Tech Alley in the Arts District of Downtown Las Vegas in Suite 150 inside the Vegas Theater Company Building (not the main stage - walk down the hall).**\n**RSVP now as seating is very limited.**\n\n**See you there!**"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JAN 25, 2023",
        "date": "2023-01-25",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/290450912",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: **Identity Based Attacks**\nJoin us for great networking, dinner and drinks, and see a presentation by:\n**Liam O’Murchu**, Technical Director, Security Technology and Response Group with Symantec\n\n**ABSTRACT**: Identity Based Attacks have become more common as the use of multifactor authentication has increased. Groups as diverse as teenage hackers to North Korean spies have devised schemes to circumvent these improvements. Direct attacks on the MFA tools themselves have also allowed APTs unfettered access to enterprises. A strong understanding of recent successful Identity Based Attacks can guide us to stronger solutions. We will look at attacks from social engineering to hidden back doors, showing attacker trends, solution weaknesses and stronger solutions will be highlighted.\n\n**Thanks to our Sponsor**: **Ermetic**\nErmetic helps prevent breaches by reducing the attack surface of cloud infrastructure and enforcing least privilege at scale in the most complex environments. The Ermetic SaaS platform provides comprehensive cloud security for AWS, Azure and GCP that spans both cloud infrastructure entitlements management (CIEM) and cloud security posture management (CSPM). The company is led by proven technology entrepreneurs whose previous companies have been acquired by Microsoft, Palo Alto Networks and others. Ermetic has received funding from Accel, Forgepoint, Glilot Capital Partners, Norwest Venture Partners, Qumra and Target Global. Visit us at [https://ermetic.com/](https://ermetic.com/) and follow us on LinkedIn ([https://www.linkedin.com/company/ermetic/mycompany/](https://www.linkedin.com/company/ermetic/mycompany/)), Twitter ([https://twitter.com/ermeticsec](https://twitter.com/ermeticsec)) and Facebook ([https://www.facebook.com/ermeticsec/](https://www.facebook.com/ermeticsec/)).\n\n*Vendors interested in sponsoring send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "Post COVID OWASP Maine Relaunch Networking Event!",
        "date": "2023-01-19",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-maine/events/290242579",
        "timezone": "America/New_York",
        "description": "1/19/23 Save the date!! After a long COVID related hiatus the OWASP Maine Chapter is ready to rock and roll again. We will be having our first event on 1/19/23, a Thursday night at Rising Tide Brewery!\n\nThis event will be a professional networking event allowing application security, cloud security, and software development engineers to meet and network and collaborate on application and software security, kicking off the relaunch of the chapter! Stay connected on [Slack](https://owasp.org/slack/invite), [LinkedIn](https://www.linkedin.com/company/owasp-maine/), or [Twitter](https://twitter.com/OWASPMaine/).\n\nGoing forward we will also be scheduling regular in person meetups with interesting and informative speakers on all sorts of application and software security topics.\n\nJoin us and tell your peers to join as well!\n\n**When:** Thursday January 19th 2023 6:00pm - 8:00pm est\n**Where:** Rising Tide Brewery 103 Fox St Portland, ME 04101\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**Sponsored by:** Contrast Security and NowSecure"
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai Online Meetup - 28th January 2023",
        "date": "2023-01-28",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/290845418",
        "timezone": "Asia/Kolkata",
        "description": "### OWASP Mumbai Online Meetup\n\n### Time: 12:00PM - 1:00PM\n\n### Session Details\n\nIntroduction to the OWASP Mumbai Chapter.\n\n**Talk:-** Client Side Prototype Pollution (CSPP)\n**Speaker:-** Sanjeev R [Senior Consultant @TheSecOpsGroup]\n\nGeneral Discussion, QnA & Feedback"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "January 2023 - OWASP Netherlands Meetup (Virtual)",
        "date": "2023-01-19",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/290365606",
        "timezone": "Europe/Amsterdam",
        "description": "Join us for our first chapter meeting for 2023!\n\nHosted virtually, we will be joined by two amazing speakers for the following talks:\n\n* **Bootstrap and increase your software assurance with OWASP SAMM** **v2.1**, with Sebastien Deleersnyder\n* **OWASP Security Knowledge Framework**, with Glenn Ten Cate.\n\nTalk abstracts coming soon!\n\nA streaming link will be sent to you shortly before the event. If you have any questions, please email netherlands@owasp.org"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Defense-In-Depth Engineering",
        "date": "2023-01-19",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/290749024",
        "timezone": "America/New_York",
        "description": "The 2021 OWASP Top Ten introduced a category \"Insecure Design\" to focus on risks related to design flaws. In this talk, we will focus on techniques we can use to build defense-in-depth software. What can we do to proactively architect software to be more resilient to attacks? What type of findings may not be discovered via automated static analysis? How can we design our software to be more friendly during incident response scenarios? Throughout this talk, we will focus on identifying often-overlooked architectural anti-patterns and vulnerabilities to be on the lookout for. We will source code to analyze patterns for improvement in both real-world applications as well as intentionally vulnerable applications. Engineers will leave this talk with a solid understanding of defense-in-depth software architecture and design. Security engineers or consultants can expect to leave with an increased understanding of insecure design patterns and vulnerabilities."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Security for Growth Companies",
        "date": "2023-01-31",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/290902364",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\nThe increased pressure for cybersecurity practices, even in their earliest stages, is becoming a common demand from both customers and investors. With cyber threats escalating, it’s more urgent than ever to embed security into a company’s day-to-day operations from day one to prevent ‘security debt’ from emerging as the company scale. Establishing a robust cyber security program can be a daunting task. A cloud-native company faces dozens of cybersecurity tools to choose from and the typical resource constraints of a young company that needs to grow fast. Based on the practical advice given by CISOs of 7 hyper-growth companies (Netflix, Datadog, HashiCorp, ACV, Axonius, Discord, and ServiceTitan), this talk aims to provide you with a modern, lightweight security guide to succeed in the cloud-first/cloud-native era.\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "January Meeting",
        "date": "2023-01-18",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/289801023",
        "timezone": "America/New_York",
        "description": "We had another speaker planned for this months event but we've had a scheduling issue so we will bring them another time. So instead I'll be presenting a preview of an upcoming talk I've been working on around CycloneDX BOMs and how to use in Threat Modeling.\n\nAs always we will be starting at 6 PM. We have room for a 2nd talk if anyone in the chapter would be interested in presenting. Don't be shy, Intro talks are fine. Message me here or at tony.turner AT owasp DOT org"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa January 2023:  Building & Adopting AppSec Capabilities",
        "date": "2023-01-26",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/290755929",
        "timezone": "America/Toronto",
        "description": "**Welcome to our first in-person meetup in over 2 years!**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\n**Health Notice:**\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/channel/UCxSU-KvNmYusZEq6v4YK5Lw). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\nYouTube Live Stream Link: https://www.youtube.com/watch?v=FV8qrPpCSmU\n\n**6:00 PM EDT** Arrival and setup\n**6:30 PM EDT** Introduction to OWASP Ottawa 2023 - Garth Boyd\n**6:45 PM EDT** Venue Sponsor Welcome - Guy-Vincent Jourdan\n\n**7:00 PM EDT** Technical Talks\n\n1. **The Missing pieces to building and adopting application security capabilities -** Jon Shapransky\n\nAbstract:\nThere are increasing requirements for organizations to improve their application security practices. To meet these requirements, organizations need to adopt capabilities whether practices (e.g., threat modelling, vulnerability scanning, etc.) or tools (e.g., SAST, SCA, DAST, CSPM, etc.). The value of hiring specialists and buying tools will not be realized unless the associated services, processes, procedures are adopted.This talk will focus on presenting an approach to building capabilities and highlight underlying principles behind adoption. This framework covers both the general components of a capability and the components required to adopt a capability. We’ll present a framework that incorporates relevant third-party research from fields outside of security and applies them to the security domain to help explain why some are successful in implementing and adopting capabilities while others are not.\n\nThis talk is for anyone involved in designing, building, and managing application security and product security programs. Takeaways:\n\n* Universal framework on capability development that prompts us to think about what we will need to ensure success and adoption.\n* Understanding of the principles behind adoption.\n* Perspective of how team topologies (structure and interactions) influences our ability to achieve desired results.\n* An approach to measuring progress.\n\nSpeaker Bio:\nJon Shapransky is a Technical Principal Security Consultant at Kroll with over 10 years of experience in Information Security. Since beginning his career, Jon has performed various forms of security assessments and helped clients build security programs and capabilities. Jon has worked with a wide range of client from both the public and private sector. His experience includes working with Fortune 100, Fortune 500, and Fortune Global 500 orgnisations across various industries and work with all levels of government, health care, and higher education. Presently, Jon is focussed on helping clients build Application Security and DevSecOps programs where he designs, architects, and helps implement related capabilities and processes."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - 18 Jan 2023",
        "date": "2023-01-18",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/290738511",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\nIf you hadn't attended our previous meetings - OWASP is a group related to application security issues. This time, Marcin Szydłowski will share his thoughts about the future of application security and Daniel Krasnokucki, current OWASP Poland Chapter Leader will speak about microservices security.\nAs usual, we are open to discuss any application security related topic, there will be a time for open discussion or to present IT security related jobs if you are an employer.\n\nPlease RSVP and save the date!\nIf you have a minute, please share this link with friends and in social media.\nBTW - if you have interesting topic to talk about, [send us your proposal](https://docs.google.com/forms/d/e/1FAIpQLSdUbie8Veh30EcRWhyq8ZFUUjz9d2sMqJx_DkIfrnMhO15LTA/viewform).\n\n**Agenda:**\n\n* AppSec trends & predictions 2023 (Marcin Szydłowski)\n* Microservices development vs OWASP Top10 A1 (Daniel Krasnokucki)\n* Open discussion / Lightning talks / IT Security jobs (if any)\n\n**AppSec trends & predictions 2023**\nIt is this time of the year when cybersecurity professionals pull out their crystall balls and tarot cards to predict what will be the industry trends in the next 12 months. Over the last few weeks I had a chance to plan what to focus on in 2023 and clash my opinions with some of the AppSec/ProductSec leaders in Poland. As interviewed individuals represent many different points of view (security consultants, bug bounty hunters, product security leaders) we have an interesting mixture of opinions and thoughts on SSDLC and Product Security in general.\nIf you are interested in most problematic vulnerabilities, upcoming challenges for software houses or predicted changes in tools & methodologies join us in Krakow and be part of the discussion.\"\n*Speaker's bio:*\n**Marcin Szydłowski** \\- Cybersecurity professional who spent last 10 years on improving security posture of different\\-sized companies in various industries\\. Started his security journey as a pentester and security consultant\\, went through building global teams responsible for application security in international companies and currently acts as a head of security at Booksy\\. Continuously struggling to find free time to do bug bounty hunting\\.\n\n**Microservices development vs OWASP Top10 A1.** Authorization in multilayer architecture\n\nNowadays all companies try to make software in agile way. The smaller pieces are done, the better. Architecture of computer programs changed a lot and everyone is try going into microservices, microfrontends and a lot of communication between those. BUT... wait... which layer is responsible for authorization? In the short presentation I will present main challenges and possible solutions in microservices world and hopefully open some discussion about your experience in this area!\n\n*Speaker's bio:*\n**Daniel Krasnokucki** \\- developer and appsec guy\\, who leads Product Security team @ Equinix\\. Every day works on improving\\, testing and automating security for very dynamic and innovative software\\. After work \\(as much as possible\\) training people about development and security and if any free time is left \\- spending time with family\\, dog and trying to find time for sport\\.\\.\\.\n\n**Open discussion / Lightning Talks / IT Security jobs**\nThe stage is yours. If you have something inspiring to share or just IT security related job offer - don't hesitate, it's open meeting and it's all about exchange of views and information."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "Post COVID OWASP Maine Relaunch Networking Event!",
        "date": "2023-01-19",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-maine/events/290242579",
        "timezone": "America/New_York",
        "description": "1/19/23 Save the date!! After a long COVID related hiatus the OWASP Maine Chapter is ready to rock and roll again. We will be having our first event on 1/19/23, a Thursday night at Rising Tide Brewery!\n\nThis event will be a professional networking event allowing application security, cloud security, and software development engineers to meet and network and collaborate on application and software security, kicking off the relaunch of the chapter! Stay connected on [Slack](https://owasp.org/slack/invite), [LinkedIn](https://www.linkedin.com/company/owasp-maine/), or [Twitter](https://twitter.com/OWASPMaine/).\n\nGoing forward we will also be scheduling regular in person meetups with interesting and informative speakers on all sorts of application and software security topics.\n\nJoin us and tell your peers to join as well!\n\n**When:** Thursday January 19th 2023 6:00pm - 8:00pm est\n**Where:** Rising Tide Brewery 103 Fox St Portland, ME 04101\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**Sponsored by:** Contrast Security and NowSecure"
    },
    {
        "group": "Pune",
        "repo": "www-chapter-pune",
        "name": "OWASP Pune Meet with Altimetrik- 21 Jan 2023",
        "date": "2023-01-21",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-pune-chapter/events/290758979",
        "timezone": "Asia/Kolkata",
        "description": "OWASP Pune is back with another informative day!\n\nWe are organizing this in person event in collaboration with Altimetrik\n\nVenue: Altimetrik India Pvt Ltd, No. 2A/1, Ground Floor, Tower B, Tech Park One Survey No, '1 91, Hissa, 2, Airport Rd, Yerawada, Pune, Maharashtra 411006\n\n***Agenda:***\n\n10:00 AM - 10:15 AM: Welcome Note by Organizers\n\n10:15 AM - 11:00 AM: **Talk 1: *CSPM(Cloud Security Posture Management) - It's not a choice but a necessity***\n**Speaker:** Shyam Kumar Thakur, Information Security Practice, Altimetrik\n\n11:00 AM - 11:45 AM: **Talk 2: *Securing APIs in modern web applications***\n**Speaker:** Sunny Singh, Lead Product Security Engineer, Calibo\n\n11:45 AM - 12:00 PM: **Networking Break**\n\n12:00 PM - 12:45 PM: **Talk 3: *Attacking and defending file upload vulnerability***\n**Speaker:** Praveen Sutar, Principal Security Engineer, CyberSecurist Technologies\n\n12:45 PM - 1:00 PM: closing"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec / OWASP-SLC - January Meetup (in person @ Health Equity Campus)",
        "date": "2023-01-24",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/290755920",
        "timezone": "America/Denver",
        "description": "**Agenda:**\n1) Lunch\n2) 2023 Calendar showing upcoming meetups for the year\n3) Topics for discussion:\n\n1. Content Security Policies and SRI and how they can/can't protect third party script usage (including dynamic)\n2. In room poll (what are you bumping into now?)"
    },
    {
        "group": "Sao Jose Dos Campos",
        "repo": "www-chapter-sao-jose-dos-campos",
        "name": "Docker Weaponization",
        "date": "2023-01-26",
        "time": "1:00-03:00",
        "link": "https://www.meetup.com/owasp-sao-jose-dos-campos-chapter/events/290877438",
        "timezone": "America/Sao_Paulo",
        "description": "Neste Meetup vamos entender o processo que permite que executemos aplicações que utilizam GUI de dentro de um container.\n\nEste tipo de ação se torna útil no dia-a-dia, ainda falando em sec, pois permite que tenhamos todas as ferramentas necessárias para um teste ou análise de vulnerabilidade, sem que haja a necessidade de instalar ferramentas diretamente no SO ou o uso de virtualização.\n\nO sistema final fica muito leve em comparação a um SO sendo executado em sua totalidade, seja como host ou virtualizado, além de ser extremamente minimalista, instalando somente as ferramentas necessárias. O que o torna performático e isolado do SO host (nem tanto)."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-02-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/290988680",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-02-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/290988679",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-02-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/290988678",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - January 2023",
        "date": "2023-01-24",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/290329408",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Modern Authentication - FIDO2 and Passkeys",
        "date": "2023-02-15",
        "time": "8:00+11:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/290887586",
        "timezone": "Australia/Sydney",
        "description": "Location: - Talenza Offices, Level 3, 7 Macquarie Place, Sydney NSW 2000\nYouTube link: TBA\nDiscord: https://discord.com/invite/uAWze2B - Questions in the Sydney Chapter channel.\nMeet at 6:00 with the talk starting at 6:30.\n\nAbstract: This presentation will discuss approaches to the modern authentication protocols. In particular, we will dive into the FIDO2 passwordless protocol and passkey, a strong candidate to finally replace passwords. Our session will cover both technical and usability aspects of those approaches. We will look at the current trends in authentication attacks as well as the latest research and developments."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "AppSec Roundtable, hosted by Chris Romeo",
        "date": "2023-01-26",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasptriangle/events/290775398",
        "timezone": "America/New_York",
        "description": "OWASP Triangle Chapter is dormant no more! This month we'll re-launch with an AppSec roundtable. Bring your AppSec questions, thoughts, opinion, and debates, and let's get the community back together to talk all things AppSec!"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver - February 2023",
        "date": "2023-02-16",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248487",
        "timezone": "America/Vancouver",
        "description": "OWASP Vancouver monthly meetup"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Panel: What is the meaning of AppSec, the Universe, and everything?",
        "date": "2023-01-19",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248482",
        "timezone": "America/Vancouver",
        "description": "Join us for a panel with industry veterans and an open discussion of various AppSec topics. Tired of a pre-set agenda? Have a question that doesn’t align with a specific topic? Want to get an opinion from a number of people? Or make an important announcement? This is the perfect opportunity. Come prepared and this session will be mighty rewarding!\n\nWe thank Forward Security for sponsoring the venue and food for this event."
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Growing pains: How security changes as your startup develops",
        "date": "2023-01-20",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-devslop-project/events/290778943",
        "timezone": "America/Toronto",
        "description": " **ABSTRACT** \nIf you have started or are a part of a small-yet-mighty software business, you know first-hand how busy it can be. You wear many hats, juggle many tasks, and put out many fires - and that is to get your product off the ground. I have worked with heaps of companies that fit that description, and when you mention the words 'security' you can often feel the energy get sucked out of the room. It is a pretty daunting subject, especially with the current state and popularity of cyber security in the news.\n\nJoin us while we discuss how to scope the size of your security needs and share practical, low-cost steps you can take towards security - depending on how big your startup is. If you have had any victories (or lessons learned the hard way) when setting good security foundations for your startup, bring them along too!\n\n**Erica Anderson (@sputina)**\nErica (she/her) is just a huge ol' nerd. She has been a security consultant, security platform engineer, incident responder, security analyst, and instructor. Right now she spends most of her time as the COO and Co-Founder of SafeStack where they are all about secure development training and community building."
    }
]