[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - May/June",
        "date": "2023-06-01",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/293431733",
        "timezone": "Europe/Copenhagen",
        "description": "Hi All,\n\nPlease note, that this is a physical event hosted by Beumer Group A/S and OWASP Aarhus may share a list of participants with Beumer Group A/S for the sole purpose of hosting the event.\n\nNote that the doors open at 18:30 for snacks and network.\n\nOWASP Aarhus would like to invite you to an OWASP Aarhus meetup on June 1st in collaboration with ICS Range and BEUMER Group A/S, and this time, it will be a bit different as we will have OT security as a theme.\n\nMikael Vingaard from ICS Range will present “IT/OT, more than a letter of differences! – Only a foul does not fear it-security people in their OT network”, and Jens Nielsen (Senior Security Researcher) also from ICS Range will present “In my defence, I was left unsupervised\".\n\nThe event will occur at BEUMER Group A/S, P.O. Pedersens Vej 10, 8200 Aarhus N (Thanks to BeumerGroup and Claus Riber for hosting us).\n\nWe will start at 19:00 but the doors open for network, snacks at 18:30 and we plan to end at 21:00.\n\nPlease remember to sign up!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2023 (Online)",
        "date": "2023-05-30",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705737",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- https://owasp\\-austin\\-2023\\-may\\.eventbrite\\.com\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nPresentation:\nHow Zero Trust can improve your web application security\nIn this presentation, we will review some of the Zero Trust concepts and roadmapping some adoption schemes. We will dive into some examples of using these concepts to improve and provide better controls around:\n\\* Setup and configuration of Zero Trust Services\n\\* Developer access and code security gains\n\\* Exposing internal web sites securely with MFA (even if not designed with MFA) with user and group driven policies without a VPN\n\\* Gain a WAF with exposing internal web sites through browser-based Zero Trust Network Access.\n\\* Dealing with 3rd party access to internal web sites"
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "OWASP Belfast event! ",
        "date": "2023-05-25",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/293191036",
        "timezone": "Europe/London",
        "description": "Hello OWASP Belfast!\n\nWe are delighted to announce that we are back with our first hybrid event for 2023 with an exciting line up of talks from industry leaders. The Meet up will be in partnership with ESO, who have also kindly offered to host the evening and provide pizza, beers and soft drinks for everyone!\n\n**Date**: 25th May 2023\n**Time**: 6.30 PM\n**Location**: ESO, 42 Fountain St, Belfast BT1 5EF.\n\n**Or join us virtually by Zoom**: https://eso.zoom.us/j/93766328107\n\nFirst, we will talk about threat modelling, its importance to developers, and how it can be implemented as a continuous approach within the development pipeline. This will naturally lead into a discussion about the current TOP 10 threats by OWASP focusing specifically on: HTTP request smuggling, mass assignment attacks, plus terraform security best practices. Finally, to wrap up, we’ll discuss how automation\ncan help address OWASP vulnerabilities, the importance of design principal prioritisation and how the utilisation of code analysis can improve vulnerability detection, management, and remediation as part of the development pipeline.\n\n**Agenda**:\n6.30 - 6.50 Networking\n6.50 - 7.00 Welcome & chat about ESO\n7.00 - 7.20 Talk 1: Threat Modelling (Simon Whittaker, Vertical Structures).\n7.20 - 7.30 BREAK\n7.30 - 7.50 Talk 2: OWASP Top 10 (Denis Podgurskii)\n7.50 - 8.00 BREAK\n8.00 - 8.20 Talk 3: Automating OWASP Defences (ESO)\n8.20 - 8.30 Q&A, Networking and Exit Disclaimer\nAs always, our events are designed to educate. Any tools and techniques\ndemonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nSpeaker Info:\n**Finian Mackin** – Director of Security Architecture at ESO\nhttps://www.linkedin.com/in/finian-m-81718014/\n**Simon Whittaker** \\- CEO at Vertical Structure Ltd\nhttps://speaking.verticalstructure.com/bio\n**Denis Podgurskii** \\- OWASP Belfast\nhttps://www.linkedin.com/in/denis-podgurskii/\n\nAdditional Information:\nESO is located between Waterstones bookshop and the back of Boots in Belfast city centre.\nThey have two working lifts\nESO employees will be at the door to welcome attendees and show them to the meetup space."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Browser Extension Security, and Scripting for Web Application Testers",
        "date": "2023-06-15",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/290892060",
        "timezone": "Europe/London",
        "description": "In-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.\n\n**Agenda:**\n\n* OWASP Updates\n* Talk 1: Browser extension security, with Billy Sheppard from Immersive Labs\n* Break\n* Talk 2: Intro to Scripting for Web Application Testers with Alex Archondakis\n* Networking\n\n**Venue:**\nPhoto shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard).\n\nAddress: 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ\n\n\\-\\-\\-\n\nTalk 1: **A look into browser extension security**, the risks involved with allowing users to install browser extensions and browser security/attack vectors, presented by **Billy Sheppard**.\n\n**Abstract**: As web technologies are becoming more and more popular, you need to be more careful about what you put in your browsers. While extensions can be very useful, they come with hidden dangers – users often prioritise functionality over safety. In this talk, you'll uncover the real risks of using extensions, explore common attacks, and learn about pitfalls. You'll also take a look at some real-life security incidents and what went wrong. You'll leave with a deeper understanding of the need for browser extension security and how to safeguard your browser.\n\n**Bio:** Billy Sheppard is a Bristol-based Senior Application Security Engineer working at Immersive Labs where he creates Secure Code content and challenges for their product.\n\nIn his career thus far, he has earned several achievements including VDP submissions for Fortune 500 companies, Bug bounties, and created and released his own niche CTF/Hacking challenge specifically aimed at increasing security awareness for ServiceNow developers. He has also created a Web Security YouTube Channel to demonstrate security concepts and educate developers and reported multiple real security issues to VDPs/Bug Bounty Programs for large companies such as BBC, RedHat and Accenture. He is a keen learner and spends a lot of his personal time continuously learning and is passionate about education around secure code.\n\n\\-\\-\\-\n\nTalk 2: **An Introduction to scripting for Application Testers,** presented by **Alex Archondakis**.\n\n**Abstract**: Scripting, or the ability to write code that allows you to perform actions or automate repetitive tasks is a crucial tool in any application security testers belt, however, it doesn’t seem to be a common one.\n\nThe purpose of this talk is to introduce scripting to application security testers, this will be achieved by looking at case studies to determine where scripting may be appropriate and how to solve the problem. We will discuss multiple languages and their advantages whilst focussing on interacting with the HTTP protocol.\n\nThe key learning points from this talk are as follows:\n\n* To gain an understanding of the importance of scripting for application security testers\n* What programming languages are used, and their advantages/disadvantages.\n* Typical scenarios where scripting is required because tooling is not comprehensive enough\n\n**Bio**: Alex is head of professional services & a senior consultant at Pentest People. He has a wealth of experience in penetration testing, people management and training hackers. He believes that all application security professionals should be able to write basic scripts to solve common problems."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Injection Vulnerabilities, with OWASP Suffolk",
        "date": "2023-05-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044436",
        "timezone": "Europe/London",
        "description": "A joint event, by OWASP Bristol and OWASP Suffolk.\n\nInjection vulnerabilities remain a common problem today. A single mistake could expose your whole database and customer data, or give an attacker the ability to remotely execute code on your server.\n\nWe will look at some examples of coding mistakes that can lead to injection vulnerabilities, demonstrate how they can be found with vulnerability scanning tools, and discuss how they can be completely prevented from happening (more than simply hoping developers will use prepared queries or database abstractions correctly).\n\nAgenda:\n\n* OWASP updates\n* Injection Vulnerabilities talk"
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Desarrollo Seguro basado en OWASP",
        "date": "2023-05-25",
        "time": "0:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/293615940",
        "timezone": "America/Santiago",
        "description": "Santiago, Jueves 25-Mayo y Jueves 08-Junio, desde 20:00 horas.\n\nOwaspChile, te invita a una charla-resumen de una hora, basada en los entrenamientos disponibles para aprender OWASP Top10 y programación segura.\n\n**TRAINING ROADMAP**\n=====================\n\n**Jueves 25-Mayo**\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\nLevel 1: Foundations Training. Sirve perfecto como un awareness de concientización en Seguridad de la Información. se basa en los riesgos de ciberseguridad más frecuentes.\n\n\\*(Inscríbete y el día de la charla recibirás el link de conexión via e-mail).\n\n**Jueves 08-Junio,**\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\nLevel 2: Advanced Training. Es un entrenamiento de 16 horas con laboratorios de programación segura para un lenguaje a elección (JAVA, .NET o PHP a definir) y store procedures de Bases de Datos.\n\n\\*(Inscríbete y el día de la charla recibirás el link de conexión via e-mail).\n\nLos esperamos."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS May 2023",
        "date": "2023-05-25",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/293309247",
        "timezone": "America/Denver",
        "description": "Speaker: John Mocuta, Weaponized AI and Executive Impersonation.\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "Introduction to OWASP ModSecurity CRS",
        "date": "2023-06-01",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/293556100",
        "timezone": "Europe/London",
        "description": "OWASP Dorset are proud to bring out latest in-person event, hosted with Hays Recruitment Bournemouth.\n\n**Talks**\nAndrew Howe is a locally based technical author, architect and Linux load balancer engineer. He is an advocate of open source software and a fellow member of OWASP. Andrew is a developer for the OWASP ModSecurity Core Rule Set (CRS) project.\n\nThe OWASP ModSecurity Core Rule Set (CRS) is a set of generic attack detection rules for use with ModSecurity or compatible web application firewalls. The CRS aims to protect web applications from a wide range of attacks, including the OWASP Top Ten, with a minimum of false alerts. The CRS provides protection against many common attack categories, including SQL Injection, Cross Site Scripting, Local File Inclusion, etc.\n\nWe will also have a talk from James Walsh of Hays Recruitment. James will present the findings from the recent Hays Global Cyber Survey, where over 1000 Senior Leaders from 29 countries have given their insight.\n\n**Event and Venue**\nWe will be joining Hays Recruitment in Bournemouth for this event, there is a limit on numbers, so signup is essential. Names will be required upon arrival to enter the building.\n\nThere will be food and drink provided for this event, so please let us know of any dietary requirements or allergies."
    },
    {
        "group": "Dublin",
        "repo": "www-chapter-dublin",
        "name": "OWASP Dublin - May Meetup",
        "date": "2023-05-23",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-dublin/events/293492626",
        "timezone": "Europe/Dublin",
        "description": "OWASP Dublin are delighted to announce KPMG will be sponsoring & hosting the next OWASP Dublin chapter meetup.\n\nWe will have two great talks from industry experts, details can be found below:\n\n**Speaker 1: Muath Sharawi** is an associate director in the KPMG Cyber Defense and Response team, with over a decade of experience assisting organisations in improving their cybersecurity posture through offensive security. His primary focus is on red and purple team exercises, in addition to infrastructure and application security assessments.\n\n**Speaker 2: Ritesh Bhat** is a senior consultant in the KPMG Cyber Defense and Response Team. He has almost 6 years of experience in the industry specialising in Offensive Security and Incident Response. Apart from that he has experience in deploying and managing Endpoint Security stacks. He also has knowledge in the areas of Malware analysis and forensics.\n\n**Talk Description**:\nOur presentation covers the life cycle of cyber-attacks, focusing on a real-world incident involving a threat actor group that exploited a public-facing server to compromise the network. Topics include common initial access vectors, recent trends in cyber attacks, and a detailed walkthrough of the attack, highlighting the tactics and techniques employed\n\nWe will also hear from our third speaker **John Marmelstein**.\n\nJohn is currently an independent security consultant. Previously he was with Oracle for about 10 years. Focus areas include access controls, and technology risk in general.\n\nJohn will be talking to us about using a test based approach to managing complex data access rules.\n\nThis will be an exciting evening, so please ensure you register early.\n\nRefreshments will be available and plenty of opportunity to speak with others in the Secuirty Community.\n\nA big thanks to our hosts for the evening KPMG."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Securing Docker to Protect the Host",
        "date": "2023-05-31",
        "time": "7:00-06:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/293321647",
        "timezone": "America/Edmonton",
        "description": "## About The Event\n\n \n**RSVP For Pizza + DOOR PRIZES**\n\nhttps://www.meetup.com/meetup-group-opbybwve/\n\n**Location:**\n10215 108 St NW, Edmonton, AB T5J 1L6\nSCFL 3-110 (Singmar Center For Learning, 3rd floor, Room 110)\n\nJoin us for our monthly OWASP event where we will dive deep into **Docker Security** and the **OWASP Top Ten for Docker**. This month's event will focus on privilege escalation attacks from the HOST, a critical issue that every Docker user must be aware of.\n\nOur event sponsor is **iON United,** a trusted cybersecurity solution provider for IT, OT, and cloud environments within Canada.\nThey be providing **delicious pizza** for all attendees, so come hungry and ready to learn!\n\nOur guest speaker for this event is John, an experienced security professional who has worked for Fortune 500 companies. With his extensive knowledge and expertise in Docker security, John will provide valuable insights and practical tips to help you secure your Docker environment.\n\n**As Socrates once said**, \"The only true wisdom is in knowing you know nothing.\" Don't miss this opportunity to expand your knowledge and learn how to protect your Docker environment from privilege escalation attacks.\n\nWe look forward to seeing you there!"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "German OWASP Day 2023 in Frankfurt: Ebbelwoi meets AppSec!",
        "date": "2023-05-30",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/293534722",
        "timezone": "Europe/Berlin",
        "description": "Hi all,\nWe're thrilled to announce the return of the German OWASP Day 2023! This leading independent and non-commercial conference on application security in Germany will take place on the 30th and 31st of May, 2023 at the Frankfurt School of Finance and Management.\n\n_What's happening? We look forward to welcoming you to our German OWASP Day 2023, offering a plethora of exciting technical and non-technical talks, various seminars, and an evening event for networking.\n\n_What's on the agenda? Our main program has been released, featuring a range of talks from esteemed experts like Björn Kimminich, Claudia Ully, Clemens Hübner, Diana Waithanji, and many more.\n\n_When? Our event takes place on the 30th and 31st of May, 2023.\n\n_Where? Frankfurt School of Finance and Management, Adickesallee 32-34, 60322 Frankfurt am Main\n\n_Tickets? Limited tickets are available at [https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477](https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477)\n\n_Additional Information? More information about the German OWASP Day, training sessions, and the conference program can be found at god.owasp.de/2023/\n\n_And now? Save the date, spread the word, and bring your friends and colleagues to our event.\n\n_Follow Us! Also, follow us on Twitter #owasp_de and #owasp_frankfurt and refer to our German OWASP Day site for information including slides and recordings of previous presentations.\n\nWe're looking forward to seeing you at this exciting event of the year!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Summer Security Evening",
        "date": "2023-05-24",
        "time": "7:15+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/293442718",
        "timezone": "Europe/Stockholm",
        "description": "### **Join us at our summer security evening, hosted by our partner Benify at their gorgeous office!**\n\n### **Come and grab something to eat and drink, and listen to talks about OT security and cutting edge research into client-side password hashing!**\n\n**Where:** Benify, Masthamnsgatan 5, 413 27 Göteborg\n\n**Agenda:**\n**17:15 - 17:45:** Welcome to Benify\n**17:45 - 18:00:** Introduction from the event hosts and presentation of tonight's speakers.\n**18:00 - 19:00: Cybersecurity today and its problems in the cyber physical world**\nA talk about findings and insights gained by doing Cyber-Physical security assessments on OT sites and critical infrastructure. We explain a bit about what we have been doing the last few years, what we have found and why we no longer can see pentests, risk-assessments, redteaming or just plain old SMA's as adequate for understanding and securing OT environments or critical infrastructure.\n**The team** consists of Ove Tjörnhed, Anastasiya Kornitska, and Oscar Gumaelius. They started working together at Orange Cyberdefence where they built OCD's OT Security field in Sweden from the ground up. Now they are working as a team at Afry X to create and build a OT Security area and help design secure OT environments and help spread the knowledge of OT security.\n\n**19:15 - 20:15: Make the cracker pay. Moving password hashing to the client.**\nOne of the main targets of attackers is exfiltrating the user databases and their password verifiers. Attackers will then try to guess the passwords doing guesses against the verifiers so that they can then try to access other services where the user may have used the same, or similar, credentials. To slow down attackers, password hashing algorithms exist which need huge amounts of memory space and bandwidth along with large processing times. Unfortunately, such algorithms are used commonly on the server to which the clients authenticate making them unusable on many systems and opening the system to Denial of Service attacks. To address this, we can instead require the client (or attacker) to perform the hashing themselves, but how can we do it without introducing new security issues? In this talk he will explain how to modify password based flows to move the brunt of the work away from the server in a secure way. We will also introduce a few techniques to improve the performance of the flows without reducing the security and introduce Clipaha, an open source library providing client-side password hashing which can be helpful in this process.\n**Francisco Blas Izquierdo Riera** **(klondike)** is studying his PhD at Chalmers with sponsoring from MSB through the Resilient IoT project. In his PhD studies, he is trying to use his knowledge of real world problems learned after years of experience working as a pentester and as a CISO to create useful solutions to address them. He is also active doing CTFs as part of ChaGU.\n**20:15 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!\n\n[Get tickets to the event!](https://www.eventbrite.com/e/owasp-goteborg-summer-security-evening-tickets-631496782877?aff=ebdshpsearchautocomplete&keep_tld=1)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-06-12",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/293371130",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#03 is a charm",
        "date": "2023-05-30",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/292893619",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on May 30th, 2023, at 18:00, **supported by [Snyk](https://snyk.io/) and [AP2SI](https://ap2si.org/)**.\n\nThe schedule is the following:\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n**18:15** \\- Open projects you can use today to improve your AppSec posture\n**19:00** \\- One\\-Time Quantum\\-Resistant Fully\\-Homomorphic Padding Oracle cryptography trends\\, buzzwords\\, and snake oil for 2023\n**20:00** \\- Snacks & Drinks sponsored by Snyk\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Open projects you can use today to improve your AppSec posture**\n\nSpeaker:\nLucas Ferreira\n\nAbstract:\nIn this talk, we go through the most important OWASP projects (both documentation/standards and tools) to show how companies can improve their security posture and mature their AppSec program. It is meant as an overview of the main OWASP projects.\n\nBio:\nLucas is a long-time OWASP member, having worked in OWASP as a project leader and chapter leader on two continents. He was a member of the OWASP Global Conferences committee and lead the organization of 3 OWASP AppSec conferences in Brazil.\n\nLinkedIn: [https://www.linkedin.com/in/ferreira/](https://www.linkedin.com/in/ferreira/)\nTwitter: @lucassapao\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **One-Time Quantum-Resistant Fully-Homomorphic Padding Oracle cryptography trends, buzzwords, and snake oil for 2023**\n\nSpeaker:\nDiogo Sousa\n\nAbstract:\nIn our modern times, cryptography is all around us, even if we don't notice it. We use it when checking our bank statements, buying pig plushies online, or sending stickers to each other on instant messengers. Given its ubiquity, it is, for the most part, taken for granted by developers: import HTTP/crypto/TLS, throw in a certificate from Let's Encrypt, and don't think much about it while relying on (hopefully) safe defaults.\nWhile sticking with well-vetted libraries should work out of the box for most cases, in certain areas, you need to be a bit more knowledgeable, if only to make good decisions about what libraries to use and how to wrangle all the moving parts into a cohesive and secure system.\nCryptography tends to be full of obscure notation that isn't that dissimilar to magic spells, and \"Don't Roll Your Own Crypto\" is an often repeated mantra (many times because of the previous statement). Search results for \"crypto\" have been getting progressively more complicated to navigate, with BTC, XRP, and others taking up all the prime SEO result space.\nThis talk targets a beginner to an intermediate audience and, starting from a brief overview of core tenets (Kerckhoffs's principle, Schneier's Law, the economy of mechanism, theoretical vs. practical security), will expand upon the current challenges and trends in modern cryptography, from FHE to PQC (including explaining what those are), and also highlight common design pitfalls (and their consequences) and how to reduce your snake oil intake.\n\nBio:\nAn opinionated individual with interest in cryptography and its intersection with secure software development.\n\nLinkedIn: [https://www.linkedin.com/in/0xdsousa/](https://www.linkedin.com/in/0xdsousa/)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2023-05-30",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/293486002",
        "timezone": "Europe/London",
        "description": "**DO NOT RSVP on Meetup: PLEASE REGISTER FOR THIS EVENT USING EventBrite here: [https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-634995969037?aff=mu](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-634995969037?aff=mu)**\n\nThis meetup will take place at Amazon London offices (in-person) and will also be live-streamed on OWASP London YouTube Channel.\n\\-\\-\\-\\-\n**TALKS:**\n\n**OWASP Introduction, Welcome and News - Sam Stepanyan**\nWelcome and a brief update on OWASP Projects & Conferences\n\n**Talk 1: \"Security Chaos Engineering: When and How You Should Break Your System\"** - **Anais Urlichs**\n\nThe real cost of misconfiguration for businesses has been set to several trillion over the past years. These costs are the result of misconfiguration in infrastructure and workloads. One way to proactively identify misconfiguration is through security scanning. The scan results provide us with insights into the security posture of our services over time. However, these scanners treat our resources as static and evaluate misconfiguration only in single instances. To assess the potential impact of misconfiguration in our production environment, we need additional tools. In this talk, we will look at ways Chaos Engineering and Security Experimentation can help us minimise the potential damage of misconfiguration. Chaos Engineering is the process of intentionally introducing fault into a system to test its resilience to failure. Anais will walk you through the principles of Security Chaos Engineering and how it can be used to proactively identify misconfiguration and make our deployment pipeline and services more robust.\n\n**Talk 2: \"It’s Not a Bug It’s Emergent Behaviour - Generative AI, Its Cybersecurity Risks and Benefits\" - Sherif Mansour**\n\nA curated talk on generative AI, where Sherif will present his research findings beginning with an overview of the technology, then discuss its current technical risks, and explore its promising security use cases without making grand claims. Additionally, this talk dive into design considerations when developing web applications utilising generative AI. To conclude, Sherif will introduce open-source software announced during the talk, encouraging attendees to use and investigate them at their own discretion.\n\n**SPEAKERS:**\n\n**Anaïs Urlichs (@urlichsanais)**\n\nAnaïs Urlichs is a Developer Advocate at Aqua Security, where she contributes to Aqua’s cloud native open source projects. When she is not advocating DevOps best practices, she runs her own YouTube Channel centered around cloud native technologies. Before joining Aqua, Anais worked as SRE at Civo, a cloud native service provider, where she worked on infrastructure for hundreds of tenant clusters. As OpenUK ambassador, her passion lies in making tools and platforms more accessible to developers and community members.\n\n**Sherif Mansour (@kerberosmansour)**\n\nSherif Mansour is the global director of information security at JustEat Takeaway.com and has been working in the field of information security for 19 years. He was the OWASP chairman and sat on of the OWASP foundations' board for four years. He was also one of the founding governing board members for the OpenSSF Foundation which he represented the OWASP Foundation. Sherif contributed to several OWASP projects and was one the main authors of the CIS Benchmark for Tomcat 7/8. As a security researcher he has disclosed vulnerabilities in Microsoft, Oracle, SAP and SiteSpect products.\n\n**TICKETS:**\n\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you **[MUST book your place on EventBrite](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-634995969037?aff=mu)** to be admitted to the event by the building security - your name will be checked against the guest list. Please have bring some form of ID to help the building security to check you in quicker.\n\n**CODE OF CONDUCT**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\n\nOWASP aims to provide a harassment-free experience for everyone, regardless of gender, sexual orientation, disability, physical appearance, body size, race, age, or religion. We do not tolerate harassment of event participants in any form.\n\nAdditionally, participating in OWASP events means you shall also adhere to the OWASP Code of Conduct which you can find here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAY 24, 2023",
        "date": "2023-05-24",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/292313422",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Tactical Security - Improving AppSec Coverage with Fewer Resources\nJoin us for great networking, dinner and drinks, and see a presentation by Rich Newman, Technical Account Manager, Synopsys\n\n**ABSTRACT**: This discussion focuses on the differences in issues detected between SAST, SCA and DAST with detailed examples. There is also an aggregation/correlation section at the end to cover the need to view an application’s AppSec status as a whole and not via individual tools.\n\n* SAST - Examples from Coverity/Sigma\n* SCA - Examples from Black Duck\n* DAST (IAST/Fuzz) - Examples from Seeker & Defensics\n* ASOC - Examples from Code Dx\n\n**Thanks to our Sponsor**: [Synopsys](www.synopsys.com/software)\n*Minimize business risk across the entire SDLC*\n*Every business is a software business. Whether you’re selling it directly to your customers or relying on it to run your operations. **Synopsys** helps you protect your bottom line by building trust in your software—at the speed your business demands.*\n\n### **SPONSORSHIP Opportunities Available**\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Madison",
        "repo": "www-chapter-madison",
        "name": "June Meeting",
        "date": "2023-06-13",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-madison/events/293553420",
        "timezone": "America/Chicago",
        "description": "Requested Topics:\n\n* Discuss the Open Letter to OWASP and the Response/Updates\n\nhttps://owasp.org/blog/2023/03/10/strategic-plan-open-letter-update.html\nhttps://owasp.org/blog/2023/03/31/owasp-strategy-2023-1.html\n\n* Industry Roundtable: initiatives, struggles, successes from the Madison Metro AppSec Space\n* Jazzer Demo https://github.com/CodeIntelligenceTesting/jazzer"
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "Meetup 2023 Presencial #02",
        "date": "2023-05-23",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-natal-chapter/events/293627466",
        "timezone": "America/Fortaleza",
        "description": "OWASP é uma organização sem fins lucrativos que se dedica a melhorar a segurança da informação global. Ela busca conscientizar as empresas e as universidades sobre as ameaças de segurança cibernética e fornecer ferramentas e recursos para defender contra essas ameaças.\n\nCom este evento, as empresas e as universidades participantes terão a oportunidade de serem atualizadas sobre os mais recentes desenvolvimentos e técnicas na área de segurança da informação. Além disso, as palestras serão ministradas por profissionais experientes e altamente qualificados, o que lhes dará acesso a conhecimento e a uma rede de contatos de especialistas.\n\nNeste meetup presencial o que vai rolar:\n\\- Apresentação sobre OWASP\n\\- Como o capítulo OWASP Natal funciona?\n**\\- Pentesting 101**\n\n*\nVocê já imaginou ser pago para hackear empresas e descobrir suas vulnerabilidades? Descubra como se tornar um Pentester de sucesso e\ndesvendar os segredos do mundo da cibersegurança! Não perca a chance de aprender na prática com este resumo empolgante.\n\n**\\- Mesa redonda: Carreira em Segurança da Informação**\n\nDestinada especialmente aos alunos do IMD interessados neste campo em expansão, mas também aberto a todo publico. Contaremos com a presença de especialistas da Conviso, Unicred e TV Globo, prontos para compartilhar suas experiências e responder às suas dúvidas.\n\nRepresentantes da Conviso, empresa líder em consultoria de segurança, discutirão tendências emergentes e habilidades necessárias na área de segurança da informação. Da Unicred, teremos profissionais destacando a importância deste campo no setor bancário e dando dicas de como prosperar nesse segmento. A TV Globo trará sua perspectiva sobre os desafios de manter a segurança da informação em um ambiente de mídia e a sua relevância no entretenimento.\n\nO evento iniciará com breves apresentações dos palestrantes, seguidas de uma discussão aberta para perguntas e interação com os especialistas. Concluiremos com uma sessão de networking, propiciando a conexão entre os participantes e os palestrantes. Esta é uma oportunidade imperdível para quem deseja direcionar sua carreira em segurança da informação.\n\nPalestrantes:\n**Kadson Breno -** Especialista em Segurança da Informação na Unicred do Brasil(UBR)\n**Kali Nathalie -** Analista de segurança da informação na Conviso\n**Matheus Cezar** \\- Analista de segurança da informação na Conviso\n**Fernando Guisso** \\- AppSec Engineer na TV Globo\n\n**Local:** Av. Cap. Mor Gouveia, 3000 - Lagoa Nova, Natal - RN, 59078-970\n**Sala**: B206\n\n**Evento Gratutito**\nInscrições para ter o Certificado de participação: https://meetup.grupyrn.org/2-meetup-owasp-2023"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "OWASP, ISACA, and ISC2: Web Application Firewalls webinar",
        "date": "2023-06-07",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/293379819",
        "timezone": "Europe/Amsterdam",
        "description": "**Want to learn more about Web Application Firewalls?**\n\n**Join the Dutch Chapters of OWASP, ISACA, and ISC2 for their first-ever combined online webinar on Wednesday, June 7th, from 19:00 to 21:00 CET.**\n\nProgram:\n19:00 - 19:10 - **Welcome**\n19:10 - 19:30 - **Web Application Firewalls** by **Aatif Khan**\n19:30 - 20:55 – **Panel Discussion on Web Application Firewalls** by **Aatif Khan**, **Menno Swam** and **Nico van Rooyen** moderated by **Ramzy Elmasry**\n20:55 - 21:00 – **Closing** and **Next Steps**\n\n*To receive the LIVE stream details, register via:*\n\n[https://isaca.nl/events/isaca-owasp-and-isc2-web-application-firewalls-webinar/](https://isaca.nl/events/isaca-owasp-and-isc2-web-application-firewalls-webinar/)\n\n***Here is a summary of the event:***\n\nWith an expert presentation and a panel discussion, you will have the opportunity to learn about best practices and get your questions answered by professionals in the field.\n\nBy combining the focus areas and driving forces of each Chapter, this event ensures that this topic will be addressed from different perspectives, such as risk, compliance, audit, cybersecurity, and technical.\n\nAatif Khan, a data-driven AI and cybersecurity expert, will kick off the webinar with a compact presentation on Web Application Firewalls (WAFs). After which, we will open the panel discussion and answer questions from the audience. Our panel members are Aatif Khan, Menno Swam and Nico van Rooyen.\n\nSee below for more information on our panel members and the topic.\n\nRegister today for this unique opportunity!\n\n**BIO Aatif Khan**\nAatif Khan is a data-driven, seasoned AI & cyber security expert who is passionate about creating Aatif Khan is a data-driven, seasoned AI & cyber security expert who is passionate about creating customer-focused products. His focus centers around developing cyber defense strategies, establishing security operations centers for large enterprises, developing data protection strategies, implementing data privacy in day-to-day operations, and developing AI strategy, governance, and risk management programs for enterprises. He specializes in building and scaling security programmes from startups to Fortune 500 organizations.\n\nWith 15+ years of experience in information security, Aatif has spoken at numerous conferences such as BlackHat, SANS & UK NCSC CyberThreat London, Security BSides London, Cyber Security Asia Malaysia, @Hack, etc., amongst other conferences across the EMEA region. He has been interviewed by the Associated Press, Voice of America, Hakin9, and numerous other media channels for his expertise on emerging cybersecurity threats. Aatif holds a Master of Science in Artificial Intelligence from LJMU, UK, and is currently working on AI-driven advanced threat detection and response with modern security analytics.\n\n**BIO Menno Swam**\nMenno is a Senior Specialist at KPMG IT Advisory The Netherlands, and part of the Cyber Assessment (CA) team. The CA team consists of cyber security specialists executing technical IT Advisory engagements, IT Auditing and management of IT infrastructure, IT processes and IT organizations.\n\nMenno has experience in the field of Information Security and Risk Management for companies in the Financial services sector, due to his experience as an Information Security Officer and Internal Auditor. Moreover, he has specific knowledge of security frameworks (such as PCI-DSS and ISO27001) as well as the technical execution of financial law (such as WWFT and PSD2). While working in complex IT environments, Menno has been able to get accustomed with all facets of information security, both technical and non-technical. As such, he is able to translate technical findings and risks to business impact and opportunities.\n\n**BIO Nico van Rooyen**\nNico is currently the CISO at CPro, a cyber security consulting firm and the one-stop shop for specialized cyber security services. They offer complete solutions that enable organizations of all sizes to protect their systems, networks, and data from digital threats. He is also a proud Executive Board Member of the ISACA NL chapter and has been an active member for many years.\n\nHe started his career as an IT auditor specializing in information security, at KPMG in South Africa and for the past decade, he has deepened his experience in information security while obtaining various certifications such as CISA, CISM, CEH, and COBIT.\nDuring this time, Nico worked across various countries including Australia, Denmark, Israel, Sweden, Europe, the UK, and the USA.\n\nIn 2017, he moved to the Netherlands with his wife, who is expecting their second baby boy in September of this year."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "May 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-05-25",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/292932837",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Exact\n**Address:** Molengraaffsingel 33, 2629 JD Delft\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **AppSec in IT contracts** by **Sebastian Avarvarei**\n20:00 - 20:15- **Break with drinks**\n20:15 - 21:00 - **About containers and their escapes: understanding escape patterns and possibilities** by **Mauricio Cano**\n\n**AppSec in IT contracts**\n*Abstract:*\nBack in 2018 I wrote: “In today’s multi-sourced enterprise, your security is as good as your worst written contract.” We have gotten better at writing security into commercial contracts since I first did my talk on this topic, but the yellow brick road ahead of us still goes some ways.\n\nBut how about AppSec, how well is it covered in our IT contracts? What are the pitfalls and the solutions? How do we avoid that someone else’s security issues become our security problems? And, by all means, let’s learn how to be a bit lazy, and do better with less effort!\n*Bio:*\nCurrently working as Information Security Manager at Canon EMEA, Sebastian has been in IT and Security for over 20 years, covering a multitude of roles ranging from Developer, Security Architect, Auditor and Consultant, before moving into security governance and management, giving him a unique multi-faceted view on today’s InfoSec challenges. He has led multiple security improvement programs and performed maturity assessments for a wide variety of organizations - while continuously asking himself:\"Could we do this in another way?\"\n\n**About containers and their escapes: understanding escape patterns and possibilities**\n*Abstract:*\nContainers have become one of the most common underlying infrastructure for microservice architectures. As such, they can often be part of the external attack surface of enterprise systems and applications (e.g., whenever a web application hosted on a kubernetes cluster is Internet-facing). Thus, it is important to understand what types of (mis)configurations can make containers more vulnerable against attacks of different types. In this talk, Mauricio will deep dive into different techniques that can be used to escape containers. In particular, he will talk about how to escape privileged containers, the usage of different capabilities, the usage of kernel exploits and a few other ways in which attackers may use to gain access to the hosts of the containers.\n*Bio:*\nMauricio Cano is a cloud pentester focused on container technologies. In particular, he focuses on the security of containers and serverless architectures. He has pentested Kubernetes clusters and serverless architectures for several multinational financial institutions. Prior to his security work, he has a background in academia and a Ph.D. in Computer Science from the University of Groningen, focused on programming language design and formal methods to ensure correctness. In his spare time, Cano enjoys reading, cooking, and solving puzzles."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Chapter Meeting",
        "date": "2023-05-31",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/292726402",
        "timezone": "America/New_York",
        "description": "This is an In-Person Event\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nSpeaker 1: **Kevin Johnson**\n\nKevin Johnson is the Chief Executive Officer of Secure Ideas. Kevin has a long history in the IT field including system administration, network architecture and application development. He has been involved in building incident response and forensic teams, architecting security solutions for large enterprises and penetration testing everything from government agencies to Fortune 100 companies. In addition, Kevin is a faculty member at IANS and was an instructor and author for the SANS Institute.\n\nTopic: **Replacements: What Malcolm Gladwell and Keanu Reeves can teach AppSec**. A reflection of how appsec is focused in the wrong place and how we can improve it. The talk includes stories and tangents based on Kevin's work and consulting.\n\nSpeaker 2: TBD\n\nTopic TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-05-24",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/293567769",
        "timezone": "Europe/London",
        "description": "Thirsty Wednesday! (Rules are made to be broken - usually Thursdays).\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "AppSecDays PNW ",
        "date": "2023-06-10",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/292707041",
        "timezone": "America/Los_Angeles",
        "description": "Joins us for a conference in person in Portland Oregon June 10th (tickets required)\n\n[https://www.appsecpnw.org/](https://www.appsecpnw.org/)\n\nTickets [https://www.eventbrite.com/e/3rd-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-558186820807](https://www.eventbrite.com/e/3rd-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-558186820807)"
    },
    {
        "group": "Riyadh",
        "repo": "www-chapter-riyadh",
        "name": "Navigating Security Risks in Cloud Computing?",
        "date": "2023-05-24",
        "time": "1:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/293507584",
        "timezone": "Asia/Riyadh",
        "description": "**Cloudy with a Chance of Penetration: Navigating Security Risks in Cloud Computing?**\n\n**Target audience:**\nIT professionals and cybersecurity experts responsible for securing cloud-based systems and data\n\n**Objective:**\nto provide a comprehensive overview of strategies for conducting penetration testing, mitigating cloud computing security risks ,and minimizing the likelihood of cyber attacks and data breaches\n\n**Topics covered:**\n\n* The current state of cloud computing security\n* Common risks and threats inherent in cloud-based systems\n* A practical guide to penetration testing in the cloud\n* Methods for reducing risk and minimizing the likelihood of data breaches\n\n**Key takeaways:**\n\n* A solid foundation in cloud computing security best practices\n* An understanding of the risks and vulnerabilities that must be addressed to achieve secure cloud computing\n* Practical strategies for mitigating risk and conducting effective penetration testing\n* An overview of the tools and techniques used to secure cloud-based assets\n\nAbrar, is a cybersecurity consultant specializing in cloud security with a focus on compliance regulations applicable to the Saudi Arabian market. He works closely with organizations to help them navigate complex regulatory requirements and safeguard themselves from cyber threats, both in the cloud and on-premise environments.\nHe helps organizations implement effective cloud security strategies to protect their data, networks, and applications from security breaches and cyberattacks. He conducts comprehensive penetration testing with a focus on cloud security, identifies potential vulnerabilities, and proposes remediation measures. Furthermore, he assists organizations in implementing multi-layered security to ensure their data privacy and availability and maintain regulatory compliance.\nTo effectively monitor cloud environments, he offers Security Operations Center (SOC) implementation to identify and respond to security issues in real-time. He also provides Digital Forensics and Incident Response (DFIR) services to ensure quick and efficient resolution of cyber-security incidents to minimize impact. He is committed to ensuring organizations are secure and compliant with the relevant regulations, which extends to assisting organizations in obtaining ISO 27001 certification, the standard Information Security Management System (ISMS), NCA ECC, and NDMO.\nBy working closely with organizations, he can help achieve a robust cloud security posture that meets both regulatory requirements and industry best practices."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec/OWASP-SLC - May Meetup (in person @ Murray Park - Pavilion #4)",
        "date": "2023-05-23",
        "time": "2:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/293627244",
        "timezone": "America/Denver",
        "description": "**Agenda:**\n\n1. Lunch\n2. Discussion on book: \"[Project Zero Trust](https://www.goodreads.com/book/show/62061375-project-zero-trust)\"\n\nPlease RSVP if you're coming! We'd like to make sure you get some lunch for meeting in person :)\n\nSee you all then!\n[ADDRESS]\nMurray Park Pavilion #4, Murray, UT 84107\nhttps://goo.gl/maps/6fLMjzZmpRftk9G79?coh=178573&entry=tt"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838145",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838144",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "OWASP AppSec Days PNW 2023",
        "date": "2023-06-10",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292199099",
        "timezone": "America/Los_Angeles",
        "description": "A collaboration between the **Vancouver, Portland, Victoria, and Seattle** chapters taking place **June 10, 2023** at **Portland Center Stage.**\n\nThe CFP for AppSec PNW is OPEN and you have until April 3rd to submit a presentation. You don't want to miss on this opportunity to speak, submit your CFPs soon!\nhttps://bit.ly/AppSecPNW2023CFP\n\nGet your tickets now for the event, there are only a few available spots in the Early Bird registration:\nhttps://bit.ly/AppSecPNW2023Tickets"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - June 2023",
        "date": "2023-06-13",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/293587091",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "Injection Vulnerabilities",
        "date": "2023-05-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291863605",
        "timezone": "Europe/London",
        "description": "Injection vulnerabilities remain a common problem today. A single mistake could expose your whole database and customer data or give an attacker the ability to remotely execute code on your server.\n\nWe will look at some examples of coding mistakes that can lead to injection vulnerabilities and discuss how they could be mitigated.\n\nThis is a joint event provided by OWASP Bristol and OWASP Suffolk.\n\nAgenda:\n\n* OWASP updates\n* Injection Vulnerabilities talk\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter Q2 CTF/Lunch Event 2023",
        "date": "2023-06-02",
        "time": "1:30-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/293320858",
        "timezone": "America/New_York",
        "description": "CMD+CTRL Web Application Cyber Range by Security Innovation (https://www.securityinnovation.com/)\n\nREGISTER TODAY:\nhttps://www.eventbrite.com/e/owasp-tampa-chapter-q2-ctflunch-event-2023-tickets-628632184787\n\nWant to test your skills in identifying web app vulnerabilities? Join OWASP Tampa and Security Innovation as members compete in CMD+CTRL, a web application cyber range where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense is all about thinking on your feet.\n\nFor each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard for a chance to win fantastic prizes! CMD+CTRL is ideal for development teams to train and develop skills, but anyone involved in keeping your organization’s data secure can play - from developers and managers and even CISOs.\n\nLunch and \"afternoon snacks while you hack\" sponsored by Bayside Solutions, Inc. (BSI) (https://bsius.com/)\n\nVenue location is sponsored by Deepwatch (https://www.deepwatch.com/)"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #22: Cloud Security & CyberSec Ecosystem [IN-PERSON]",
        "date": "2023-06-08",
        "time": "8:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/293548265",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\n\nTheme sessions - Theme: CyberSec Ecosystem & Cloud Security\n\n`Schedule` **`Time:`**` 18:00 to 21:00`\n\nIntroduction, OWASP News & Updates - Catalin Curelaru\nCyberSecurity Ecosystem - Octavian STANCU (Atos)\nSecurity Log Management - Adrian PAUL (Visma)\nImproving security in AWS Cognito - Lucian Patian (Haufe)\n\nLocation of the event: UBC3, et 10, Sediu VISMA, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by VISMA"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP x Project Calico x Okta | Container and Kubernetes security policy design",
        "date": "2023-06-15",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/293475436",
        "timezone": "America/Toronto",
        "description": "\\*\\*\\* THIS TALK IS BOTH ONLINE (https://www.youtube.com/watch?v=eMSnga3arIA) and OFFLINE @ the Okta offices \\*\\*\\*\n\n**TALK**\n\n**Container and Kubernetes security policy design: 10 critical best practices**\n\n**Summary:**\n\nCompanies are constantly seeking new and innovative ways to stay ahead in a highly competitive and rapidly changing business landscape. One strategy that has proven to be highly effective is application modernization. This is not just a mere upgrade; it is a complete transformation of how businesses operate. By embracing this approach, companies can accelerate innovation, optimize costs, and improve their overall security posture.\n\nHowever, embarking on the journey of application modernization is not an easy task. It requires a significant investment in people, processes, and technology to achieve the desired business outcomes. The right foundation must be established from the beginning to avoid the high cost of re-architecture, which can be a major roadblock in achieving success. One crucial aspect is developing a standard and scalable security design for their Kubernetes environment. This will establish the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\nIn conclusion, application modernization is a strategic initiative that can transform businesses. Developing a standard and scalable security design for the Kubernetes environment is critical to establishing the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\n**Presenter:**\n\n**Regis Martins**\n\nRegis Martins is a passionate problem solver and technologist with a deep-rooted love for finding innovative solutions. With a background in Electrical Engineering and a Master's Degree in Computer Science, he has honed his expertise in areas such as deep packet inspection technologies, traffic management, network analytics, and Kubernetes. His journey has led him to excel as a Sales Engineer, where he architects solutions, educates clients, and thrives in helping organizations overcome challenges. With a diverse skill set encompassing Python, Linux, virtualization, cloud computing, and more, Regis is committed to making a positive impact in the world of technology through continuous innovation and knowledge sharing."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "How to Identify Threat Modeling Limitations ",
        "date": "2023-05-25",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/293199573",
        "timezone": "America/New_York",
        "description": "Many cyber and application security tools love to say they can do everything needed to protect your assets. It isn’t rocket science to know that’s not true. It’s helpful to consider the limitations of tools and processes. This presentation will take attendees through how to define the limitations of threat modeling correctly, understand best practices in how, when, and by whom a proper threat model should be performed, and how this process of identifying threat model limitations can help users better understand its utility to systems and processes."
    },
    {
        "group": "Security Integration System",
        "repo": "www-project-security-integration-system",
        "name": "Navigating Security Risks in Cloud Computing?",
        "date": "2023-05-24",
        "time": "1:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/293507584",
        "timezone": "Asia/Riyadh",
        "description": "**Cloudy with a Chance of Penetration: Navigating Security Risks in Cloud Computing?**\n\n**Target audience:**\nIT professionals and cybersecurity experts responsible for securing cloud-based systems and data\n\n**Objective:**\nto provide a comprehensive overview of strategies for conducting penetration testing, mitigating cloud computing security risks ,and minimizing the likelihood of cyber attacks and data breaches\n\n**Topics covered:**\n\n* The current state of cloud computing security\n* Common risks and threats inherent in cloud-based systems\n* A practical guide to penetration testing in the cloud\n* Methods for reducing risk and minimizing the likelihood of data breaches\n\n**Key takeaways:**\n\n* A solid foundation in cloud computing security best practices\n* An understanding of the risks and vulnerabilities that must be addressed to achieve secure cloud computing\n* Practical strategies for mitigating risk and conducting effective penetration testing\n* An overview of the tools and techniques used to secure cloud-based assets\n\nAbrar, is a cybersecurity consultant specializing in cloud security with a focus on compliance regulations applicable to the Saudi Arabian market. He works closely with organizations to help them navigate complex regulatory requirements and safeguard themselves from cyber threats, both in the cloud and on-premise environments.\nHe helps organizations implement effective cloud security strategies to protect their data, networks, and applications from security breaches and cyberattacks. He conducts comprehensive penetration testing with a focus on cloud security, identifies potential vulnerabilities, and proposes remediation measures. Furthermore, he assists organizations in implementing multi-layered security to ensure their data privacy and availability and maintain regulatory compliance.\nTo effectively monitor cloud environments, he offers Security Operations Center (SOC) implementation to identify and respond to security issues in real-time. He also provides Digital Forensics and Incident Response (DFIR) services to ensure quick and efficient resolution of cyber-security incidents to minimize impact. He is committed to ensuring organizations are secure and compliant with the relevant regulations, which extends to assisting organizations in obtaining ISO 27001 certification, the standard Information Security Management System (ISMS), NCA ECC, and NDMO.\nBy working closely with organizations, he can help achieve a robust cloud security posture that meets both regulatory requirements and industry best practices."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "German OWASP Day 2023 in Frankfurt: Ebbelwoi meets AppSec!",
        "date": "2023-05-30",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/293534722",
        "timezone": "Europe/Berlin",
        "description": "Hi all,\nWe're thrilled to announce the return of the German OWASP Day 2023! This leading independent and non-commercial conference on application security in Germany will take place on the 30th and 31st of May, 2023 at the Frankfurt School of Finance and Management.\n\n_What's happening? We look forward to welcoming you to our German OWASP Day 2023, offering a plethora of exciting technical and non-technical talks, various seminars, and an evening event for networking.\n\n_What's on the agenda? Our main program has been released, featuring a range of talks from esteemed experts like Björn Kimminich, Claudia Ully, Clemens Hübner, Diana Waithanji, and many more.\n\n_When? Our event takes place on the 30th and 31st of May, 2023.\n\n_Where? Frankfurt School of Finance and Management, Adickesallee 32-34, 60322 Frankfurt am Main\n\n_Tickets? Limited tickets are available at [https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477](https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477)\n\n_Additional Information? More information about the German OWASP Day, training sessions, and the conference program can be found at god.owasp.de/2023/\n\n_And now? Save the date, spread the word, and bring your friends and colleagues to our event.\n\n_Follow Us! Also, follow us on Twitter #owasp_de and #owasp_frankfurt and refer to our German OWASP Day site for information including slides and recordings of previous presentations.\n\nWe're looking forward to seeing you at this exciting event of the year!"
    }
]