[
    {
        "group": "Ahmedabad",
        "repo": "www-chapter-ahmedabad",
        "name": "OWASP | Ahmedabad Monthly Meet-Up",
        "date": "2023-07-08",
        "time": "1:00+05:30",
        "link": "https://www.meetup.com/owasp-ahmedabad-chapter/events/294429221",
        "timezone": "Asia/Kolkata",
        "description": "11:00 am - 11:45 am -Project Yantra Vishleshan by Vismit Rakhecha(Druk)\n11:45 am - 12:15 PM - Deserialization 101\n(Java/PHP edition) by Marvik\n12:15pm - 12:30 pm - Network Break\n12:30 pm - 1:00 pm - Blockchain 101 by Parth\n1:00 pm - 1:30 pm - Unleashing the Power of SSRF by Vaidik"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - July 2023 (Online)",
        "date": "2023-07-25",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705755",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- Coming Soon\\!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 15 July 2023 ",
        "date": "2023-07-15",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/294426792",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 15 July 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* TBD\n* TBD\n*"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- API Security Workshop with OWASP crAPI (hands-on)",
        "date": "2023-07-27",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/294625016",
        "timezone": "America/Los_Angeles",
        "description": "We are happy to announce a Hacker days on API security on 27th July.\nFood and awesome courtesy of our host Traceable.\n\n**Abstract**:\nIn today's rapidly digitalizing world, Application Programming Interfaces (APIs) are the backbone\nof communication in the vast landscape of web services, cloud applications, and microservices.\nWith this increased usage comes the inevitable rise of security threats targeting APIs. This\nworkshop aims to arm participants with practical knowledge and hands-on experience to secure\nAPIs effectively.\nIn this workshop, we will be using OWASP crAPI (completely ridiculous API), a purposely\ninsecure API, to demonstrate common API vulnerabilities and their mitigations. We will discuss\nthe 'Shift Left' approach in API security, emphasizing the importance of integrating security\nmeasures early in the development lifecycle. Participants will learn to identify, exploit, and\nsecure API vulnerabilities, equipping them with the necessary skills to build more secure\napplications\n\n**Presenter Bio:**\n1\\. Jayesh Ahire is the Product Manager at TraceableAI where he works on the Company’s\nAPI Security initiative. He is the maintainer of OWASP crAPI, Hypertrace, and many\nother notable OSS Projects. He is AWS ML Hero, Twilio champion, and runs API\nSecurity Global Community. He also runs AWS UG, Elastic UG, TensorFlow UG, and\nmany other communities in US and India. His research interest involved Distributed\nneural computers and Defi. In his free time, he likes to read and these days he is\nlearning to play the piano.\nLinkedin: https://www.linkedin.com/in/jayesh-ahire/\n\n**Requirements**:\n1\\. Active Participation: The workshop will be highly interactive\\. Questions\\, comments\\, and\nsharing of experiences are strongly encouraged.\n2\\. Laptop: As this is an in\\-person workshop\\, please bring along your laptop with any API\ntesting tool installed.\n3\\. Pre\\-workshop Material: On confirmation of your attendance\\, you will receive some\npre-workshop reading materials. We recommend reviewing these before the event to\nmaximize your learning experience."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "July Meetup",
        "date": "2023-07-19",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/294624958",
        "timezone": "America/Los_Angeles",
        "description": "This is a place holder for July meetup. We are looking for speakers. Please message or email us at kvprashant at owasp.org"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Every action on every device tells a story",
        "date": "2023-07-25",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/294588372",
        "timezone": "Australia/Brisbane",
        "description": "Let's talk about leveraging the power of device and behavioural user data to create trust and maintain ease of access at the same time. This is becoming more and more common with giants like Google and Microsoft who are taking the lead to add it into their services while smaller players are falling behind due to a lack of resources to invest in it. In this presentation, I mainly focus on modern methods of fake account detection and account takeover protection as key areas that almost every service is dealing with these days.\n\nEvent location to be confirmed. (soon)"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Top 10 V2021 Awareness - A6 - A10",
        "date": "2023-07-15",
        "time": "2:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/292302183",
        "timezone": "Africa/Cairo",
        "description": "OWASP Top 10 Awareness Program\n\nThe OWASP Top 10 is a powerful awareness document for web application security. It represents a broad consensus about the most critical security risks to web applications.\n\nThe second day of the awareness program includes three sessions covering the risks from 6 to 10 of OWASP top 10 risks and Mitigations,\n\nLocation: Online Event, we will have a live streaming for the event through chapter Youtube channel:\nhttps://www.youtube.com/channel/UCOmffRRYZSpYOiJQp15NHQA\n\nDate: 18 Feb 2023\n\nAgenda:\n\n1- A06:2021-Vulnerable and Outdated Components\n2- A07:2021-Identification and Authentication Failures\n3- A08:2021-Software and Data Integrity Failures\n4- A09:2021-Security Logging and Monitoring Failures\n5- A10:2021-Server-Side Request Forgery"
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "Operation Poppins: An immersive Interactive case study driven approach",
        "date": "2023-07-06",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-cambridge-meetup/events/294546302",
        "timezone": "Europe/London",
        "description": "Hosted by the Cyber Security & Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, & BCS Cybercrime Forensics SG/BCS Women & BCS Hampshire/Dorset branches\n\n**Background**\n\nThe BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.\n\nOWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organisation focused on improving the security of application software. Their mission is to make application security visible, so that people and organisations can make informed decisions about true application security risks.\n\nThe **Cyber Security and Networking** (**CSN**) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP & the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment.\n\n**Abstract : “Operation Poppins: An immersive Interactive case study driven approach\"**\n\nLike a lot of recent teaching developments, the pandemic and lockdowns forced us to re-evaluate how to deliver engaging remote content. Together with limited staffing resources there was an urgent operational requirement for case study driven teaching which kept a high level of interactive student engagement in a remote setting.\n\nThe success of the resources trialled during this period led to the development of an outreach course which successfully trialled a whodoneit style of immersive investigation throughout the entire module. The result included animated character videos, interactive online and in person exercises for each activity area, and a virtual crime scene for additional reflection and learning. By the end of the module the students had solved their first mini digital forensics case. The technique has proven so successful in outreach trials it has now been developed into a full module for postgraduate students.\n\nThis talk will briefly describe the development journey, the resulting module, and look at results from trials to date.\n\n**Provisional Agenda**\n\n16:45 - Webinar waiting lobby opens\n17:00 - Start of Presentation\n17:45 – Questions & Answers\n18:00 – Estimated Finish"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "And we're back!",
        "date": "2023-07-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/294216909",
        "timezone": "America/New_York",
        "description": "We are BACK folks. Been .. a minute. But we have a great meeting coming together. Jeff Williams is our speaker, and Black Hills Security will be providing the snac. Here's what Jeff will be covering:\n\nAfter over 20 years, achieving app and API security still requires Herculean effort by smart and dedicated people. Fortunately, we can look to history and see a path forward. In the mid-2000s we changed the curve on kernel exploits by adding ASLR and DEP to operating systems. Imagine hardening your web app and web API stacks against all the major classes of vulnerability. You could instantly notify developers if they introduce a vulnerability and you could stop vulnerable software from being exploited. How would it change your appsec program if you could dramatically reduce the risk of all the common classes of vulnerability? In this talk, we’ll explain how runtime protection works and how you can streamline vulnerability management and ensure your software doesn’t get exploited… at the same time."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP July Meet - In person",
        "date": "2023-07-20",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/294141225",
        "timezone": "America/Chicago",
        "description": "OWASP Dallas is ready to host in-person meets.\n\n\"The Monsters in Your Software Supply Chain that SCA Can't Find\"\n\nThere are excellent SCA tools and excellent SSDLs out there, so why did the 3cx breach feel so much like GroundHog Day? This talk will discuss root cause, attack vectors, adversaries, and countermeasures for Software Supply Chain Security attacks."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP JULY Meetup - Join Us!",
        "date": "2023-07-26",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/294482375",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us July 26 for food, drinks, networking and an exciting and timely presentation on \"Introduction to the OWASP API Security Top 10 2023\" from one of the best and brightest in the industry: Alan Shen. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to our Denver OWASP sponsor [SpyderSec](https://spydersec.com)**\n\n**Presentation Title:** Introduction to the OWASP API Security Top 10 2023\n\n**Presentation Details:** Application Programming Interfaces (APIs) are the glue that allows independently evolving systems to communicate with each other, and are an important focus for security investment due to their privileged access to sensitive data and functionality. Recently, the OWASP API Top 10 has been updated for 2023, so join us as we introduce the OWASP API Security Project. We'll cover what's new in the 2023 API Top 10, as well as compare the differences with the previous 2019 version. For those interested in hands-on practice, we'll also briefly introduce the OWASP crAPI (completely ridiculous API) Project which demonstrates common API vulnerabilities."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "From Manual to Machine: Evolution of Security Automation (SOAR) in SOC",
        "date": "2023-07-20",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/294576663",
        "timezone": "Asia/Dubai",
        "description": "**The focus of a security automation strategy is on implementing automated tools and processes to enhance the effectiveness and efficiency of an organization's security operations.**\n**The strategy covers several key steps, including identifying security risks and vulnerabilities, evaluating current security operations, setting clear automation goals, selecting the appropriate tools, implementing and testing them, continuously monitoring and improving, training the team, and ensuring compliance with regulations. With security automation, organizations have seen benefits such as improved efficiency and scalability, faster threat detection and response, cost savings, and better decision-making**"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #61 ",
        "date": "2023-07-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291813603",
        "timezone": "Europe/Berlin",
        "description": "Hi all, after the [German OWASP Day 2023](https://god.owasp.de/2023/) we want to dive into our regular OWASP Frankfurt Chapter meetings again. We are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within AppSec & Cyber Security. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **NVISO.**\n\n_What are we going to talk about?\nTo be announced!\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **NVISO**.\n\n_When?\nOur Meetup takes place on the last Wednesday before the summer break in July, namely on 19.07.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nNVISO GmbH, Holzgraben 5, 60313 Frankfurt\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "[on-prem] Rust: Eine moderne Alternative zu C und C++ ",
        "date": "2023-07-06",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/294347212",
        "timezone": "Europe/Berlin",
        "description": "Moin / Hi,\n\nnext talk will be in German.\n\nWir haben in zwei Wochen einen interessanten Vortrag von Damian Poddebniak zur gehypten Programmiersprache Rust. Dem können wir uns natürlich nicht verschließen ;-) und freuen uns auf die Einsichten von Damian!\n\nWir sind zu Gast bei Check24 am Anfang der Außenalster (Nähe Hotel Atlantic) In Fußmarschentfernung vom Hauptbahnhof.\n\nAus planungstechnischen Gründen (Verpflegung) unseres Hosts sag mir bitte per Mail oder hier bei Meetup Bescheid, wenn du dazustoßen möchtest.\n\nGeplant ist, den Vortrag auch zu streamen. In dem Fall bitte NICHT auf \"RSVP: ja\" drücken, da das sonst die Planung unseres Gastgebers durcheinander bringt (Stream-URL: https://lecture.senfcall.de/dir-o5v-cka-yx7)\n\n**TL;DR**\n===\n\nTitel: \"[on-prem] Rust: Eine moderne Alternative zu C und C++ \"\nSprecher: Damian Poddebniak\nLokation: Check24, An der Alster 64, 20099 Hamburg\nStart: 6.7.2023, 18:30 Uhr, Einlass ab 18 Uhr\nNetworking danach: TBD\n\n**Abstract**\n===\n\nC und C++ haben sich durch ihre hohe Leistung und Kontrolle über Hardware als wichtigste systemnahe Programmiersprachen etabliert. Allerdings sind sie auch bekannt für ihre subtil schwierige Anwendung und die damit verbundenen Sicherheitslücken.\n\nRust tritt hier als vielversprechende Alternative auf: Es bietet die gleichen Vorteile in Bezug auf Leistung und Kontrolle, bringt jedoch auch Speichersicherheit und Threadsicherheit mit. Zudem löst es weitere gesamte Klassen an Fehlern wie z.B. NULL-Pointer-Dereferenzierung auf.\n\nRust ist bereits jetzt fester Bestandteil des Linux- und Windows-Kernels und wird für neue Komponenten in Android eingesetzt.\n\nDie Kombination aus Leistung, Sicherheit und nicht zuletzt einer tollen Community mit hohen sozialen Standards macht Rust zur Sprache der Wahl für moderne Programmierung.\n\nDer Vortrag gibt einen kurzen Überblick über die Programmiersprache Rust und soll zum Auszuprobieren anregen. Dazu gibt es einen größeren Live-Coding Anteil um zu zeigen wie die Arbeit mit Rust aussieht und welche Konzepte die Sprache so besonders machen.\n\n**Generelles zum OWASP-Stammtisch**\n===\n\nBei unseren offenen Treffen geht es um Software und deren Sicherheit im Internet und/oder IT-Security allgemein. Es treffen sich Leute, die sich beruflich oder privat damit auseinandersetzen: Entwickler, Manager, \"Pentester\" und alle an (Web)sicherheit interessierte. Die Atmosphäre ist offen und locker. Uns geht's um den Erfahrungsaustausch, Technikschnack und ums Netzwerken. Wer Produkte oder Dienstleistungen verkaufen will, ist hier falsch. Ihr seid herzlich willkommen Kollegen oder Bekannte den Hinweis auf unser Treffen weiterzuleiten. Alle Treffen sind frei, für jeden offen und kostenlos.\n\nSchönen Gruß, Björn / Dirk"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-07-10",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/294138407",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kathmandu",
        "repo": "www-chapter-kathmandu",
        "name": "OWASP Kathmandu Meetup - 0x04",
        "date": "2023-07-08",
        "time": "0:30+05:45",
        "link": "https://www.meetup.com/owasp-kathmandu-chapter/events/294300182",
        "timezone": "Asia/Kathmandu",
        "description": "The 0x04 Meetup for OWASP Kathmandu is ecstatically set to take place on the 8th of July, 2023. We are deeply honored to have the illustrious TechKraft Inc. as our esteemed sponsor & the 0x04 CTF has been sponsored by Plerion.\n\nTalks will encompass a diverse range of topics including Organizational Cybersecurity, Bug Bounties, Network Security, Compliance, and much more. Please note that this time we have implemented a strict RSVP policy, so ensure to confirm your attendance in advance."
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "OWASP Community Day",
        "date": "2023-07-22",
        "time": "0:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/294165322",
        "timezone": "Asia/Karachi",
        "description": "**OWASP Community Day Lahore**\n\nJoin us for the highly anticipated OWASP (Open Web Application Security Project) Community Day in Lahore! This event is a gathering of cybersecurity enthusiasts, professionals, students, and experts who are passionate about web application security and its importance in today's digital landscape.\n\nDuring this day-long event, you will have the opportunity to engage with like-minded individuals, learn from industry leaders, and expand your knowledge in the field of web application security. The OWASP Community Day Lahore aims to promote collaboration, knowledge sharing, and awareness of the latest trends and best practices in securing web applications.\n\n_**Highlights of the OWASP Community Day Lahore:_**\n\n1. Expert Talks: Listen to renowned cybersecurity experts and thought leaders as they share their insights and experiences in web application security. Gain valuable knowledge about emerging threats, vulnerabilities, and effective countermeasures.\n\n2. Hands-on Workshops: Participate in interactive workshops conducted by industry professionals where you can enhance your practical skills in areas such as secure coding, penetration testing, threat modeling, and secure software development.\n\n3. Networking Opportunities: Connect with fellow cybersecurity enthusiasts, professionals, and students in a collaborative and engaging environment. Expand your professional network, share ideas, and forge valuable connections with individuals who share your passion for web application security.\n\n4. Capture The Flag (CTF) Challenges: Test your skills and compete in exciting Capture The Flag challenges designed to simulate real-world scenarios. Solve security puzzles, find vulnerabilities, and demonstrate your expertise to win attractive prizes.\n\n5. Lightning Talks and Demos: Engage in quick-paced lightning talks and live demonstrations, where participants showcase innovative tools, techniques, and research findings related to web application security. Discover new solutions and gain inspiration from cutting-edge projects.\n\n6. Community Projects and Initiatives: Learn about ongoing OWASP projects and initiatives, and find out how you can contribute to the community. Explore opportunities to collaborate on open-source security tools, research papers, and resources that benefit the broader cybersecurity ecosystem.\n\nDon't miss out on this incredible opportunity to be part of the OWASP Community Day Lahore! Mark your calendars and join us for a day filled with knowledge sharing, skill-building, and networking in the vibrant world of web application security. Together, let's make the web a safer place for everyone.\n\n**Note: Please stay tuned for updates on speakers, workshops, and additional event details on our official website and social media channels.**\n\nWe look forward to welcoming you to the OWASP Community Day Lahore!"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Limassol Meetup 2.0",
        "date": "2023-07-28",
        "time": "8:30+03:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/294232592",
        "timezone": "Asia/Nicosia",
        "description": "**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the second meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/)! We cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19:00 — 20:45 — Speaches TBA\n20:45 — 21:15 — Entertainment for all the attendees\n21:15 — 23:00 — Eat, drink, networking!\n\nWe are also currently looking for people to present at the meetup. If you have a great idea or research or would like to share your experience with the rest of the information security community, please submit a [Call for Papers (CFP)](https://forms.gle/FchXL2THqUFWHhhu9).\n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUL 26, 2023",
        "date": "2023-07-26",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/293419781",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Anatomy of a Breach: Dissecting Cloud Security\n\nJoin us for great networking, dinner and drinks, and see a presentation by John Heenan, Cloud Security Solutions Architect, Palo Alto Networks.\n\n**ABSTRACT**: Cloud security presents unique challenges. As enterprises continue to move to the cloud, security practitioners face new threats and paradigms. In this session, we’ll forensically reconstruct major cloud-centric breaches and step through them, building an understanding of what happened, how it happened, and developing key takeaways to help secure our own infrastructure, especially in AWS, Azure, and GCP.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP NZ - Auckland Meetup - July 2023",
        "date": "2023-07-11",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721004",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for July will be **A08:2021 - Software and Data Integrity Failures.**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Mobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-07-20",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/294045639",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in mobile AppSec vs. web AppSec and how to put OWASP MAS project, tools, and resources to work. In this session, we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources, and how to build your own toolkit. Along the way, we will hit the latest privacy and security updates with iOS and Android. The Web Rocks… but Mobile Rules - Come join us!"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Disinformation is the malware of a free society - Part 2",
        "date": "2023-07-27",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/294627454",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Speaker:** Brandon Soroudi, Visiting fellow at National Security Institute\n[https://nationalsecurity.gmu.edu/](https://nationalsecurity.gmu.edu/)\n\n**Topic:** Disinformation is the malware of a free society - Part 2\n**Abstract:**\nThe future of information security is not protecting networks or endpoints. A new and unique security condition has emerged that has no IOC’s or TTP’s. However, it is arguably the most dangerous of all emerging threats. If exploited, it can alter elections, destabilize governments, and bring a swift end to truth and the institutions that rely on truth. The future of information security is detecting and preventing the spread of “disinformation”.\n\nPart 1 of this series focused on the origins of “active measures” in the Cold War and the events leading up to January 6th 2021. Part 2 of this series, will focus on a new framework to map disinformation tactics and techniques, and the impact AI based chatbots and “deepfake” technology will have on the future of democracy.\n\nWithout trust, democracy has no future. Can the security community help to restore trust in information and save democracy for posterity?\n\n**Schedule:**\n6:00pm - 6:40pm Networking, Food & Drink\n6:40pm - 6:45pm Welcome and Introduction\n6:45pm - 7:45pm Presentation & Q&A\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-07-27",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/294627572",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro 011 [ONLINE]",
        "date": "2023-07-20",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/294421971",
        "timezone": "America/Sao_Paulo",
        "description": "Em julho teremos o nosso próximo encontro, será no dia 20/07 (quinta-feira), a partir das 19h30, online em nosso canal do YouTube.\n\n*Link para a transmissão:* [https://www.youtube.com/watch?v=-5EE217FhAk](https://www.youtube.com/watch?v=-5EE217FhAk)\n\n**Confira a agenda:**\n\n**19h30-20h30**\n***\"Shift-Left no SSDLC\"***\n*Desloque sua mente para a esquerda com a gente, serão abordadas iniciativas Shift-Left para detecção e correção de vulnerabilidades de forma antecipada, gerando uma maior eficiência na batalha contra as vulnerabilidades e uma redução de custos para sua empresa!*\n***Rodolfo Mariano*** *(Application Security Leader na Compass.UOL)*\n*Formado em Análise e Desenvolvimento de Sistemas\\, Pós\\-graduado em Inteligência Cibernética e Segurança Ofensiva OSCP \\| CEH \\| eWPTX \\| CRTP \\| eJPT \\| DCPT \\| SYCP \\| CWHI\\.*"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec/OWASP-SLC - July 14 Meetup (in person @ Balsam Campground - G-06)",
        "date": "2023-07-14",
        "time": "7:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/294483489",
        "timezone": "America/Denver",
        "description": "**Off-grid Meetup --**\n\n**Campout Location:** Balsam Campground, Hobble Creek Canyon, Group Site (g-06)\n[https://www.recreation.gov/camping/campgrounds/232225?tab=campsites ](https://www.recreation.gov/camping/campgrounds/232225?tab=campsites)\n\n**Date:**\nCheck-in at: July 14th 3-9 pm\nCheckout: July 15 by 12 pm\n\n**Food:**\nBYOF, we may get a sponsor for dinner depending on the number who RSVP (we will update the details here).\n\n**What we'll do:**\nCome hang out with other members of the OWASP-SLC/Wasatch AppSec group. Feel free to come for dinner, chat, Mt. Biking, hiking, fishing, CTF via Star-link, frisbee, camp, etc.\n\n**RSVP by July 8th**, to ensure enough Parking for cars."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-07-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/294356460",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Residential Proxies Unmasked: Navigating the Hidden Threat",
        "date": "2023-07-11",
        "time": "7:30+10:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/294359924",
        "timezone": "Australia/Sydney",
        "description": "Join us at the second OWASP Sydney event featuring a talk by [Adam Cassar](https://www.linkedin.com/in/adamcassarac/) from [Peakhour.io](http://peakhour.io/) who will delve into the world of residential proxies. In this talk, Adam will dive into residential proxies, tools that allow for requests from residential IP addresses. He'll clarify what these proxies are, who relies on them, and the possibilities they unlock. Additionally, he'll go over the process of how these large-scale proxy networks come to life.\n\nAdam will discuss the potential implications of these services on IP threat intelligence, the complications of carrier-grade NAT, and questions our reliance on geo-IP databases. He'll also shed light on how your internet use at home, school, or work might be effected by these services.\n\nFinally, Adam will touch on ongoing legal cases involving these services and reveal that some state actors are setting up their own proxy networks for data extraction purposes. The goal is to equip you with a comprehensive understanding of residential proxies, enabling you to make informed decisions within the field of internet security.\n\n**Here are the details of the event:**\n**Date:** July 11th 2023, 5:30pm\n**Venue**: Talenza, Level 3, Macquarie Place, Sydney\n\n**Schedule:**\n\n* 5.30 pm: Arrive, grab a drink, and meet your fellow attendees.\n* 6.00 pm: Residential Proxies Talk.\n* 6:30 pm: Q&A.\n* 7:00 pm: Networking.\n\n* 8:00 pm: Event ends\n\nRSVP now, and we'll see you there!\n\nBest regards,\nOWASP Sydney Chapter Committee"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver - July 2023",
        "date": "2023-07-20",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248508",
        "timezone": "America/Vancouver",
        "description": "OWASP Vancouver monthly meetup"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #61 ",
        "date": "2023-07-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291813603",
        "timezone": "Europe/Berlin",
        "description": "Hi all, after the [German OWASP Day 2023](https://god.owasp.de/2023/) we want to dive into our regular OWASP Frankfurt Chapter meetings again. We are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within AppSec & Cyber Security. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **NVISO.**\n\n_What are we going to talk about?\nTo be announced!\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **NVISO**.\n\n_When?\nOur Meetup takes place on the last Wednesday before the summer break in July, namely on 19.07.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nNVISO GmbH, Holzgraben 5, 60313 Frankfurt\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]