[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - June",
        "date": "2024-06-25",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460542",
        "timezone": "Europe/Copenhagen",
        "description": "**IMPORTANT:**\n\n* **You need to reverse into the parking spot!**\n* **Please please provide your email to Thomas to receive a private link to register in the guest system at Vesta before the event**\n* **Please register your car before the event. See the image for parking**\n\nAgenda:\n**19:00 – 19:10** Welcome by Vestas and OWASP Aarhus\n\n**19:10 – 20:00** ”Automated attack path discovery and alerting with Adalanche” by Rasmus Have.\n\nRasmus Have is a Senior Cyber Security Architect at Vestas where he works with security architecture across the IT and OT domains. Rasmus has a background from the startup world and military security over the last 25 years. He aims to close the gap between the theoretical architecture work and the practical engineering work with a hands on approach to security.\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** How to leverage AI in web protection - OWASP Juiceshop\" by Rasmus Dalsgaard Andersen, CheckPoint\n\nOWASP Juice Shop is probably the most modern and sophisticated insecure web application! I will show you how AI can be leveraged in a WAF to protect against attacks."
    },
    {
        "group": "Algiers",
        "repo": "www-chapter-algiers",
        "name": "DevSecOps : Bridging DevOps and Security",
        "date": "2024-06-14",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-algiers-chapter/events/301445745",
        "timezone": "Africa/Algiers",
        "description": "Join us for an exclusive webinar on \"**DevSecOps: Bridging DevOps and Security**\" on 14th June 2024 at 19:00 GMT+1.\n\nLearn from industry expert **Djelloul Bouida** about integrating security into your DevOps workflow. Register now!\n\n Date: 14/06/2024\n Time: 19:00 GMT+1"
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "3. OWASP Augsburg Stammtisch",
        "date": "2024-06-26",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/301438471",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda**\n\n#### tbd - Du hast einen Vortrag? Du hast ein Thema, das dich interessiert? Zeig es uns! Vorträge sind immer willkommen!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - June 2024 (Online)",
        "date": "2024-06-25",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207011",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation! Presentation begins at 12CDT!\n\nIf you would like to attend in person and have a free lunch, please register at [https://owasp-austin-2024-june.eventbrite.com](https://owasp-austin-2024-june.eventbrite.com)\n\nPresentation: **Full of SaaS and TOTALLY SECURE**\n\nManaging shadow IT in the age of SaaS application sprawl is an important component of managing risk, especially since so many of us depend on SaaS/PaaS as part of our critical infrastructure. However, traditional approaches (blocklisting, brute force, etc.) have proven ineffective and are, oftentimes, too late to prevent any real security issues.\nIn this session, we’ll discuss some of the psychology behind why we’re referred to as the “department of NO” as well as how to start shifting that perception. You will also learn of some tactics to identify and mitigate shadow IT as well as proactive measures that may help avoid future sprawl."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-20",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301366702",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "June 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-06-13",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299655980",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, June 13th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Checkmarx](https://checkmarx.com)\n*Checkmarx is constantly pushing the boundaries of Application Security Testing to make security seamless and simple for the world’s developers and security teams. As the AppSec testing leader, we deliver the unparalleled accuracy, coverage, visibility, and guidance our customers need to build tomorrow’s software securely and at speed.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-13",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301223275",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Thursday with Pacific Hackers & OWASP – CTF Time",
        "date": "2024-06-27",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/301426321",
        "timezone": "America/Los_Angeles",
        "description": "**Want to tap into your inner evildoer and test your skills in hunting down web application vulnerabilities?**\nJoin us at this joint event between Pacific Hackers and OWASP Bay Area to immerse yourself in the industry’s most authentic environment, where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense are all about thinking on your feet. For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard as you vie for the top spot!\n\n**About the Range:**\nThe CMD+CTRL Cyber Range is ideal for anyone interested in learning how web applications are attacked, furthering their cybersecurity acumen, or honing the skills needed to protect the enterprise. From curious bystanders to active practitioners to Risk and Security Executives, there’s something for everyone.\n\nRegistration:\nPlease register here to get more event details and help us organize food and drinks [https://web.securityinnovation.com/owasp-bayarea](https://web.securityinnovation.com/owasp-bayarea)\n\n**Agenda:**\n5 PM – Food & Networking\n5:30 PM – 8:30 PM – CTF Time\n8:30 PM – Prizes"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Bay Area OWASP June Meetup",
        "date": "2024-06-26",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/301448414",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming June meetup, which will be hosted by the wonderful **Traceable** team at **Harness** HQ in San Francisco. Refreshments will be sponsored by **Defy Security**. Get ready for insightful discussions and the chance to network with some of the brightest minds in the industry.\n\n**Agenda:**\n5:00 - 5:45: Doors open, networking and food\n\n5:45 - 6:30: Talk 1: API Security Blunders: Tales from the Cyber Trenches - Anjum Ahuja\n6:30 - 7:15: Talk 2: Had a Cyber Incident? Better Call Saul! - Daniel Davis\n7:15 - 8:00: Talk 3: Details TBA\n\n**Talk 1:**\nSpeaker:\nAnjum Ahuja\n\nTitle:\nAPI Security Blunders: Tales from the Cyber Trenches\n\nAbstract:\nIn this session, we dive into API Security by dissecting real-world blunders that have caused security breaches. We'll guide you through the process of identifying these anti-patterns and provide insights to effectively defend against such attacks.\n\nSpeaker Bio:\nAnjum is the Director of Security Research at Traceable.ai. He has worked on different aspects of security engineering specifically Detection engineering & Incident response, AppSec and Threat Intelligence. He has presented at conferences like BSidesSF, BSidesCharm, and has multiple patents issued for IOT Security.\n\n**Talk 2:**\nSpeaker: Daniel Davis\n\nTitle: Had a Cyber Incident? Better Call Saul!\n\nAbstract: If you’re a CISO, you’re already calling your lawyer. The rest of you are going - huh??? From the SEC’s legal action against Solarwinds to the looming specters of CMMC 2.0 and CIRCIA, when will cybersecurity’s transformation into a legal domain be complete?\n\nSpeaker Bio:\nNo, Daniel isn’t a lawyer, but he did stay at a Holiday Inn Express last night (does that one still hold up???). Cybersecurity isn’t the first technical discipline to be “legal-lite” as he learned running safety programs for military aerospace programs. When things go wrong, people will always want to know who “signed off on it”.\nThis experience led Daniel to Lyft’s autonomous vehicle division to create a public-private partnership to develop a framework for safety and cybersecurity for AVs. Today, he’s the founder of Mindpipe, which will be open sourcing a next generation, end-to-end RAG pipeline leveraging open knowledge graph frameworks."
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "C3 Dev Festival - the contemporary software engineering and design festival",
        "date": "2024-06-14",
        "time": "08:00+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/300841713",
        "timezone": "Europe/London",
        "description": "OWASP Belfast is pleased to announce the C3, a contemporary software engineering & design festival!\n\n**With 3 free tickets, we'll run a draw on May 20th among all who comment on this post!**\n\nCode, career, creativity\n12 artists & 30 speakers\nSpeed Networking\n& many more\n\n**#Amsterdam, June 14-15, 2024 → https://c3fest.com**\n\nСonference announcement:\n\nCheck out the C3, a contemporary software engineering & design festival, organized by GitNation!\n\nIt is set to be one of the most vibrant festivals, blending technology, design, art, and music. It's a global gathering of tech enthusiasts in the beautiful city of Amsterdam!\n\nExcept for the 40 + speaker talks, the festival includes workshops, icebreaker activities, a game tournament, a pre-party, discussion rooms, a digital art exhibition, and a night party featuring 18+ DJs, musicians & creative coders on Techno/House, Algorave/Experimental, Night Cinema/Karaoke Hall stages\n\nAmongawesome first confirmed artists & speakers:\n\n• Rival Consoles, London-based critically acclaimed electronic music producer presenting a brand new unique performance that will take the form of an immersive audio-visual experience\n• Sam Aaron, key figure in algorave movement\n• Saskia Freeke, Creative coder, interaction designer, visual designer and educator\n• Christian Heilmann, Author of the Developer Advocacy Handbook\n& more\n\nExplore more about C3 and grab your ticket → https://c3fest.com/"
    },
    {
        "group": "Belo Horizonte",
        "repo": "www-chapter-belo-horizonte",
        "name": "OWASP BH está de volta!",
        "date": "2024-06-29",
        "time": "10:00-03:00",
        "link": "https://www.meetup.com/owasp-belo-horizonte-chapter/events/301344829",
        "timezone": "America/Sao_Paulo",
        "description": "**OWASP BH está de volta!**\n\nJunte-se a nós no nosso primeiro meetup de 2024 e celebre a reabertura do capítulo OWASP BH!\n\nAgenda:\n**10h00 - 10h30:** Boas-vindas e reabertura oficial do capítulo OWASP BH: Apresentação da OWASP e dos planos do capítulo para 2024.\n**10h30 - 11h30:** Palestra \"IA Generativa e o Cenário da Segurança Cibernética\": Descubra os desafios e oportunidades da inteligência artificial na segurança.\n**11h30 - 12h00:** Palestra a definir\n**12h00 - 13h00:** Networking e encerramento"
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "ML Huddle & Cracking the Cybersecurity Puzzle",
        "date": "2024-06-15",
        "time": "11:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/301458426",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an evening of professional networking and insightful discussions on the latest trends in computer security, application security, and open source technology. Our group, the OWASP Bhopal Chapter, is dedicated to promoting knowledge sharing and collaboration in the fields of cybersecurity, software security, and web application security. Building upon the success of our previous events like \"Revisiting Cyber Security & 101 with ML\" and \"Introduction and overview to OWASP,\" this event will focus on the significance of web security and network security in today's digital landscape.\n\nWhether you are a seasoned cybersecurity professional or a budding enthusiast eager to learn about penetration testing and information security, this event is the perfect platform to connect with like-minded individuals and expand your knowledge. Come join us for an engaging session on new technologies, best practices in software security, and the latest developments in the OWASP community. Let's unite to make the digital world safer and more secure for all!"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - June 2024",
        "date": "2024-06-12",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owaspboston/events/301105296",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Lindsay Kaye as our presenter. Lindsay will be giving her presentation an Overview of the PROXYLIB Campaign.\n\nIn May 2023, we identified a cluster of VPN apps available on the Google Play Store that transformed the user’s device into a proxy node without their knowledge. We’ve dubbed this operation PROXYLIB. Other researchers identified this malicious behavior in a single free VPN application—Oko VPN— which resulted in the app's removal from the Play Store. Based on further analysis of Oko VPN, Satori researchers uncovered 27 additional applications related to PROXYLIB. These apps shared a common native library, written in Golang, that enrolls the device as a proxy node. This talk will provide a high-level overview of the PROXYLIB Android malware and take the listener through the changes we observed in response to defenders’ actions.\n\nLindsay Kaye is the Vice President of Threat Intelligence at HUMAN Security. Her technical specialty spans the fields of malware analysis and reverse engineering, with a keen interest in dissecting custom cryptographic systems. Lindsay is an internationally-recognized cybersecurity speaker and author. Lindsay holds a BS in Engineering with a Concentration in Computing from Olin College of Engineering and an MBA from Babson College."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "How quantum computers can become a threat to cryptography",
        "date": "2024-06-10",
        "time": "17:55+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/301188369",
        "timezone": "Australia/Brisbane",
        "description": "Looking at recent developments in quantum computers, we try to make a prediction how much of a threat quantum computers will be for \"classical\" cryptography. Look at how technologies were able to penetrate our society seems to give a good indication of how prevalent quantum computers will become. We also look at research results, and how they inform us about the threat of quantum algorithms."
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "The Truman Show: Real-world application attacks instead of canned demos",
        "date": "2024-06-20",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/300788193",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nIn this presentation, Kevin Johnson of Secure Ideas will walk attendees through various scenarios used in penetration testing of applications. These demonstrations will use real attacks and discuss how a penetration tester views applications. This talk will explain the mindset of an attacker, using actual applications as well as demonstration apps to allow for exploitation.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Cracking the Code: Deep dive into malware analysis",
        "date": "2024-06-08",
        "time": "16:00+05:30",
        "link": "https://www.meetup.com/owasp-cuddalore-chapter/events/301418808",
        "timezone": "Asia/Kolkata",
        "description": "Join us at the OWASP Cuddalore Chapter for an interactive workshop on Malware analysis. Industry expert Mr.Melvin will guide you through the latest trends in Malware analysis. Whether you're a software developer, cybersecurity enthusiast, or application security professional, this event is perfect for anyone interested in enhancing their security knowledge. Don't miss out on this opportunity to network with like-minded individuals and stay ahead of the curve in the ever-evolving field of information security."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP June Meet - In person",
        "date": "2024-06-11",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/301038527",
        "timezone": "America/Chicago",
        "description": "\\*\\*\\*\\*AI Hallucination\\*\\*\\*\\*\\*\n\n90% of the code in Apps today comes from Open Source Software. Whether through infiltrating the software delivery pipeline, deliberately uploading malicious components to popular repositories, or taking advantage of existing vulnerabilities in open source components, attackers are leveraging gaps in supply chain controls to compromise organizations. With GenAI quickly becoming a popular tool for developers to generate code, a new threat has emerged. AI package hallucinations is one of the more recent attack types within supply chain that is easy to execute and can have devastating effects. During this session we will give an overview of Supply Chain Security with some examples of the current threats, discuss AI package hallucinations, and preventative measures."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Incident Response Coaching with SentinelOne's Purple AI and MNP Digital",
        "date": "2024-06-12",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/300949430",
        "timezone": "America/Edmonton",
        "description": "*As Franklin D. Roosevelt once wisely said, \"A smooth sea never made a skilled sailor.\"*\n\n**Ahoy, cyber sailors!** Just as sailors master the waves, [SentinelOne ](https://www.sentinelone.com/)and [MNP Digital](https://mnpdigital.ca/) are here to steer your ship through the stormy seas of cyberspace. Picture this: [SentinelOne's Purple AI](https://www.sentinelone.com/platform/purple/) is your trusty first mate, offering personalized coaching to navigate through cyber currents and dodge digital pirates‍. Together, we'll transform your crew into skilled cyber defenders ready to face any challenge on the high seas of security. \n\nAnd that's not all - [MNP](https://mnpdigital.ca/) is bringing in an Incident Response specialist to share the latest insights and trends. MNP doesn't just crunch numbers and balance the books like the superheroes of the accounting world. But they also fend off digital villains with their mighty Cybersecurity team. Think of MNP as your financial wizards by day and cyber warriors by night. They keep your money safe in more ways than one – after all, who knew accountants could also be your digital bodyguards? ‍\n\nJoin us for a day of learning, laughter, and delicious food as we level up our cyber defenses together!\n\n**Culinary Details**\nAfter the presentation, we'll be descending a few floors to MNP's brand new social and games floor, with a huge shoutout and special thanks to MNP for granting us early access! \n\nBut wait, there's more! Thanks to SentinelOne, we're serving up [Cornerstone BBQ's](https://www.cornerstonebbq.com/) mouthwatering beef brisket and grilled chicken at the event, all on the house! \n\n**Registration - 50 person limit**\nDue to limited capacity please wait for a confirmation of your RSVP.\nUnfortunately we will not be able to allow people into the event who have not received registration confirmation.\n\nJoin us for an open and inclusive gathering, dedicated to our shared theme. In compliance with our commitment to provide an optimal experience, we encourage timely registration to accommodate all interested participants within the policy guidelines. \n\n**Agenda **\n5:00 - 5:30 - Registration Verification\n5:30 - 6:00 - Presentation\n6:00 - 7:00 - Dinner and Socializing"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP Bordeaux Juin 2024",
        "date": "2024-06-20",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-france/events/301293664",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup OWASP France sur Bordeaux aura lieu le 20 Juin a partir de 17h30.\n\nIl devrait avoir lieu dans le centre de Bordeaux (adresse a venir)\n\nAu programme :\n\n* Welcome to OWASP Bordeaux ; par Sebastien Gioria\n* Threat Modeling for Developers par Jonathan Marcil ; talk en Francais\n\n*Jonathan is from Montreal, Canada and is passionate about Application Security. He enjoys architecture analysis, code review, threat modeling and debunking security tools. Jonathan holds a bachelor's degree in Software Engineering and has 20 years of experience in IT and Security*.\n\n* Kubernetes par Maxime Girardet (Pentester chez Advens)\n*Durant ce talk, Maxime GIRARDET vous présentera le niveau de sécurité par défaut d'un cluster Kubernetes, différents scénarios réalistes d'attaques ainsi que les remédiations associées, au niveau système et applicatif*.\n\nLe nombre de place sera limité"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Juin 2024",
        "date": "2024-06-17",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/301415122",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **OCTO Technology** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - June 2024",
        "date": "2024-06-23",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/300284889",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is thrilled to announce our next Meetup event! \n\nGet ready for a vibrant gathering of the AppSec community, featuring delicious food, refreshing drinks, networking opportunities, and insightful security discussions.\n\nThis special occasion will be graciously hosted by Axonius!\n\n====================================================================\nAgenda:\n 18:00 - 18:30 - gathering and food - We will gather at Axonius's office for drinks, great treats and mingling.\n 18:30 - 18:35 - Meetup kickoff + Microphone tuning\n 18:35 to 19:20 - From Challenge to Triumph: Transforming AppSec with AI and Automated Code Reviews - A Journey of Lessons Learned\n*Michael Goberman - Director of Product Security and Aviad Feig - Product Security Architect @ Axonius*\nMaintaining a robust application security program with a lean team of experts is challenging. We’re eager to share with the community a practical and innovative approach that worked for us: How we were able to move away from manually reviewing every feature developed while increasing the thoroughness of our security oversight. We’ll explain how we succeeded at integrating generative AI tools using GitHub actions to automate the code review process and broaden security oversight in a highly efficient way. Attendees will learn from our journey and discover how they, too, can automate routine security checks, engaging human experts only when their expertise is truly needed.\n 19:20 to 19:30 - Beer Break\n 19:30 to 20:15 - Pains and advantages of application anomaly detection in containerized applications\n*Ben Hirschberg - CTO @ ARMO*\nIn this talk an open-source based application anomaly detection system to detect malicious activity. The solution focuses on applications running in Kubernetes orchestration system.\nIn the talk I will cover these points:\n\\* Main attack vectors to these kinds of applications: exploit remote vulnerabilities, supply-chain attacks\n\\* Anomaly detection dimensions: process, file, network and system-call activity\n\\* What detection dimension is working (or not working) with what kind of applications\n\\* What anomalies are bound to what kind of attacks\n\\* Live demo with the Kubescape project to show results\n\n 20:15 to 21:00 - The Dark Side of AI: The Hidden Risks in Open-Source AI Models\n*Jossef Harush Kadouri - Security Researcher @ Checkmarx*\nThis talk is for anyone who is using open source in their daily routine. The purpose is to bring awareness to the risks of software supply chain attackers lurking in some of our open-source code and to show how ridiculously easy it is for them to launch attacks.\nJoin me as we unravel the construction of AI models, focusing on their weak spots. Through multiple demos, witness how AI models can be manipulated to become malicious.\n\n====================================================================\nThis event is hosted by Axonius in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2024",
        "date": "2024-06-20",
        "time": "16:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/300592625",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy will host the next OWASP Italy Day 2024 on June 20th. It will be a full-day event dedicated to application security (AppSec)!\n\n#### **OWASP Italy Day 2024 will take place at Cagliari.** This is a free, one-day, informal event aimed at increasing awareness and knowledge of web application security. **Reserve your seat here:** [https://clicqui.net/2Lst5](https://clicqui.net/2Lst5)\n\nThe event is primarily intended to appeal to security professionals, software developers, software quality engineers, and computer science students with a strong interest in computer security.\n\n### **PROGRAM**\n\nThe event will take place next 20th June from 4 PM to 22 PM (Italian time). We are working on the program at the moment.\n\n#### **Dinis Cruz, Founder @ The Cyber Boardroom, Chief Scientist @ Glasswall, vCISO and GenAI expert, will be the esteemed keynote speaker at the upcoming OWASP Italy Day 202**4!\n\n### **Call for papers**\n\nThose who are interested in participating as speakers to the conference can submit an abstract of their proposed talk via Easychair by April, 2024. The Easychair link for submission is reported on this page.\nThe abstract must be in PDF format and should contain the following information:\nName and surname of the speaker Institutions and roles of the speaker therein Short biography of the speaker Title of the contribution Abstract of the presentation The submission must be no longer than 2 pages overall. No additional formatting requirements are in place.\nThe submission will be reviewed by the program committee and the most interesting talk proposals will be selected for the conference.\n[CFP OWASP Italy Day 2024](https://easychair.org/cfp/CJ24)\n\n### **Call for Sponsorship**\n\nWe are excited to offer sponsorship opportunities for the OWASP Italy Day 2024, taking place in Cagliari on June 20th. This event provides a unique platform to connect with professionals from multiple facets of the software industry, including security experts, developers, engineers, and influential academics.\n\n#### Why Sponsor OWASP Italy Day 2024?\n\nBrand Visibility: As a sponsor, your brand will be prominently displayed before, during, and after the event. This includes logo placement in event materials, promotional content, and key areas at the venue. Enhance your brand recognition within the cybersecurity and developer communities.\nCommunity Engagement: Engaging with the OWASP community puts your company in the spotlight as a leader in supporting open software and security advancements. This event will provide you with the opportunity to network with industry leaders and cybersecurity professionals, offering a chance to build relationships and share your company’s expertise and solutions.\nLead Generation: With hundreds of attendees from various sectors, sponsoring OWASP Italy Day 2024 gives you direct access to potential clients and customers. The event will provide a focused audience interested in cybersecurity solutions, products, and training.\nPlease see **[here for details](https://owasp.org/www-chapter-italy/assets/images/2024%20OWASP%20Italy%20Day%20Sponsorship.pptx.pdf)**\nFor detailed information on our sponsorship packages please read the details [here](https://owasp.org/www-chapter-italy/events/OWASPIt24SponsorKit)\n\n**RESERVE YOUR SEAT:**\n[https://clicqui.net/2Lst5](https://clicqui.net/2Lst5)\n\nEvent official site:\nhttps://owasp.org/www-chapter-italy/events/OwaspItalyDay2024-06-20"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-06-17",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686433",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUN 26, 2024",
        "date": "2024-06-26",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/298386242",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: **What's in your AI code? Learn why every SCA tool is wrong, and how to deal with it.**\nJoin us for great networking, dinner and drinks, and see a presentation by **Darren Meyer**, Lead Solution Architect at Endor Labs.\n\n**ABSTRACT**: With the rise of AI-fueled by Python-based libraries, it has become of paramount importance to scan Python-based projects and their dependencies for OSS vulnerabilities. Python relies on package managers like pip or conda to manage declared dependencies. Dependencies are declared in manifest files which the package manager uses to install the correct version of the required dependency. However, Python’s dependency management system coupled with its dynamic type nature makes it an especially challenging language to deal with.\n\nOf particular focus is the phenomenon of phantom dependencies which are unreported dependencies in a project's manifest profile. These hidden dependencies, which are often provided dependencies (which is especially true for libraries such as tensorflow and pytorch which are essential for AI), challenge software composition analysis (SCA) of Python code, impacting the reliability of vulnerability results.\n\n**Thanks to our Sponsor**: *[Endor Labs](https://www.endorlabs.com/)*\n*Endor Labs’ Dependency Lifecycle Management Platform is designed to address the weakest link in software supply chain security: the ungoverned sprawl of open source software in the enterprise. Endor Labs’ mission is to help developers spend less time dealing with security issues and more time accelerating development through safe code reuse. With this solution, development and security teams are able to maximize software reuse by safely evaluating, maintaining, and updating dependencies at scale.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "June meetup: Hidden Risks in Open-Source Code and AI Models",
        "date": "2024-06-18",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/301154232",
        "timezone": "America/Chicago",
        "description": "**Hidden Risks in Open-Source Code and AI Models**\n**Ryan Wakeham, Senior Solutions Engineer, Checkmarx**\n\nThis presentation will explore some of the threats and risks associated with open-source code and generative AI models. Open-source packages, while widely adopted for their flexibility and collaborative benefits, can be exploited through supply chain attacks, where malicious code is introduced into trusted components. Similarly, open-source AI models face risks such as data poisoning, model theft, and adversarial attacks, which can compromise their integrity and reliability. Understanding these threats is crucial for developing robust security measures and ensuring the safe use of open-source technologies.\n\nAudience level: Moderately technical\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nPlease remember to register and keep your registration up to date so we know how many to expect."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Digital Safeguards: Your Essential Blueprint for Navigating Cyber Threats\"",
        "date": "2024-06-19",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300436528",
        "timezone": "America/Chicago",
        "description": "Outdated cybersecurity tactics leave us vulnerable. This thought-provoking talk introduces the “Cyber Risk Manifesto”, drawing upon the wisdom of military intelligence and corporate defense methodologies. Explore innovative strategies for predicting threats, reinforcing defenses, and empowering everyone to become cybersecurity guardians. Discover how outmaneuvering attackers is the key to digital resilience."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "June 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-06-20",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/300855942",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** VU, Amsterdam - Theater 7, 4E floor at the New University Building\n**Address:** De Boelelaan 1105\n**Parking information:** [https://www.parkerenbijvu.nl/](https://www.parkerenbijvu.nl/)\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Ship Happens: The Stormy Seas of Supply Chain Security** by **David Archer**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Technical leverage: dependencies are a mixed blessing** by **Fabio Massacci**\n\n**Ship Happens: The Stormy Seas of Supply Chain Security**\n*Abstract:*\n“The more I know about how software is made, the less I want to know” - Me\n\nAs a software developer with over a decade of experience and countless interactions with application security teams, I’ve discovered the unsettling complexities of modern software production. Despite what I thought I knew, the reality was far more intricate.\n\nModern software development is a sprawling network of open-source dependencies, sophisticated build tools, plugins, pipelines, and runtimes. These components are fundamental in securing critical sectors of our daily lives—finance, healthcare, infrastructure, transportation, and social interactions. However, this supply chain is under relentless attack and many of the potential threats are poorly understood.\n\nThis talk will delve into specific vulnerabilities, such as dependency poisoning and pipeline compromises, that exemplify the challenges we face. We’ll explore strategies to mitigate these threats and discuss practical takeaways that attendees can immediately implement in their software development practices. Expect to leave with a deeper understanding of supply chain security and with ideas to fortify your software factory against these escalating threats.\n\n*Bio:*\nDavid Archer is a Solution Architect at Endor Labs. He began his career as a software developer and witnessed significant shifts in how software is built over the last two decades. After spells as a development lead, product director and pre-sales consultancy roles David consistently saw a concerning trend: security often took a backseat amidst the hustle and bustle of development priorities.\n\nSeeking to help address this balance David took an opportunity in 2018 to work full-time in the field of application security with a particular focus on technologies that promise to enhance security without impeding development speed. Through his extensive experience with secure coding practises and hands-on experience with the myriad of code analysis tools like IAST, SAST, DAST, RASP and SCA, he gained valuable insights into their relevance and effectiveness in a modern software factory.\n\n**Technical leverage: dependencies are a mixed blessing**\n*Abstract:*\nModern applications are build upon a large supply chain of (possibly open source) libraries and tools. In finance, leverage is the ratio of debts (other people’s money) vs equity (your money) and the Lehman Brothers have made that concept famous. For software, technical leverage is the ratio between other people’s code and your own code. I will argue with some examples from the Maven, Python and the NPM ecosystems that this is both a risk and an opportunity. The Lehmans Brothers were 30 to 1, what about the Software Sisters?\n\n*Bio:*\nFabio Massacci is a co-author of CVSS v4. Among other things, he is also a professor at Vrije Universiteit. He has been a speaker at hackers’ venues (BlackHat USA, Asia) scientific security conferences (IEEE S&P, CCS), software engineering (ICSE,MSR) and risk analysis (SRA). He coordinates the EU project Sec4AI4Sec (name tells it all) and an NWO project on using AI for security threat intelligence. While almost all professors are sellers of tech (through their papers or their spin-offs) he was also for 7 years deputy for ICT procurements and services supervising a 70+ workforce and few millions Euro in outsourcing contracts. Being a buyer of tech makes a difference in perspective."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle June 2024",
        "date": "2024-06-19",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/300468663",
        "timezone": "Europe/London",
        "description": "We're back with our second event of 2024! We’ll be doing our usual two talks and pizza format.\n\nLocation: Precursor Security (at the old Newcastle Building Society office)\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1830 OWASP Newcastle Welcome\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk one\n**Title:** Supercharging Enterprise DFIR - 'Forensics as Code', AI, Automation and Cloud.\n**Speaker:** Michael L\n**Speaker Bio:** Currently the Director of SOC/DFIR for Precursor Security, experienced working in different SOC teams across public sector, financial services and managed services. I've lead DFIR engagements for a varied client base across EMEA.\n**Talk Synopsis:** This talk will introduce the latest techniques to supercharge your response to threat actors at enterprise scale. We will cover techniques I've employed to combat Lockbit, Akira and other TA's in challenging and diverse environments, focusing on new trends shaking up the DFIR corner such as performing forensics investigations 'as code', harnessing AI for DFIR and utilising Azure for automation and almost limitless scale.\n\nTalk two\n**Title:** Utilizing PowerBI for DFIR and incident investigation.\n**Speaker:** Venkatraman Krishnamoorthy\n**Speaker Bio:** Working as SOC manager for Sage . I have lead critical investigations, detection engineering efforts, Security automation.\nProviding free cyber security Mentoring for economically modest students.\n**Talk Synopsis:** Leveraging Power BI for Digital Forensics and Incident Response (DFIR): Enhancing Data Analysis and Visualization\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Chapter Meeting",
        "date": "2024-06-27",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/300859951",
        "timezone": "America/New_York",
        "description": "This is an In-Person Event\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **Marc Frankel**\n\nTopic: AIBOM - summary TBD\n\nSpeaker 2: **TBD**"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa June 19th 2024: OWASP Top 10 for LLM Applications-A Detailed Review",
        "date": "2024-06-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/301345606",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **OWASP Top 10 for LLM Applications: A Detailed Review**\n\n**Abstract:**\nAs the adoption of Large Language Models (LLMs) in corporate and governmental organizations becomes increasingly common, it introduces unique security challenges that need immediate and effective management. This presentation provides a detailed overview of the OWASP Top 10 for LLM applications, which in less than eight months has already become a trusted resource on how to secure LLMs within and outside of the global cybersecurity community. The goal of the publication is to equip organizations with the knowledge to successfully navigate LLM security challenges. Beginning with a technical primer on AI, Machine Learning, and LLMs, the presentation will ensure a foundational understanding of the technology and its potential security risks. We will then review critical vulnerabilities such as Prompt Injection, Insecure Output Handling, Training Data Poisoning, Model Denial of Service, and Supply Chain Vulnerabilities, among others, and highlight the importance of recognizing and mitigating these risks as well as provide actionable advice for secure LLM implementation. Through this presentation, the audience will learn how to safeguard their LLM deployments against emerging threats, ensuring both the security and efficacy of these powerful AI tools in their organizational context.\n\n**Speakers:**\n**Simon Sulyma** is an expert in the fields of cybersecurity and information risk, with close to 20 years of experience designing, building, securing, and auditing complex IT systems at large financial institutions across Canada. Simon currently leads the Governance, Risk, and Compliance (GRC) function at the Global Wealth and Asset Management segment at Manulife. He frequently speaks at conferences, trainings, and meetups, organizes and participates in community events, and mentors people entering the cybersecurity field. Simon holds a Master's degree in Information Security and a number of certifications including CISA, CISSP, CISM, CRISC, CCSP, and AZ-500.\n\n**Diana Rogachova** is a Data Science and Machine Learning professional. In 2023, she graduated from a bootcamp where she subsequently worked as a Teaching Assistant for Data Science students. Her areas of interest are the intersection of Generative AI, cybersecurity, and privacy as well as the ethical use of AI. Diana holds the Machine Learning certification from Amazon Web Services (AWS) and is currently pursuing the Cybersecurity Certificate from ISC2. She also has a Bachelor’s Degree in Criminology and Criminal Justice from Carleton University and three years of experience in the criminal justice field."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-06-27",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/301347316",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Ataki przy użyciu Flipper Zero - modelowanie zagrożeń",
        "date": "2024-06-13",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/301314367",
        "timezone": "Europe/Warsaw",
        "description": "Tym razem nasze spotkanie będzie po Polsku. A temat to:\n\nModelowanie zagrożeń - Flipper Zero w atakach fizycznych.\n\nW trakcie tego spotkania dowiesz się, jak identyfikować potencjalne zagrożenia oraz jak je łagodzić. Odkryj, jak to urządzenie może być używane w rzeczywistych scenariuszach ataków, w tym:\n\n* Odczytywanie, zapisywanie i klonowanie kluczy RFID 125 kHz,\n* Hakowanie czytników kart RFID 125 kHz,\n* Wykorzystywanie czytników NFC-A Mifare Classic 1K,\n* Odczytywanie i nagrywanie sygnałów z pilotów (bramy, rolety, aut),\n* Odczytywanie karty płatniczej (multi-protocol card) i inne.\n\nPodczas spotkania zastosujemy metodę modelowania zagrożeń w uproszczonym podejściu. Metoda ta pozwala na identyfikację, ocenę i łagodzenie zagrożeń. Nie przegap tej okazji, aby nauczyć się praktycznych technik i pogłębić swoją wiedzę na temat luk w zabezpieczeniach oraz strategii ich przeciwdziałania.\n\nSpotkanie poprowadzą: [Sebastian Obara](https://www.linkedin.com/in/sobara/) i [Michał Kłaput](https://www.linkedin.com/in/michalklaput/)\n\nTechie’s Space is the vibrant tech community around Techie’s, a resto-bar run by Exadel (formely Codete).\n\nFrom January 2022 onward, it has emerged as the go-to space for meetups and events where tech professionals\nand enthusiasts meet to share insights, expand their knowledge, and cultivate meaningful connections.\nLearn more about the space and our events: [https://www.techiesspace.pl/](https://www.techiesspace.pl/)"
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "11.VI - Spotkanie OWASP w Warszawie (AI Security)",
        "date": "2024-06-11",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/301240374",
        "timezone": "Europe/Warsaw",
        "description": "**Wznawiamy w pełni stacjonarne spotkania OWASP w Warszawie!** Zaczynamy od gorącego tematu – wykorzystania sztucznej inteligencji w obszarze bezpieczeństwa aplikacji. Nasze najbliższe spotkanie odbędzie się we **wtorek, 11 czerwca o godzinie 18:00** w siedzibie firmy **Snowflake** (**Warszawa, Kasprzaka 4**), która będzie nas tego dnia gościła. Oprócz wystąpień merytorycznych będzie przestrzeń do otwartej dyskusji, wymiany poglądów oraz networkingu przy poczęstunku. Zachęcam do rejestracji, z uwagi na ograniczoną pojemność sali.\n\n\\-\\-\\-\n\n17:30 – 18:00 – Rejestracja (prośba o możliwie wcześniejsze przybycie, by uniknąć kolejki przy recepcji)\n\n18:00 – 18:25 – Otwarcie spotkania oraz **omówienie aktualnych projektów OWASP dotyczących bezpieczeństwa sztucznej inteligencji**, Michał Kurek, OWASP Poland\nW ramach dorobku OWASP pojawiło się w ostatnim czasie wiele ciekawych projektów, które pomagają rzucić więcej światła na ciemne strony AI. W trakcie prezentacji omówione zostaną główne zagrożenia dla AI oraz specyficzne wyzwania w zakresie zapewnienia bezpieczeństwa sztucznej inteligencji, przez pryzmat takich projektów OWASP jak: OWASP AI Exchange, OWASP Top 10 for LLM Applications, OWASP AI Security & Privacy Guide, OWASP Machine Learning Security Top 10.\n\nMichał współkieruje polskim oddziałem OWASP. Na co dzień zarządza zespołem ekspertów stanowiącym regionalne centrum kompetencyjne KPMG w zakresie cyberbezpieczeństwa. Posiada bogate, przeszło 20-letnie doświadczenie w zakresie doradztwa w obszarze cyberbezpieczeństwa. Zdobył m.in. następujące certyfikaty: CISM, CISSP, CISA, GICSP, GDSA, LPT, CEH, GWAPT, CRISC, CCSP, CCSA, GSSP-JAVA, ECSA, PMP, CIA, GAWN, CCNA.\n\n18:30 – 19:00 – **Moc AI w programie AppSec**, Jakub Kałużny, Snowflake\n\nW ramach prezentacji zostaną przekazane praktyczne wskazówki, jak wzbogacić program zarządzania bezpieczeństwem aplikacji z wykorzystaniem sztucznej inteligencji. Zostanie omówione jak wykorzystać funkcjonalność LLM, RAG i GBM aby osiągnąć następujące cele:\n\\- identyfikacja niepokojących sygnałów poprzez semantyczną analizę danych w systemach wspierającychwytwarzanie oprogramowania \\(Jira\\, Github\\)\n\\- uzyskanie szybkich wglądów w bezpieczeństwo w ramach przeglądów kodu źródłowego\n\\- wsparcie wiedzą z zakresu polityk i procedur wewnętrznych w ramach przeglądów bezpieczeństwa\n\\- automatyzacja modelowania zagrożeń dzięki dostarczaniu odpowiednich zagrożeń i środków mitygujących ryzyko poprzez wytrenowanie modelu AI z wykorzystaniem ustrukturyzowanych danych z modelowania zagrożeń\n\nJakub kieruje działaniami związanymi z bezpieczeństwem AI w Snowflake jako Starszy Menedżer w zespole Product Security, gdzie zarządza portfelem usług związanych z bezpieczeństwem aplikacji. Przed dołączeniem do Snowflake zarządzał programami pentestingowymi i wdrażał procesy modelowania zagrożeń w wielu różnych przedsiębiorstwach w Australii i Polsce. Ekspert w Fundacji AI Security.\n\n19:00 – 19:30 – **Otwarta dyskusja**\n\n19:30 – 21:00 – **Networking**\n\n\\-\\-\\- ENGLISH \\-\\-\\-\n\n17:30 – 18:00 – Registration (please arrive as early as possible to avoid the queue at the reception)\n\n18:00 – 18:25 – Opening of the meeting and presentation of **current OWASP projects regarding AI security**, Michał Kurek, OWASP Poland\n\nOWASP has recently launched many interesting projects that help shed more light on the dark sides of AI. During the presentation, the main threats to AI and specific challenges in ensuring the security of artificial intelligence will be discussed, through the prism of such OWASP projects as: OWASP Top 10 for LLM Applications, OWASP AI Security & Privacy Guide, OWASP Machine Learning Security Top 10.\n\n18:30 – 19:00 – **Amplify your AppSec program with AI**, Jakub Kałużny, Snowflake\n\nIn this presentation, you will learn practical knowledge how to power your AppSec program with AI - I will talk how to use LLM functions, RAG and GBM to achieve the following goals:\n\\- identify concerning signals earlier via semantic search through engineering and security data with LLMs\n\\- provide instant security insights in code reviews\n\\- contextualize consults via application of internal security policies in simple security reviews\n\\- automate threat modeling with contextualized threats and mitigations via training a model on your structured threat modeling data\n\n19:00 – 19:30 – **Open discussion**\n\n19:30 – 21:00 – **Networking**"
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "AppSec Days Pacific Northwest 2024",
        "date": "2024-06-15",
        "time": "21:00-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/301184004",
        "timezone": "America/Los_Angeles",
        "description": "AppSec PNW is an annual regional conference produced by the Portland, Seattle, Vancouver, and Victoria OWASP chapters. This year it will be in Vancouver BC. (Last year it was in Portland.)\n\nOur featured speakers are [E Coleen C.](https://www.linkedin.com/in/ecoleenc/), CISO Advisor, and [Jason Haddix](https://www.linkedin.com/in/jhaddix/), CEO of Arcanum Information Security! Coleen will kick off the builder track, and Jason will launch the breaker track.\n\nAll the talks are on Saturday this year, and all the workshops on Sunday. You can find full details, including the complete schedule, at [appsecpnw.org](https://www.appsecpnw.org/schedule). Registration is on [EventBrite](https://www.eventbrite.com/e/4th-annual-owasp-appsec-days-pacific-northwest-conference-june-15-16-tickets-858457528577?aff=oddtdtcreator)."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "AppSec Days Pacific Northwest Conference 2024",
        "date": "2024-06-15",
        "time": "08:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/301143536",
        "timezone": "America/Los_Angeles",
        "description": "Join your security community for two days of  builder and breaker content, including session talks, workshops, and a CTF.\nLearn, play, network, meet new friends, or connect with existing ones.\n\nColeeen Coolidge will open our breaker track & Jason Haddix will kick off our breaker track.\n\nFull schedule @ [https://www.appsecpnw.org/schedule](https://www.appsecpnw.org/schedule)\nTickets @ [https://bit.ly/appsecpnw2024-tickets](https://bit.ly/appsecpnw2024-tickets)\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Navigating the Complex World of Secret Scanning and Data Loss Prevention",
        "date": "2024-06-12",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300218560",
        "timezone": "America/Los_Angeles",
        "description": "In an era where breaches and leaks are increasingly common, safeguarding sensitive information has never been more critical. This talk surveys the multifaceted landscape of secret scanning and management, extending beyond source code to encompass data, logs, and productivity apps. We'll explore the overlapping and unique challenges across various environments and discuss emerging industry trends and solutions that go beyond the usual suspects, ensuring robust data loss prevention across the enterprise stack.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2024Q2 Lunch and Learn",
        "date": "2024-06-14",
        "time": "11:30-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/301294626",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2024Q2 Lunch and Learn!**\n\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda:**\n\n* 11:30am - Registration and Lunch\n* 12:00pm - Speaker - Chris Lindsey - From Reactive to Effective: Building Application Security that Works\n* 1:00pm - Depart\n\n**Speaker:**\n\nChris Lindsey is a seasoned speaker who has appeared at conferences, webinars, and private events. Currently building an online community and creating a podcast series, Chris draws on expertise from more than 15 years of direct security experience and over 35 years of experience leading teams in programming and software, solutions, and security architecture.\n\nFor three years, Chris built and led an entire application security program that includes the implementation of mature AppSec programs, including oversight of security processes and procedures, SAST, DAST, CSA/OSA, compliance, training, developer communication, code reviews, application inventory gathering, and risk analysis.\n\n**Abstract**:\n\nIn 2023, 71% of enterprises admitted their AppSec programs were reactive, playing catch-up with vulnerability alerts -- while at the same time, applications remain the top target for threat actors. That adds up to increased business risk for a lot of companies and fuels an urgent need to improve application security strategies. But how?\nThe key is to move from a compliance-based approach to managing application risk.\n\nJoin Chris Lindsey, Application Security Evangelist, for an in-depth discussion of what it takes to stop playing defense when it comes to application security. He'll wrangle over topics like:\n\n* The tell-tale signs of reactive mode\n* The value of preventative best practices\n* How to build security actions into the developer experience\n* The need for a holistic view and effective prioritization\n* Arming the security team with instant control at scale\n\n**Location:**\nGuidePoint Security\n3030 N Rocky Point Drive W\nSte 600\nTampa, FL\n\n**Sponsors:**\n[Mend](https://www.mend.io/)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | OWASP Top 10 for LLM Applications",
        "date": "2024-06-12",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/301234176",
        "timezone": "America/Toronto",
        "description": "**TALK**\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\n\n**OWASP Top 10 for LLM Applications**\n\n**Summary:**\n\nThe presentation will discuss the OWASP Top 10 for LLM AI Applications, highlighting the work accomplished and the vision for version 2.0 moving forward. It aims to educate developers, designers, architects, managers, and organizations about the potential security risks associated with deploying and managing Large Language Models (LLMs).\n\nAttendees will learn about the synergy and collaborative efforts between this project, international institutions and governments in protecting the rollout of Generative AI. We will present emerging trends and resources available to safeguard and promote the responsible use of AI, thereby empowering security strategies.\n\n**Presenters**\n\n**Emmanuel Guilherme Junior**\n\nDedicated Cyber Security Professional with over a decade of experience, he serves as an AI/LLM Security Researcher at the OWASP Foundation. In this role, he is leading the development of the OWASP TOP 10 for AI/LLM-based Applications v2.0 Data Gathering Methodology and contributed in creating the Security & Governance Checklist for Chief Information Security Officers (CISOs). This work aids CISOs in navigating the intricacies of deploying Generative AI technologies. His contributions also extend to Business Strategy, Information Security Research, and Project Management, where he has offered valuable insights to several Fortune 500 companies.\n\nHe possesses a nuanced understanding of the global security landscape, advanced security strategies, and compliance frameworks. Committed to enhancing security measures with innovative and practical solutions, he consistently aims to share his knowledge and expertise in a manner that benefits the wider community.\n\n**Ads Dawson**\n\nAds, full stack AI red teamer, is the Technical Lead for the OWASP Top 10 for LLM Applications project and is a seasoned security engineer in all realms of the industry, primarily focusing on red teaming, ethical hacking, and offensive security, primarily orientating REST & GraphQL APIs, LLM application security, MLSecOps and also has a strong background in network and infrastructure penetration testing and security, originally stemming as a self-taught network engineer."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup - Junio",
        "date": "2024-06-11",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/301263486",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY te invita a su próximo Meetup!**\n\nLas exposiciones serán las siguientes:\n\n**Felipe Zipitría: Fingerprinting en la Web**\nEl uso de IPs en el mundo web para bloquear comportamiento malicioso en la Web es difícil de mantener y puede inclusive resultar perjudicial. Presentaremos formas de realizar fingerprints, casos de uso y los principales problemas que quedan por resolver con estas técnicas.\n\n**Andrés Gómez: Descubriendo tesoros ocultos en el mundo Java**\nTBA\n\n**¿Cuándo?** Martes 11/6, 19:00.\n**¿Dónde?** Isbel, Paysandú 926.\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Application Security Pacific Northwest Conference",
        "date": "2024-06-15",
        "time": "08:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/301142469",
        "timezone": "America/Vancouver",
        "description": "You have to buy tickets for this OWASP conference, please go to the following site to register for the event:\nhttps://www.eventbrite.com/e/4th-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-858457528577"
    },
    {
        "group": "Warwick",
        "repo": "www-chapter-warwick",
        "name": "OWASP Warwick Chapter - Meet and Greet, 12 Jun 2024, 18:00",
        "date": "2024-06-12",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-warwick/events/301417204",
        "timezone": "Europe/London",
        "description": "OWASP Warwick is back! We're starting off with a meet & greet where we can get to know one another, gauge our community's areas of interest, and start planning our roadmap for the rest of the year.\n\n#### TALKS\n\n#1: **Welcome to OWASP Warwick** \\- Brian McGlone \\(IBM X\\-Force Red\\)\n#2: **Exploiting Weaknesses in AI Systems** \\- Jakub Partyka \\(LRQA Nettitude\\)\n#3: **CHERI - Memory safe architecture - what is it, and do we need one?** \\- Mirek Malinowski \\(Cyber Security Reaserch Group \\- WMG\\)"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Extra OWASP SAMM community call - Europe - Asia",
        "date": "2024-06-14",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/301334615",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call on 14th June @ 15.00 CET. This is not a replacement of the regular community call, but an extra one we’ve scheduled during a more friendly time for users in EU and Asia. Bring your SAMM questions and we’ll discuss them!\n\nHere’s the agenda outline for the call.\n\n* Welcome and introductions\n* SAMM Project Updates\n\n* SUD24\n* SAMM Fundamentals Course\n* Benchmark submissions\n* SAMM Guidance\n* Mappings to / from other frameworks\n\n* Q&A round"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly OWASP SAMM Community Call - June 2024",
        "date": "2024-06-12",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/300918520",
        "timezone": "America/New_York",
        "description": "Our next community call in June 12, we will cover:\n1) Welcome new community members\n2) SAMM project updates\n2) Q&A"
    }
]