[
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter December 2023 Meetup",
        "date": "2023-12-13",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owaspboston/events/297520132",
        "timezone": "America/New_York",
        "description": "Please join us for OWASP Boston's December meetup! For those attending in-person, the doors open at 6pm, and those joining us virtually the presentation will start at 6:30pm.\n\nThis month we will be welcoming Tommaso Innocenti to talk about his research on OAuth2.0 redirection URIs.\n\nABOUT THE SPEAKER\nTommaso is a fourth-year Ph.D. student advised by Engin Kirda, working as a Secure Systems Lab (SecLab) member at Northeastern University. His interests revolve around Privacy and Security, with particular attention to increasing final users' security. His works reflect his passion and tenacity in exploring complex security topics. His most recent work focuses on the security of the OAuth protocol.\n\nABSTRACT\nOAuth 2.0 requires a complex redirection trail between websites and Identity Providers (IdPs). In particular, the \"redirect URI\" parameter included in the popular Authorization Grant Code flow governs the callback endpoint to which users are routed, together with their security tokens.\n\nIn this talk, I will present recent attack trends in conjunction with the research trends to identify the source of the problem that allowed us to generate our hypothesis.\n\nBased on this observation, I will present novel attack techniques and the experiment that allowed us to verify that the OAuth 2.0 security guidance is under-specified empirically. Finally, I will explain end-to-end attack scenarios that combine our attack techniques with common web application vulnerabilities, ultimately resulting in a complete compromise of the secure delegated access that OAuth 2.0 promises."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "End of year celebration!",
        "date": "2023-12-04",
        "time": "6:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/297536830",
        "timezone": "Australia/Brisbane",
        "description": "Join us in celebrating yet another end to an amazing year.\nThis meetup will be different from the rest, no presentations this time around, rather a catch up with all you hackers, security experts and enthusiasts alike.\nNothing but drinks, food, chats (about sweet hacks you’ve done or things you’ve heard about if you’re down) and hangz.\nHope to see you there!"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "Introduction to Application Security\n",
        "date": "2023-12-11",
        "time": "3:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/297626784",
        "timezone": "Africa/Cairo",
        "description": "Join us for an on-site event with the Future University in Cairo to learn about the fundamentals of application security. This event will cover the OWASP Top 10 project, which outlines the top 10 most critical security risks for web applications. You will have the opportunity to engage in a Q&A session with industry experts and gain valuable insights into securing your applications.\n\nEvent Agenda:\n- Introduction to OWASP and the importance of application security\n- Overview of the OWASP Top 10 project and its relevance to the industry\n- Deep dive into the top 3 security risks and their impact on applications\n- Case studies and real-world examples of security vulnerabilities\n- Q&A session with industry experts\n- Networking and opportunities to connect with peers and professionals in the field\n\nWe look forward to seeing you at this informative and interactive event!"
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A night of Backdoors & Breaches with a virtual touch of John Strand",
        "date": "2023-12-05",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/297344292",
        "timezone": "Europe/Copenhagen",
        "description": "*Following our return from hibernation in September, OWASP Copenhagen invites you, to join us for a night of Backdoors & Breaches!*\n\nJohn Strand from Black Hills Information Security (BHIS) will join us online and tell us about their incident response game; Backdoors & Breaches, why you should use it and how it can help you raise awareness among your peers\n\nAfterwards Jon Bevers (also from BHIS) will show us how to play Backdoors & Breaches. Jon will also join us online.\n\nJon is one of BHIS' European community ambassadors and travels Europe from his home in Krakow, Poland. Jon was in Copenhagen recently as part of BSides København where he also had the opportunity to talk to you about Backboors & Breaches and he might even have given you a deck already. If not, fear not as we will have plenty of decks to share with you (and keep).\n\nAfter the talk and demo from John and Jon it's time for pizza, drinks and the opportunity to get some hands on experience and try to game for yourself.\n\nWe hope to see you there!"
    },
    {
        "group": "Curitiba",
        "repo": "www-chapter-curitiba",
        "name": "Owasp Curitiba - Segurança desde a concepção do Projeto",
        "date": "2023-12-13",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-curitiba-chapter/events/297614280",
        "timezone": "America/Sao_Paulo",
        "description": "Owasp Curitiba - Segurança desde a concepção do Projeto"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Decembre 2023",
        "date": "2023-12-04",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/297473423",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **Alan** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg OAuth2 and Offensive Security",
        "date": "2023-12-06",
        "time": "7:15+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/297221787",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Omegapoint's office for an awesome evening with food and drinks, and talks about OAuth2 pitfalls and Pentest war stories!**\n\n**Where:** Omegapoint, Rosenlundsgatan 3, 411 20 Göteborg\n\n**Agenda:**\n**17:00 - 17:30:** Welcome to Omegapoint\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n**17:45 - 18:30:** *How to f\\*ck up at OAuth2 while following BCPs*\nBest current practices (BCPs) for implementing OAuth2 and OIDC have undergone many changes over the years. In this presentation we highlight the risks of staying with the ancient (roughly 2019-2021) “current” best practices. The current (circa 2022) BCPs bring many changes, such as deprecation of the implicit flow, required usage of PKCE and the BFF pattern which mitigates some of the previous attack vectors. It takes time for new concepts to fully mature and secure defaults emerge. While following the latest BCPs it’s still possible to make mistakes and end up with a broken implementation. This presentation will show some common OAuth2/OIDC security pitfalls and why it is bad practice to use reverse proxy catch-all routing in your BFF, an OAuth2 client with access to many scopes, together with APIs that do authorization based on just a valid token and scopes. Does your BFF enable authenticated SSRF as a Service? During the presentation we will demonstrate both attacks and defences for a OAuth2/OIDC application running locally.\n**Pontus Hanssen** in an experienced security researcher and penetration tester. He loves to hack everything that blinks or has an IP address. Pontus performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security.\n**Tobias Ahnoff** is an experienced developer and architect with focus on application security. He specializes in implementing authentication flows and authorization for web applications and APIs that manage sensitive data. Tobias performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security. He also gives courses in application security and is an appreciated speaker in OAuth2 and OpenID Connect areas.\n\n**18:30 - 19:15:** Food\n\n**19:15 - 20:00:** *Pentesting War Stories*\nWorking in penetration testing generates quite a few interesting stories\nabout spectacular vulnerabilities found in tested systems.\nOften these stories are not shared outside of a small circle of people.\nThis presentation goes through a selection of vulnerabilities found\nduring assignments in the recent years. The titles of the stories are:\n“The omnipotent client cert” (automotive app), “Next level XSS“ (web),\nNo route to boat” (network), and ”Having a conversation with a door\nhandle\" (embedded).\n**Emilie Barse** is an experienced IT security consultant with a deep\ninterest in security testing and log analysis. She has worked in IT\nsecurity since 2005 and has worked in numerous different industries, and has tested applications, networks, cloud environments, IoT systems, and cars. Emilie has a PhD in computer security from Chalmers University of Technology.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Evaluasi Malware 2023 dan trend Malware 2024",
        "date": "2023-12-21",
        "time": "9:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/297555833",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n• Tool dan standar keamanan aplikasi\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n• Kendali keamanan dan pustaka standar\n• Cabang lokal di seluruh dunia\n• Riset terkini\n• Konferensi lengkap di seluruh dunia\n• Mailing list\n• Dan banyak lagi … di www.owasp.org\nKali ini di OWASP ID akan membahas :\n1\\. Evaluasi Malware 2023 dan trend Malware 2024\nSpeaker : Alfon Tanujaya (Security Enthusiast / Pengamat Sekuriti Vaksincom)\n\nLinkedin : https://www.linkedin.com/in/alfonstanujaya\n\nTopic: OWASP Jakarta - Evaluasi Malware 2023 dan trend Malware 2024.\nTime: Dec 21, 2023 07:00 PM Jakarta\n\nBergabung Zoom Rapat\nhttps://zoom.us/j/95692246978?pwd=VzdvL1QzWE9IZzAweFNYZ2tobW5aQT09\n\nID Rapat: 956 9224 6978\nKode Sandi: 652201\n\nsupported by appsec.co.id"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "New Year's OWASP Chapter Limassol meetup.",
        "date": "2023-12-15",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/297479557",
        "timezone": "Asia/Nicosia",
        "description": "[Location](https://www.google.com/maps/place/BrainRocket/@34.6979542,33.0460735,20z/data=!4m6!3m5!1s0x14e733f291b01fad:0x5ff57bb6ed3f9838!8m2!3d34.6979152!4d33.0461381!16s%2Fg%2F11q_08mvzb?entry=ttu) is the restaurant at the Brain Rocket office.\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the second meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/)! We cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19:00 — TBA\n19:55 — 20:05 A short break\n20:05 — 20:30 TBA\n22:00 — 23:00 — Eat, drink, networking!\n\nWe'll have catering, a cocktail bar, a DJ, and a shisha zone all set up to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2023-12-05",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-london/events/297445289",
        "timezone": "Europe/London",
        "description": "**This event is kindly sponsored and hosted by Thought Machine. There is limited seating available for in-person attendees. Registration required. Please note that all our events are live-streamed on YouTube for the online audience. Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Thought Machine, 7 Herbrand St, London WC1N 1EX\n**Nearest Tube:** Russell Square (Piccadilly Line) - 2 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\n\n**\"E2E Detection Testing\"** \\- George Gilligan\n\nHow do you make sure your detections work in a cloud native organisation? Software engineers have integration tests, reliability engineers have chaos engineering frameworks. Detection engineers lack an equivalent standardised approach to E2E testing. A natural approach is a binary that generates a suspicious event, validates that a suitable alert is generated in your SIEM, closes it, and reports the result. An open source Datadog tool named Threatest does just this. We are working on extending this to work with Elasticsearch, with the hope of automating a huge portion of the work of the red team, and providing constant validation for our detections.\n\n**\"5 Open Source Security Tools All Developers Should Know About\"** \\- Raz Probstein\n\nThe minimum viable security (MVS) approach, enables us to easily bake security into our config files, apps, and CI/CD processes with a few simple controls - and the great part? It’s easily achievable through open-source tooling. In this talk we will focus on five critical security controls that will be integrated as part of the CI/CD pipeline by leveraging some excellent open source tools in addition to custom controls to ensure proper enforcement of MFA via Github Security. These controls will provide a foundational framework for securing your applications from the first line of code, which will make it possible to continuously iterate and evolve your security maturity all the way through advanced layers of security that come with time, as well as increased experience with your deployments, stacks, and security posture. Code examples & demos will be showcased as part of this session.\n\n**\"I Will IDOR Myself In\"** \\- Vangelis Stykas\n\nHow could attackers gain control of hundreds of million devices? In this talk Vangelis explains how attackers can exploit a series of simple, yet critical API flaws that are typical “rush to market” flaws which allow an attacker to control and even use them as an initial foothold in millions of networks. Devices vary from routers to alarms and car chargers. It seems that the era of “central platform” handling that solves a variety of problems (like port forwarding) backfired by re-introducing a number of vulnerabilities that were thought to be long gone.\n\n**SPEAKERS**\n\n**George Gilligan (@ggilligan12)**\nGeorge Gilligan is a security engineer at Thought Machine, where his work includes securing Kubernetes clusters, container security, intrusion detection, security testing, and implementing security policies. George participates in various CTF competitions and his CTF achievements include the Deloitte CTF Qualifier, Scottish Universities Cybersecurity Challenge and Hack Harvard 2018.\nGeorge holds an Offensive Security Certified Professional (OSCP) certification and a BSc (Honours) degree in Computer Science and Mathematics from the University of Edinburgh.\n\n**Raz Probstein (@RazProbstein)**\nRaz comes with years of experience in both leadership and technology, having served not only as Young Ambassador to the state of Israel, as well as headhunted and selected as Young Researcher at the prestigious Weizmann Institute for multi-disciplinary scientific research. Today she serves as a Solution Engineer at Jit, coming to the role with years of experience as a FullStack Engineer and years of experience in a diversity of programming languages from Python, to Javascript and C/C#, from the elite IDF unit 81.\n\n**Vangelis Stykas** (@evstykas)\nVangelis is a Chief Technology Officer at Atropos, and during his free time, Vangelis is helping start-ups secure themselves on the internet.\n\n**TICKETS**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST book your place to be admitted to the event by the building security - your name will be checked against the guest list.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: https://owasp.org/www-policy/operational/code-of-conduct"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "December virtual meet: OWASP tool lunch & learn - Dependency Check",
        "date": "2023-12-13",
        "time": "2:00-06:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/297608399",
        "timezone": "America/Chicago",
        "description": "Join OWASP-MSP chapter leads Zoa Buske and Nathan Larson for a demo of longstanding OWASP flagship project Dependency Check and a discussion of Software Composition Analysis (SCA).\n\nPasscode will be sent out shortly before the event opens.\n\n[https://owasp.org/www-project-dependency-check/](https://owasp.org/www-project-dependency-check/)\n[http://jeremylong.github.io/DependencyCheck/](http://jeremylong.github.io/DependencyCheck/)"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation to create secure by design software.",
        "date": "2023-12-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-12-13",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296623321",
        "timezone": "America/Los_Angeles",
        "description": ""
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "OWASP South Florida Chapter Meeting December 2023 ",
        "date": "2023-12-13",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/297622240",
        "timezone": "America/New_York",
        "description": "We will be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.\n\nPlease join us virtually for our December 2023 Meeting. **Make sure** you **don’t miss this final session of 2023!**\n\nBYOB - Bring Your Own Beverage\n\n**Agenda**\n===\n\n* Chapter update/news\n* Talk by Rohini Sulatycki\n* Virtual Networking\n\n**Talk Title:** Zero Trust Demystified - NIST 800-207 and the CISA ZT Maturity Model\n**Talk Summary:** This is a fast paced session that will cover the following.\n\n* What is Zero Trust?\n* What are the challenges in ZT adoption?\n* How does NIST 800-207 define a Zero Trust Architecture?\n* Review the CISA ZT Maturity Model v2"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Pub evening - Lucia OWASP meet up and after-work near Odenplan",
        "date": "2023-12-13",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/297092224",
        "timezone": "Europe/Stockholm",
        "description": "Time for a Lucia/near xmas get together. This is the perfect opportunity for all of us app-sec interested folks to get together and meet up in real life for a relaxed chat and maybe a beer or some other refreshments.\n\n When: 13th December, 2023\n Where: The Old Brewer - Public House & Dining Room at Luntmakargatan 98, 113 51 Stockholm\n\nExpect:\n Quick AppSec Tips\n Networking\n Drinks & Laughter\n\nThe meeting will start at 17:00, but it's a casual event so turn up when it suits."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Call for Speakers and Venues: Sydney OWASP Chapter Meetup in 2023!",
        "date": "2023-12-31",
        "time": "2:00+11:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/292598127",
        "timezone": "Australia/Sydney",
        "description": "The Sydney OWASP Chapter is dedicated to fostering a thriving community focused on application security and collaboration among industry professionals. With our goals of promoting equality, education, and community, we're excited to announce that we're actively looking for speakers and venue hosts for our upcoming events throughout the year.\n\n**Call for Speakers**\nDo you have a passion for cybersecurity and would like to share your expertise with our growing community? We invite you to submit a talk proposal for our upcoming meetups! This year's theme revolves around diverse applied topics in cybersecurity. We welcome presentations from experienced speakers, as well as those giving their first talk.\n\nTo submit your proposal, please email the following details to [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org):\n\n* Proposed topic\n* Abstract (100-200 words)\n* Brief speaker bio (100-200 words)\n\n**Call for Venues**\nWe're also searching for venue hosts who can accommodate 30-50 attendees and provide a screen for presentations. Hosting an OWASP meetup is a fantastic opportunity to demonstrate your commitment to security excellence while supporting the cybersecurity community. Please note that hosts are expected to cater pizza and beverages for attendees.\nIf you're interested in becoming a venue host, please reach out to us at [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org).\n\nBy contributing as a speaker or venue host, you're helping to advance our mission of fostering collaboration, education, and diversity within the cybersecurity field. We look forward to hearing from you and hope to see you at our next event.\n\nDeb, Blair, and Nick\nOWASP Sydney Chapter Committee"
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Cybersecurity Careers: Insights from a Panel of Security Leaders",
        "date": "2023-12-14",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/296891549",
        "timezone": "America/New_York",
        "description": "Join a panel of leaders in the Cybersecurity field, talk about their career journey, and offer advice."
    },
    {
        "group": "Tallinn",
        "repo": "www-chapter-tallinn",
        "name": "OWASP Tallinn - Cybersecurity & AI - Vol. 1",
        "date": "2023-12-15",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-tallinn-chapter/events/297697716",
        "timezone": "Europe/Tallinn",
        "description": "** Welcome to the Inaugural Event of OWASP Estonia: Cybersecurity & AI - Vol. 1 **\n\n Get ready to dive into the world of AI technology and cybersecurity at our first-ever event! We are thrilled to present a lineup of distinguished speakers and groundbreaking topics.\n\n **Featuring a Core Member from OWASP Top 10 LLM:** Delve into the depths of cybersecurity with insights from a key figure behind the renowned OWASP Top 10 for large language models. Learn about the latest trends, challenges, and strategies in securing large language models and AI systems.\n\n **TalTech’s Cybersecurity RA for AI-Driven Autonomous Ships:** Join our guest from TalTech, a leading assistant researcher in cybersecurity, specializing in AI-driven autonomous ships. Discover how AI is revolutionizing maritime technology and the critical role of cybersecurity in this innovative domain.\n\n **And That's Not All - More Surprises Await!** Whether you're a cybersecurity professional, a tech enthusiast, or just curious about the future of AI, there's something for everyone.\n\n **Connect, Collaborate, and Create:** This event is more than just talks - it's a platform to connect with like-minded individuals, collaborate on ideas, and contribute to the ever-evolving field of cybersecurity and AI.\n\n **Mark Your Calendars:**\nFriday 15th December at 18:30 - 20:30\nWIP Maakri 19, Tallinn\n\n **Join us at OWASP Estonia's inaugural event, Cybersecurity & AI - Vol. 1!**"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "ISSA / OWASP Tampa Chapters Q4 Year-end Minicon",
        "date": "2023-12-06",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/296916076",
        "timezone": "America/New_York",
        "description": "**Welcome to our joint ISSA & OWASP End of Year Minicon!**\n\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This half day minicon will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda:**\n\n* 8:30am - Registration\n* 9:00am - First Talk: Tsvi Korren, Field CTO Aqua Security\n* 10:00am - Second Talk: Tony Cook, Sr. Dir, DFIR & Threat Intel\n* 11:00am - Third Talk: Jadee Hanson, CISO Code42\n* 12:00pm - Lunch\n\n**Speakers:**\n\n* Tsvi Korren has been an IT security professional for over 25 years. In previous positions at DEC and CA Inc., he consulted with various industry verticals on the process and organizational aspects of security. As the Field CTO at Aqua, he is tasked with delivering commercial and open source solutions that make Cloud Native workloads the most secure, compliant and resilient application delivery platform.\n* Tony Cook is the Sr. Director of DFIR & Threat Intelligence on GuidePoint Security’s consulting team, where he manages digital forensics and incident response engagements on behalf of the firm’s clients. His career background includes high-level national security activities in cybersecurity operations for several clients over various verticals.\n* Jadee Hanson is the Chief Information Security Officer at Code42, where she is responsible for business technology strategy and purchasing, as well as leading global risk and compliance, security operations, incident response, and insider threat monitoring and investigations.\n\n**Location:**\n3030 N Rocky Point Drive W\nSte 600\nTampa, FL\n\n**Sponsors:**\n[Aqua Security](https://www.aquasec.com/)\n[Code42](https://www.code42.com/)\n[GuidePoint Security](https://www.guidepointsecurity.com/)"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #24: Bug Bounty and Cloud Security [ONLINE]",
        "date": "2023-12-14",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/297677302",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be Online\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter. Theme sessions - Theme: Bug Bounty and Cloud Security\n**`18:00`**` Welcome participants`\n**`18:15`**` Introduction, OWASP News & Updates - Catalin Curelaru`\n**`18:30`**` Bug Bounty(Again) - Tomi Koski (Visma)`\n**`19:00`**` The bigger picture - Ovidiu Cical (Cyscale)`\n**`19:30`**` Networking`\n**Tomi Koski** \\- Red Team Engineer @ VISMA \\| Tomi Koski has been working with IT\\-systems for many moons\\, actually since \\(the wonderful\\) 1990’s\\. He is passionate about anything related to security\\, combining both physical and virtual worlds\\. He is a constant learner and very curious person about life and bug bounties\\. Currently\\, he is working for Visma as a Red \\(read: Purple\\) Teamer\n*Bug Bounty(Again)* Abstract: My journey in the world of Bug Bounties, the good and bad. Story about how bug bounties have changed my life and why I think these are super fun and educational.\n**Ovidiu Cical** \\- Cloud Security Architect @ Cyscale \\| Ovidiu is a cybersecurity enthusiast with 20 years of experience in IT\\. Ovidiu speaks at international conferences covering different topics of Cybersecurity and is not a stranger to the pro\\-bono work of running the OWASP chapter in Cluj\\-Napoca for many years in the past\\. Currently\\, he leads Cyscale\\, a cloud security startup developing a product from the heart of Cluj\\-Napoca\\.\n*The bigger picture* Abstract: The bigger picture: a context is critical in understanding your security posture. Why a certain problem in one part of your cloud infrastructure may affect other areas of your cloud apps, how cloud data is secured, and how safe is the rest of your cloud estate."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Privacy by Design (PbD)",
        "date": "2023-12-06",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-toronto/events/297636602",
        "timezone": "America/Toronto",
        "description": "TALK\n\nPrivacy by Design (PbD)\n\nSummary:\n\nThis presentation will discuss Privacy by Design (PbD) and what it can look like when put into practice. PbD will be looked at as a best practice and as a requirement set out by privacy laws and regulations. In this talk, you will learn about the foundational principles of PbD, and concepts to consider that can help you in your role and collaboration with stakeholders.\n\nPresenter:\n\nHoria Tabatabaei Soltani,\n\nHoria is currently the Director (Fellow) of Privacy at Canon Canada. She oversees the development and maturity of Canon Americas (Canada, US, Latin America) privacy program. She is also completing her Masters of Law (LLM) at Osgoode Law School, York University in Privacy and Cybersecurity."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "December Cybersecurity Social",
        "date": "2023-12-14",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248523",
        "timezone": "America/Vancouver",
        "description": "**Biggest Cybersecurity Social of the year!** This Vancouver area Cybersecurity Social is jointly organized by VanCitySec, OWASP Vancouver, and DC604 DEFCON Group. It's a perfect chance to mingle, make new connections, talk shop, geek out, and otherwise have a blast with like-minded folks.\n\nPlease register so we have an idea of how many people are coming (tickets not required for entry). See you there!\n\nDecember 14, 6-9PM at **Relish the Pub**\n\n**Follow us at:**\nOWASP Vancouver: [https://www.meetup.com/OWASP-Vancouver-Chapter/](https://www.meetup.com/OWASP-Vancouver-Chapter/)\nVanCitySec: [https://twitter.com/VanCitySec](https://twitter.com/VanCitySec)\nDC604 (DEFCON group): [https://www.meetup.com/defcon604/](https://www.meetup.com/defcon604/)\nChannels on MARS Slack: **#owasp-vancouver** and **#dc604**\nJoin MARS Slack: [https://fourthplanet.ca/slack/](https://fourthplanet.ca/slack/)"
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "Fundamentos e Melhores Práticas da Inteligência de Ameaças Cibernéticas",
        "date": "2023-12-11",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/297701972",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: Paulo Trindade\nTema: Os Fundamentos e as Melhores Práticas da Inteligência de Ameaças Cibernéticas na Prevenção de Ataques\nData: 11/12/2023 às 19:30"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-12-13",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889913",
        "timezone": "America/New_York",
        "description": "Welcome to our final 2023 monthly SAMM community call Wednesday 13th December, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EST.\n\nJoin Zoom Meeting: [Zoom link.](https://zoom.us/j/96866048960?pwd=TmZkTSs3ZmlWU09DbHJoSnVZWmdiUT09)"
    }
]