[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Project Spotlight - OWASP SAMM",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/293864175",
        "timezone": "America/New_York",
        "description": "Interested in learning how to secure your software development lifecycle? Then join us as we dive deep into the OWASP Software Assurance Maturity Model (SAMM), a technology and process agnostic framework that helps to provide an effective and measurable way for you to analyze and improve your secure development lifecycle. Our speaker, Christian DeHoyos, will walk through its history, use cases, benefits, and how one can quickly leverage OWASP SAMM at their org."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - June 2023 (Online)",
        "date": "2023-06-27",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705746",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- Coming Soon\\!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 24 June 2023 ",
        "date": "2023-06-24",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/294034192",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 24 June 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n*\n* Securing IoT on the Home Network by **Vedant Khandelwal**\n* OAUTH vulnerabilities by **Soujanya Namburi**\n* AWS serverless pentesting by **Divyanshu shukla**\n* Policy based Kubernetes Security Using KYVERNO by **Ravi**\n* GCP with IAP Security by **Anjali Shukla**\n\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "June Meetup ",
        "date": "2023-06-14",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/293963878",
        "timezone": "America/Los_Angeles",
        "description": "Security time, We will have exciting talks, lots of people to meet, and great food and Drinks. Courtesy our sponsors JIT (https://www.jit.io).\n\n*Jit*\\- An open DevSecOps Orchestration Platform allows high\\-velocity Engineering teams to own product security while increasing dev velocity\\.\n\n5PM to 5.45PM Networking, food/Drinks\n5.45 PM to 8 PM Talks\n\nComplete talk descriptions will be updated soon.\n\nTalk #1: \"Securing a cloud app: from threat modeling to Continuous Security\"\n(basically I am doing is an extended talk based on the MVS one for Python apps)\n\nAbstract:\nIn this presentation, we will delve into the process of securing a cloud hosted application, using a Python-based app as our demonstrative model, from scratch. Our initial focus is on the initial crucial step of threat modeling, demystifying the process for beginners and offering a deep-dive into the identification, analysis, and prioritization of potential security risks across the codebase, infrastructure, CI/CD pipeline, and runtime.\n\nFurther, we will explore how these identified risks can be mapped to security tools using open-source security (OSS) tools, including some developed by OWASP.\n\nThe final part of our journey takes us through the seamless integration of these tools into the Continuous Integration/Continuous Deployment (CI/CD) pipeline. Utilizing Github Actions as a case study, we will show how to build and automate a security-focused workflow, ensuring a constantly secure state for your application.\n\nBy attending this session, you'll gain practical insights and tools to build secure cloud applications, maintain an efficient CI/CD pipeline, and tackle the dynamic cyber threat landscape with confidence and foresight. Stay a step ahead in your application security with continuous and integrated security measures.\n\nSpeaker: David Melamed CTO JIT\n\nTalks #2: Career growth topic for Appsec professionals\n\nSpeaker: Trupti Shiralkar, Sr Manager Product Security at Datadog and Deidre Diamond Founder CyberSN\n\nTalk #3: Drowning in APIs - How to improve your API security with proper inventory, prioritization, and automation\n\nSpearker: Nick Hawley, Practice Manager Optiv"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "The Risks of Hardcoding Secrets in AI-Generated Code",
        "date": "2023-06-14",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/293890172",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person or online (link to be provided).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nFor our June meeting, Julie Peterson, Senior Product Marketing Manager at Cycode, will be speaking to the chapter about The Risks of Hardcoding Secrets in AI-Generated Code.\n\nMachine learning, particularly Language Learning Models (LLMs), has paved the way for groundbreaking advancements in many fields, including code generation. However, this innovation is not without inherent risks. One potential issue is that these models generate code with hardcoded secrets, such as API keys or database credentials. This practice stands in stark contrast to the recommended way of managing these secrets – through a secrets manager.\n\nIn this presentation, we consider the following:\n\\- What are hardcoded secrets and how to prevent them\n\\- The importance of secrets management\n\\- The impact of LLMs in generating code\n\\- How to mitigate the risk of hardcoded secrets in code generated by LLM\n\nThis will be an exciting session, RSVP now!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "PCI - The Good, The Bad and the Ugly",
        "date": "2023-06-20",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/293853720",
        "timezone": "Australia/Brisbane",
        "description": "Intro - Craig & Michael\nPCI - What is it?\nPCI Projects - The Game Plan\nApp Sec Deep(ish) Dive\nAuditor Whispering\nWar Stories\nIs PCI DSS Effective? The Verdict\n\nEvent location will be announced soon."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Browser Extension Security, and Scripting for Web Application Testers",
        "date": "2023-06-15",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/290892060",
        "timezone": "Europe/London",
        "description": "In-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.\n\n**Agenda:**\n\n* OWASP Updates\n* Talk 1: Browser extension security, with Billy Sheppard from Immersive Labs\n* Break\n* Talk 2: Intro to Scripting for Web Application Testers with Alex Archondakis\n* Networking\n\n**Venue:**\nPhoto shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard).\n\nAddress: 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ\n\n\\-\\-\\-\n\nTalk 1: **A look into browser extension security**, the risks involved with allowing users to install browser extensions and browser security/attack vectors, presented by **Billy Sheppard**.\n\n**Abstract**: As web technologies are becoming more and more popular, you need to be more careful about what you put in your browsers. While extensions can be very useful, they come with hidden dangers – users often prioritise functionality over safety. In this talk, you'll uncover the real risks of using extensions, explore common attacks, and learn about pitfalls. You'll also take a look at some real-life security incidents and what went wrong. You'll leave with a deeper understanding of the need for browser extension security and how to safeguard your browser.\n\n**Bio:** Billy Sheppard is a Bristol-based Senior Application Security Engineer working at Immersive Labs where he creates Secure Code content and challenges for their product.\n\nIn his career thus far, he has earned several achievements including VDP submissions for Fortune 500 companies, Bug bounties, and created and released his own niche CTF/Hacking challenge specifically aimed at increasing security awareness for ServiceNow developers. He has also created a Web Security YouTube Channel to demonstrate security concepts and educate developers and reported multiple real security issues to VDPs/Bug Bounty Programs for large companies such as BBC, RedHat and Accenture. He is a keen learner and spends a lot of his personal time continuously learning and is passionate about education around secure code.\n\n\\-\\-\\-\n\nTalk 2: **An Introduction to scripting for Application Testers,** presented by **Alex Archondakis**.\n\n**Abstract**: Scripting, or the ability to write code that allows you to perform actions or automate repetitive tasks is a crucial tool in any application security testers belt, however, it doesn’t seem to be a common one.\n\nThe purpose of this talk is to introduce scripting to application security testers, this will be achieved by looking at case studies to determine where scripting may be appropriate and how to solve the problem. We will discuss multiple languages and their advantages whilst focussing on interacting with the HTTP protocol.\n\nThe key learning points from this talk are as follows:\n\n* To gain an understanding of the importance of scripting for application security testers\n* What programming languages are used, and their advantages/disadvantages.\n* Typical scenarios where scripting is required because tooling is not comprehensive enough\n\n**Bio**: Alex is head of professional services & a senior consultant at Pentest People. He has a wealth of experience in penetration testing, people management and training hackers. He believes that all application security professionals should be able to write basic scripts to solve common problems."
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Cairo Chapter Event at CIASEC",
        "date": "2023-06-12",
        "time": "2:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/293931877",
        "timezone": "Africa/Cairo",
        "description": "OWASP Cairo Chapter will have a separate room during CAICES event with a free registration.\nThese sessions are served on the way of First Come, First Served. The room has limited seats. If you are interested in attending, please be there before the first OWASP session starts in a reasonable amount of time.\n\nPlease make sure to register using the following link:\nhttps://www.eventbrite.com/e/owasp-cairo-chapter-in-caisec-cyber-security-event-tickets-648988942397\n\nEven Agenda:\n\n13:00 - 13:45 Topic title: From traditional SDLC to DevSecOps\nSpeaker: Ahmed Abdallah\n13:45 - 14:30 Workshop title: Session Management\nSpeaker: Mohamed Amgad\n14:30 - 15:15 Workshop title: Implementing DevSecOps using OWASP free tools\nSpeaker: Ahmed Abdallah\n15:15 - 16:00 Topic title: AppSec Lessons from Battlefield\nSpeaker: Mohamed El-Fateh\n16:00 - 17:00 Discussion panel: Application Security Challanges in the Middleast"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP API Top 10 Awareness",
        "date": "2023-06-10",
        "time": "9:30+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/293990207",
        "timezone": "Africa/Cairo",
        "description": "A foundational element of innovation in today’s app-driven world is the API. From banks, retail and transportation to IoT, autonomous vehicles and smart cities, APIs are a critical part of modern mobile, SaaS and web applications and can be found in customer-facing, partner-facing and internal applications. By nature, APIs expose application logic and sensitive data such as Personally Identifiable Information (PII) and because of this have increasingly become a target for attackers. Without secure APIs, rapid innovation would be impossible.\n\nAPI Security focuses on strategies and solutions to understand and mitigate the unique vulnerabilities and security risks of Application Programming Interfaces (APIs).\n\nLocation: Online Event, we will have a live streaming for the event through chapter Youtube channel:\nhttps://www.youtube.com/channel/UCOmffRRYZSpYOiJQp15NHQA\n\nDate: 10 June 2023\n\nAgenda:\n\n1- Session 1: OWASP API Top 10 - Part One [By Mahmoud Elhendy]\n2-Session 2: OWASP API Top 10 - Part Two [By Ahmed Abdallah]"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS June 2023",
        "date": "2023-06-22",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/294021716",
        "timezone": "America/Denver",
        "description": "Speaker: Stan Richister, Social Engineering: How and Why it Works (A “soft” Kill is Still a Kill).\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP June Meet ",
        "date": "2023-06-20",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/293404993",
        "timezone": "America/Chicago",
        "description": "\"Common Security Considerations for Web 3.0”\n\nJoin this virtual event to discuss:\n\n* an overview of decentralization\n* digital identities in 3.0 and typical threats\n* examples of Web 3.0 attacks and mitigations\n* security concerns and some actions to consider to protect organizations."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Join us LIVE and IN-PERSON for Denver OWASP's June Meetup",
        "date": "2023-06-21",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/293553304",
        "timezone": "America/Denver",
        "description": "**As always, everyone is welcome! You do NOT have to be an OWASP member to attend.**\n\nJoin us June 21st for food, drinks, networking and a super informative presentation on \"The Joys of Mobile Application Testing\" from one of the best and brightest in the industry: Greg Leonard. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to our Denver OWASP sponsor [SpyderSec](https://spydersec.com)**\n\n**Presentation Title:** The Joys of Mobile Application Testing\n\n**Presentation Details:** In this talk, I will walk through the major challenges of testing mobile applications. This will include reliably capturing HTTPS traffic between the app and it's backend APIs, reviewing data stored by the app on the mobile device, working around defenses built into many apps, and discussing some obstacles that need to be worked around with modern mobile operating systems."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "Adopting DevSecOps for faster and more secure SDLC",
        "date": "2023-06-15",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/293758240",
        "timezone": "Asia/Dubai",
        "description": "Accelerate your software delivery with DevSecOps culture!\n\nJoin our free webinar led by Ahmed Abdallah, a Senior Solutions Architect and Cyber Security Consultant, and learn about all things DevSecOps.\n\nIn this session, participants will gain further knowledge on the importance of the concept and discover how integrating security throughout the software development process can enhance speed, quality, and overall success."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Juin 2023",
        "date": "2023-06-12",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/293778948",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **TotalEnergies** que nous remercions chaleureusement de leur soutien.\n\n**Date limite d'inscription: jeudi 8 juin**\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\n*--*\n*Pour des raisons de sécurité d'accès aux locaux de notre sponsor, il est nécessaire de fournir votre nom et prénom pour ce meetup. **Une pièce d'identité sera demandée** pour l'obtention d'un badge d'accès. Nous vous remercions de votre compréhension.*\n*--*\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-06-12",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/293371130",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lima",
        "repo": "www-chapter-lima",
        "name": "OWASP Meeting Junio 2023",
        "date": "2023-06-21",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/owasp-lima-meetup-group/events/293986407",
        "timezone": "America/Lima",
        "description": "**OWASP Meeting Junio 2023**\nReunión Mensual de Seguridad de Aplicaciones\n\n**PRESENTACIONES:**\n\n***Técnicas de evasión de sistemas de detección y prevención de intrusiones (IDS/IPS) - Aleida Pérez* (MX)**\n¿Te gustaría conocer las estrategias utilizadas por los hackers para evadir los sistemas de seguridad más avanzados? ¿Quieres estar un paso adelante en la protección de tu red?\nEn esta charla, profundizaremos en las técnicas de evasión de IDS/IPS. Aprenderás cómo los atacantes logran evitar la detección y el bloqueo de los sistemas de seguridad, y cómo puedes fortalecer tus defensas para proteger mejor tu infraestructura.\n\n***Ciberseguridad para Todos - Alejandra Figueroa* (MX)**\nSe abordarán la historia de la ciberseguridad, los conceptos principales, herramientas, cómo incursionar en el área, campo laboral y experiencias personales."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUN 28, 2023",
        "date": "2023-06-28",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/292955470",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Security Architecture - What is it? How to Deploy it\nJoin us for great networking, dinner and drinks, and see a presentation by President and Founder of iSecurePrivacy, LLC.\n\n**ABSTRACT**: Security Architecture is a security design that addresses the technology goals, approaches, controls, and potential for the enterprise. It also specifies when and where to apply security controls. This discussion starts from the enterprise perspective using SABSA (Sherwood Applied Business Security Architecture). It then introduces COBIT, from ISACA, which is a framework that focuses on the governance and management of enterprise IT. TOGAF (The Open Group Architecture Framework) aligns security with business needs. Then there is the OWASP SAMM (Software Assurance Maturity Model) that is a framework for helping organizations analyze their current software security practices in the development of new applications. Within these four security architectures, we will also talk about some software secure coding standards such as (PCI Software Security Framework, SEI CERT Coding Standards, NIST SSDF, Microsoft Secure Coding Guidelines , and OWASP Secure Coding Practices). These standards are important, but they need to be based on meeting the business strategic objectives, business model, and business needs. That is what security architectures provide.\n\n**Thanks to our Sponsor**: *[Prisma Cloud](https://www.paloaltonetworks.com/prisma/cloud)*\n*The Most Complete Cloud-Native Application Protection Platform (CNAPP). Prisma Cloud secures applications from code to cloud, enabling security and DevOps teams to effectively collaborate to accelerate secure cloud-native application development and deployment.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Madison",
        "repo": "www-chapter-madison",
        "name": "June Meeting",
        "date": "2023-06-13",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-madison/events/293553420",
        "timezone": "America/Chicago",
        "description": "Requested Topics:\n\n* Discuss the Open Letter to OWASP and the Response/Updates\n\nhttps://owasp.org/blog/2023/03/10/strategic-plan-open-letter-update.html\nhttps://owasp.org/blog/2023/03/31/owasp-strategy-2023-1.html\n\n* Industry Roundtable: initiatives, struggles, successes from the Madison Metro AppSec Space\n* Jazzer Demo https://github.com/CodeIntelligenceTesting/jazzer"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/293695815",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS), the OWASP Mobile Application Security Verification Standard (MASVS), and OWASP Mobile Application Security Testing Guide (MASTG) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. Come join us!\n\n\\*Food and drinks will be provided by NowSecure\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "Save the Date - OWASP New Zealand Day 2023",
        "date": "2023-07-04",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/287977420",
        "timezone": "Pacific/Auckland",
        "description": "As plans for the event come together, we'll add details here."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Anatomy of a Breach: Dissecting Cloud Security",
        "date": "2023-06-29",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/293621833",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\nCloud security presents unique challenges. As enterprises continue to move to the cloud, security practitioners face new threats and paradigms. In this session, we’ll forensically reconstruct major cloud-centric breaches and step through them, building an understanding of what happened, how it happened, and developing key takeaways to help secure our own infrastructure, especially in AWS, Azure, and GCP.\n\n**Code of Conduct:**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**Sponsorship:**\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter 2: OWASP Meet Up",
        "date": "2023-07-05",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/292660571",
        "timezone": "Europe/London",
        "description": "***PLACEHOLDER EVENT - PLEASE RESPOND TO UNDERSTAND AVAILABILITY***\n\nEach Chapter meeting will be focus on a different element of Cyber. To not limit creativity - this will be agreed once the request for speakers/sponsors/demos has been closed.\n\n**Location:** The Brewery Tap [availability pending]\n\n**We are looking for:**\n\n* Sponsors [to enable the event]\n* Speakers [to learn from & showcase]\n* Demos [to showcase practicals]\n\n**SPEAKERS:** If you want to speak or showcase anything - hit this link -> https://forms.gle/k1xnqmuGbHE5zsvUA\n\n**SPONSORS:** If you'd like to sponsor the event - please contact Ryan.winstanley@owasp.org.\n\nThank you,"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-06-29",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/293991357",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "AppSecDays PNW ",
        "date": "2023-06-10",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/292707041",
        "timezone": "America/Los_Angeles",
        "description": "Joins us for a conference in person in Portland Oregon June 10th (tickets required)\n\n[https://www.appsecpnw.org/](https://www.appsecpnw.org/)\n\nTickets [https://www.eventbrite.com/e/3rd-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-558186820807](https://www.eventbrite.com/e/3rd-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-558186820807)"
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/293695815",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS), the OWASP Mobile Application Security Verification Standard (MASVS), and OWASP Mobile Application Security Testing Guide (MASTG) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. Come join us!\n\n\\*Food and drinks will be provided by NowSecure\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "June Meetup",
        "date": "2023-06-21",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/293615825",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of each month. We will announce topics 2-3 weeks in advanced of our meetups.\n\n7PM-9PM\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Community Topics\n* Presentation TBD"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838145",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838144",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "OWASP AppSec Days PNW 2023",
        "date": "2023-06-10",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292199099",
        "timezone": "America/Los_Angeles",
        "description": "A collaboration between the **Vancouver, Portland, Victoria, and Seattle** chapters taking place **June 10, 2023** at **Portland Center Stage.**\n\nThe CFP for AppSec PNW is OPEN and you have until April 3rd to submit a presentation. You don't want to miss on this opportunity to speak, submit your CFPs soon!\nhttps://bit.ly/AppSecPNW2023CFP\n\nGet your tickets now for the event, there are only a few available spots in the Early Bird registration:\nhttps://bit.ly/AppSecPNW2023Tickets"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - June Encore 2023",
        "date": "2023-06-27",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/293587120",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - June 2023",
        "date": "2023-06-13",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/293587091",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "¿CÓMO IDENTIFICAR UN CORREO ELECTRÓNICO PHISHING?",
        "date": "2023-06-16",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-tegucigalpa-chapter/events/293849484",
        "timezone": "America/Tegucigalpa",
        "description": "**Tema: Phishing**\nEs una técnica de ingeniería social que consiste en el envío de correos electrónicos que suplantan la identidad de compañías u organismos públicos y solicitan información personal y bancaria al usuario.\n\nEste método sirve para engañarle y hacer que comparta contraseñas, números de tarjeta de crédito, y otra información confidencial haciéndose pasar por una institución de confianza en un mensaje de correo electrónico o llamada telefónica"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #22: Cloud Security & CyberSec Ecosystem [IN-PERSON]",
        "date": "2023-06-08",
        "time": "8:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/293548265",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\nTheme sessions - Theme: CyberSec Ecosystem & Cloud Security\n\n`Schedule` **`Time:`**` 18:00 to 21:00`\n\nIntroduction, OWASP News & Updates - Catalin Curelaru\nCyberSecurity Ecosystem - Octavian STANCU (Eviden/an Atos business)\nSecurity Log Management - Adrian PAUL (Visma)\nImproving security in AWS Cognito - Lucian Patian (Haufe)\n\nLocation of the event: UBC3, et 10, Sediu VISMA, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by VISMA\n\nMore about the speakers and topics:\n**Octavian STANCU** is an experienced Unit Lead and IT Instructor with a demonstrated history of working in the Information Technology industry, specifically in the fields of Cybersecurity, Networking and Telecommunications. As the Head of Cybersecurity Services, Octavian brings within Global Delivery Center Romania extensive expertise and a strong track record in managing and delivering Cybersecurity services and solutions.\n\n**Adrian PAUL.** I love information technology, passionate to learn about it, and always looking to put the pieces together. Currently, in the conspicuous role of managing the Cyber Security Engineering team that is in charge of implementation, maintenance and development of multiple security services at Visma. When time permits, I enjoy running and volunteering.\n\n***\\~Security Log Management\\~***\nEnsuring the confidentiality, integrity, and availability of the modern digital enterprise is not an easy task. It involves many parallel and related efforts, from systems engineering to effective cybersecurity policy and comprehensive workforce training. The essential elements in cybersecurity operations are monitoring, analyzing, responding to, and recovering from cyber attacks. Behind the scenes, programs and policies must be put into place to support cybersecurity operations.\n\nOrganizations are starting to use cloud computing to take advantage of its many benefits, including cost savings, quick time-to-market, and on-demand scaling of the environment. To improve security visibility in the cloud, security operations teams will want to develop a continuous monitoring strategy that uses a combination of cloud-native services and third-party options for the Security Log Management solution. The strategy needs to provide the most complete range of coverage for both proactively assessing the environment and detecting unusual events or anomalous behaviour rapidly. Additionally, a Security Log Management focused on automation and machine learning, alongside new and updated types of monitoring, will evolve into a Next-generation Security Information and Event Management (NG-SIEM) solution.\nLogging is a vital part of cybersecurity, as it enables you to detect breaches and identify their source. With a robust Security Log Management solution, you can monitor your environments for unusual activity and take action to stop it before it develops into a full-blown attack. By taking the time to develop a comprehensive logging strategy, you can not only mitigate the potential damage of a cyber attack, but also learn important lessons about how to improve your solution for the future\n\n**Lucian Pătian** is a Cloud Solutions Architect at Haufe Group Timisoara. With a SysAdmin background, for the past four years, he has earned a reputation for finding creative solutions to problems in Cloud.\n\n***\\~ Improving security in AWS Cognito. \\~***\nAbstract: we will discuss about why using the standard configurations in Cognito can make your application a security honeypot. How can you use AWS WAF to add an extra layer of protection and why using verified token attributes should be a must."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP x Project Calico x Okta | Container and Kubernetes security policy design",
        "date": "2023-06-15",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/293475436",
        "timezone": "America/Toronto",
        "description": "\\*\\*\\* THIS TALK IS BOTH ONLINE (https://www.youtube.com/watch?v=eMSnga3arIA) and OFFLINE @ the Okta offices \\*\\*\\*\n\n**TALK**\n\n**Container and Kubernetes security policy design: 10 critical best practices**\n\n**Summary:**\n\nCompanies are constantly seeking new and innovative ways to stay ahead in a highly competitive and rapidly changing business landscape. One strategy that has proven to be highly effective is application modernization. This is not just a mere upgrade; it is a complete transformation of how businesses operate. By embracing this approach, companies can accelerate innovation, optimize costs, and improve their overall security posture.\n\nHowever, embarking on the journey of application modernization is not an easy task. It requires a significant investment in people, processes, and technology to achieve the desired business outcomes. The right foundation must be established from the beginning to avoid the high cost of re-architecture, which can be a major roadblock in achieving success. One crucial aspect is developing a standard and scalable security design for their Kubernetes environment. This will establish the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\nIn conclusion, application modernization is a strategic initiative that can transform businesses. Developing a standard and scalable security design for the Kubernetes environment is critical to establishing the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\n**Presenter:**\n\n**Regis Martins**\n\nRegis Martins is a passionate problem solver and technologist with a deep-rooted love for finding innovative solutions. With a background in Electrical Engineering and a Master's Degree in Computer Science, he has honed his expertise in areas such as deep packet inspection technologies, traffic management, network analytics, and Kubernetes. His journey has led him to excel as a Sales Engineer, where he architects solutions, educates clients, and thrives in helping organizations overcome challenges. With a diverse skill set encompassing Python, Linux, virtualization, cloud computing, and more, Regis is committed to making a positive impact in the world of technology through continuous innovation and knowledge sharing."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2023-06-29",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/293768575",
        "timezone": "America/New_York",
        "description": "TBA"
    }
]