[
    {
        "group": "Aligarh",
        "repo": "www-chapter-aligarh",
        "name": "OWASP Chapter Talk Series - Crypto currencies and the Secure coding practices",
        "date": "2021-12-26",
        "time": "14:00",
        "link": "https://www.meetup.com/OWASP-Aligarh-Meetup-Group/events/278656640/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Agenda:<br/>--&gt; GeneralOWASP Chapter discussion</p> <p>--&gt; OWASP Chapter Talk Series - Crypto currencies and the Secure coding practices</p> <p>--&gt; Any real OWASP Top 10 example and its mitigation by W3LC</p> <p>--&gt; Future plans</p> "
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Top 10 V2021 Awareness - A3 A4",
        "date": "2021-12-18",
        "time": "10:30",
        "link": "https://www.meetup.com/OWASP-Cairo-Chapter/events/282636105/",
        "timezone": "Africa/Cairo",
        "description": "<p>OWASP Top 10 Awareness Program</p> <p>The OWASP Top 10 is a powerful awareness document for web application security. It represents a broad consensus about the most critical security risks to web applications.</p> <p>The second day of the awareness program includes four sessions covering 3rd and 4th items of OWASP top 10 risks and Mitigations.</p> <p>Location: Online Event,<br/>Please follow chapter's Youtube channel to join the Event.<br/><a href=\"https://www.youtube.com/channel/UCOmffRRYZSpYOiJQp15NHQA\" class=\"embedded\">https://www.youtube.com/channel/UCOmffRRYZSpYOiJQp15NHQA</a></p> <p>Date: 18 December 2021</p> <p>Event Agenda:</p> <p>1- Using HTTP Proxies for Web Apps Pentesting [By: Ahmed Abdallah] 10:30 to 11:00<br/>2- A03:2021-Injection [By: Mohamed Galal] 11:00 to 12:00<br/>3- A04:2021- Insecure Design [By: Mohamed Alfateh] 12:00 to 12:45<br/>4- Online Competition &amp; Event Closing 12:45 to 13:30</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP January Meeting",
        "date": "2022-01-18",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/280898991/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>Using the Threat Modeling Manifesto to Build an Enterprise Threat Modeling Program</p> <p>Description:</p> <p>The concept of threat modeling, while not new, is more imperative today than ever before. It's a foundational part of building a security culture and uncovers potential security issues before they slip into production.<br/>Proactively protecting data from the app to the API requires modeling potential attacks to mitigate weak points before bad actors find them. A team of 15 security veterans and experts, including Chris Romeo, CEO of Security journey, created the Threat Modeling Manifesto. Chris is a veteran security expert focused on developing a security culture through training and education. During this session, he will discuss why a manifesto, how you can use it as a foundational piece of your threat modeling program, and practical application tips for building an Enterprise-class threat modeling program.</p> <p>Bio:</p> <p>Chris Romeo is CEO and co-founder of Security Journey and is a builder of security culture influencing education. His passion is to bring security culture change to all organizations, large and small, by providing gamified security programs. Chris is a highly rated industry speaker and trainer, featured at RSA Conference, OWASP Global AppSec, and ISC2 Security Congress. Chris was the Chief Security Advocate at Cisco for five years, empowering engineers to shift security left in all products and led Cisco’s security belt program (Cisco Security Ninja). Chris has twenty-three years of security experience, holding positions across the gamut, including application security, security engineering, and incident response. Chris holds the CISSP and CSSLP certifications. For more information, see <a href=\"https://www.linkedin.com/in/securityjourney/\" class=\"linkified\">https://www.linkedin.com/in/securityjourney/</a><br/>To book Chris for you event, please contact speaking@securityjourney.com.</p> "
    },
    {
        "group": "Dkte Soc Textile And Engineering Institute",
        "repo": "www-chapter-dkte-soc-textile-and-engineering-institute",
        "name": "OWASP DKTE Meetup #2 (Virtual)",
        "date": "2021-12-26",
        "time": "17:00",
        "link": "https://www.meetup.com/owasp-dkte/events/282663700/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Details<br/>26th December 5:00 PM IST</p> <p>Agenda</p> <p>Offensive Analysis of Android Application by Raja Nagori (IT Security Analyst II at FIS Global)<br/>(<a href=\"https://www.linkedin.com/in/raja-nagori/\" class=\"linkified\">https://www.linkedin.com/in/raja-nagori/</a>)</p> "
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "Series of lightning talks",
        "date": "2022-01-13",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Hamburg-Stammtisch/events/282692845/",
        "timezone": "Europe/Berlin",
        "description": "<p>Hi everyone,</p> <p>this is mostly a \"save the date\" with little content yet. It'll be updated when all data is available.</p> <p>On this day we present a series of lightning talks, online.</p> <p>1) Björn Kimminich: Juice Shop 13: Now with Coding Challenges!\"<br/>2) Nurullah Demir: \" Our (in)Secure Web: Understanding Update<br/>Behavior of Websites and Its Impact on Security\"<br/>3) TBA...</p> <p>1) Abstract<br/>---------------<br/>OWASP Juice Shop 13.x has some juicy new features which will be tough to squeeze into a mini-talk, but let's do it anyway! Learn about the latest additions since the last session at OWASP Hamburg Stammtisch, such as:</p> <p>- Coding Challenges<br/>- Cheat Detection<br/>- Challenge Feedback<br/>- Daily Project Stats</p> <p>Warning: This talk will skip any basic intro part in favor more new content!</p> <p>2) Abstract:<br/>----------------<br/>Software updates take an essential role in keeping IT environments secure. If service providers delay or do not install updates, it can cause unwanted security implications for their environments. This paper conducts a large-scale measurement study of the update behavior of websites and their utilized software stacks. Across 18 months, we analyze over 5.6M websites and 246 distinct client-and server-side software distributions. We found that almost all analyzed sites use outdated software. To understand the possible security implications of outdated software, we analyze the potential vulnerabilities that affect the utilized software. We show that software components are getting older and more vulnerable because they are not updated. We find that 95 % of the analyzed websites use at least one product for which a vulnerability existed.</p> <p>Until then: have a great holiday season and all the best for 2022!</p> <p>Cheers, Dirk</p> "
    },
    {
        "group": "Hartford",
        "repo": "www-chapter-hartford",
        "name": "(Virtual) \"Breaker\" Pen Test security lunch and learn",
        "date": "2021-12-29",
        "time": "12:00",
        "link": "https://www.meetup.com/CT-Cyber-Security-Meetup-OWASP-Hartford/events/282572004/",
        "timezone": "US/Eastern",
        "description": "<p>Agenda:<br/>* OWASP project spotlight focusing on \"Breaker\" (Pen-testing) topics including Nightengale: <a href=\"https://owasp.org/www-project-nightingale/\" class=\"linkified\">https://owasp.org/www-project-nightingale/</a><br/>* Call for volunteers<br/>* 2022 planning</p> "
    },
    {
        "group": "Hyderabad",
        "repo": "www-chapter-hyderabad",
        "name": "OWASP Hyderabad Chapter Meet - December 2021",
        "date": "2021-12-18",
        "time": "10:30",
        "link": "https://www.meetup.com/hyderabad-owasp-meetup-group/events/282604831/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Hello OWASPIANS ,</p> <p>It's a great pleasure to announce the OWASP Hyderabad Chapter December month meetup</p> <p>The following talks are lined up for the day :</p> <p>1. Exotic Magic Hashes: Type Juggling - Mr. Aqeel aka Ciph3r00t</p> <p>Description: In this session, Discuss the=implicit type casting,source code analysis, different avenues of exploitation and exploit development for a type Juggling vulnerability. Discussing OWASP Top A02 in 10 2021.</p> <p>About Mr.Aqeel: Passionate Information Security Engineer with 10 + years of professional experience and currently leading security team @ Servicenow</p> <p>He holds OSCP, CISM, CISA to name few with masters degree in computer science and Engineering.</p> <p>He got accolades from Apple, Microsoft, Google, LinkedIn, Amazon, SAP, Intel, NASA, SANS Institute and others for reporting Critical Security Vulnerabilities</p> <p>Join Zoom Meeting<br/><a href=\"https://us06web.zoom.us/j/83999896072?pwd=NEhtMUVKdHpjdXZva1Z0N2JtSDdsQT09\" class=\"linkified\">https://us06web.zoom.us/j/83999896072?pwd=NEhtMUVKdHpjdXZva1Z0N2JtSDdsQT09</a></p> <p>Meeting ID: 839 9989 6072<br/>One tap mobile<br/>+19294362866,,85053811753# US (New York)<br/>+12532158782,,85053811753# US (Tacoma)</p> <p>Dial by your location<br/>+1 929 436 2866 US (New York)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 301 715 8592 US (Washington DC)<br/>+1 312 626 6799 US (Chicago)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>Meeting ID: 839 9989 6072<br/>Find your local number: <a href=\"https://us06web.zoom.us/u/kb5HByKDCL\" class=\"linkified\">https://us06web.zoom.us/u/kb5HByKDCL</a></p> "
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup Dec 2021",
        "date": "2021-12-27",
        "time": "17:45",
        "link": "https://www.meetup.com/OWASP-Israel/events/282521101/",
        "timezone": "Asia/Jerusalem",
        "description": "<p>We are eager to see you all, and we are sure you are too, with COVID-19 still around, we are required to comply with the green pass guidelines meaning we will need to see proof of vaccination, recovery or a negative test from the past 72 hours for all attendees and please make sure to wear a mask during the event (except while eating ;) )</p> <p>If attending in person, I acknowledge that I do so at my own risk. OWASP recommends all participants be fully vaccinated before attending in-person events to reduce the risk of severe illness or death.</p> <p>------------------------------------------------------------------------------------------</p> <p>About our host Apiiro<br/>By analyzing signals from Design to Code to Cloud, Apiiro provides asset discovery &amp; risk assessment across application, open source &amp; Infra-as-Code - remediating critical risks to your business.<br/>We are helping every company in the world build &amp; scale their AppSec Program - Automatically!<br/> RSA Innovation Sandbox 2021 Winner<br/> Gartner 2021 Cool Vendor in DevSecOps</p> <p>------------------------------------------------------------------------------------------</p> <p>Agenda:<br/>17:45 - 18:15 - gathering, food &amp; networking</p> <p>18:15 - 18:45 Session #1 - HTTP Smuggling from inception to nowadays</p> <p>Join Milan Charniak, Red Teamer and Penetration Tester at Cilynx. Milan is an experienced Red Teamer that has experience in the detection / operations domains as well.</p> <p>The lecture is discussing HTTP Smuggling attacks from inception to this day while sharing some real exploitation successes.<br/>We will cover how HTTP Smuggling attacks are performed, from the classic HTTP Smuggling attack to the more recent HTTP 2.0<br/>Async Smuggling attacks. A variety of examples will be technically described and presented.</p> <p>18:45 - 19:15 Session #2 - APIs Posture Management and the Extinction of Rogue APIs</p> <p>Aner Morag, VP of Technology at Noname Security. Leading the Detection, Research and Innovation of the company.</p> <p>What is a good/secured API? How do you even measure the risks of your APIs when most part of your environment is unknown - even if an API-GW is in place, risks like data exposure and broken authentication mechanism are a common misconfiguration.<br/>Maintaining an up-to-date posture of your APIs is starting with their detection, cloud/infrastructure routing, while also including exposure / usage of sensitive data, IAAA functionality, or public access.</p> <p>19:15 - 19:30<br/>Break</p> <p>19:15 - 20:00 session 3 TBD</p> "
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "5º virtual meeting OWASP Natal Chapter",
        "date": "2021-12-21",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Natal-Chapter/events/282706028/",
        "timezone": "America/Fortaleza",
        "description": "<p>Nessa talk vamos conversar com a Helena, que começou a carreira de TI como desenvolvedora e agora atua como analista de segurança de aplicações em uma grande Fintech.<br/>Outra talk imperdível!</p> "
    },
    {
        "group": "Oklahoma City",
        "repo": "www-chapter-oklahoma-city",
        "name": "Zero Trust Model - A Swiss Knife for API Risk Reduction",
        "date": "2022-01-13",
        "time": "15:00",
        "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/282192276/",
        "timezone": "US/Central",
        "description": "<p>Web applications are prone to various cybersecurity risks. Did you know that 96% of these web applications contain some Open Source? Furthermore, did you know that 99% of such Open Source contain some Web APIs.</p> <p>You may be surprised to know that Web APIs contribute 83% of the traffic over the internet. Unfortunately, this growing API usage also means growing cybersecurity risks. Although, APIs benefit organizations immensely through accelerated innovations, newer business models, competitive differentiation, but organizations are also negatively impacted by APIs due to their weak security posture leading to business disruptions, legal and compliance issues.</p> <p>Gartner has actually predicted that by 2022, API abuses will be the most frequent attack vector resulting in data breaches for web applications. Given the importance of APIs for digital transformation at organizations, it is imperative for their Security, Compliance and Audit professionals to get a handle on APIs to manage various API related risks.</p> <p>This session will provide an overview of an API Governance framework for effective API Risk Management. This framework is inspired by the Zero Trust model that enterprises can use as a “Swiss Knife” for reducing their API related risks. We’ll also highlight best practices and hands-on examples for API Risk Management .</p> "
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2022-01-12",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Seattle-Chapter/events/pfhhqsydccbqb/",
        "timezone": "US/Pacific",
        "description": "<p>At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.</p> <p>Suggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.</p> <p>Slack @ #chapter-seattle (<a href=\"https://bit.ly/owasp-seattle-slack\" class=\"linkified\">https://bit.ly/owasp-seattle-slack</a>)</p> <p>seattle-chapter@owasp.org (<a href=\"https://groups.google.com/a/owasp.org/g/seattle-chapter\" class=\"linkified\">https://groups.google.com/a/owasp.org/g/seattle-chapter</a>)</p> "
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Effective Approaches for Shift Left Security",
        "date": "2022-01-13",
        "time": "19:30",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/282543092/",
        "timezone": "Asia/Singapore",
        "description": "<p>The concept of shift left is not new, but it is more possible today thanks to how cloud native applications are designed and deployed. This session will look at some key threats associated with cloud native applications and examples of how shifting security left can greatly help an organization's security posture.</p> <p>Speaker: Siddharth Deshpande<br/>With over 15 years of experience in the technology and cybersecurity domains, Siddharth Deshpande is Palo Alto Networks’ CTO for the APAC region, focussed on the emerging areas of cloud native application security and security for the hybrid workforce.</p> <p>In this role, he leads both business and technical focussed advisory engagements around cloud security to the largest corporations and government agencies in the region.</p> <p>He joined Palo Alto Networks from Akamai where he was a key technology leader focussed on emerging cybersecurity domains across Asia-Pacific and Japan. Prior to Akamai, Siddharth spent almost a decade at Gartner where he was a strategic advisor to organizations across the Asia-Pacific and Japan region as well as globally around a variety of emerging and established cybersecurity domains.<br/>Siddharth holds a Bachelor in Electronics Engineering from Mumbai University in India</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2021-12-30",
        "time": "18:30",
        "link": "https://www.meetup.com/owasptriangle/events/pqfzhsyccqbnc/",
        "timezone": "US/Eastern",
        "description": "<p>TBA</p> "
    },
    {
        "group": "Wia",
        "repo": "www-committee-wia",
        "name": "Diversity Panel",
        "date": "2022-01-15",
        "time": "11:00",
        "link": "https://www.meetup.com/womeninappsec/events/281488440/",
        "timezone": "US/Eastern",
        "description": "<p>*** Overview Goes here ***</p> "
    }
]