[
    {
        "group": "Algiers",
        "repo": "www-chapter-algiers",
        "name": "Unifying Web and Network Defense: Mastering WAF Deployment",
        "date": "2024-09-24",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-algiers-chapter/events/303408081",
        "timezone": "Africa/Algiers",
        "description": "The **OWASP Algiers Chapter** is thrilled to invite you to a unique learning experience led by **Mehdi Semmar**, a seasoned Network Security Consultant and official Cisco & Fortinet instructor.\n\n **Training Title**: *Unifying Web and Network Defense: Mastering WAF Deployment*\n **Format**: Online (via Zoom, Webex, or Teams)\n **First Session**: 24 September 2024 at 7 PM (Algiers Time)\n⏳ **Second Session**: 01 October 2024 (Algiers Time)\n **Duration**: 2.5 hours/session\nThis intermediate-level training is designed for **beginners in Cybersecurity or Networking**, with a focus on the integration of **Web Application Firewalls (WAF)** into network security frameworks. You’ll learn:\n\n* How WAF technology bridges the gap between web and network security\n* WAF deployment scenarios and web protection rules\n* The role of machine learning in web security\n\n **Instructor**:\n*Mehdi Semmar* is an industry expert with certifications such as **Cisco CCNPx2**, **Cisco CCSI**, **Fortinet NSE7**, and **Fortinet FCT**. He has extensive experience delivering high-quality, hands-on training that meets the learning objectives of participants.\n\n **Who Should Attend**:\nAnyone with a basic understanding of **TCP/IP and HTTP protocol** looking to advance their knowledge of **network and web security**.\n **Certification**: Upon successful completion, participants will receive a **Course Completion Certificate**.\n **Requirements**:\n\n* PC with at least **8GB RAM** and an **i3 processor**\n* **VMware Workstation 15.0 or higher**\n* Stable internet connection"
    },
    {
        "group": "Algiers",
        "repo": "www-chapter-algiers",
        "name": "Live Q&A Session: ISC2 Certified in Cybersecurity (CC) Certification",
        "date": "2024-09-21",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-algiers-chapter/events/303368452",
        "timezone": "Africa/Algiers",
        "description": "**Live Q&A Session: ISC2 Certified in Cybersecurity (CC) Certification**\nJoin us this **Saturday 21st September from 7:00 PM to 9:00 PM** (CET) for an interactive Live Q&A session hosted by the **OWASP Algiers Chapter**! Whether you're preparing for the ISC2 Certified in Cybersecurity (CC) certification or simply interested in learning more, this is the perfect opportunity to get your questions answered by professionals who have successfully achieved this certification.\n**Speakers:**\n\n* **Instructor:** Taher Amine Elhouari\n* **CC Certification Holders:**\n* Mehdi KERKAR\n* Wissam Bouattou\n* Abdelbasset Zerrouki\n* Hichem Belguendouz\n\nOur panelists will cover a wide range of topics related to the ISC2 CC exam, including preparation tips, key exam concepts, and real-life experiences. Bring your questions and join the conversation!\n\n**Register now and don't miss this chance to engage with cybersecurity professionals and boost your exam readiness.**\n\nLooking forward to seeing you there!"
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "From Noise to Insight: Transforming Vulnerability Data",
        "date": "2024-09-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/302943013",
        "timezone": "America/New_York",
        "description": "Security and engineering teams everywhere are often overwhelmed by the tens of thousands of new vulnerabilities that are reported each year. But while there are several commonly used prioritization inputs that can help manage CVE noise — like CVSS, EPSS, and KEV — there are additional factors organizations would be wise to consider beyond these frameworks.\nThis talk will provide guidance for using inputs like asset business context, remediation efficiency, and exploitability analysis alongside traditional vulnerability metrics. Additionally, it will cover important outputs (like VEX and VDR statements) that efficient vulnerability management programs can use to communicate outcomes and posture to internal and external audiences.\n\nEvent sponsored by FOSSA: https://fossa.com/\nDinner provided\nPlease arrive on-time as we begin promptly at 5:30."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "5. OWASP Augsburg Stammtisch",
        "date": "2024-09-25",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/302854068",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda tbd**\nDu hast einen Vortrag? Melde dich! Wir sind immer auf der Suche nach interessanten Inhalten!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2024 (Online)",
        "date": "2024-09-24",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207023",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nIf you would like to attend in-person, please sign-up on [https://owasp-austin-2024-september.eventbrite.com](https://owasp-austin-2024-september.eventbrite.com) (please don't sign-up for in-person and not attend as the Chapter arranges for lunch **a week before the event** for all in-person attendees -- and we don't want to waste both food and Chapter money.)\n\nPresentation: **The Secure Development Lifecycle in Action: The Point, Purpose, and Rationale** presented by Mark Black\n\nThe Secure Development Lifecycle (SDL) is a powerful construct that can advance security for both organizations with established security practices by shifting left, and immature organizations seeking a framework to implement security best practices in agile development. NI has been on a journey over the last several years to improve the security of its products driven by customer requirements, their expectations, and increasingly, regulations that require software to be developed with secure methodologies. Security is as much about a mindset and development culture as it is about tools, vulnerabilities, and security technologies. Learn how NI’s adoption of the Secure Development Lifecycle has created a framework for addressing various security challenges in web applications, microservices, and infrastructure."
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Announcing null + OWASP Bangalore Combined Meetup!",
        "date": "2024-09-21",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/303385903",
        "timezone": "Asia/Kolkata",
        "description": " Date: 21st September 2024\n Venue: Tekion India Pvt Ltd XPC5+MPC,Bagamane Solarium City,4th floor, Neon Building,Kundalahalli Colony, Brookefield,Bengaluru, Karnataka 560037\n Time: 9:30 AM - 1:55 PM\nSessions include:\nBug Bounty Hunting by Akash Kumar\nWeb application firewall with demo by Ranjith Singh\nAttacking & Defending Kubernetes by Bhavik Kanejiya\nJupyter as a SOAR, Threat Hunting by Shubham AGARWAL\nDon’t miss this opportunity to learn from the best in cybersecurity!\n Register here: https://null.community/events/1046-bangalore-null-owasp-bangalore-combined#event_sessions\n#cybersecurity #nullcommunity #owasp #bangalore #techmeetups"
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE Chapter Meeting (03/10/2024, Diegem)",
        "date": "2024-10-03",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/303275104",
        "timezone": "Europe/Brussels",
        "description": "On October 3rd, we organize our next OWASP Belgium chapter meeting at EY in Diegem.\n\n**Agenda**:\n\n* 18h00-18h30: Welcome and refreshments\n* 18h30-18h40: OWASP Update\n* 18h40-19h30: **JWT security and exploitation** (by Louis Nyffenegger, founder of PentesterLab)\n* 19:45-20h45: **Breaking and securing OAuth 2.0 in frontends** (by Dr. Philippe De Ryck, Founder of Pragmatic Web Security)\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Belo Horizonte",
        "repo": "www-chapter-belo-horizonte",
        "name": " OWASP BH apresenta: Transformando Sua Pipeline CI com Segurança Proativa",
        "date": "2024-10-01",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-belo-horizonte-chapter/events/303372739",
        "timezone": "America/Sao_Paulo",
        "description": "#  OWASP Belo Horizonte apresenta: Transformando Sua Pipeline CI com Segurança Proativa\n\nVocê está pronto para levar a segurança da sua pipeline de desenvolvimento para o próximo nível? Não perca o nosso próximo meetup!\n\n##  Quando?\n\n**Data:** 1 de outubro de 2024 **Horário:** 19:30 (Horário de Brasília)\n\n##  O que você vai aprender?\n\nNeste encontro imperdível, vamos mergulhar fundo no mundo do DevSecOps e descobrir como implementar um pipeline verdadeiramente seguro. Nosso palestrante expert, Eric Ferreira, vai guiar você através das melhores práticas, ferramentas essenciais e estratégias inovadoras para incorporar segurança desde o início do seu ciclo de desenvolvimento.\n\n### Destaques da palestra:\n\n* Implementação prática do OWASP DevSecOps Guideline\n* Estratégias eficazes para promover a cultura de \"shift-left\"\n* Ferramentas e técnicas para integrar segurança em cada etapa do seu pipeline CI\n\n##  Sobre o palestrante\n\n**Erick Ferreira** é um expert da Cibersegurança, com mais de 12 anos de experiência nas trincheiras das áreas ofensivas e defensivas. Sua expertise abrange empresas nacionais e internacionais, trazendo uma perspectiva global para nossa comunidade.\n\n*  Graduado em Sistemas de Informação pela FIAP\n*  Certificações de nível internacional: CISSP, CSSP\n*  Palestrante renomado em eventos como TDC, RoadSec, Mind the Sec e CISO Forum\n\n##  Como participar?\n\nO evento será realizado online via Zoom. Clique no link abaixo para se juntar a nós: [Link do Zoom](https://us06web.zoom.us/j/83332089144?pwd=KGQlH352PwfDVcw1ZaY09zWxUe88uc.1)\n\n##  Por que você não pode perder?\n\n* Networking com profissionais de segurança e desenvolvimento\n* Insights práticos que você pode aplicar imediatamente\n* Oportunidade de fazer perguntas a um expert da indústria\n\nVenha fazer parte desta jornada rumo a um desenvolvimento mais seguro e eficiente. Sua pipeline CI agradecerá!\n\n**#OWASPBh #DevSecOps #CyberSecurity #ShiftLeft**\n\n***\n\nOrganizado com  pelo capítulo OWASP de Belo Horizonte"
    },
    {
        "group": "Bogota",
        "repo": "www-chapter-bogota",
        "name": "Defcon y Cybercamp 2024",
        "date": "2024-09-18",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-bogota-meetup-group/events/303332662",
        "timezone": "America/Bogota",
        "description": "Nos complace anunciar que el próximo encuentro HackLab Bogota, se llevará a cabo el día miércoles 18 de septiembre de 2024, de 6:00 a 8:00 P.M. en la universidad del rosario sede claustro\nÚnete a nosotros para una charla exclusiva donde estaremos compartiendo con ustedes las experiencias de DEFCON y el INCIBE CyberCamp. Descubre las tendencias emergentes, innovaciones y aprendizajes clave de estos eventos líderes en seguridad informática. Perfecto para profesionales, estudiantes y entusiastas de la ciberseguridad.\n\nUniversidad del rosario \\| Sede Claustro \\| tercer piso auditorio 1"
    },
    {
        "group": "Boulder",
        "repo": "www-chapter-boulder",
        "name": "Boulder OWASP September Meetup",
        "date": "2024-09-25",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-boulder/events/303357869",
        "timezone": "America/Denver",
        "description": "The OWASP Boulder Chapter Leaders have some exciting news to share! Our long awaited Chapter Meeting is schedule for Wednesday, September 25th at the Rule4 office at 6 PM, with complimentary food, beer, and soft drinks. Join us for networking with your peers and a featured talk from City National Bank's AppSec Lead and industry veteran, [Paul Wowk](https://www.linkedin.com/in/pwowk/), presenting his BSides Oklahoma City talk:\n\n**Building an Application Security Program**\n\nThe typical root cause of all vulnerabilities is a weak development process that fails to leverage a Secure Software Development LifeCycle (SSDLC). This presentation will discuss the building blocks for deploying a secure development process for detecting, remediating, and ultimately preventing security vulnerabilities in your software.\n\nSpecial thanks to the Rule4 Team for hosting and sponsoring, we couldn't do these events without our sponsors. If you're interested in sponsoring the #1 AppSec organization and our Boulder Chapter meetings, please reach out to alex.brown@owasp.org.\n\nAgenda to follow, see everyone there!\n\nPlease follow us on LinkedIn: https://www.linkedin.com/company/owasp-boulder\n\nAnd join our Slack: https://join.slack.com/t/boulder-owasp/shared_invite/zt-2qnxnmmts-IQDaobNC1rcUbpaH1ip8Lg"
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland: Join the Conversation on Application Security",
        "date": "2024-09-18",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/303247536",
        "timezone": "America/New_York",
        "description": "Thank you to everyone who joined us last month. We’ll be meeting again on Wednesday, 9/18 at Market Avenue Wine Bar. Join us for a presentation on Threat Modeling by Eden Yardeni."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP Colorado Springs September 2024",
        "date": "2024-09-26",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/303319145",
        "timezone": "America/Denver",
        "description": "Speaker: Jeff Tomkiewicz; \"Fortifying Active Directory: Combating Misconfigurations\"\n\nPizza & GF Pizza, Drinks; Alcoholic and Non-Alchoholic will be provided.\nNetworking session after!\n\nLocation: National Cyber Center (NCC):\n3650 N Nevada Ave\nColorado Springs, CO 80907\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "All Day All Night API Security Endpoint Analytics",
        "date": "2024-09-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301083996",
        "timezone": "America/New_York",
        "description": "APIs are the pipelines to the data within our environments. Attackers want this data. So how can you use the APIs to understand when you are being attacked? How can endpoint analytics help? In this discussion I will break down several attacks that have occurred over the trillions of transactions that have been monitored over time."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A Night of OpenAPI Security and you?",
        "date": "2024-09-26",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/303328101",
        "timezone": "Europe/Copenhagen",
        "description": "*Welcome to the first OWASP Copenhagen meetup after the (long) summer break!*\n\n*We will be talking on API security and hopefully more. We're missing a speaker and it might be you! If you have something to talk about that might or might not be related, please let us know!*\n\nThe talk on API Security we have in place is by Andrei Agape and here's a short synopsis:\n\nThis presentation will share key findings from analyzing the OpenAPI standard and 100,000 publicly available API documentations. The aim of this research is to uncovered vulnerabilities that can be detected by analyzing the documentation and how testing techniques can be improved based on these results. Attendees will gain insights into how these discoveries can enhance API pentesting methodologies, streamline vulnerability detection, and improve overall security practices.\n\nAndrei is an Pentester and Offensive Security Specialist with a passion for web and API research as he likes finding ingenious ways to chain and exploit vulnerabilities that otherwise seem benign.\n\n**Agenda**\n18.00: Welcome\n18.05: Andrei Agape: A Deep dive into OpenAPI Security\n18.50: Pizza time\n19.30: Your talk?"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP Oct Meet - In person",
        "date": "2024-10-08",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/303473011",
        "timezone": "America/Chicago",
        "description": "\\*\\*\\*\\*How to accelerate development while providing security guardrails for developers\" \\*\\*\\*\\*\\*\n\nCloud-native application development demands agility, speed, and robust security. As organizations multiply and scale their business initiatives, maintaining security across the entire software development lifecycle becomes critical. This session looks at the challenges in achieving comprehensive cloud-to-code visibility and identifying risks at the source - the code."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP September Meetup - Join Us!",
        "date": "2024-09-18",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/302950884",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on September 18th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:00 - food is served at 5:30 and the presentation starts at 6:00.\n\nThis month's meeting is brought to you by SnowFROC! This month's speaker will be Jason Haddix! Jason taught two workshops for us at SnowFROC this year and this was one of them. If you missed them, now's your chance!\n\n**Presentation:**\nRecon Like an Adversary: Uncovering Modern Techniques in Attack Surface Management\n\n**Abstract**:\nJoin our expert, Jason, in a talk designed to demystify the advanced techniques adversaries employ to infiltrate organizations. This session is a deep dive into the world of attack surface management using open-source tools, tailored to emulate both adversaries and professional bug hunters.\n\n* Introduction to Reconnaissance Techniques: Gain insights into the methodologies used by adversaries in their initial approach to an organization.\n* Tool Mastery: Explore a range of common tools and techniques for targeting organizations. This includes:\n* Email Acquisition: Methods and tools for gathering email data.\n* Technology Profiling: Techniques for identifying the technology stack of an organization.\n* External Attack Surface Analysis: A focus on cloud and mobile environments, among others.\n* Historical Data Mining: Strategies for uncovering valuable historical endpoint data.\n* Live Demonstrations: Experience real-time use of each tool in the toolchain. Jason will share personal tips and tricks, enhancing your learning experience.\n* Practical Application: The workshop features live targets, offering a real-world scenario for participants to engage with and learn from.\n* Interactive Learning Experience: Participants are encouraged to actively engage, ask questions, and share experiences throughout the session."
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Dorset September In Person Meetup",
        "date": "2024-09-26",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/303388623",
        "timezone": "Europe/London",
        "description": "OWASP Dorset are proud to bring out latest in-person event, hosted with Hays Recruitment Bournemouth in their NEW ADDRESS.\n\n**PLEASE NOTE THAT HAYS HAVE A NEW ADDRESS AROUND THE CORNER:**\n1st floor South\nTelephone House\n18 Christchurch Road\nBournemouth\nDorset\nBH1 3NE\n\n**Talks**\n\n**Dr Shamal Faily**\n***Secure by Design: why it's hard, and what we're doing about it.***\nSecure by Design is becoming the dominant approach in government for increasing cyber resilience by considering Cyber Security early and through life. However, within MOD we (like many organisations) face challenges that make Secure by Design hard for those responsible for implementing. In this talk, I will outline these challenges and talk about the role Dstl is playing to address them within MOD, and collectively with our partners across government.\n\nDr Shamal Faily is a Principal Scientist in the Software and Systems Dependability Team at Dstl. He is a Visiting Fellow at Bournemouth University, and previously held a range of academic posts at Robert Gordon University, Bournemouth University, UCL, and University of Oxford, including course leadership positions. Prior to his work in Higher Education, Shamal was a software engineer at Logica UK’s Space & Defence division for nearly a decade. Shamal has long established interests in the design and secure and usable systems, and published over 100 peer-reviewed publications in Software Engineering, Cyber Security, HCI, and Computer Science Education. Shamal is also the lead developer of the open-source CAIRIS (Computer Aided Integration of Requirements and Information Security) platform, which is widely used for threat modelling.\n\n**Hays**\nCyber recruitment update from the Hays team.\n\n**Ashley Allen**\nNowadays, domestic smart security devices, such as smart locks, smart doorbells, and security cameras, are becoming increasingly popular with users due to their ease of use, convenience, and declining prices. Unfortunately, users have very few sources of unbiased information regarding product performance in real-world conditions and, as a result, tend to take manufacturer claims at face value. This means that users may be exposed to threats such as theft, impersonation, and even physical injury if the device fails and is used to prevent access to hazardous environments. This talk discusses recently published research, and in particular several attacks using popular wireless attack vectors (i.e., 433 MHz radio, Bluetooth, and RFID) against domestic smart security devices. Results suggest that users are open to considerable threats, irrespective of whether they use lesser known (i.e., no name) or branded smart security devices, due to the poor security offered by these devices.\n\nAshley Allen is a PhD student in Computer Science at the University of Hertfordshire and a member of the Cybersecurity and Computing Systems research group. He holds an MSc in Computer Science (Cybersecurity) from Staffordshire University, UK. He has over 20 years of experience working in security roles in both the public and private sectors. He is currently Senior Security Engineer for Posit, PBC, an American data science company. His research interests include IoT security and federated learning.\n\n**Event and Venue**\nWe will be joining Hays Recruitment in their new offices in Bournemouth for this event, there is a limit on numbers, so signup is essential. Names will be required upon arrival to enter the building.\n\nThere will be food and drink provided for this event, so please let us know of any dietary requirements or allergies."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #68 - Special Edition with OWASP Founder",
        "date": "2024-10-10",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/303263342",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #68! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\n**Special Event Announcement:** This time, we are hosting a special event featuring two distinguished speakers.\nFirst, we'll hear from **[Jeff Williams](https://www.linkedin.com/in/planetlevel/)**, CTO of Contrast Security and one of the OWASP core founding members, who will deliver a thought leadership talk on the **OWASP History and the state of Application Security**.\n\nFollowing Jeff, we are thrilled to have **[Kevin Wennemuth](https://www.linkedin.com/in/feffi/)**, Head of Security at codecentric AG, join us. Kevin, a security specialist, hacker, blogger, and thinker, will be sharing his war stories at his talk \"**Stories from the Dark Side**\" where he explores the real-life challenges of a Red Teamer and the harsh truths of IT security.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*What are we going to talk about?* For this meeting, we're excited to have Jeff Williams and Kevin discuss the latest in application security. Additionally, we will provide updates from our recent OWASP projects, particularly those related to AI. Stay tuned for the announcement of another speaker who will be joining us!\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **10.10.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at codecentric AG, located at Lise-Meitner-Straße 4, 60486 Frankfurt am Main, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #67 - CISO Roundtable ",
        "date": "2024-09-26",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/302364452",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #67!\nOur Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\nFor this meetup, we’re introducing a new format: a **CISO roundtable**. We are excited to welcome panelists from diverse industries to discuss software and cloud security.\n\n* **Sheetal Joseph** \\- Director\\, Cybersecurity at Isar Aerospace\n* **Dr. Tim Sattler** \\- CISO at Jungheinrich AG\n* **Scott T. Nichols** \\- Global Product Security Leader Danaher Corporation\n* **Irfaan Santoe** \\- Global Head of Application Security Wolters Kluwer\n* tbd\n\nWe aim to provide fresh perspectives and gain CISO-level insights, starting with a set of questions and then opening the floor for a lively audience discussion. Participants can submit questions in advance or ask them during the event.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**.\n\n_When?\nOur Meetup takes place on 26.09.2024 from 18.00 to 22.00 o'clock CEST.\n\n_Where?\nIBM Tower One is located at Brüsseler Straße 1-3 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on [LinkedIn](https://www.linkedin.com/company/owasp-frankfurt/) and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg Maritime and OT Cybersecurity",
        "date": "2024-09-19",
        "time": "17:15+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/302944829",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Stena's Danmarksterminalen for an interesting evening with food and drinks, and talks about maritime and OT cybersecurity!**\n\n**Where:** Stena Line Danmarksterminalen, 413 28 Gothenburg\n\n**Agenda:**\n\n**17:15 - 17:30** Doors open\n\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n\n**17:45 - 18:30:** Maritime cybersecurity governance, *Fredrik Pihl*\n\n**Talk outline:** Maritime industry is being regulated since a few years back and is on journey towards a risk-based management approach. Learn about threat landscape, incidents, governance and similarities between industries.\n\n**Speaker’s bio:** Manager Cybersecurity, Risk and Compliance at Stena Group IT and OT Security Officer at Stena Group IT working with vessels, ports and terminals, wind turbines, property and waste management. Fredrik has 15+ years of experience from industrial IT projects and physical security industry working as IT / OT security architect including manufacturing, rail, defense industry, telecom and logistics.\n\n**18:30 - 19:00:** Food & Drinks\n\n**19:00 - 19:45:** Bridging the gap between IT and OT, *Jonathan Björnsson*\n\n**Talk outline:** In his presentation, Jonathan will, in a light-hearted and engaging manner, demonstrate how to bridge the gap between IT and OT. The goal is to build connections between these two areas and show how collaboration can lead to both innovation and stronger security.\n\n**Speaker’s bio:** Jonathan Björnsson is a cybersecurity expert with over 25 years of experience in both IT and OT. With his deep understanding of how these two worlds intersect and are secured, he has helped organizations protect their critical infrastructures. Jonathan is certified in Generative AI and works on AI-based cybersecurity solutions within the EU. He is also known for making complex security issues easy to understand for everyone.\n\n**19:45 - 20:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston Security Professionals Happy Hour - Sponsored by Salvador Technologies",
        "date": "2024-09-25",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/303064569",
        "timezone": "America/Chicago",
        "description": "Please join us at Monkey's Tail for a Happy Hour sponsored by Salvador Technologies.\n\nInformation from our sponsor:\nhttps://www.salvador-tech.com/\nSalvador addresses a crucial problem concerning operational continuity and cyber attack recovery for mission critical systems, eliminating costly, inconvenient, or even dangerous downtime. Our Security Failover technology is redefining the essence of ICS & OT Resilience, with our 30-second Recovery."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Introduction to Attacking AWS Cloud",
        "date": "2024-09-26",
        "time": "15:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/303291709",
        "timezone": "Asia/Jakarta",
        "description": "Topic : Introduction to Attacking AWS Cloud\n\nDate : 26 September 2024\n\nSession type : Online/zoom\nTime : 1 Hour\n\nSenior Product Security Engineer @Poshmark\nMohd Arif holds the position of Senior Product Security Engineer at Poshmark, a prominent Ecommerce organization. With three years of experience in the security industry, he has established himself as a skilled practitioner in various domains. His expertise encompasses hacking web applications, mobile apps, API security testing, source code review, architecture review, and threat modeling.\nHe remains deeply committed to the field of cybersecurity and actively seeks opportunities to share his knowledge and experiences. As a result, he has been invited to speak at esteemed conferences and summits, including Seasides Conference, C0C0N Conference, and Redteam Summit. Notably, Mohd Arif has been an enthusiastic volunteer at India's beloved Seasides Conference, where he eagerly shares his hacking insights with a receptive audience.\n\nConnect with Speaker:\nLinkedin: https://www.linkedin.com/in/mohd--arif/\nTwitter: @Zero0x00"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Workshop Utilize DSOMM App to Define and Deliver Your Own Program",
        "date": "2024-10-02",
        "time": "19:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/302731833",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Utilize DSOMM App to Define and Deliver Your Own Program\nStep into the world of DSOMM in an immersive hands-on training event offered by **Timo Pagel**, [OWASP DSOMM](https://owasp.org/www-project-devsecops-maturity-model/) Project lead.\n\n**Abstract:** Discover how to elevate your DevOps security strategy with the OWASP DevSecOps Maturity Model (DSOMM). This comprehensive framework offers a structured approach to prioritizing and implementing security measures within DevOps practices.\n\nIn this workshop, Timo will introduce DSOMM and its practical application, demonstrating how to leverage DevOps strategies to enhance security. He'll showcase the DSOMM application and its features, guiding you through the process of customizing and scaling your AppSec program. Specifically, how you can customize the activities your team(s) should implement with level, title, descriptions/requirements, and evidence to deliver it to your teams including the current implementation status.\nYou'll learn about the \"inheritance\" concept in DSOMM activities and its time-saving benefits, including automatic mapping to frameworks like SAMM and ISO 27001. Through an interactive exercise, you'll create a small application security testing program based on DSOMM, gaining hands-on experience in prioritizing AppSec activities.\n\nThis talk offers tools and techniques for all skill levels, whether you're new to AppSec/DevSecOps or looking to refine your existing strategies.\nJoin us to learn how DSOMM can transform your approach to security and sharpen your skills in prioritizing AppSec/DevSecOps activities for enhancing impact.\n\n*Requirements*:\n\\- Docker\n\\- Linux is recommended\\.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - SEP 25, 2024",
        "date": "2024-09-25",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300687523",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: AI Services Security Test Guideline at Zoom\nJoin us for great networking, dinner and drinks, and see a presentation by **Raina Chen**, Senior Security Engineer at Zoom.\n\n**ABSTRACT**: As the adoption of AI technology proliferates across industries, an increasing number of companies are leveraging AI to power myriad products. This widespread integration necessitates a robust approach to ensuring the security of AI-driven solutions. This discussion explores an overview of Zoom’s security testing guidelines tailored for AI services, encompassing essential facets such as data privacy, model security, system security, open-source software (OSS) security, security of AI downstream services, and Automation Tools.\nThis presentation will provide a framework for navigating these challenges, offering practical insights and strategies for enhancing the security posture of AI services within Zoom and beyond.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "October 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-10-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/302961495",
        "timezone": "Europe/Amsterdam",
        "description": "See [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **AI Security: Safeguarding Software from Code to Architecture** by **Feiyang Tang**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **TBA**\n\n**AI Security: Safeguarding Software from Code to Architecture**\n*Abstract:*\nAI is rapidly transforming software development, offering unprecedented capabilities but also introducing new security challenges. As organizations rush to adopt AI technologies, they often overlook critical security implications, potentially exposing themselves to novel threats and vulnerabilities.\nIn this talk, we’ll explore how to build secure AI-powered software, covering both coding practices and system design. We’ll dive into specific scenarios where AI can introduce security risks and discuss practical strategies to mitigate these issues in software development. We’ll also touch on privacy concerns when implementing AI solutions. Through real-world examples, you’ll gain actionable insights to enhance the security of your AI projects, from individual algorithms to complete systems.\n*Bio:*\nFeiyang Tang is a Technical Software Consultant at Software Improvement Group, specializing in code quality and security. He holds a Ph.D. in Software Privacy from Norway and a Master’s degree in Artificial Intelligence. With a background spanning academia and industry, Feiyang focuses on enhancing software development practices through the responsible integration of AI technologies. His work aims to bridge the gap between advanced AI capabilities and robust, secure software engineering principles."
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "OWASP NYC: \"Day 1 DevSecOps\"  |  Building a Program and Your Credibility",
        "date": "2024-10-17",
        "time": "17:30-04:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/303412715",
        "timezone": "America/New_York",
        "description": "An OWASP NYC Chapter Meetup - On-Site\n\nThursday, October 17th, 2024.\n\nWestCap\nLocation: 40 10th Avenue, New York,\nNY 10014 (Entrance on 13°\" Street)\n\nSpeaker Alex Olea, DevSecOps Engineer at Starburst\n\nDay 1 DevSecOps \\| Building a Program and Your Credibility\nStarting a DevSecOps function is an exciting opportunity to not just run a program, but build one. But whether you’re at a large enterprise or a startup, Day 1 is never total greenfield. Even if the organization doesn’t have serious technical and security debt, you’re still going to run into stuff that was spun up and abandoned or tools that aren’t what you might have chosen. So how do you get started?\n\nIn this session, Alex will share his experiences with building DevSecOps programs at startups, including:\n\n* What is DevSecOps?\n* Building trust with developers\n* Improving developer productivity and measuring success\n* Redefining an AppSec program case study: replacing an SCA tool"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Threat Modeling Challenges",
        "date": "2024-09-18",
        "time": "17:30-04:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/303327509",
        "timezone": "America/New_York",
        "description": "***Sign-up is required for Venue VIP Entrance - More to come***\n\nLooking forward to seeing everyone tomorrow downtown FiDi\n\nWednesday, September 18, 2024\nThe event starts at 5:30 pm\n\n**The Malt House FiDi**\n9 Maiden In\nNew York. NY 10038\n\n5:30 pm - Networking, drinks and appetizers\n6:00 pm - Stephen Talk - LLMs in your Software Security House\n6:30 pm - Jason Talk - Global-Grade Threat Modeling: Scaling Security to Meet Financial Regulatory Demands\n7 pm - Open Q&A/General Discussion on Threat Modeling Challenges\n8:30 pm - Event ends"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The Cloud Explosion and the new age of SOC (OWASP OC & CSA OC Joint Meeting)",
        "date": "2024-09-25",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/303339243",
        "timezone": "America/Los_Angeles",
        "description": "NOTE: This is a joint meeting with CSA OC. We will not be meeting at our usual location or day, so **read the detail event date and location carefully**.\n\n**Topic**\nThe innovations of cloud technologies have evolved and multiplied over the years - along with the amount of data produced and stored. From not enough to way too much, how do security teams harness the power of data overload?\nDinner and beverages will be provided, so if you cannot make it, **PLEASE** be sure to cancel your reservation to make room for other members. Thanks again to **Query** for sponsoring and **Chipotle** for hosting us at their venue!\n\nWe look forward to seeing everyone there, and don't forget to RSVP to our [OC Joint Cyber Mixer on the 17th of September](https://www.meetup.com/owasp-oc/events/303251499/?eventOrigin=home_next_event_you_are_hosting)!"
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "Gamification of Threat modeling",
        "date": "2024-10-15",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-oslo/events/303410666",
        "timezone": "Europe/Oslo",
        "description": "* **17:00-1730 - Food serving**\n* **17:30-18:15 - Gamification of Threat Modeling for Machine Learning, Elias Brattli Sørensen**\n* **18:15-19:00 - Let’s play OWASP Cornucopia! Johan Sydseter**\n\n**Gamification of Threat Modeling for Machine Learning**\nArtificial Intelligence (AI) has established itself as an important part of our lives, with machine learning spearheading the most notable innovations in the last two decades. Publications about prompt injection and similar attacks get a lot of attention. However, these are far from the only security issues with machine learning systems. We also have to think about challenges like poisoned data, recursive data pollution and all the personally identifiable information the models have memorized, as well as other inherent weaknesses with stochastic systems. Too much focus is directed towards operational security in the OPS part of of MLOps, while the shift-left idea of building systems \"secure by design\" during planning and development does not get enough emphasis. Threat modeling and risk analysis will likely play an important role in the future of machine learning security. I introduce Elevation of MLsec, which is an extension of Shostack's threat modeling card game Elevation of Privilege, and based on the risk framework published by the Berryville Institute of Machine Learning (BIML). In this talk, we will demystify how machine learning systems actually work and explore how the threat modeling game can help us engineer more secure machine learning systems.\n\n**Let’s play OWASP Cornucopia!**\nOWASP Cornucopia is a card game to assist software development teams identify security requirements in agile software development processes. It is language, platform, and technology agnostic.\n\nIn this session we will learn to play the game in a different way from what we usually do. Johan Sydseter, OWASP Cornucopia co-lead and game master will take you through a provocative scenario. Confronted with the grumpy old senior developer that refuses to shift-left due to too many hours working overtime on his incredible sophisticated pet projects, what will you do? Will you be able to teach him a lesson about why security is important, or will he be laughing all the way to his developer cave? Only true passionate application security engineers will succeed. Expect confetti, swags, (yes, you read right, swag, valued just below the corruption limit) and illegal bribes as you venture into the unknown of OWASP Cornucopia.\n\n**Speakers**\n\n**Elias Brattli Sørensen** is a software engineer & security champion at Kantega SSO, engineering digital identity standards for secure authentication to the Atlassian ecosystem while facilitating and promoting secure software development practices. M. Sc. in Computer Science at NTNU, researching usage of static analysis tools like Spotbugs to find vulnerabilities in OpenID Connect client implementations.\n\n**Johan Sydseter** is co-leader for OWASP® Cornucopia and Co-creator of the OWASP® Cornucopia Mobile App Edition. The man with the long hair, not the long beard. Fresh meat in App Sec and OWASP but has 15 years' experience building and designing backend and frontend solutions as a designer, developer and architect. He has held several presentations on appsec at various international conferences, loves confetti and funny glasses.\n\n**About OWASP and OWASP Chapter meetings**\nOWASP is an online community that produces freely available articles, methods, documentation, tools, and technologies in IoT, system software, and web application security.\nOWASP Chapters exist to build a community of application security professionals worldwide. Our Oslo OWASP Chapter's meetings are free and open to everyone to attend, so both members and non-members are always welcome. Local meetings include:\n\n* Training to improve your skills\n* Lectures that are relevant to your work\n* Networking capabilities"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa September 18th 2024: How Vulnerability Assessment is Done ",
        "date": "2024-09-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/303182934",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=DmTI1urW3Ts\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **How Vulnerability Assessment is Done in Common Criteria Evaluations**\n\n**Abstract:**\nThis presentation will discuss the methods currently used for vulnerability analysis in the internationally-recognized IT security evaluation standard, Common Criteria. Besides describing what is currently done in Canada and the United States, this presentation will briefly describe other vulnerability methodologies that have been outlined in the standard. The presentation will start with a brief discussion of what Common Criteria is, and why it is such a consequential standard for IT security.\n\n**Speakers:**\n**Carol Cantlon**, CISSP, has been involved with Common Criteria since its beginnings. She has done Common Criteria evaluations as a Canadian scheme Approved Evaluator in EWA-Canada's Common Criteria Laboratory and as part of the DOMUS IT Security Laboratory. She is currently the Quality Manager of Lightship Security's Canadian and US Common Criteria Laboratories with her responsibilities including the review of vulnerability assessment reports."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Music night ,Monthly Networking Social",
        "date": "2024-09-26",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/302453493",
        "timezone": "Europe/London",
        "description": "Music night join us in The Ostrich for a might of music and networking.\n\nhttps://www.ostrichinnpeterborough.com/\n\nThirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "Pain in the SAST: Secure Code Reviews and Static Analysis",
        "date": "2024-09-24",
        "time": "19:00-04:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/303492663",
        "timezone": "America/New_York",
        "description": "Yoo OWASP Philly!! We back!!\n\nPlease reconvene with us as we dive into our Fall Line-Up at the Black Sheep Pub in Center City Philadelphia. The agenda will include networking, lite refreshments, and a technical talk on Secure Code!\n\nHave you ever wondered what vulnerabilities look like in code? Has anyone ever asked you do a secure code review on a PR, or implement some tooling to run automated code scans? Did you answer no to all of this but still think it might be interesting? Then please join me as we do an introductory session on performing Secure Code reviews and take a look at some code scanning options with their fairly simple code base integrations!\n\nP.S. Your OWASP Philly team is looking to bring you a Secure Code CTF in October for Security Awareness Month, so this may or may not be useful!\n\nExcited to see everyone!\n-Higgs"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "October 2024 Meeting",
        "date": "2024-10-01",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/303457123",
        "timezone": "America/Phoenix",
        "description": "**Free (HTTP) Cookies!** (15 min)\nThe talk will cover how cookies are used for session management in web applications and the security settings that can be applied to them."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - JWT, OAuth secrets & Bug bounty",
        "date": "2024-10-01",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/303209619",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\nWe are Polish chapter of [OWASP](https://owasp.org/) \\- worldwide\\, non\\-profit organisation focused on application security issues\\.\nThis time we have invited **Grzegorz Niedziela** and **Louis Nyffenegger**.\n\n**[Louis Nyffenegger](https://www.linkedin.com/in/snyff/)** the founder of [PentesterLab](https://pentesterlab.com/), will talk about JSON Web Tokens (JWTs).\n**[Grzegorz Niedziela](https://www.linkedin.com/in/gniedziela/)**, \"[Bug Bounty Reports Explained](https://www.youtube.com/c/BugBountyReportsExplained)\" Youtube channel host will have a talk about OAuth security.\nAfter talks, we will discuss bright and dark sides of bug bounty.\n\nAgenda:\n\n1. **JSON Web Tokens (JWTs) (Louis Nyffenegger)**\nNowadays, JSON Web Tokens (JWTs) are ubiquitous, serving as session tokens, OAuth tokens, or simply as a means to pass information between applications or microservices. However, by design, JWTs contain numerous security and cryptography pitfalls that can lead to serious vulnerabilities. In this talk, we will explore how to exploit some of these issues.\n2. **OAuth Secrets (Grzegorz Niedziela)**\nThese days, Oauth is a key protocol, allowing us to log in with one click to many websites. As anything, this convenience doesn’t come without a cost. The cost here is the risk of an account takeover bug. And that’s not only changing the redirect_uri to an attacker-controlled host which, for many hackers, is the only attack they know. That attack won't work too well in 2024. This talk will be about exploiting smaller misconfigurations. For example, what do to if you only control the path of the redirect_uri or how to exfiltrate the code when your open doesn't preserve parameters. It will also focus on particular auth providers and how they don't make it hard for us by being way more relaxed than the standard defines.\n3. After the break, we will be hosting a **discussion about bug boutnty**. We want to discuss both sides - bug bounters and companies which have bug bounty programs.\nHow to report vulnerabilities? Where to seek? What should be your goal - easy bugs occuring en masse or sophisticated kill-chains? What to expect? Bug bounty myths and reality.\nHow bug bounty might help your organisation? What are the real costs of having bb program? What can go wrong? How to manage good bb program? Bug bounty or penetration testing?\n\nAbout our guests:\n**[Louis Nyffenegger](https://www.linkedin.com/in/snyff/)** is a seasoned security engineer and the founder of [PentesterLab](https://pentesterlab.com/), a platform dedicated to teaching web penetration testing and security code review.\n**[Grzegorz Niedziela](https://www.linkedin.com/in/gniedziela/)** \\- I'm a hacker who documents his journey by creating and curating the best content for you in the form of [videos](https://www.youtube.com/c/BugBountyReportsExplained) and [newsletter](https://www.bugbountyexplained.com/).\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this invitation** with friends and in your social media."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - In-person Meetup (Aumni @ Cottonwood Heights, UT)",
        "date": "2024-09-26",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/303279818",
        "timezone": "America/Denver",
        "description": "**Agenda**:\n\n1. Introductions / Lunch\n2. Topic of Discussion: **Implementation of an SDLC end to end**.\n1. i.e. talk about each tool that should go into a CI/CD pipeline, each gate that should ideally be present, monitoring, etc.\n3. Q&A\n\nCome join us for a lunch meetup at the Aumni building in Cottonwood Heights and discuss what others are doing in the industry, and how the size of the company can affect SDLC controls as well.\n\nCasual group and anyone interested in Software Security is welcome to attend.\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-10-09",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539100",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "OWASP AppSec Days Singapore (paid event)",
        "date": "2024-10-01",
        "time": "09:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/302520187",
        "timezone": "Asia/Singapore",
        "description": "Join us for the 2024 OWASP AppSec Days Singapore at Marina Bay Sands hotel. Designed for private and public sector infosec professionals, OWASP conference equips developers, defenders, and advocates to build a more secure web. We are offering three educational \\*\\*1-day training courses on 01-October that requires a separate ticket purchase followed by the conference and exhibition on 02-October. Join us for leading application security technologies, speakers, prospects, and community, in a unique event that will build on everything you already know to expect from an OWASP Conference. With amazing speakers and networking opportunities, this is an event you will not want to miss.\n\nREGISTER AND LEARN MORE [HERE](https://singapore.appsecdays.org/?utm_source=owasp-web&utm_medium=event-page&utm_campaign=none)"
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "September 2024 SFOWASP Monthly Meeting - Joint Meeting with SFISSA",
        "date": "2024-09-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/302943630",
        "timezone": "America/New_York",
        "description": "Each September, the OWASP South Florida Chapter (SFOWASP) and South Florida ISSA (SFISSA) come together for a joint meeting. This year, please join us on **September 19, 2024**, at **Palm Beach State College**, **4200 S Congress Ave, Lake Worth, FL**. The meeting will take place in **Room CE119** in the CE building.\n\n**Location: Palm Beach State College - CE building, room 119**\n\n**Agenda**:\n\n* Chapter updates/announcements, upcoming events - SFISSA\n* Chapter updates/announcement, upcoming events - SFOWASP\n* Talk1 - TBA\n* Talk2 - TBA\n* Networking\n\nWe will update this notice for speaker(s) and topic(s)."
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "Special OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-10-08",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/302783300",
        "timezone": "Europe/Berlin",
        "description": "Jeff Williams is visiting Germany and has offered to visit the OWASP Stammtische. A great reason to hold a special Stammtisch outside of the regular schedule!\n\n**Novatec Consulting** will host this Stammtisch at their venue – thank you very much, we truly appreciate your support in making this event possible!\n\nThe exact details of this Stammtisch are still being finalized and will be shared here soon."
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Container and Kubernetes Security (Free Half-Day Training)",
        "date": "2024-09-25",
        "time": "13:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/302684671",
        "timezone": "Europe/Zurich",
        "description": "In this **free, half-day training session**, we will provide you with a condensed overview of essential container and Kubernetes security concepts. You will learn the basics on how to harden your Kubernetes cluster and secure your containerized applications.\n\n* **Cloud-native security fundamentals:** Understanding the layered approach to securing cloud, cluster, container, and code.\n* **Hardening containers:** Best practices for reducing the attack surface.\n* **Kubernetes security architecture:** Grasp the key components and potential attack vectors within a Kubernetes cluster.\n* **Segregation in Kubernetes:** Strategies for isolating resources and maintaining security boundaries.\n* **Kubernetes security features:** Learn about RBAC, Network Policies and Admission Controllers (e.g. PSA/PSS) to enforce security requirements.\n\nThis training is designed to provide a solid foundation on the best practices and tips for securing your Kubernetes cluster and containerized applications. Unfortunately, due to time constraints, we won’t be able to have hands-on labs, but you can expect live demos of the concepts covered.\n\nWhether you’re a DevOps engineer, security professional, or just starting out with containers and Kubernetes, this half-day session will give you the knowledge and skills to harden your cloud-native environment.\n\n**Event Timeline:**\n\n* 13:00: Door opening\n* 13:15: Start of training\n* 17:30 (approximately): End of training\n* 17:30-19:00: Possibility to network with some snacks and drinks"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver Monthly Meetup",
        "date": "2024-10-17",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516380",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Docker security mistakes I made so you don’t have to",
        "date": "2024-09-19",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516377",
        "timezone": "America/Vancouver",
        "description": "**We would like to thank Lululemon for sponsoring this event!**\n\n**Docker security mistakes I made so you don’t have to** with **Amiran Alavidze**\n\nContainers are often used as an isolation mechanism to either run unsecured workloads (i.e. isolate them from hostile external environments) or increase security of questionable workloads (i.e. “I don’t fully trust this, so I’ll keep it separate”). When doing so, we need to keep in mind that strong security isolation was not a design objective for containers. There are limits to the provided isolation and also unexpected ways to break the isolation completely through misconfiguration.\n\nIn this blue team focused talk we will review Docker security (mis-)configurations I’ve seen in the wild. We will consider WHY they are dangerous (there will be demos!) and HOW to fix them.\n\nThe talk is focused on intended (albeit dangerous) functionality, there will be no 0-days. Also, container orchestration technologies will not be covered - a lot of presented scenarios would be applicable, but there is additional attack surface not considered in this talk.\n\n**Amiran** is an OWASP Vancouver board member and is a passionate product security professional with over 20 years of technology experience in a variety of roles. As a security engineering leader, Amiran is advocating a pragmatic approach to security where partnership between security, builder, and platform teams result in security becoming a business enabler."
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "Dancing with OAuth 2.0",
        "date": "2024-09-24",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/303480446",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: Matheus Vrech\nTema: Dancing with OAuth 2.0\nData: 24/09/2024(Terça-feira) às 19:30"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #68 - Special Edition with OWASP Founder",
        "date": "2024-10-10",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/303263342",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #68! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\n**Special Event Announcement:** This time, we are hosting a special event featuring two distinguished speakers.\nFirst, we'll hear from **[Jeff Williams](https://www.linkedin.com/in/planetlevel/)**, CTO of Contrast Security and one of the OWASP core founding members, who will deliver a thought leadership talk on the **OWASP History and the state of Application Security**.\n\nFollowing Jeff, we are thrilled to have **[Kevin Wennemuth](https://www.linkedin.com/in/feffi/)**, Head of Security at codecentric AG, join us. Kevin, a security specialist, hacker, blogger, and thinker, will be sharing his war stories at his talk \"**Stories from the Dark Side**\" where he explores the real-life challenges of a Red Teamer and the harsh truths of IT security.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*What are we going to talk about?* For this meeting, we're excited to have Jeff Williams and Kevin discuss the latest in application security. Additionally, we will provide updates from our recent OWASP projects, particularly those related to AI. Stay tuned for the announcement of another speaker who will be joining us!\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **10.10.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at codecentric AG, located at Lise-Meitner-Straße 4, 60486 Frankfurt am Main, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #67 - CISO Roundtable ",
        "date": "2024-09-26",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/302364452",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #67!\nOur Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\nFor this meetup, we’re introducing a new format: a **CISO roundtable**. We are excited to welcome panelists from diverse industries to discuss software and cloud security.\n\n* **Sheetal Joseph** \\- Director\\, Cybersecurity at Isar Aerospace\n* **Dr. Tim Sattler** \\- CISO at Jungheinrich AG\n* **Scott T. Nichols** \\- Global Product Security Leader Danaher Corporation\n* **Irfaan Santoe** \\- Global Head of Application Security Wolters Kluwer\n* tbd\n\nWe aim to provide fresh perspectives and gain CISO-level insights, starting with a set of questions and then opening the floor for a lively audience discussion. Participants can submit questions in advance or ask them during the event.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**.\n\n_When?\nOur Meetup takes place on 26.09.2024 from 18.00 to 22.00 o'clock CEST.\n\n_Where?\nIBM Tower One is located at Brüsseler Straße 1-3 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on [LinkedIn](https://www.linkedin.com/company/owasp-frankfurt/) and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\nWe're looking forward to seeing you at our event!"
    }
]