[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2025-01-28",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299786143",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with Norlys.\n\nAgenda:\n**19:00 – 19:10** Welcome by Norlys and OWASP Aarhus\n**19:10 – 20:00** ”Hybridwar, critical infrastructure and resilience…” by Ken Bonefeld Nielsen\n\nGet an insight into how vulnerable modern societies are when it comes to hybrid warfare. What can we do to make critical infrastructure more resilient…\n\nKen Bonefeld Nielsen – Senior Cyber Security and Resilience Advisor at Norlys shares his many years of experience from the military and international work for organizations like Sony, Tele2, Lundbeck and Norlys\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** \"The Journey of Cyber Entrepreneurship, Community Building, and Open Source Opportunities\" by Bjarke Petersen\n\nDiscover how true innovation emerges in entrepreneurial environments, the challenges it faces, and what it takes to succeed. Explore the vision behind Cybersikker.dk, a community designed to become Denmark's leading self-help hub for IT security. The session concludes with a collaborative exploration of impactful and affordable technological solutions, emphasizing the transformative potential of open-source tools.\n\nBjarke Petersen – Serial Cyber Entrepreneur and Community Enthusiast with experience in creating businesses. Now dedicated to building a free, self-help Cyber Community to support Danish SMEs in navigating and resolving their IT security challenges."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "AI Empowerment vs. Security Risk: Navigating the AppSec Challenges of AI Agents ",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304581179",
        "timezone": "America/New_York",
        "description": "In just a short span, AI Agents and low-code development have transformed how businesses operate, allowing users without coding backgrounds to create applications, automate processes, and streamline workflows. Business users are empowered as never before, using tools that merge AI with productivity—from email and business intelligence to application development. But while these tools amplify efficiency, they also introduce new security risks that challenge the traditional boundaries of IT and AppSec.\n\nAs security teams grapple with vulnerabilities like authorization misuse, data leakage, and the risk of exfiltration, they must decide how to approach the widespread adoption of AI-driven tools and low-code platforms without stifling innovation. In this session, we’ll explore recent research into the security challenges posed by AI agents and low-code development, emphasizing the pitfalls that emerge when business users become app creators. We’ll also outline how AppSec teams can adapt their approaches to balance security with productivity, ensuring they enable the business rather than block it."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "February 2025 OWASP Happy Hour sponsored by Cyera",
        "date": "2025-02-13",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305616287",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, February 13th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cyera](https://cyera.io/)\n*Cyera is an AI-powered data security platform that helps organizations manage and protect their data in today’s complex digital landscape. The company’s platform combines advanced Data Security Posture Management (DSPM) with real-time enforcement controls, providing customers with a comprehensive solution for securing their data assets against evolving threats. Learn more at [Cyera.io](https://cyera.io/).*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - January 2025 (Online)",
        "date": "2025-01-28",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305488934",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nJoin us for the OWASP Austin Cryptoparty and discover practical ways to protect your privacy and enhance your digital security in a fun, interactive setting! Whether you're a tech enthusiast, a professional, or just starting your journey in cybersecurity, this event offers something for everyone. Gain hands-on experience with tools and techniques, hear from engaging speakers, and connect with a community passionate about building a safer online world. Don’t miss this opportunity to level up your security know-how—mark your calendar and **bring a friend**!\n\nFeaturing:\n\n* James Wickett\n* Mark Spears\n* Rafal Los\n* Josh Sokol\n\nIf you would like to attend in person, please pull a ticket for a free lunch at Emerson/NI location in Austin --\n[https://owasp-austin-2025-january.eventbrite.com](https://owasp-austin-2025-january.eventbrite.com)"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- Web Security Code Review Workshop",
        "date": "2025-02-11",
        "time": "17:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/305674357",
        "timezone": "America/Los_Angeles",
        "description": "Well, the Master himself is in town, so what do we do? Organize a hacker day! :)\nWe are delighted to announce a workshop on Web Security Code Review, led by none other than **Louis Nyffenegger, Founder and CEO of Pentester Lab—yes, our favorite hacker playground!.**\nTraveling all the way from Australia, this is a fantastic opportunity to learn from the master himself.\nThank you very much Semgrep for hosting the event. This meetup is in collaboration with [pacific hackers group](https://www.pacifichackers.org/)\n\n5 PM : Doors open\n5 PM -6 PM Networking\n6-8 PM : Workshop\n\nDetails Below:\n\n**\\# Title:** Web Security Code Review Workshop\n**\\# Abstract:** Learn how to identify vulnerabilities through effective manual security code reviews. In this workshop, we’ll analyze real-world code examples, uncover common flaws like injections and authentication issues, and explore how to leverage built-in security features. You’ll gain practical skills to complement automated tools and confidently tackle security challenges in real codebases. Ideal for developers, AppSec engineers, and code reviewers, this session focuses on practical techniques and real-world impact.\n\n\\# Speaker short bio\nLouis Nyffenegger is a seasoned security engineer and the founder of PentesterLab, a platform dedicated to teaching web penetration testing and security code review. With over a decade of experience in cybersecurity, Louis has focused on penetration testing, architecture analysis, and code reviews."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Jan 2k25 Chapter Meet-up with Mini CTF",
        "date": "2025-01-31",
        "time": "11:30+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/305453272",
        "timezone": "Asia/Kolkata",
        "description": "Join us for the OWASP Bhopal Chapter Meetup to explore the latest trends in Cybersecurity. Our event will focus on topics such as Computer Security, Application Security, Penetration Testing, and Web Application Security. Dive deep into discussions on Software Security and Web Technology, while staying updated on Information Security best practices.\n\nThis meetup will also include interactive sessions on Capture the Flag challenges and Machine Learning applications in cybersecurity. Whether you are a seasoned professional or a newbie in the field, this event is a great opportunity to network with fellow enthusiasts and learn from industry experts. Don't miss out on this chance to enhance your knowledge and skills in the ever-evolving realm of cybersecurity."
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland: Contrast Security Demonstration",
        "date": "2025-02-18",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/305067809",
        "timezone": "America/New_York",
        "description": "Join us on Tuesday, February 18th at Market Avenue Wine Bar for a hands-on lab demonstration with Contrast Security. The presentation will go over features and limitations of Contrasts RAST tool. This session is designed for everyone, whether you decide to participate or not.\n\nContrast is an Application Security solution used by companies like AARP, InfoSys, Citizens Bank, Snap Finance, and more."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Authentication Demystified: Basic Auth to Web Tokens in 60 minutes",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/305318149",
        "timezone": "America/New_York",
        "description": "Welcome to 2025! Both the speaker and I are off at CodeMash in January, so we are going to start our EVERY MONTH transition in February!\n\nWe'll start off with a few highlights related to what is new in the world of appsec, and have a good-of-the-order style chat about the year, and then ... Have you ever searched for \"how to authenticate an API call\" and been confused by the dizzying array of techniques, terminology, jargon, and acronyms that come back?\n\nThis session is designed for anyone that's struggling to make sense of modern authentication options. You'll learn the differences between OAuth, API Keys, HMAC, JSON Web Tokens (JWT), SAML, OpenID Connect, and passkeys using Webauthn. Each technique will be explained in a clear, practical, easy-to-understand way.\n\nThis session focuses on core concepts, not code, and is accessible to anyone that works with technology."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Meeting ",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242794",
        "timezone": "America/New_York",
        "description": "Introduction to OWASP projects. New Members drive."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Essentials: An Overview of Key Projects and Best Practice",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242793",
        "timezone": "America/New_York",
        "description": "Join us for a high-level introduction to the Open Web Application Security Project (OWASP) foundation. We’ll explore its most notable resources—like the OWASP Top 10, Zed Attack Proxy (ZAP), and the Application Security Verification Standard (ASVS)—and discuss practical ways to use them in everyday development and security workflows. This session is perfect for those new to OWASP or looking to brush up on core concepts.\n\nPresented by Francois Fried."
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Um hacker no seu bolso",
        "date": "2025-01-29",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/305527548",
        "timezone": "America/Fortaleza",
        "description": "Marcos Tulio e Anderson Peixoto irão apresentar uma análise detalhada do OWASP Top 10 Mobile, explorando os principais riscos associados a aplicações móveis. Durante a exposição, farão uma abordagem mais aprofundada em tópicos específicos, destacando os cenários mais críticos. Ao final, realizarão uma demonstração prática de análise de segurança em aplicações móveis, ilustrando como atacantes exploram vulnerabilidades para obter privilégios na aplicação e até mesmo no sistema operacional. Por fim, compartilharão as melhores práticas e recomendações para mitigar as vulnerabilidades identificadas, promovendo a segurança no desenvolvimento de aplicativos móveis."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JAN 29, 2025",
        "date": "2025-01-29",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/305489048",
        "timezone": "America/Los_Angeles",
        "description": "**/\\*\\* Updated Meeting Date \\*\\*/**\n**TOPIC**: Adding API Security to your DevSecOps Toolbelt\nJoin us for great networking, dinner and drinks, and see a presentation by **Scott Bly**, Director, Security Technologies, Systems Integration Solutions\n\n**ABSTRACT**:\nHow do you integrate API Security into your DevSecOps processes? You have DevOps tooling and CI/CD pipelines for your product release cycle. Your Dev & Ops teams work well together. You started a DevSecOps transformation to Shift Left and test code security in pipelines.\nBut how do you integrate the Security teams into DevOps to achieve true DevSecOps? Then, how do you integrate APIs, as they are behavior-based? Traditional AppSec can’t identify vulnerabilities in API consumption.\nLearn how to integrate API testing into Shift Left DevSecOps pipelines to eliminate vulnerabilities. Learn how to bring Dev, Sec, Ops teams together to improve Mean Time To Remediation, and keep your teams happy!\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "February 2025 OWASP Chapter Netherlands Meetup",
        "date": "2025-02-13",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/305251997",
        "timezone": "Europe/Amsterdam",
        "description": "See [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **The AI Who Shagged Me!** by **Ali Abdollahi**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Behind the Breach: Understanding and Preventing Web Vulnerabilities** by **Mitchel Koster**\n\n**The AI Who Shagged Me!**\n*Abstract:*\nIn today’s ever-changing world of cybersecurity, bringing AI into red teaming exercises is an exciting way to boost how we assess our organizational defenses. This approach fits well with frameworks like TIBER, which focus on creating realistic simulations of cyber threats. It’s all about making our defenses stronger and more effective! AI algorithms effectively analyze large datasets to identify emerging threats and tactics, aiding in realistic attack simulations. AI-driven tools help replicate complex attacks, providing red teams with thorough assessments of security measures. Using AI-generated anomalies enhances detection capabilities and strengthens incident response plans. However, the integration of AI into red teaming is not without challenges. This discussion aims to provide a nuanced overview of the application of AI in red teaming exercises, examining its potential benefits and limitations within established frameworks like TIBER. By critically evaluating this integration, we can better understand how to harness AI’s capabilities to strengthen cybersecurity offense and defense.\n*Bio:*\nAli is a cybersecurity researcher with over 12 years of experience. Currently, he is the application and offensive security manager at Canon EMEA. He studied computer engineering, published articles, and holds several professional certificates. Ali is a Microsoft MVP and regular speaker or trainer at industry conferences and events.\n\n**Behind the Breach: Understanding and Preventing Web Vulnerabilities**\n*Abstract:*\n“Behind the Breach: Understanding and Preventing Web Vulnerabilities delves into the transformation of modern web applications and architecture, showcasing how advancements in frameworks and browser technologies have revolutionized security. Yet, even with these innovations, attackers persist in uncovering and exploiting vulnerabilities. Drawing from real-world case studies across industries—from agile startups to global enterprises—this presentation not only demonstrates how a deeper understanding of security can thwart these threats, but also highlights how effectively conveying the potential impact of vulnerabilities is key to prioritizing security efforts.”\n*Bio:*\nMitchel Koster is the Chief Security Researcher at Breachlock, where he leads the development of new security products and conducts research and engagements for high-profile clients. His work includes Red and Purple Team exercises and addressing custom security requirements across diverse sectors, including Aviation and Healthcare. With a background in computer science, embedded systems, and programming, Mitchel bridges the gap between modern software development practices and robust security measures.\n\nFor parking, there’s a (paid) parking space less than 5 minutes away at the Q-Park Hermitage. ([ https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88](https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88) )\n\nAlso a 5 minute walk is the Zaandam station. ([ https://maps.app.goo.gl/3emKrp4ygx41SoN67](https://maps.app.goo.gl/3emKrp4ygx41SoN67) )"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Happy 2025 New Year Event join our Working Cyber Incident Workshop Happy Hour\"",
        "date": "2025-01-29",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/305785153",
        "timezone": "America/New_York",
        "description": "Come have some fun with our OWASP Members and Cyber Fireside NJ: Join in hands-on learning with a few Rockstars sharing and teaching.\n\n#### **Workshop Purpose**\n\nThe purpose of this workshop is to enhance the organization’s resilience against threats stemming from fake or malicious applications. By simulating an attack scenario involving a counterfeit app, participants will gain practical experience in identifying, preventing, and responding to such incidents.\n\nThis hands-on exercise is designed to strengthen cross-functional collaboration, reinforce secure app and API design principles, and ensure compliance with relevant regulatory frameworks.\n\n**Exercise Objectives**\n\n1\\. Detection and Prevention of Fake Applications\n\n* Implement methods to identify and validate app integrity and authenticity using advanced runtime checks and mobile attestation solutions.\n* Develop strategies to monitor and promptly remove counterfeit apps from app stores.\n\n2\\. Securing API Communication\n\n* Strengthen API security with app-specific integrity checks, token validation, and certificate pinning to prevent unauthorized interactions.\n* Explore rate limiting and role-based access control (RBAC) as critical safeguards.\n\n3\\. Harden Server\\-Side Security\n\n* Enforce robust input validation and access controls to mitigate server-side vulnerabilities.\n* Simulate threat scenarios to test server-side resilience against credential stuffing and brute-force attacks.\n\n4\\. Incident Monitoring and Response\n\n* Enhance log analysis and telemetry used to detect and investigate rogue app activity.\n* Design and implement a clear incident response playbook that includes user notification, regulatory compliance, and mitigation strategies."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle February 2025",
        "date": "2025-02-19",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/305613479",
        "timezone": "Europe/London",
        "description": "We're back with our first event of 2025! We’ll be doing our usual two talks and pizza format.\n\nLocation: Opencast Software, Unit 2, The Kiln, Hoults Yard, Newcastle‑upon‑Tyne NE6 1AB.\nThere is free onsite registered parking. To register, attendees must enter their details into an iPad upon entering the Opencast office otherwise a parking fine may be issued.\nNeither OWASP Newcastle or Opencast can assist with or be responsible for parking issues, you do so at your own risk.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1830 OWASP Newcastle Welcome\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk one\n**Title:** Harassed by Hamas: Israel’s Cyberwar\n**Speaker:** Andy Pannell\n**Speaker Bio:** Andy Pannell is an accomplished application security lead with a keen focus on safeguarding product and cloud security for a prominent mobile ride-hailing company. His expertise lies in identifying vulnerabilities, implementing robust security measures, and ensuring the integrity of critical systems.\nOutside the digital realm, Andy indulges in a passion that balances the binary code: endurance racing. Andy spends hours at racetracks, appreciating the symphony of precision engineering and adrenaline-fueled competition.\n**Talk Synopsis:** This presentation examines (in my opinion) one of the most recently overused phrases in the media “cyber war”, and what it actually means in reality for us cyber security practitioners.\nWe will start by examining warfare, and review previous nation states attacks that have crossed the boundary into offensive cyber operations.\nWe will then focus on October 2023 and the tactics deployed by both Hamas and the IDF during the war, from a cyber perspective. To do this we will discuss reverse engineering malware samples, API security and DDoS attacks in detail.\nLastly we will conclude by looking at what the future of cyber warfare looks like, and what we can do to best protect ourselves / our organisations in such events.\n\nTalk two\n**Title:** Scaling Security Through Collaboration: The Role of Security Champions in Modern Organisations.\n**Speaker:** Kimberley Graham\n**Speaker Bio:** Kimberley is the Manager of People-Centered Security at Sage, headquartered in Newcastle. She is responsible for promoting and championing security within Sage.\n**Talk Synopsis:** TBC\n\nThere is a capacity limit on the venue so ticket numbers for the event have been restricted so please cancel your ticket if you are unable to attend.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The State of Secure Coding: Talk + Hands-On Tournament",
        "date": "2025-01-30",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/305300856",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, January 27th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**The State of Secure Coding: Talk + Hands-On Tournament**\nIn this talk, we will explore the current state of secure coding, focusing on common vulnerabilities and pitfalls developers face today. Drawing from the OWASP Top 10, the session highlights real-world examples of flawed code and their potential risks. Attendees will gain practical insights into better coding standards and participate in a hands-on workshop to learn how to identify and fix these issues effectively. By the end, participants will be equipped with actionable techniques to create more secure and resilient applications.\n\n**Thanks to our Sponsor Cycode!**\nCycode enables companies to deliver software fast without compromising on security. Cycode delivers a complete Application Security Posture Management (ASPM) platform that can replace existing testing tools or integrate with them while providing visibility, prioritization, and remediation of vulnerabilities at scale.\n\nCheck them out at: https://cycode.com"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-02-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181943",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2025-01-30",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/304844725",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "OWASP Philly 2025 Bootstrap",
        "date": "2025-01-28",
        "time": "19:30-05:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/305684772",
        "timezone": "America/New_York",
        "description": "Dear Friends -\n\nNew year, new OWASP Philly? Well yes, but don’t worry - a lot of things will stay the same (and be better!). 2024 was foundational for us, and affirmed how great of a community we have, which we love to be a part of.\n\nSo please join us in this first meeting of 2025, as we chart our course for new horizons and evaluate our place and role in the community. This meeting will be our first social, along with a \\~30min discussion of OWASP projects and structure, with lots of opportunity for input and feedback. We’ll also have an intro for some of our new leadership members, discuss the great benefits of OWASP and membership, and look at the volunteer roles and opportunities we have coming up.\n\nAnd if nothing else, come warm your bones and talk security-shop with some old friends and new! Lite refreshments with heavy good times will be provided at the place we meet - upstairs at the Black Sheep - 730PM.\n\nSee you there!\nHiggs"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "February 2025 Meeting",
        "date": "2025-02-04",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/305763822",
        "timezone": "America/Phoenix",
        "description": "**Revoked! How WebPKI is Failing Users** (75 minutes)\n\n* For decades, WebPKI has relied on certificate revocation as a safety net to shield users from untrusted websites.\n* The issue is that our current approaches: CRLSet and OCSP, don't fully address the issue and have glaring weaknesses.\n* CRLite was born from Mozilla to challenge the status quo and make certificate revocation a reality.\n* But what lies behind CRLite's success? A fascinating journey through the realms of cryptography and hashing reveals that the solution is rooted in an unlikely place: a 50-year-old mathematical concept.\n* The answer may surprise you, but it's one that could change everything."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-02-12",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349991",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sofia",
        "repo": "www-chapter-sofia",
        "name": "OWASP Sofia - January 2025 Meetup",
        "date": "2025-01-31",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-sofia-chapter/events/305741781",
        "timezone": "Europe/Sofia",
        "description": "Добре дошли в месечната ни сбирка на OWASP Sofia!\n\nWelcome back to the OWASP Sofia Meetup! This event will also be in Bulgarian. We will do English-speaking events as soon as we have some international speakers.\n\nЗапочваме новата година с първото събитие на живо, на което колегите и приятелите от [Amatas](https://amatas.com/) & [Foothold Security](https://footholdsecurity.com/) ще ни запознаят с иновативни и интересни методи и подходи за тестване и експлоатиране на активна директория и мрежови протоколи. Домакини на събитието ще бъдат [ЕЦИХ Тракия](https://dihtrakia.org/) и Тех Парк София.\n\n**Програма за 31 Януари 2025**\n\n* 19:00 - Начало и въведение - [Миглен Евлогиев](https://www.linkedin.com/in/miglen/) @ [Payhawk](https://payhawk.com/trust)\n* 19:10 - Кратко представяне на [ЕЦИХ Тракия](https://dihtrakia.org/) - [Христиан Даскалов](https://www.linkedin.com/in/hristian/)\n* 19:15 - [Петър Джалалиев](https://www.linkedin.com/in/pdjalaliev/) @ [Amatas](https://amatas.com/) \\- OS Command Injection via CRLF Injection in SNMP Services\n* 20:00 - [Любен Петров](https://www.linkedin.com/in/lyuben-petrov-b287bb236/) @ [Amatas](https://amatas.com/) \\- Active Directory Exploitation\n* 20:45 - [Милчо Хекимов ](https://www.linkedin.com/in/milcho-hekimov/)@ [Foothold Security](https://footholdsecurity.com/) \\- Authentication Gone Bad \\- Penetration Testing Techniques for Chaining Vulnerabilities\n* 21:30 - Q&A / Networking\n* 22:00 - Закриване\n\nСъбитието ще се проведе на живо в зала [The Venue в Тех Парк София](https://sofiatech.bg/en/venue/the-venue-incubator/). Ако желаете да споделите нещо интересно свързани с Уеб Сигурност, моля изпратете ни вашата сесия на [https://sessionize.com/owasp-sofia/](https://sessionize.com/owasp-sofia/)\n\nЗа следващите ни събития планираме да ги организираме на място, за целта си търсим желаещи хост компании, пишете ни ако имате интерес!"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "4th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-02-11",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584148",
        "timezone": "Europe/Berlin",
        "description": "**AI Security & Insights into OWASP Top 10 LLM**\n\nAs artificial intelligence systems become increasingly integrated into our daily lives, the importance of securing these systems grows exponentially. This keynote introduces the core principles of AI security, highlighting the unique challenges and risks posed by large language models (LLMs). Explore the recently introduced OWASP Top 10 for LLMs—a comprehensive framework that identifies the most critical vulnerabilities and provides actionable guidance for securing AI applications. We'll finish with an oversight of all the initiatives at the OWASP Top 10 LLM community.\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "OWASP Switzerland Community Meetup, February 2025",
        "date": "2025-02-19",
        "time": "17:10+01:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/305296964",
        "timezone": "Europe/Zurich",
        "description": "Join us at the OWASP Switzerland Community Meetup to kick off the year 2025! This meetup will feature two exciting talks on application security. It’s a fantastic opportunity to network with like-minded professionals, exchange ideas, and expand your knowledge in a friendly and collaborative environment.\n\n**Program:**\n**17:10** - **Doors open**: Grab a drink, meet old and new friends from the OWASP Switzerland community\n\n**17:35** - **Uninstallable by Design**: The Role of Pre-installed Apps in Android’s Security Landscape - (Thomas Sutter, PhD Student @ University of Bern)\n\n**18:30** - **Coffee Break**\n\n**18:45** - **Continuous Security with DevSecOps**: How Platform Engineering Transforms Modern Application Security​ - (Romano Roth, Chief of DevOps / Partner @ Zühlke)\n\n**19:40 - 20:10 - Drinks, Fingerfood and Networking:** Grab a bite and chat with old and new friends\n\n**Talk details:**\n\n* **Uninstallable by Design - by Thomas Sutter**: The competitive smartphone market is keen to prevent its intellectual property from being analysed by competitors and the public. As a result, most smartphones are locked when distributed, and anti-reversing techniques are widely used. Consequently, millions of users use smartphones daily without a clear understanding of the software’s functionality and purpose. To lower the bar for security researcher to analyze Android firmware, we developed a novel framework, called FirmwareDroid. In this talk, we discuss the challenges to automate the process of analyzing Android firmware and showcase how we use FirmwareDroid to analyse pre-installed Android apps in academia.\n* **Continuous Security with DevSecOps - by Romano Roth:** Security must be seamlessly integrated into every stage of the software development lifecycle. This talk explores how combining DevSecOps principles with Platform Engineering empowers teams through automation, standardized environments, and reduced complexity. Learn how these approaches transform application security into a proactive, scalable, and collaborative enabler for delivering secure, high-quality software at speed."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-02-20",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510162",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Extra OWASP SAMM community call Europe - Asia",
        "date": "2025-02-14",
        "time": "08:00-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/305496638",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\nWe will share any project news and updates.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    }
]