[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Hack-Proof Your Code:  Exploring Mobile App Weaknesses with OWASP MAS",
        "date": "2024-08-22",
        "time": "11:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/302022462",
        "timezone": "America/New_York",
        "description": "In this talk, we will take a hands-on look at some of the latest OWASP MAS developments, in particular the new MASWE (Mobile Application Security Weakness Enumeration). This talk will introduce the concepts of \"weaknesses\", \"atomic tests\" and \"demos\" that are the basis of the upcoming MASTG v2. Attendees will gain practical knowledge through detailed examples that show the journey from definition to implementation using both static and dynamic analysis techniques available in MASTG. In addition, discover the newly developed MAS test apps designed to streamline research and improve the development of robust MAS tests.\n\nDon't miss this opportunity to improve your mobile app security skills and make your apps hack-proof. Whether you're looking to bolster your defenses or learn how to uncover vulnerabilities, this session will provide you with the cutting-edge resources you need to stay ahead in mobile security!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-15",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302459888",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "August 2024 OWASP Austin Security Professionals Happy Hour--sponsor Trellix",
        "date": "2024-08-08",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302124371",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, August 8th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Trellix](https://www.trellix.com)\n*Trellix is a global company redefining the future of cybersecurity. The company’s open and native extended detection and response (XDR) platform helps organizations confronted by today’s most advanced threats to gain confidence in the protection and resilience of their security operations. Trellix, along with an extensive partner ecosystem, accelerates technology innovation through machine learning, automation, and actionable real-time intelligence to empower over 40,000 customers with living security. Trellix is committed to accelerating the inclusion of all communities in the industry, bringing together talented professionals with diverse backgrounds and experiences to have a meaningful impact on the evolution of cybersecurity.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-08",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302335657",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-01",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302074820",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - July 2024 (Online)",
        "date": "2024-07-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207014",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation! Presentation begins at 12 CDT!\n\nPresentation: **Cyber Resilience - Findings from the 2024 Futures Report**\n\nWe are poised on the precipice of a new era of computing underpinned by new networks, new apps, and a digital-first experience.\nHear the latest findings from AT&T Cybersecurity research and learn about:\n\\- What high\\-priority edge computing use cases are across seven industry markets\n\\- How to secure and work with the edge ecosystem\n\\- How the attack surface is changing\n\\- How endpoints are diversifying\nThe data from this research helps audiences understand challenges and opportunities of the future and examines:\n\\- Balanced investment strategies\n\\- Collaboration and communication needs\n\\- Building with dynamic cyber resilience in mind\nSecurity is now a critical part of business - learn how to move your team to the future!"
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém UEPA 2024",
        "date": "2024-08-03",
        "time": "08:30-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/301800873",
        "timezone": "America/Boa_Vista",
        "description": "No dia 03 de agosto, a **OWASP Belém** é um dos capítulos brasileiros entre os mais de 200 capítulos ativos em todo o mundo. Nosso objetivo é disseminar a missão da OWASP, tornando a segurança das aplicações visível, para que as pessoas e organizações possam tomar decisões conscientes sobre os verdadeiros riscos de segurança das aplicações.\nAlém disso, estamos empenhados em promover práticas de computação forense, ajudando a identificar, preservar, analisar e apresentar evidências digitais de forma adequada. A computação forense é essencial para a investigação de incidentes de segurança, permitindo que as organizações compreendam as origens e impactos de ataques, além de reforçar suas defesas contra futuras ameaças.\n\n**Data:** 03/08/2024\n\n* **Horário:** 8h30m.\n* **Local:** UEPA\n* **Endereço**: Tv. Dr. Enéas Pinheiro, 2626 - Marco - UEPA\n* Inscrição: https://bit.ly/owaspuepa\n\nConfira a programação:\n**08h30m:** Abertura\n**09h00:** Apresentação OWASP\n**09h15 - 09h45:** Em breve.\n\n**10h - 10h45:** Em breve**.**\n\n**10h45 - 11h00:** Intervalo / Networking\n**11h15 - 11h45:** Em breve."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "OWASP Juice Shop – hands on pen testing!",
        "date": "2024-08-06",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/302342937",
        "timezone": "Australia/Brisbane",
        "description": "Hello hackers, security enthusiasts, and the like.\nFor this upcoming OWASP meetup we are going to do things a little different. Over the past few years, we have presented on numerous web /API vulnerabilities, this time we are going to exploit some of these weaknesses!!\nYes, that’s right, less talking more hacking!\nAs we have a mixed group of attendees, including executives, students, developers, security experts and enthusiasts, and to stay on brand :D, let’s focus on exploiting vulnerabilities present within Try Hack Me’s OWASP Juice Shop.\nListed below are the things you will need to participate:\n· Laptop (one that can be used for exploiting weaknesses (Try Hack Me’s OWASP Juice Shop), perhaps not a corporate laptop :D)\n· Internet (Mobile hotspot in case the venue’s Wi-Fi cannot be used for any reason)\n· Try Hack Me account (Can be a free version)\n· Optional – Linux based VM + Try Hack Me VPN if you prefer to test from a local machine. Otherwise, you can spin up a cloud based Try Hack Me Linux based VM to conduct testing from.\nFor those that have already completed this room well done!! Feel free to attend and perhaps pick another room or HTB to focus on, attend for the vibes/social aspect \nFor those who have never performed pen testing of any kind, no stress, we can provide support/answer any questions that you may have. This is a judgement free zone, there are no dumb questions!!\nHope to see you all there\n\nVenue will be announced soon (Brisbane CBD)"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "Secure by Design: Empowering Enterprise Security through Application Governance",
        "date": "2024-07-27",
        "time": "10:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/302273299",
        "timezone": "Africa/Cairo",
        "description": "In today's rapidly evolving digital landscape, securing applications is a critical concern for enterprises. This joint event, organized by the OWASP Cairo Chapter and ISACA Cairo Chapter, aims to equip security professionals, developers, and IT leaders with the knowledge and tools necessary to integrate security throughout the application development lifecycle.\n\nThe event will feature two key sessions:\n[10:00 AM - 10:45 AM]⁠ ⁠Integrating Security into the Development Lifecycle: Governance Frameworks and Best Practices [Speaker: Mohamed Alfateh]\n\\- Discover strategies for embedding security within Agile\\, Waterfall\\, and DevSecOps methodologies\n\\- Explore the security manager's role in fostering collaboration\\, driving security awareness\\, and measuring the effectiveness of security initiatives\n\n[10:45 AM - 11:30 AM]⁠ ⁠Secure Coding Practices for Web Applications [Speaker: Mohammed Sherif]\n\\- Explore secure coding principles and techniques to mitigate common application vulnerabilities\n\\- Learn about secure coding standards\\, code review best practices\\, and automated security testing\n\nThrough a combination of expert presentations, interactive discussions, and real-world case studies, attendees will gain a comprehensive understanding of secure application development and the essential role of security governance in empowering enterprises to build secure, resilient, and compliant software solutions."
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Hacking AWS: Hands-On exploitation of cloud services",
        "date": "2024-07-27",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/302116015",
        "timezone": "Asia/Kolkata",
        "description": "**Note:** **1\\. Participants can attend the event by invitation only\\, as we have limited seating\\. Venue details will be sent to selected participants\\.**\n**2\\. This workshop is intended for peoples who already have basic knowledge in AWS environment only\\, not for newbies/beginners\\.**\n\n**Hacking AWS**\nAn immersive 8-hour workshop designed for Blackbox Pentesters looking to enhance their skills in attacking and exploiting AWS resources.\nThis beginner-friendly session dives deep into AWS security, focusing on identifying and exploiting vulnerabilities in various AWS services.\n\n**What You Will Learn**\nThroughout the workshop, attendees will gain hands-on experience in:\n\\- Enumerating and Reconnaissance: Identifying and mapping AWS resources\\.\n\\- IAM Misconfigurations: Exploiting flaws in IAM roles and policies\\.\n\\- S3 Bucket Exploitation: Accessing and exfiltrating data from misconfigured S3 buckets\\.\n\\- EC2 Instance Attacks: Gaining unauthorized access to EC2 instances\\.\n\\- Other Common Misconfigurations: Identifying and exploiting other prevalent AWS vulnerabilities\\.\n\n**Capture the Flag (CTF) Event**\nThe workshop will conclude with a Capture the Flag (CTF) event, allowing attendees to apply what they've learned in a simulated AWS environment.\nThe CTF event will end on the same day, but the labs will remain accessible for 48 hours post-session for further practice.\n\n**Ideal Audience**\nThis workshop is best suited for individuals aiming to work on breaking into AWS environments, including:\n\\- Offensive Security Engineers\n\\- Pentesters Specializing in Cloud Security\n\\- Security Engineers\n\\- Technical Cloud Security Consultants\n\n**Not Suitable For**\nRed Teamers: This session does not cover advanced attack tactics, defense evasion, C2 hosting, or advanced data exfiltration.\nBlue Teamers & Defenders: Defensive strategies against these attacks are not covered.\nBeginners to AWS: Basic understanding of AWS and cloud computing concepts is required.\nRequirements for Participation\nAWS Account: Each attendee must have their own AWS account with root/admin access. Free tier accounts are sufficient.\nAWS CLI v2: Must be installed on the attendee's system.\nHardware: Attendees must bring their own laptops with internet connectivity.\nKnowledge Base: Basic familiarity with AWS services and concepts like IAM, Lambda, EC2, etc., is needed.\n\n**Kindly Fill this form for registration :** [https://forms.gle/GSTZZmfpEUHiDYHN6](https://forms.gle/GSTZZmfpEUHiDYHN6)"
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Un gran poder conlleva una gran responsabilidad.",
        "date": "2024-07-31",
        "time": "20:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/302332749",
        "timezone": "America/Santiago",
        "description": "Únete a nosotros para una conversación en modo conspiranoico, acerca de los riesgos y oportunidades que ofrecen nuestro sw y herramientas cotidianas.\n\nA priori, analizaremos los super-poderes del navegador CHROME, BRAVE, y otras funciones de tu notebook y smartphone.\n\nAprende y previene, para evitar posibles vulnerabilidades y malas prácticas que podrían comprometer tus proyectos."
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "OWASP Cheat Sheet Series Bug Bash!",
        "date": "2024-08-07",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/302142287",
        "timezone": "America/New_York",
        "description": "Interested in application security? Or have you been wanting to get into open source but aren't sure where to start? Come to our Bug Bash! We'll provide an overview of the [OWASP Cheat Sheet Series](https://cheatsheetseries.owasp.org/) project, a collection of articles on specific application security topics. Then we'll dive into the project's GitHub repository and start hacking away at issues. We'll have mentors on hand to help you get started and answer any questions you have. All skill levels are welcome!\n\nNever submitted a pull request before? No problem! We'll walk you through the process and help you get your first open source contribution under your belt.\nAre you an expert in one specific area of application security? Come contribute to the project by writing a new cheat sheet or improving an existing one.\nJust getting started? Come and learn from experts, and contribute by fixing typos, improving formatting, or adding examples to existing cheat sheets. You don't need to be a technical expert to participate in open source!\nHave tons of experience? Come help mentor others and review their pull requests.\n\nWe'll unleash the group on the project and see how much we can accomplish in a couple hours. There will be food for all attendees, and we'll have special **awards** for the top contributors in various categories.\n\n**Bring your laptop! Make sure you're set up with a GitHub account, and ideally have Git installed on your laptop.**\n\n**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required. Include your first and last name with your RSVP.**\n**Sponsored by [Traceable](https://www.traceable.ai/)**"
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland: Join the Conversation on Application Security",
        "date": "2024-08-13",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/302440241",
        "timezone": "America/New_York",
        "description": "Thank you to everyone who joined us last month. We’ll be meeting again on Tuesday, 8/13 at Market Avenue Wine Bar to discuss and share knowledge on information/application security topics. There won’t be any dedicated speakers this time—just come ready meet others and join the conversation!"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #66 - Cloud Security & Vulnerability Disclosure",
        "date": "2024-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/300654912",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #66! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Security at Scale - Mastering Cloud Security in the Cyberwar Era**\n\n*Dominik Sowinski, Cybersecurity Architect & Cybersecurity Community Lead, Siemens*\n\nIn the midst of rapid cloud transformation, industrial organisations face an ever-evolving cyber threat landscape, exacerbated by global events such as the war in Ukraine. This presentation will address the latest APT activities and the significant risks they pose to cloud infrastructures and critical industrial operations. We will explore cutting-edge strategies, technical considerations and essential processes to rapidly adapt and secure cloud environments at scale against these relentless threats. The presentation will help you understand how to fortify cloud applications and infrastructure in this dynamic threat landscape.\n\n**2\\. Talk: Let's talk vulnerabilities**\n\n*Vinit K., Independent security research and threat hunting*\n\nA talk and live demo on cybersecurity threats involving terminal emulators and SSH. We will explore how URL handling in iTerm2 and Hyper can be abused for code execution, as well as delve into the recent CVE-2023-51385 vulnerability, which allows unexpected code execution via SSH ProxyCommand. The session will include interactive segments where the audience can contribute exploit ideas and deepen their understanding of these critical security issues.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 31.07.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-08-19",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686443",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-07-29",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/301991448",
        "timezone": "America/Los_Angeles",
        "description": "Join us for our 3rd mixer with participating cybersecurity communities in Southern California, enjoy beautiful weather, amazing sunset, great conversations, network with your peers, make new friends!\nYou **don't** have to be a member of any group to participate. Mark your calendars; see you there!!\n\n**VENDOR Opportunities Available**\n*Vendors interested in attending please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - July 2024 Meetup",
        "date": "2024-07-31",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/302245868",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nWe had a great meetup last month. Thank you to those that attended.\nTo make it easier, let's call this new format \"Practitioner's Roundtable\". We'll keep this going for the rest of this year. Following the survey last month of when you'd like to have these meetings, 66.7% of you told us you'd prefer the last Wednesday of the month - so, it shall be.\n\nIn our last meetup, attendees voted for [Dr. Watson's Bar in the CBD](https://www.thesherlockholmes.com.au/dr-watsons-bar/) as our location this month. On 31st July 2024 6PM, there we shall meet.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic.* \\*)\\*\n\nPlease remember to update your RSVP if you can no longer attend. Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get.\n\nWe're looking forward to the discussions we had once again.\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is [inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics.\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there.\n\nSee you there.\nThank you."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Capture The Flag Event - SHRED with Security Innovation",
        "date": "2024-08-14",
        "time": "16:30-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300354016",
        "timezone": "America/Chicago",
        "description": "Join us in-person for an exciting day of hacking a cyber range! Thanks to the folks at Security Innovation, we'll host attackers of all skill levels and background to have some fun networking and learning about the mindset, skills and methodologies used in the seemingly growing number of breaches we hear about in the news."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2024-08-08",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181908",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "August 2024 Meeting",
        "date": "2024-08-06",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/302320210",
        "timezone": "America/Phoenix",
        "description": "**Introduction to DevSecOps with GitHub Actions** (45 min)\nGitHub Actions are a powerful way to automate your development pipelines. This talk will give you a foundational understanding of GitHub Actions with enough knowledge to start integrating security scans. We will start with the fundamentals of GitHub Actions and put those into practice with a Hello World test. Then we will look at how to create a dashboard that displays the current state of your repository. Finally, we will resolve one of the failing dashboard metrics by implementing an automated scan. This is intended to be a hands-on talk. Bring your laptop and set up a GitHub account before the meeting begins."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Bezpieczeństwo API + Kariera w branży IT security?",
        "date": "2024-07-30",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/302269188",
        "timezone": "Europe/Warsaw",
        "description": "Przed nami kolejne spotkanie naszej grupy. Mamy dla Was wykład Maćka Kofela o bezpieczeństwie API a w drugiej części proponujemy dyskusję o karierze w IT security.\n\n* **Bezpieczeństwo API (Maciej Kofel)**\nPodczas tworzenia i testowania API często priorytetem są wydajność i funkcjonalność. Ale co z bezpieczeństwem? Czy wiesz, że hakerzy mogą wykorzystać API do wyciągnięcia cennych informacji z Twojej aplikacji lub uzyskania dostępu do Twojego serwera, co umożliwia im dalsze eksplorowanie zasobów Twojej firmy? Na nadchodzącym spotkaniu OWASP zaprezentuję takie przykłady.\nW mojej prezentacji dowiesz się o lukach z listy OWASP API Top10, które mogą wystąpić w API, poznasz narzędzia i techniki testowania bezpieczeństwa API oraz dowiesz się, gdzie szukać pomocy lub rekomendacji dotyczących łatania tych luk.\nTa sesja będzie pełna praktycznych przykładów. Po tej prezentacji, już nigdy nie spojrzysz na API w ten sam sposób.\n*\n* **Kariera w branży IT security (dyskusja)**\nW drugiej części naszego spotkania porozmawiamy o tym jak wejść do branży IT security i jak planować swoją karierę. Zapraszamy zarówno tych którzy dopiero planują rozpoczęcie pracy, tych którzy mają już kilka lat doświadczenia, jak i managerów prowadzących rekrutację. Porozmawiamy o tym co działa a co nie, jaki jest obecny stan rynku pracy, jakie specjalności są dzisiaj a jakie będą w przyszłości, na co warto zwracać uwagę planując swoją karierę w IT security."
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro #16 [PRESENCIAL]",
        "date": "2024-08-15",
        "time": "18:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/302429958",
        "timezone": "America/Sao_Paulo",
        "description": "Em agosto voltaremos com nossos encontros PRESENCIAIS, com apoio da **AZION** cedendo o espaço para nossa a comunidade, teremos um encontro presencial na sede da empresa.\n\nVAGAS **LIMITADAS**\n\n**Confira nossa agenda:**\n 18:30 - Credenciamento e wellcome coffee\n\n 19:00 - \"Hackers a favor: Como Programas de Bug Bounty Protegem Empresas” - Raphael Estima\n[https://www.linkedin.com/in/raphael-e-m/](https://www.linkedin.com/in/raphael-e-m/)\n\n 19:45 - \"Segurança digital no contexto da Indústria 4.0” - Marcos Rodrigues de Carvalho\n[https://www.linkedin.com/in/marcos-rodrigues-de-carvalho-8ab2381b7/](https://www.linkedin.com/in/marcos-rodrigues-de-carvalho-8ab2381b7/)\n\nPara este encontro iremos emitir certificado de participação, esperamos vocês na Praça Dr. Maurício Cardoso, 71 - 4º andar - Porto Alegre - RS."
    },
    {
        "group": "Riyadh",
        "repo": "www-chapter-riyadh",
        "name": "Data management and data Governance",
        "date": "2024-07-29",
        "time": "21:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/302409760",
        "timezone": "Asia/Riyadh",
        "description": "**Topic Details**\nData management and data governance are two interrelated concepts that are crucial for organizations in today’s data-driven world. Data management is the execution, putting the practices in place to handle data effectively. Data governance sets the direction, outlining the policies and procedures that guide data management activities. In this talk, we will explore in details how data management and data governance play an important role for any application."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-08-14",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539097",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver Monthly Meetup",
        "date": "2024-08-15",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516374",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Yerevan",
        "repo": "www-chapter-yerevan",
        "name": "OWASP Yerevan July meetup - Davit Karapetyan; Artur Papyan",
        "date": "2024-07-31",
        "time": "19:00+04:00",
        "link": "https://www.meetup.com/owasp-yerevan/events/302352402",
        "timezone": "Asia/Yerevan",
        "description": "OWASP Yerevan July meetup agenda:\n\n1. LETS NOT GET HACKED: some vulnerabilities and how to avoid them - Davit Karapetyan\n2. Details about the cameras draft law - Artur Papyan\n\nLocation: American University of Armenia\nRoom number 314W in Paramaz Avedisian building (PAB, second/new building)."
    },
    {
        "group": "Security Integration System",
        "repo": "www-project-security-integration-system",
        "name": "Data management and data Governance",
        "date": "2024-07-29",
        "time": "21:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/302409760",
        "timezone": "Asia/Riyadh",
        "description": "**Topic Details**\nData management and data governance are two interrelated concepts that are crucial for organizations in today’s data-driven world. Data management is the execution, putting the practices in place to handle data effectively. Data governance sets the direction, outlining the policies and procedures that guide data management activities. In this talk, we will explore in details how data management and data governance play an important role for any application."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #66 - Cloud Security & Vulnerability Disclosure",
        "date": "2024-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/300654912",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #66! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Security at Scale - Mastering Cloud Security in the Cyberwar Era**\n\n*Dominik Sowinski, Cybersecurity Architect & Cybersecurity Community Lead, Siemens*\n\nIn the midst of rapid cloud transformation, industrial organisations face an ever-evolving cyber threat landscape, exacerbated by global events such as the war in Ukraine. This presentation will address the latest APT activities and the significant risks they pose to cloud infrastructures and critical industrial operations. We will explore cutting-edge strategies, technical considerations and essential processes to rapidly adapt and secure cloud environments at scale against these relentless threats. The presentation will help you understand how to fortify cloud applications and infrastructure in this dynamic threat landscape.\n\n**2\\. Talk: Let's talk vulnerabilities**\n\n*Vinit K., Independent security research and threat hunting*\n\nA talk and live demo on cybersecurity threats involving terminal emulators and SSH. We will explore how URL handling in iTerm2 and Hyper can be abused for code execution, as well as delve into the recent CVE-2023-51385 vulnerability, which allows unexpected code execution via SSH ProxyCommand. The session will include interactive segments where the audience can contribute exploit ideas and deepen their understanding of these critical security issues.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 31.07.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    }
]