[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2023 (Online)",
        "date": "2023-05-30",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705737",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- Coming Soon\\!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days, Cloud Security: The Purple Team Ninja Learning Lab",
        "date": "2023-05-03",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/292970141",
        "timezone": "America/Los_Angeles",
        "description": "After a long time we are happy to announce a hacker day with hands on workshop by Abhay Bhargav. This meetup is sponsored by DeepFactor.\nWe are presenting this event in partnership with Pacific hackers group.\n\nSchedule:\n5PM :- Doors open, food, drinks and networking\n5.45PM :- Introduction and Short talk by Kiran Kamity from Deepfactor\n6PM :- Workshop on The Purple Team Cloud Security Ninja Learning Lab\n8 PM :- Doors closed.\n\nTalk by Kiran Kamity(TBD)\n\n## Session Abstract\n\nThe Purple Team Cloud Security Ninja Learning Lab is meant to be a completely hands-on exploration of cloud security attacks and defense against major cloud providers, AWS, Azure and GCP. In this Learning Lab, participants will be given vulnerable cloud environments on cyber-ranges. The participants have to identify and fix the vulnerabilities in the cloud environments.\n\n## Facilitator(s)\n\n* Abhay Bhargav, Founder and Chief Research Officer, AppSecEngineer\n\n## Technical Requirements\n\n* Participants will need to bring their own laptops that can connect to the conference WiFi network. They will need to access our lab environment on the cloud to access the labs for the learning lab\n* Participants should preferably not have a highly restrictive network policy, especially to access cloud resources\n\n## Outline\n\n* 0-20 minutes: Overview of Learning Lab, Shared Responsibility on Cloud, History of Cloud Attacks and Exploits\n* 21-60 mins - AWS Attack and Defense Scenarios\n* AWS EC2 and Attack and Defense Story and Scenario\n* AWS Lambda Attack and Defense Story and Scenario\n* 60-90 mins - Azure Attack and Defense Scenarios:\n* Azure Compute and Storage Attack and Defense Story\n* Azure Functions and Logic Apps Attack and Defense Story and Scenario\n* 90-110 mins - Google Cloud Attack and Defense Scenarios:\n* Google Storage IAM Attack and Defense Story and Scenario\n* 110-120 mins - Conclusions + Review of Scenarios"
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "OWASP Belfast event! ",
        "date": "2023-05-25",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/293191036",
        "timezone": "Europe/London",
        "description": "Hello OWASP Belfast!\n\nWe are delighted to announce that we are back with our first hybrid event for 2023 with an exciting line up of talks from industry leaders. The Meet up will be in partnership with ESO, who have also kindly offered to host the evening and provide pizza, beers and soft drinks for everyone!\n\n**Date**: 25th May 2023\n**Time**: 6.30 PM\n**Location**: ESO, 42 Fountain St, Belfast BT1 5EF.\n\n**Or join us virtually by Zoom**: https://eso.zoom.us/j/93766328107\n\nFirst, we will talk about threat modelling, its importance to developers, and how it can be implemented as a continuous approach within the development pipeline. This will naturally lead into a discussion about the current TOP 10 threats by OWASP focusing specifically on: HTTP request smuggling, mass assignment attacks, plus terraform security best practices. Finally, to wrap up, we’ll discuss how automation\ncan help address OWASP vulnerabilities, the importance of design principal prioritisation and how the utilisation of code analysis can improve vulnerability detection, management, and remediation as part of the development pipeline.\n\n**Agenda**:\n6.30 - 6.50 Networking\n6.50 - 7.00 Welcome & chat about ESO\n7.00 - 7.20 Talk 1: Threat Modelling (Simon Whittaker, Vertical Structures).\n7.20 - 7.30 BREAK\n7.30 - 7.50 Talk 2: OWASP Top 10 (Denis Podgurskii)\n7.50 - 8.00 BREAK\n8.00 - 8.20 Talk 3: Automating OWASP Defences (ESO)\n8.20 - 8.30 Q&A, Networking and Exit Disclaimer\nAs always, our events are designed to educate. Any tools and techniques\ndemonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nSpeaker Info:\n**Finian Mackin** – Director of Security Architecture at ESO\nhttps://www.linkedin.com/in/finian-m-81718014/\n**Simon Whittaker** \\- CEO at Vertical Structure Ltd\nhttps://speaking.verticalstructure.com/bio\n**Denis Podgurskii** \\- OWASP Belfast\nhttps://www.linkedin.com/in/denis-podgurskii/\n\nAdditional Information:\nESO is located between Waterstones bookshop and the back of Boots in Belfast city centre.\nThey have two working lifts\nESO employees will be at the door to welcome attendees and show them to the meetup space."
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Birmingham Chapter Meetup May 2023",
        "date": "2023-05-04",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/292724936",
        "timezone": "Europe/London",
        "description": "Welcome from OWASP Birmingham to our first Meetup of 2023 and we're in person @Hays at One Colmore Square Thursday 4th May for two great Infosec talks.\n\nOur guest speakers are:\n\n* Dave Archer from Contrast Security, and\n* Stefania Chaplin (DevStefOps) from Gitlab.\n\n5.45pm - Doors open\n6.15pm - Welcome and Food\n6.30pm - TALK #1 \"Debunking myths about IAST & RASP\" with Dave Archer\n\n\"David has been working on security instrumentation for nearly a decade now, and during this time here he's had countless conversations with people about how and where IAST and RASP can be used to help accelerate DevSecOps. What continues to surprise him is the misconceptions that surface again and again about which teams should use these technologies and where they can benefit from them. David will debunk some of those myths and give us all a clearer picture on their usefulness and how and where we should be using them.\"\n\n7.00pm - Break\n7.15pm - TALK #2 \"DevSecOps with GitLab: How to embed Security within the Software Delivery Process\" with Stefania Chaplin\n\n\"Implementing DevOps can drastically improve the rate we deliver software. Organisations can go from deploying changes a few times a year to multiple times a day. What about vulnerabilities? Security is often considered an afterthought and this can have dire consequences as the world becomes increasingly reliant on software. How do we embed security into the software delivery process? Security is a quality check, there are multiple types and we need to make the software delivery experience as smooth as possible.In this session, you'll find out more about common pain points, solutions, and how to embed security within the software delivery process and secure your DevOps process.\"\n\n7.45pm - Questions/Any Other Business\n8.00pm - Close\n\n***\n\nNathan + Jim"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "Introducing the OWASP Top 10 for Kubernetes",
        "date": "2023-05-10",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/292729353",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person or online (link to be provided).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nFor our May meeting, Andrew Josephides, Director of Security Research at KSOC, will give a talk introducing the [OWASP Kubernetes Top 10](https://owasp.org/www-project-kubernetes-top-ten/).\n\nGiven the growth and adoption of Kubernetes, a number of projects have been published in the OWASP community to help practitioners assess and secure the security of their containerized infrastructure including the recently released Top Ten for Kubernetes ([https://owasp.org/www-project-kubernetes-top-ten/](https://owasp.org/www-project-kubernetes-top-ten/)). This OSS project is a community-curated list of the most common Kubernetes risks backed by data collected from organizations varying in maturity and complexity. This session will discuss the project in detail, examples for each of the risks in the list, and how to get involved."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "The DevSecOps Playbook-step by step open source guide-building DevSecOps program",
        "date": "2023-05-16",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/293181021",
        "timezone": "Australia/Brisbane",
        "description": "Short Description:\nWe talk a lot about DevSecOps, but what do we really mean when we say that? Nobody really can agree on what it means, and if you listen to vendors it's just security tools embedded in your CI/CD processes. I believe in the original idea of a group of people with backgrounds in development, security, and operations working collaboratively together to build and deploy better, more secure applications. Based on that vision I wrote the DevSecOps Playbook in early 2022 as a list of specific steps that people from all three domains (dev, sec, and ops) can do together. The Playbook is 60 tasks that DevSecOps teams can perform to materially affect their application environments. This presentation will walk the audience through all 55 tasks in the Playbook and show them how to prioritize the tasks for their specific company based on the resources that org has.\n\nLonger Description:\nWhat is DevSecOps? How do I \"do\" it? There's a lot of hype around DevSecOps right now, and getting two people to agree on exactly what it means can be a challenge. Unfortunately, there's a lot of vendor narrative that says it's CI/CD with some security thrown in for good measure, but DevSecOps is a lot more than that! My career was changed by the DevOps movement and I believe that DevSecOps should be built on top of DevOps. What does that mean? Well, what made DevOps so powerful for me in the late 2000's was that it brought together people from different departments to work together. Developers learned more about how to manage the underlying infrastructure, and ops teams learned how to use code to build and manage automation. This was powerful and I believe we can do the same with DevSecOps: bring security teams into the processes and workflows that DevOps built at at the same time those security teams will evolve to understand how operations and development teams work.\nThis talk will cover my DevSecOps Playbook which is an open source step-by-step guide to implementing DevSecOps for any organization. This Playbook is broken down into 5 distinct areas of domain expertise:\nDevelopment Environment\nSource Code Management\nContinuous Integration / Deployment and other Automation\nDeployment Environments\nOrganizational Functions\nThe DevSecOps Playbooks spreads the controls evenly across these 5 domains and highlights that this is a group responsibility. There is also an addendum for compliance frameworks and how they can map to the tasks and controls listed in the Playbook. In this talk I will outline these 5 areas and talk about the different controls and tasks in each. I will also give examples of how to implement a subset of these controls.\n\nLocation of this event coming soon."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Injection Vulnerabilities, with OWASP Suffolk",
        "date": "2023-05-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044436",
        "timezone": "Europe/London",
        "description": "A joint event, by OWASP Bristol and OWASP Suffolk.\n\nInjection vulnerabilities remain a common problem today. A single mistake could expose your whole database and customer data, or give an attacker the ability to remotely execute code on your server.\n\nWe will look at some examples of coding mistakes that can lead to injection vulnerabilities, demonstrate how they can be found with vulnerability scanning tools, and discuss how they can be completely prevented from happening (more than simply hoping developers will use prepared queries or database abstractions correctly).\n\nAgenda:\n\n* OWASP updates\n* Injection Vulnerabilities talk"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - May 2023",
        "date": "2023-05-09",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044026",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Join us LIVE and IN-PERSON for Denver OWASP's May Meetup",
        "date": "2023-05-10",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/293004797",
        "timezone": "America/Denver",
        "description": "**As always, everyone is welcome! You do NOT have to be an OWASP member to attend.**\n\nJoin us May 10th for food, drinks, networking and what is expected to be a very timely and interesting presentation. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to the sponsor [SpyderSec](https://spydersec.com)**\n\n**Presentation Title:** Back to Basics - How to Mature your Security Program\n\n**Presentation Details:** If you pay close attention to the details that emerge when organizations are breached, you may notice something interesting: The root cause of the compromise is usually not due to anything those of us in the security community would consider \"sophisticated\". Now... Did you ever stop to wonder why? Why are there still supply chain issues with production code, why does phishing still work, why are machines not being patched, why is it that not everything mission critical is protected with 2FA, and why is it seemingly so hard to inventory systems? But this talk actually isn’t about the \"why\", it’s about the \"what\": What we can do to identify and address the root causes and how we can positively influence our own security program. During this presentation we'll take a realistic view into human nature, technical & non-technical controls, and have a conversation about change... for the better."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Mai 2023",
        "date": "2023-05-15",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/293212217",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **Mobiskill** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "AppSec IL 2023",
        "date": "2023-05-16",
        "time": "8:30+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/293101142",
        "timezone": "Asia/Jerusalem",
        "description": "Dear community use this code for 25% discount\n\n**AppSecIL2023_owaspil_meetup**\n\nOWASP AppSec Israel 2023 will take place IN-PERSON on May 16th and 17th, 2023!\n\nIt is the largest conference in Israel for application security.\n\nThe [Agenda](https://appsecil.org/Agenda) is out!\n\nMake sure to **Register** [here](https://appsecil.org/Register)\n\nWe still have [sponsor](https://appsecil.org/assets/AppSecIL2023Sponsorships.pdf) spots available as well"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-05-08",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/291605620",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#03 is a charm",
        "date": "2023-05-30",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/292893619",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on May 30th, 2023, at 18:00, **supported by Snyk**.\n\nThe schedule is the following:\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n**18:15** \\- Open projects you can use today to improve your AppSec posture\n**19:00** \\- One\\-Time Quantum\\-Resistant Fully\\-Homomorphic Padding Oracle cryptography trends\\, buzzwords\\, and snake oil for 2023\n**20:00** \\- Snacks & Drinks sponsored by Snyk\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Open projects you can use today to improve your AppSec posture**\n\nSpeaker:\nLucas Ferreira\n\nAbstract:\nIn this talk, we go through the most important OWASP projects (both documentation/standards and tools) to show how companies can improve their security posture and mature their AppSec program. It is meant as an overview of the main OWASP projects.\n\nBio:\nLucas is a long-time OWASP member, having worked in OWASP as a project leader and chapter leader on two continents. He was a member of the OWASP Global Conferences committee and lead the organization of 3 OWASP AppSec conferences in Brazil.\n\nLinkedIn: [https://www.linkedin.com/in/ferreira/](https://www.linkedin.com/in/ferreira/)\nTwitter: @lucassapao\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **One-Time Quantum-Resistant Fully-Homomorphic Padding Oracle cryptography trends, buzzwords, and snake oil for 2023**\n\nSpeaker:\nDiogo Sousa\n\nAbstract:\nIn our modern times, cryptography is all around us, even if we don't notice it. We use it when checking our bank statements, buying pig plushies online, or sending stickers to each other on instant messengers. Given its ubiquity, it is, for the most part, taken for granted by developers: import HTTP/crypto/TLS, throw in a certificate from Let's Encrypt, and don't think much about it while relying on (hopefully) safe defaults.\nWhile sticking with well-vetted libraries should work out of the box for most cases, in certain areas, you need to be a bit more knowledgeable, if only to make good decisions about what libraries to use and how to wrangle all the moving parts into a cohesive and secure system.\nCryptography tends to be full of obscure notation that isn't that dissimilar to magic spells, and \"Don't Roll Your Own Crypto\" is an often repeated mantra (many times because of the previous statement). Search results for \"crypto\" have been getting progressively more complicated to navigate, with BTC, XRP, and others taking up all the prime SEO result space.\nThis talk targets a beginner to an intermediate audience and, starting from a brief overview of core tenets (Kerckhoffs's principle, Schneier's Law, the economy of mechanism, theoretical vs. practical security), will expand upon the current challenges and trends in modern cryptography, from FHE to PQC (including explaining what those are), and also highlight common design pitfalls (and their consequences) and how to reduce your snake oil intake.\n\nBio:\nAn opinionated individual with interest in cryptography and its intersection with secure software development.\n\nLinkedIn: [https://www.linkedin.com/in/0xdsousa/](https://www.linkedin.com/in/0xdsousa/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAY 24, 2023",
        "date": "2023-05-24",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/292313422",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Tactical Security - Improving AppSec Coverage with Fewer Resources\nJoin us for great networking, dinner and drinks, and see a presentation by Rich Newman, Technical Account Manager, Synopsys\n\n**ABSTRACT**: This discussion focuses on the differences in issues detected between SAST, SCA and DAST with detailed examples. There is also an aggregation/correlation section at the end to cover the need to view an application’s AppSec status as a whole and not via individual tools.\n\n* SAST - Examples from Coverity/Sigma\n* SCA - Examples from Black Duck\n* DAST (IAST/Fuzz) - Examples from Seeker & Defensics\n* ASOC - Examples from Code Dx\n\n**Thanks to our Sponsor**: [Synopsys](www.synopsys.com/software)\n*Minimize business risk across the entire SDLC*\n*Every business is a software business. Whether you’re selling it directly to your customers or relying on it to run your operations. **Synopsys** helps you protect your bottom line by building trust in your software—at the speed your business demands.*\n\n### **SPONSORSHIP Opportunities Available**\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation on Microsoft Azure and Amazon AWS",
        "date": "2023-05-27",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "May 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-05-25",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/292932837",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Exact\n**Address:** Molengraaffsingel 33, 2629 JD Delft\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **AppSec in IT contracts** by **Sebastian Avarvarei**\n20:00 - 20:15- **Break with drinks**\n20:15 - 21:00 - **About containers and their escapes: understanding escape patterns and possibilities** by **Mauricio Cano**\n\n**AppSec in IT contracts**\n*Abstract:*\nBack in 2018 I wrote: “In today’s multi-sourced enterprise, your security is as good as your worst written contract.” We have gotten better at writing security into commercial contracts since I first did my talk on this topic, but the yellow brick road ahead of us still goes some ways.\n\nBut how about AppSec, how well is it covered in our IT contracts? What are the pitfalls and the solutions? How do we avoid that someone else’s security issues become our security problems? And, by all means, let’s learn how to be a bit lazy, and do better with less effort!\n*Bio:*\nCurrently working as Information Security Manager at Canon EMEA, Sebastian has been in IT and Security for over 20 years, covering a multitude of roles ranging from Developer, Security Architect, Auditor and Consultant, before moving into security governance and management, giving him a unique multi-faceted view on today’s InfoSec challenges. He has led multiple security improvement programs and performed maturity assessments for a wide variety of organizations - while continuously asking himself:\"Could we do this in another way?\"\n\n**About containers and their escapes: understanding escape patterns and possibilities**\n*Abstract:*\nContainers have become one of the most common underlying infrastructure for microservice architectures. As such, they can often be part of the external attack surface of enterprise systems and applications (e.g., whenever a web application hosted on a kubernetes cluster is Internet-facing). Thus, it is important to understand what types of (mis)configurations can make containers more vulnerable against attacks of different types. In this talk, Mauricio will deep dive into different techniques that can be used to escape containers. In particular, he will talk about how to escape privileged containers, the usage of different capabilities, the usage of kernel exploits and a few other ways in which attackers may use to gain access to the hosts of the containers.\n*Bio:*\nMauricio Cano is a cloud pentester focused on container technologies. In particular, he focuses on the security of containers and serverless architectures. He has pentested Kubernetes clusters and serverless architectures for several multinational financial institutions. Prior to his security work, he has a background in academia and a Ph.D. in Computer Science from the University of Groningen, focused on programming language design and formal methods to ensure correctness. In his spare time, Cano enjoys reading, cooking, and solving puzzles."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP NZ - Auckland Meetup - May 2023",
        "date": "2023-05-09",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291720878",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for May will be **A07:2021 - Identification and Authentication Failures.**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle May 2023",
        "date": "2023-05-15",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/293043420",
        "timezone": "Europe/London",
        "description": "We're back! We’ll be doing our usual two talks and pizza format.\n\nPlease note; there is a new location for this event.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1820 OWASP Newcastle Welcome\n1820 - 1920 Talk one\n1920 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk 1\n**Title:** Threat Modelling\n**Speaker:** Robin Fewster\n**Speaker Bio:** Robin has over 20 years experience in cyber security, and is particularly interested in helping companies to improve their security posture. A recent area of focus has been to assist development teams with improving their security practices. This has included implementing security strategy, security champions programmes and threat modeling as a new process. Robin is also a former OWASP Newcastle chapter leader.\n**Talk Synopsis:** Drawing on some client experiences, Robin will discuss different threat modeling approaches and tools available, and how they went down with development teams.\n\nTalk 2\n**Title:** An Intro to DevSecOps, Devs like carrots not sticks\n**Speaker:** Simon Gurney\n**Talk Synopsis:**\ntbc\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there.\n\nYou can also join our Google Group which is how we'll be sending out emails to events and is also going to be used as a forum for discussion.\n\nhttps://groups.google.com/a/owasp.org/forum/#!forum/newcastle-chapter"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Tactical Security - Improving AppSec Coverage with Fewer Resources",
        "date": "2023-05-18",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/293154445",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\nThis discussion focuses on the differences in issues detected between SAST, SCA and DAST with detailed examples. There is also an aggregation/correlation section at the end to cover the need to view an application’s AppSec status as a whole and not via individual tools.\n\n* SAST - Examples from Coverity/Sigma\n* SCA - Examples from Black Duck\n* DAST (IAST/Fuzz) - Examples from Seeker & Defensics\n* ASOC - Examples from Code Dx\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)\n\n**Thanks to our Sponsor**: **Synopsys**\n**[Synopsys](https://www.synopsys.com/)**[ ](https://www.synopsys.com/)builds trust in software by enabling organizations to manage application security, quality, and compliance risks at the speed their business demands."
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "May meeting - API Security",
        "date": "2023-05-08",
        "time": "7:00+02:00",
        "link": "https://www.meetup.com/owasp-oslo/events/293025797",
        "timezone": "Europe/Oslo",
        "description": "We have one talk planned, and an opening for one more.\n\nBig thanks to Vipps for sponsoring the event\n\n**Security at high speed - How Vipps secures their APIs**\n\nFrom the outside, login systems can seem very simple. In the Vipps app, for example, you just use biometrics (or a PIN code) and you're in with a blink of an eye! But how much work goes into creating such a system? What actually happens if someone steals my Vipps PIN code? And why doesn't Vipps just have a \"login with Facebook\" button? You'll get the answers to these questions in this presentation. We'll cover everything from the EU directive PSD2 to how to practically secure APIs so that the next time you log in to Vipps, you'll know what's happening behind the scenes!\n\nSpeaker: Nora Tomas is a developer and security lead for the User Security team at Vipps MobilePay. She is involved in developing Vipps MobilePay's authentication systems. With a passion for both security and programming, Nora is interested in how to develop at DevOps speed while still keeping the systems secure"
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "May Meetup",
        "date": "2023-05-17",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/293001314",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of each month. We will announce topics 2-3 weeks in advanced of our meetups.\n\n7PM-9PM\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Community Topics\n* Modern Phishing Techniques with Evilginx2"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-05-10",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/293028166",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Hands-on walkthrough of API Security & Automated Testing for Complex API",
        "date": "2023-05-10",
        "time": "9:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/292823383",
        "timezone": "Asia/Singapore",
        "description": "Ashwath (co-author of ATOR Burp Plugin) and Avneesh (employee of Akto) will be doing a hands-on walkthrough of API security and talk about automating testing for complex API scenarios. They will cover the following topics:\n\n1\\. What is API Security\n2\\. Why is it important?\n3\\. Why do BB hunters find more bugs than appsec/internal folks?\n4\\. Common problems with API Security\n5\\. Automated tools that are in the market:\na. Burp native scanning\nb. Burp plugins - ATOR\nc. Akto open source\n6\\. Running ATOR against some basic scenarios \\- Demo & Hands on\n7\\. Running Akto against a test setup \\- Demo & Hands on\n8\\. Q&A\n9\\. Wrap\\-up\n\nATOR - [ATOR Github](https://github.com/PortSwigger/ator)\nAkto - [Akto Homepage](https://www.akto.io/)\n\n**Target Audience:** Appsec engineers, Developers who work on APIs, Bug Bounty Hunters\n\n**What will they gain at end of session**:\n1\\. Why is API security important?\n2\\. How do misconfigurations happen?\n3\\. How to build an inventory of APIs?\n4\\. How to automate testing for complex scenarios \\(chained login\\, multi\\-step API request etc\\.\\)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "Injection Vulnerabilities",
        "date": "2023-05-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291863605",
        "timezone": "Europe/London",
        "description": "Injection vulnerabilities remain a common problem today. A single mistake could expose your whole database and customer data or give an attacker the ability to remotely execute code on your server.\n\nWe will look at some examples of coding mistakes that can lead to injection vulnerabilities and discuss how they could be mitigated.\n\nThis is a joint event provided by OWASP Bristol and OWASP Suffolk.\n\nAgenda:\n\n* OWASP updates\n* Injection Vulnerabilities talk\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - May 2023",
        "date": "2023-05-09",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291864867",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney Unmeetup #1",
        "date": "2023-05-09",
        "time": "7:30+10:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/292887824",
        "timezone": "Australia/Sydney",
        "description": "We are thrilled to announce our first community-driven Meetup event, where we aim to build a platform for you to showcase your skills, network with like-minded individuals, and learn from others' real-life experiences.\n\nAt this event, we're doing something different by allowing the community to select the topics of most interest to them. Whether you're an experienced speaker or a first-time presenter, we encourage you to bring an idea for a talk you can give. No slides required, and the minimum time is 5 minutes.\n\nWe're hoping to create a safe space for people of all levels of experience, so if you're a little nervous about speaking, this is the perfect opportunity to overcome that fear. The event is designed to be inclusive and supportive, so even if you don't get to give your talk this time, you can always bring it to the next Meetup!\n\nHere are the details of the event:\n\n**Date:** May 9 2023\n**Time:** Arrive from 5.30 pm\n**Venue:** Talenza, Level 3, 7 Macquarie Place, Sydney\n\n**Schedule:**\n\n* 5.30 pm: Arrive, grab a drink, and meet your fellow attendees\n* 6.00 pm: Food is served\n* 6.00 pm: Submit your talk suggestions (5 to 30 mins each) for the night and begin voting\n* 6.30 pm: Voting closes, and the top selected talks begin\n* 7.30 pm: Talks finish, and networking begins\n* 8.00 pm: Event ends\n\n**Here are some of the talks that have already been submitted:**\n\n* Automating software composition analysis to identity vulnerabilities (est. 5 mins)\n* How we used readily available AppSec tools to get our startup acquired (est. 5-10 mins)\n* The emerging verticals in cyber threat intelligence (est. 5-10 mins)\n* Being ghosted during a security role interview process - and what to do next! (est. 5 mins)\n\nWe're expecting this event to be a little haphazard as it's our first time trying something like this. But we're looking forward to receiving your feedback to make the next event even better.\n\nDon't miss out on this unique opportunity to share your knowledge and connect with your peers. RSVP now, and we'll see you there!\n\nBest regards,\nOWASP Sydney Chapter Committee"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2023-05-25",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/293199573",
        "timezone": "America/New_York",
        "description": "TBA"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "SQLi en la práctica: De la explotación a la prevención",
        "date": "2023-05-02",
        "time": "8:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/292840705",
        "timezone": "America/Montevideo",
        "description": "Este evento se enfocará en un tema clásico y que últimamente se ha visto menos vulnerado, aunque sigue presente y explotable en nuevos desarrollos: **inyecciones en SQL (SQLi)**. Se abordará desde más de una perspectiva, como individuo que **ataca**, que **prueba** la aplicación o que la **desarrolla**.\n\nSe presentarán los diferentes tipos de inyección: clásicas con retorno de datos visibles, por inferencia (ciegas basadas en errores o demoras) y con visibilidad fuera de banda. El propósito es también comentar cómo **combatir** problemas desde el punto de vista del **desarrollo y configuración,** mencionando algunas herramientas y tecnologías comunes para lograr tanto la detección y explotación como la corrección.\n\n**La participación práctica es opcional**. Se contará con una guía pública unos días previos al evento para quien le interese seguir los ejercicios expuestos con un ambiente en su propia máquina o tener una idea del tema antes de concurrir.\n\nSe lleva a cabo en el **edificio central** de la Universidad Católica del Uruguay, en el **Anexo Plaza de Encuentro**. La entrada es libre y gratuita. Por dudas, usar la sección de comentarios."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "CMD+CTRL Cyber Range",
        "date": "2023-05-18",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248501",
        "timezone": "America/Vancouver",
        "description": "Want to tap into your inner evildoer and test your skills in hunting down web application vulnerabilities?\nIf so, immerse yourself in the industry’s most authentic environment where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense is all about thinking on your feet. For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard as you vie for the top spot!\n\nThe **CMD+CTRL Cyber Range** is ideal for anyone interested in learning how web applications are attacked, furthering their cybersecurity acumen, or honing the skills needed to protect the enterprise. From curious bystanders to active practitioners to Risk and Security Executives, there’s something for everyone.\n\nTeaser: [https://securityinnovation.hubs.vidyard.com/watch/9NbmLo8rHBqcKJbVP4oLek](https://securityinnovation.hubs.vidyard.com/watch/9NbmLo8rHBqcKJbVP4oLek)\n\nThis event is sponsored by **Security Innovation** \\- thank you for facilitating the workshop and enabling access to their Cyber Range\\.\nThis event is sponsored by **Microsoft** \\- thank you for providing us space\\."
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "Secure Your Apps: A Cybersecurity Event by OWASP Victoria",
        "date": "2023-05-11",
        "time": "8:30-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/292413504",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter is pleased to present an In-Person Application Security Event on May 11, 2023. Join us at Fort Tectoria from 6:30 PM to 9:00 PM for an informative and engaging event focused on the latest trends and best practices in cybersecurity. We are excited to announce that Tanya Janca and Roberto Salgado will deliver two live presentations!\n\nTanya will present \"Pushing Left to Secure Software,\" and Roberto will present \"A Summary of Cybersecurity in 2022\". Whether you're a seasoned security professional or just getting started in the field, you'll leave with valuable insights, actionable takeaways to improve your organisation's security posture, and a chance to win swag/prizes!\n\nIn addition to the presentations, hors d'oeuvres, and prize giveaways, there will be ample opportunities for networking and collaboration with like-minded professionals. You'll have the chance to connect with peers, learn from industry leaders, and exchange ideas about the latest tools and techniques for staying ahead of the ever-evolving cybersecurity landscape.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in cybersecurity. If you would like to attend, please click the RSVP button to reserve your spot, as we have limited seats available.\n\nWe would also like to give a special thanks to Websec and SheHacksPurple for sponsoring this event.\n\n‎\n**Who This Event is For**\n\n* IT and Cybersecurity Professionals\n* Developers and Engineers\n* Executives and Managers\n* Researchers, Academics, and Students\n* IT Vendors and Service Providers\n* Hobbyists\n\n‎\n\n**Speaker Biographies**\n**Tanya Janca**\nTanya Janca, also known as SheHacksPurple, is the best-selling author of 'Alice and Bob Learn Application Security'. She is also the founder of We Hack Purple, an online learning academy, community, and podcast that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years and has been everywhere from startups to public service to tech giants (Microsoft, Adobe, & Nokia). She has worn many hats; startup founder, pentester, CISO, AppSec Engineer, and software developer. She is an award-winning public speaker, active blogger, and streamer and has delivered countless talks and training sessions across six continents. She values diversity, inclusion, and kindness, which shines through in her countless initiatives.\n\n**Roberto Salgado**\nRoberto Salgado, a co-founder of Websec, became fascinated with technology at a very young age and eventually found his niche in Cybersecurity. Through his passion and dedication to this field, he researched and devised new methods of attack and defence; this led Roberto to present his research at several security conferences and contribute to various open-source projects. Roberto also created and maintains the SQL Injection Knowledge Base, one of the most comprehensive references available. During his time at Websec, he has served many roles, from security tester to business developer, which has allowed him to gain a broad perspective and understanding of the field of information security."
    }
]