[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - Virtual - March",
        "date": "2023-03-28",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/288772567",
        "timezone": "Europe/Copenhagen",
        "description": "Notice, that this is a virtual event running on Zoom. Please reach out if the event gets full and I will add room for more people.\n\n**19:00 - 19:10 – \"Welcome\" by OWASP Chapter Aarhus**\n\n**19:10 - 19:55 – \"Let's Write Security Unit Tests\" by Eric Johnson, Principal Security Engineer at Puma Security and SANS Senior Instructor**\n\nAbout the presentation:\nDevOps teams are test obsessed, often leveraging unit testing frameworks and continuous integration (CI) tools to automate test requirements. In this talk, we will explore how security unit testing fits into DevOps, a few unit testing frameworks, and several examples that can help security teams harden their applications. Live demonstrations will show how to write security unit tests, execute the tests in a GitHub Actions workflow, and evaluate the test results.\n\nAbout the presenter:\nEric Johnson is co-founder and Principal Security Engineer at Puma Security focusing on cloud security, static code analysis, and DevSecOps automation. His experience includes performing cloud security reviews, infrastructure as code automation, application security automation, web and mobile application penetration testing, secure development lifecycle consulting, and secure code review assessments. Eric is a Senior Instructor with the SANS Institute where he authors information security courses on cloud security, DevSecOps automation, and secure coding. He delivers security training globally for SANS, as well as presents security research at conferences including RSA, BlackHat, OWASP, BSides, DevOpsDays, fwd:cloudsec, and ISSA.\n\n**19:55 – 20:05 – Short break**\n\n**20:05 – 20:55 – “A Fully Trained Jedi, You Are Not” by Adam Shostack, President, Shostack + Associates**\n\nAbout the presentation:\nAs software organizations try to bring security earlier in the development processes, what can or should regular software or operations engineers know about security? Taking as given that we want them to build secure systems, that demands a shared understanding of the security issues that might come up, and agreement on what that body of knowledge might entail. Without this knowledge, they'll keep building insecure systems. With them, we can have fewer recurring problems that are trivially attackable.\n\nAbout the presenter:\nAdam is a leading expert on threat modeling, and a consultant, author and game designer. He has decades of experience delivering security. His experience ranges across the business world from founding startups to nearly a decade at Microsoft. He helped to create the CVE, serves on the Blackhat Review Board, and is an affiliate professor at the University of Washington.\n\n**20:55 – 21:00 - \"Closing notes and Goodbyes\" by OWASP Chapter Aarhus**"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - March 2023 (Online)",
        "date": "2023-03-28",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705720",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* -- [Eventbrite](https://owasp-austin-2023-march.eventbrite.com)\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n**Presentation: API Risk Management**\nWeb applications are prone to various cybersecurity risks. Did you know that 96% of these web applications contain some Open Source? Furthermore, did you know that 99% of such Open Source contain some Web APIs. You may be surprised to know that Web APIs contribute 83% of the traffic over the internet. Unfortunately, this growing API usage also means growing cybersecurity risks. Although, APIs benefit organizations immensely through accelerated innovations, newer business models, competitive differentiation, but organizations are also negatively impacted by APIs due to their weak security posture leading to business disruptions, legal and compliance issues. Gartner has actually predicted that by 2022, API abuses will be the most frequent attack vector resulting in data breaches for web applications. Given the importance of APIs for digital transformation at organizations, it is imperative for their Security, Compliance and Audit professionals to get a handle on APIs to manage various API related risks. This session will provide an overview of an API Governance framework for effective API Risk Management. This framework is inspired by the Zero Trust model that enterprises can use as a “Swiss Knife” for reducing their API related risks. We’ll also highlight best practices and hands-on examples for API Risk Management.\n\n**Speaker: Dr. Baljeet Malhotra**\nDr. Baljeet Malhotra, is an award-winning researcher known for his work in Open Source and API Data Management. He conceptualized the world's first \"API Composition Analysis\" based on source code static analysis. He founded TeejLab in 2017 and steered the team to build API Discovery and Security™, world's first comprehensive end-to-end API Management platform. Prior to TeejLab, he established the R&D unit of Black Duck Software in 2016 (acquired by Synopsys), he has also served as Research Director at SAP. He received a PhD in Computing Science from the University of Alberta and won several awards including NSERC (Canada) scholar in 2005 and Global Young Scientist (Singapore). He concurrently holds Adjunct Professor positions at the University of British Columbia, University of Victoria and University of Northern BC.\n\nRSVP for in-person:\nhttps://owasp-austin-2023-march.eventbrite.com Eventbrite(in-person)"
    },
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "Zed Attack Proxy",
        "date": "2023-04-04",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-bonita-springs-chapter/events/292201291",
        "timezone": "America/New_York",
        "description": "Join us online, Tuesday, April 4, at 6:30PM to learn about Zed Attack Proxy (ZAP) from the co-author of 'Zed Attack Proxy Cookbook: Hacking tactics, techniques, and procedures for testing web applications and APIs', Ryan Soper! Ryan will discuss his book as well as walk us through some examples of using ZAP."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "BASC - Boston Application Security Conference",
        "date": "2023-04-01",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/292282690",
        "timezone": "America/New_York",
        "description": "**Join us for [BASC 2023](basconf.org) on April 1.**\n\n**See [conference website](https://www.basconf.org/home) for details and [register at eventbrite](https://www.eventbrite.com/e/boston-application-security-conference-basc-2023-tickets-542873247497)**\n\n(There is no conference registration or RSVP here on meetup.)"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "**Speaker change** OWASP Brisbane - March",
        "date": "2023-03-30",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/291605626",
        "timezone": "Australia/Brisbane",
        "description": "Hi All!\n\nWe have a speaker change for this event. The new date for Paul McCarty will be announced soon.\n\nHere is all you need to know about our new speaker for our March event, at Thoughtworks Brisbane on the 30th of March!\n\n**Speaker:** Louis Nyffenegger\n\n**Title:** Introduction to SAML and its Security\n\n**Talk Description:** SAML is one of the key protocols used to perform Single Sign-On. Especially for enterprises who...\n\nACKCHYUALLY!!! SAML is a Markup Language, like HTML... You don't code in HTML, you don't SSO with SAML.\n\nOk, thanks for the clarification. In this talk we are going to look at how SAML is used to provide Single Sign-on and what security issues can arise.\n\n**Thank you to our sponsor:**\n[Thoughtworks](https://www.thoughtworks.com)"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - April 2023",
        "date": "2023-04-11",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044025",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS March 2023",
        "date": "2023-03-30",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/292240244",
        "timezone": "America/Denver",
        "description": "Speaker: Ben Struebing\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "Les applications web: Amélioration ou mise en danger de la vie des utilisateurs",
        "date": "2023-04-20",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/292382900",
        "timezone": "Africa/Porto-Novo",
        "description": "Ce meeting du chapitre OWASP-Cotonou a pour thème général: \"Les applications web: amélioration ou mise en danger de la vie des utilisateurs ?\" Il s'articulera autours des deux thèmes suivants:\n\n**Impacts de la digitalisation sur les internautes,** par **Orace KPAKPO**, Ing Réseaux et Systèmes, Analyst Cybersécurité à EMES SARL, leader du chapitre OWASP Cotonou\n\n**Digitalisation et sécurité au Bénin,** par **Victor OYETOLA**, Expert TIC, responsable du SPTIC à l'UAC"
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "Hacking Multifactor Authentication",
        "date": "2023-03-28",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-delaware-chapter/events/292010693",
        "timezone": "America/New_York",
        "description": "Organizations often have the misconception that if they implement Multifactor Authentication (MFA) as an extra layer of security on top of passwords, they are unhackable. Unfortunately, this is not the case. During this talk you will learn some of the ways MFA can be bypassed.\n\nBonus: Time permitting - Misc. web hacking demos and CTF challenges will also be given after the featured presentation. The meeting will be held in the library's computer lab to encourage people to get some hands-on web security testing experience."
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Suffolk Fight Club - April 2022",
        "date": "2023-04-11",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/291889114",
        "timezone": "Europe/London",
        "description": "Hosted by OWASP Suffolk\n\nFight Club has no agenda, no slides, no recording, and is 100% unscripted.\nThis month a live attempt of a HTB machine or challenge."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "The Art of Deception - Outsmarting the Attackers",
        "date": "2023-03-29",
        "time": "7:00-06:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/292115758",
        "timezone": "America/Edmonton",
        "description": "**UPDATE** - *The March event has been moved to NorQuest college to accommodate catering services and a larger than expected audience.*\n\n**Location**\n*10215 108 St NW, Edmonton, AB T5J 1L6*\n*Room 2-013 - SCFL - Downtown*\n*Directions and parking information are located in the photos section at the bottom of this page.*\n\n## About The Event###\n\n  \n**RSVP for CATERING COMPANY + DOOR PRIZES**\n\nhttps://www.meetup.com/meetup-group-opbybwve/\n\n**[SentinelOne](https://www.sentinelone.com/)** is sending a squadron of their finest experts to share their knowledge on the elusive art of **MITRE** deception.\n\nAs a pioneering force in this field, they will be providing not only a delectable **BBQ** **DINNER** catered by **Edmonton's** local **[CORNERSTONE BBQ](https://www.cornerstonebbq.com/)**, but also valuable insights on how to outsmart the crafty attackers. Think of it as a masterclass on the tactics and strategies needed to protect your organization from cyber-attacks.\n\nIn the words of the renowned ancient Chinese general **Sun Tzu**, \"All warfare is based on deception.\" And just as Sun Tzu believed in the importance of deception in warfare, Sentinel One understands the significance of deception in the ever-evolving battlefield of cybersecurity. So, join us for this informative session, and let's learn how to effectively deploy deception techniques to turn the tables on attackers."
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "The way to WAF in 2023 [online]",
        "date": "2023-03-24",
        "time": "5:00+01:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/292033499",
        "timezone": "Europe/Berlin",
        "description": "Hello out there / Hola por ahí,\n\nit's been a while, I haven´t much luck chasing speakers the past months. But the sun is shining again, so here we go ;-)\n\nWe´d like to invite you to the next (online) meeting which fits into the previous WAF topics we had. Thus I am glad we´ll have Felipe and Juan Pablo as our guests presenting us a modern approach to an Open-Source WAF: Coraza. Coraza is a a new OWASP project, currently in lab status. It's written in Go, supports ModSecurity SecLang rulesets and is 100% compatible with the OWASP Core Rule Set.\n\nWe'll start @ 3pm as there's a time difference to where the speaker's are joining us from.\n\nIn a nutshell\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nLocation: Online\nStart: 24th of March, 3pm CET (10 am EST)\nTitle: The way to WAF in 2023 [online]\nSpeakers: [Felipe Zipitria](https://owasp2023globalappsecdublin.sched.com/speaker/felipezipitria), [Juan Pablo Tosso](https://owasp2023globalappsecdublin.sched.com/speaker/jptosso)\nNetworking: Stick around afterwards a bit if you like.\n\nAbstract\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nWe are fighting a 2023 problem by using early 2000s technology. The web has evolved. Therefore, the threats have evolved, SQL injection isn’t as common as it used to be, and attackers are now looking for more complex vulnerabilities that could provide faster and bigger profits. New technologies also come with new architecture and deployment requirements, so the final question becomes, how can we protect our applications without risking false positives or decreasing performance? OWASP Coraza’s goal is to solve these questions by providing a modern approach to Open-Source WAF using Golang. Coraza provides a modular, fast, developer-friendly, and efficient set of WAF capabilities that can be easily integrated into any program, it also provides connectors for Web Servers, API Gateways, HTTP frameworks, and more. Coraza is 100% compatible with OWASP Core Ruleset and extends ModSecurity capabilities to the 2020s internet.\n\nProject Links:\n[https://www.coraza.io/](https://www.coraza.io/)\n[https://github.com/corazawaf/coraza](https://github.com/corazawaf/coraza)\n[https://owasp.org/www-project-coraza-web-application-firewall/](https://owasp.org/www-project-coraza-web-application-firewall/)\n\nBios\n\\-\\-\\-\\-\\-\\-\nFelipe has over 15 years of experience in the information security field. He regularly trains professionals from different backgrounds in application security, cloud security, and information security. He is a lecturer on Computer Security Foundations for graduates and Application Security for postgraduates at the local University where he lives, in Montevideo - Uruguay. He holds an MSc in Computer Security from the same University, UDELAR. Felipe also has contributed to the OWASP mission as a co-leader of the OWASP ModSecurity Core Rule Set Flagship project, the OWASP Coraza WAF project, and previously as Uruguay Chapter Leader.\n\nJuan is a cybersecurity researcher from Chile. He enjoys writing open-source code, hiking, biking, spending time with his children, traveling, writing, and reading. He used to be a white hat hacker, but now turned to the blue side. He is the founder and project leader of the OWASP Coraza WAF project.\n\nHow to participate\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nOWASP Hamburg Meetup members who rsvp'd for the event will see the URL at the RHS and can join the video conference directly.\nPlease make sure when the talk starts your video is off and you are muted.\nWe´ll be guest of senfcall (a german membership corporation) which provides us with a privacy friendly video conference facility. Thank you!\n\nOur OWASP \"Stammtisch\"\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nOur meeting is about web applications and their (in)security and/or about IT security in general. People come together who care as a hobby or in their job about information security: developers, managers, pen testers and everybody else who's interested. The atmosphere is open and relaxed. Who's coming to sell products or services: Move on, this is not the right place. OWASP is about education and sharing (mostly) technical information.\n\nFeel free to forward our meetup URL to your colleagues or friends. They are welcome, too. Participation is free and open -- as the O in OWASP.\n\nCheers, Dirk\n\nPS: Outlook: Next meetings we'll present a new OWASP project -- OWASP Raider and a cool introduction into Rust. We plan both as hybrid sessions, OWASP Raider will be in English."
    },
    {
        "group": "Indian Institute Of Technology Patna",
        "repo": "www-chapter-indian-institute-of-technology-patna",
        "name": "Cybersecurity 101 - How to break into the cybersecurity industry as a beginner?",
        "date": "2023-03-27",
        "time": "9:00+05:30",
        "link": "https://www.meetup.com/meetup-group-mrogmpnt/events/292032103",
        "timezone": "Asia/Kolkata",
        "description": "*This talk will provide an introduction to cybersecurity for beginners and offer guidance on how to break into the cyberindustry. The speaker will provide practical advice on how to gain relevant experience, including resources for learning and developing technical skills, as well as tips for building a professional network and finding job opportunities. The talk will also touch on the importance of staying current with industry trends and regulations, and the need for ethical behavior and responsibility in the cybersecurity profession.*"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-04-10",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/291605618",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Reconnaissance like a cyber scout.",
        "date": "2023-04-10",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/292411394",
        "timezone": "America/Fortaleza",
        "description": "Por que e de que maneira é levantado informações do perímetro de uma empresa durante uma operação? Como diria o provérbio chinês: \"Para cortar uma árvore bem rápido, gaste o dobro do tempo afiando o machado\". Trazendo para nossa interpretação: \"Consiga o máximo de informações e melhor será o seu resultado da invasão\". Esta palestra irá abordar o fundamento de uma enumeração de perímetro, seguindo para a exibição da notória ferramenta ReconFTW que automatiza todo o processo e será concluído detalhando a contribuição do palestrante para o projeto, que é open-source e foi idealizado pelo \"Six2dez\"."
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London CTF Tournament [IN-PERSON]",
        "date": "2023-03-29",
        "time": "7:30+01:00",
        "link": "https://www.meetup.com/owasp-london/events/292093403",
        "timezone": "Europe/London",
        "description": "**PLEASE REGISTER ON [EVENTBRITE](https://www.eventbrite.co.uk/e/574787925157/): [https://www.eventbrite.co.uk/e/574787925157/](https://www.eventbrite.co.uk/e/574787925157/)**\n\n**PLEASE NOTE - THE CTF LOCATION, REGISTRATION AND TICKETS FOR THIS EVENT ARE ONLY AVAILABLE ON EVENTBRITE:** **[https://www.eventbrite.co.uk/e/574787925157/](https://www.eventbrite.co.uk/e/574787925157/)**\n\n**OWASP London Chapter** is pleased to announce the OWASP London Capture The Flag(CTF) Tournament kindly sponsored by **Invicti**.\n\n**Doors open and registration**: 5:30pm\n**CTF starts**: 6:00pm (we start on time)\n**Expected CTF finish and Prize Giving Ceremony**: 8:45pm\n\nOWASP London Chapter is pleased to announce the OWASP London CTF Tournament kindly sponsored by Invicti.\n\nCTF (Capture The Flag) is a type of computer security competition. Contestants are presented with a set of challenges and puzzles which test their creativity, technical skills, vulnerability-finding skills and problem-solving ability. The challenges usually cover a number of categories and when solved, each yields a “flag” which is submitted to a real-time scoring service. The difficulty levels are from beginner to advanced.\n\nPlease note that unlike our OWASP London Chapter ‘s previous CTFs this is not a secure coding tournament, but a proper \"Hacking CTF\". The challenges will be around finding and exploiting application vulnerabilities, not vulnerabilities in the source code.\n\n**IMPORTANT**: Please **bring your own** **LAPTOP** and a **CHARGER** for it.\nTop 3 scorers will win exciting prizes generously provided by Invicti and other cyber security technology vendors.\n\nParticipation is FREE, but the **number of seats is strictly limited to 50** and **[registration is required](https://www.eventbrite.co.uk/e/574787925157/)** to attend.\n\n**Please remember to bring your own laptop!**\n\n**IMPORTANT**: By participating in this activity you agree to abide by the\n\n**OWASP Code of Conduct** and **Invicti CTF Rules**:\n\n**CODE OF CONDUCT**\nWe hope you enjoy our events, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback or would like to speak to us, we take these matters very seriously. You can find the full text of the OWASP Code of Conduct Policy here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)\n\n**INVICTI CTF RULES (Excerpt)**\n\n* Players are not allowed to form teams or groups to solve challenges together.\n* Players must not share any information regarding the flags or walkthrough for any of the challenges with other players.\n* Players must not try to attack scoring bots, central CTF management application and targets for other players. Those who try to attack any of these systems/applications will be disqualified from the competition.\n* Players must not try to perform any denial-of-service attack to any network or application in the competition network.\n* Players must not write any walkthroughs for the solutions or share any information regarding the challenges.\n\nYou can find the full text of Invicti CTF Rules here: [https://github.com/OWASP/www-chapter-london/blob/master/assets/misc/invicti-ctf-rules.md](https://github.com/OWASP/www-chapter-london/blob/master/assets/misc/invicti-ctf-rules.md)"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "1st Annual 2023 OWASP Maine Secure Coding Tournament",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/292101163",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 1st annual OWASP Maine Secure Coding Tournament! This will be an in person meetup where we welcome all software developers and appsec professionals from entry level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2023!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* $500 VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* $100 VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* $50 VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Wednesday April 19th 2023 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:** [https://discover.securecodewarrior.com/tournament-maine23.html](https://discover.securecodewarrior.com/tournament-maine23.html)\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "April 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-04-20",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/292323208",
        "timezone": "Europe/Amsterdam",
        "description": "This is an online meeting and will be streamed on YouTube.\n\n19:00 - 19:10 - **Welcome and OWASP updates**\n19:10 - 19:55 - **The Rise of the Security Verification Standard** by **Josh Grossman**\n19:55 - 20:05 - **Questions and** **Break**\n20:05 - 20:50 - **OWASP Juice Shop** by **Björn Kimminich**\n\n**The Rise of the Security Verification Standard**\n*Abstract:*\nWe are currently seeing a big uptick in the progression of the OWASP Application Security Verification Standard (ASVS) as well as the Mobile version (MASVS). Not only are two major releases in the pipeline (5.0 and 2.0 respectively) but we are now seeing industry stand up, take notice and start expecting more from applications, based on these standards. In this talk, Josh Grossman (one of the ASVS project leaders) will take you through these key developments including our vision for the upcoming version 5.0 of the ASVS and how you and your employer can be involved in the final release.\nThis will also be a chance to hear first-hand about a couple of new programmes where you will see the SVSs being more widely used and required and how you can prepare your organizations for this significant impact this will have, whether you are developing applications or you are assessing them.\n\n*Bio:*\nJosh Grossman has worked as a consultant in IT and Application Security and Risk for 15 years now, as well as a Software Developer. This has given him an in-depth understanding of how to manage the balance between business needs, developer needs and security needs which goes into a successful software security programme.\n\nJosh is currently CTO for Bounce Security where he helps clients improve and get better value from their application security processes and provides specialist application security advice. His consultancy work has led him to work, speak and deliver training both locally and worldwide including privately for ISACA and Manicode and publicly for OWASP's Global AppSec conferences. In his spare time, he co-leads the OWASP Application Security Verification Standard project and is on the OWASP Israel chapter board.\n\nHe was also recognized as a Key Contributor for the OWASP Proactive Controls project and has also contributed to the OWASP Top 10 Risks project and the OWASP JuiceShop project.\n\n**OWASP Juice Shop**\n*Abstract:*\nOWASP Juice Shop is probably the most modern and sophisticated insecure web application! It can be used in security training, awareness demos, CTFs and as a guinea pig for security tools!\n\nJuice Shop encompasses vulnerabilities from the entire OWASP Top Ten along with many other security flaws found in real-world applications!\n\nAt this event, we will take a tour through the application, hack it live on screen, learn about Coding Challenges, CTF mode, cheat detection, custom theming, and more!\n\n*Bio:*\nBjoern Kimminich works as Product Group Lead Application Ecosystem at Kuehne + Nagel, responsible – among other things – for the Application Security program in corporate IT. He is an OWASP Lifetime Member, the project leader of the OWASP Juice Shop, and a co-chapter leader for the OWASP Germany Chapter. Björn also currently chairs the OWASP Project Committee."
    },
    {
        "group": "New Braunfels",
        "repo": "www-chapter-new-braunfels",
        "name": "March 2023 Meetup - DefectDojo Discussion",
        "date": "2023-03-25",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasp-new-braunfels-chapter/events/292281152",
        "timezone": "America/Chicago",
        "description": "The OWASP New Braunfels chapter will discuss better ways to engage the community, the emergence of the San Antonio chapter, Defect Dojo, and the new Developer Guide. Please join us!"
    },
    {
        "group": "Oakland County",
        "repo": "www-chapter-oakland-county",
        "name": "Kubernetes – “containers aren't just for leftovers”",
        "date": "2023-04-13",
        "time": "9:00-04:00",
        "link": "https://www.meetup.com/owasp-oakland-county-chapter/events/292303253",
        "timezone": "America/New_York",
        "description": "An exploratory look at what Kubernetes is, how it works, and how it can be implemented to provide modern solutions to dated problems.\n\n5:30pm - Socializing (Towne Square Food and Spirits)\n7:00pm - Announcements followed by this month's speaker presentation starts\n8:00pm - presentation ends, socializing\n\nTowne Square Food and Spirits entrance:\nPark in the East parking lot of 1 Town center and look for the awning to the right of the main entrance of the 1 town center building. That is the restaurant. We meet in the main dinning center to the right of the restaurant's entrance. The presentation is given in the room to the left of the Bar you face once you enter. It's advised first time attendees show up before to socialize but also follow the group into the presentation area."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "OWASP Peterborough: Chapter Kick Off",
        "date": "2023-03-29",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/291965524",
        "timezone": "Europe/London",
        "description": "**Join the first ever OWASP Peterborough Chapter event!**\n\nTo kick the chapter off, the session focuses on introducing OWASP and similar topics, whilst networking in a great venue!\n\nWe're still confirming some specifics, but can promise outstanding speakers focusing on:\n\n* Introducing OWASP and Web Application Security\n* Web Application Firewalls (WAFs)\n* What's coming up next\n* How to get involved in the security field\n\nAn agenda will be shared closer to the MeetUp date.\n\n**Who is it for?**\nEverybody! Come along, bring a friend, share with your colleagues.\n\nA principle of the chapter is to ensure **cyber security is accessible** for everyone. You don't need to be a security professional, each session will break down topics to ensure everybody can take something away.\n\n**When is it?**\n\n* Wednesday 29th March\n* **Arrive** from 7:30pm\n* **Sessions start** at 8PM sharp\n* **Networking** from 9:30pm\n* **Close** by 11pm\n\n**How can you get involved?**\n\n* Respond **'I'm coming!'** to this group\n* Join our **[slack](https://join.slack.com/share/enQtNDkyNjM5ODI3ODgzMi02N2ZkNGQ2NzIzZjQ4M2FjOTc1MGQxNmRlOTlkZTJmZjc1MmZmYzMxYzFkMWEwMzQyMzdkMDJjZjk1N2FiNzUy) channel**\n* Check out our OWASP Chapter [page](https://owasp.org/www-chapter-peterborough/)\n\n**Sponsors!**\nSponsors enable events like ours to happen. We want to give a huge shout out to our sponsors - Cybanetix. Check them out to understand how you can secure your business, people and network: https://cybanetix.com\n\nWe look forward to seeing you there!"
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "1st Annual 2023 OWASP Maine Secure Coding Tournament",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/292101163",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 1st annual OWASP Maine Secure Coding Tournament! This will be an in person meetup where we welcome all software developers and appsec professionals from entry level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2023!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* $500 VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* $100 VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* $50 VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Wednesday April 19th 2023 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:** [https://discover.securecodewarrior.com/tournament-maine23.html](https://discover.securecodewarrior.com/tournament-maine23.html)\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "April Meetups",
        "date": "2023-04-19",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/292421031",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of the month. We will announce topics 2-3 weeks in advanced of our meetups.\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Intro to the chapter\n* Desired outcome from the community\n* Brief Threat Model of AWS Security"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec / OWASP-SLC - March Meetup (in person @ SLC County Bldg)",
        "date": "2023-03-30",
        "time": "2:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/292096700",
        "timezone": "America/Denver",
        "description": "**Agenda:**\n\n1. Lunch\n2. Discussion on book: \"[How to measure anything in Cybersecurity](https://a.co/d/3E75efX)\"\n3. How to measure ROI on popular AppSec controls\n\nPlease RSVP if you're coming! We'd like to make sure you get some lunch (i.e. pizza) for meeting in person.\nAnd let us know if there are any food sensitivities.\n\nSee you all then!\n\n[ADDRESS]\n2001 S State St, Salt Lake City, UT 84190\nSouth Building -- Rm# S1-120, located on the West side of the South building atrium\n\n[Amazon Book Link]\nhttps://a.co/d/3E75efX"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-04-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292263676",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-04-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292263675",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - April 2023",
        "date": "2023-04-11",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291864839",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Taiwan",
        "repo": "www-chapter-taiwan",
        "name": "OWASP Taiwan Meetup (APR, 2023)",
        "date": "2023-04-07",
        "time": "3:20+08:00",
        "link": "https://www.meetup.com/taipei-owasp-meetup-group/events/292383519",
        "timezone": "Asia/Taipei",
        "description": "OWASP Taiwan Chapter Meetup  OWASP \n\n\n\n [KKTIX](https://csa.kktix.cc/events/owasp202304-copy-1)\n 200/()"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Tracing webapp exploitability through code review and taint analysis",
        "date": "2023-04-20",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248498",
        "timezone": "America/Vancouver",
        "description": "**Title**: Tracing web application exploitability through code review and taint analysis\n**Speaker**: Dana Epp\n\nCome learn how to look at your web apps and APIs more offensively to discover the exploitability of your code before your adversaries do.\n\nThis event is sponsored by **Microsoft** \\- thanks for providing us space and food\\."
    },
    {
        "group": "Vilnius",
        "repo": "www-chapter-vilnius",
        "name": "OWASP Vilnius #4",
        "date": "2023-03-30",
        "time": "8:00+03:00",
        "link": "https://www.meetup.com/owasp-vilnius/events/292250628",
        "timezone": "Europe/Vilnius",
        "description": "I'm glad to announce, that this will be a physical event organised with VU Cyber Security Lab on the Vilnius University premises (Baltupiai, Vilnius).\n\nThe agenda:\n\n1\\) Linas Bukauskas \\(Kibernetinio saugumo labaratorijos vadovas \\| VU MIF\\) \\- \"Kibernetinio saugumo laboratorijos veiklos\\, projektai\\, bendradarbiavimo galimybės\" \\(lithuanian\\)\n\n2\\) Agne Marija Bucyte \\(Vehicle Cybersecurity Analyst \\| Block Harbor\nCybersecurity) - \"Automotive (car) Cybersecurity trends\".\nWe will be discussing some of the latest trends in the world of automotive\ncybersecurity, gain insight on some latest statistics and get familiar\nwith some standards that help keep the streets safe.\n\n3\\) Ulad Pyanou \\( Application Security Engineer \\| EPAM Systems\\)\\- \"A day in life of the Security Engineer\"\\. During the talk Ulad will show\nexamples of tasks that are being solved by different security teams\n\nLocation: VU MIF, Didlaukio g. 47. 103 auditorium.\n\nSee you soon!"
    },
    {
        "group": "Waterloo",
        "repo": "www-chapter-waterloo",
        "name": "OWASP Waterloo - Enhancing the security of your Kubernetes cluster",
        "date": "2023-04-04",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-waterloo-meetup-group/events/292294645",
        "timezone": "America/Toronto",
        "description": "Dear OWASP Waterloo Community Members,\n\nWe are excited to announce our upcoming OWASP chapter meetup on \"Enhancing the security of your Kubernetes cluster.\" Join us virtually for an engaging and informative session on securing Kubernetes clusters using best practices and cutting-edge security tools.\n\nDuring this meetup, our expert speakers will cover the following topics:\n\n1. Running CIS Benchmarks against Kubernetes Clusters: Learn how to assess the security configuration of your K8s cluster using the Center for Internet Security (CIS) benchmarks to ensure compliance with industry best practices.\n2. Seccomp and AppArmor in Kubernetes: Discover the importance of implementing Linux security features like Seccomp and AppArmor in your K8s environment to limit system calls and resource access, minimizing the attack surface.\n3. Using Falco to Identify a Breach in Cluster: Explore how to deploy and use Falco, an open-source cloud-native runtime security project, for monitoring K8s cluster security, identifying potential breaches, and generating alerts for security incidents.\n\nThis meetup is a fantastic opportunity for security professionals, developers, and Kubernetes enthusiasts to network, share knowledge and stay up-to-date on the latest security trends and best practices in Kubernetes.\n\nEvent Details:\nDate: March 30, 2023\nTime: 6:30 PM - 7.30 PM EST\nLocation: https://us06web.zoom.us/j/85253024263?pwd=ckdtRE5XTmlBUFpNUTc3YXFtRlVhdz09\n\nWe look forward to seeing you!"
    }
]