[
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 16 December 2023 ",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/297751648",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 16 Dcember 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* Hacker's Perspective by **Abhishek Kumar**\n* Defense in Docker by **Aditya Gupta**\n* Ways to get into Kubernetes Cluster by **Manoj Deshmukh**\n* RE for windows P files by **Ananthakrishna**"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "December meetup",
        "date": "2023-12-12",
        "time": "7:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/297768419",
        "timezone": "America/Los_Angeles",
        "description": "Exciting News!  Join us for an engaging and insightful last meetup of the year...courtesy our hosts Gitguardian(Keep secrets out of your source code)\n\n**Talk#1** Do you know where your secrets are?\nAbstract:\nDo you know what Uber, CircleCI, and Toyota all have in common? They had hardcoded credentials in plaintext somewhere in their environments, leading to either a public leak or enabling an attacker to expand their footprint during a breach.\nUnderstanding the problem with hardcoding secrets is simple, but how widespread is this problem? How fast is it growing? How does it keep happening? Moreover, what can you do to address it?\n\n**Speaker:** Aslan pishdad,\nAslan has spent the last 10+ years working for high-growth companies spanning various sectors. Always championing new frontiers and ensuring that new ideas materialize into revenue. Have been successful in selling hardware, software, security solutions, networking, and services to a diverse customer base. Skilled in greenfield territory development and expanding customer bases to drive top-line revenue growth.\n\n**Talk #2:-** Securing Your AI Applications: Navigating Contemporary Threats and Solutions\nAbstract:-This talk provides an overview of AI/LLM models and the intuition behind them, typical design patterns for AI applications, top threats facing AI applications, and practical mitigations.\n\n**Speaker:-** Prasad Kethana, Founder, Stealth Startup in AI Security, EIR at Norwest Venture Partners\n\nPrasad Kethana has 25+ years of experience securing trailblazing companies like Reddit, Airbnb, and Databricks and building security products at CipherCloud (CASB), Symantec, PGP, and Oracle. Prasad has expertise in AI security, IAM, and cloud and application security."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter December 2023 Meetup",
        "date": "2023-12-13",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owaspboston/events/297520132",
        "timezone": "America/New_York",
        "description": "Please join us for OWASP Boston's December meetup! For those attending in-person, the doors open at 6pm, and those joining us virtually the presentation will start at 6:30pm.\n\nThis month we will be welcoming Tommaso Innocenti to talk about his research on OAuth2.0 redirection URIs.\n\nABOUT THE SPEAKER\nTommaso is a fourth-year Ph.D. student advised by Engin Kirda, working as a Secure Systems Lab (SecLab) member at Northeastern University. His interests revolve around Privacy and Security, with particular attention to increasing final users' security. His works reflect his passion and tenacity in exploring complex security topics. His most recent work focuses on the security of the OAuth protocol.\n\nABSTRACT\nOAuth 2.0 requires a complex redirection trail between websites and Identity Providers (IdPs). In particular, the \"redirect URI\" parameter included in the popular Authorization Grant Code flow governs the callback endpoint to which users are routed, together with their security tokens.\n\nIn this talk, I will present recent attack trends in conjunction with the research trends to identify the source of the problem that allowed us to generate our hypothesis.\n\nBased on this observation, I will present novel attack techniques and the experiment that allowed us to verify that the OAuth 2.0 security guidance is under-specified empirically. Finally, I will explain end-to-end attack scenarios that combine our attack techniques with common web application vulnerabilities, ultimately resulting in a complete compromise of the secure delegated access that OAuth 2.0 promises."
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "Introduction to Application Security\n",
        "date": "2023-12-11",
        "time": "3:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/297626784",
        "timezone": "Africa/Cairo",
        "description": "Join us for an on-site event with the Future University in Cairo to learn about the fundamentals of application security. This event will cover the OWASP Top 10 project, which outlines the top 10 most critical security risks for web applications. You will have the opportunity to engage in a Q&A session with industry experts and gain valuable insights into securing your applications.\n\nEvent Agenda:\n- Introduction to OWASP and the importance of application security\n- Overview of the OWASP Top 10 project and its relevance to the industry\n- Deep dive into the top 3 security risks and their impact on applications\n- Case studies and real-world examples of security vulnerabilities\n- Q&A session with industry experts\n- Networking and opportunities to connect with peers and professionals in the field\n\nWe look forward to seeing you at this informative and interactive event!"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Access control vulnerabilities - OWASP MEETUP DEC 2023",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/297733035",
        "timezone": "Asia/Kolkata",
        "description": "Embark on a transformative learning experience as Saravana Priya, a distinguished expert in cybersecurity, unveils the intricate web of Access Control Vulnerabilities. This event is tailor-made for security professionals, IT administrators, and anyone keen on understanding and fortifying against the vulnerabilities that lurk in access control systems.\n\n **What We Cover:**\n\n* **Deep Dive into Access Control Systems:** Saravana Priya will provide a comprehensive exploration of access control systems, dissecting their mechanisms, and shedding light on common vulnerabilities that can compromise security.\n* **Real-world Case Studies:** Through real-world case studies, Saravana Priya will illustrate actual access control vulnerabilities encountered in diverse environments. Attendees will gain invaluable insights into the anatomy of security breaches.\n* **Live Demonstrations:** Experience live demonstrations where Saravana Priya will simulate access control attacks, showcasing potential exploits and vulnerabilities. Witness firsthand how attackers exploit weaknesses and, more importantly, learn how to prevent them.\n* **Best Practices for Mitigation:** Saravana Priya will share a wealth of best practices and strategies to fortify access control systems. From robust authentication methods to authorization pitfalls, attendees will leave armed with actionable steps to enhance security.\n* **Interactive Q&A Session:** Engage directly with Saravana Priya during the Q&A session. Pose your questions, share your experiences, and benefit from personalized insights into access control security.\n\n **Who Should Attend:**\n\n* Cybersecurity Professionals\n* IT Administrators\n* System Architects\n* Security Analysts\n* Anyone Interested in Access Control Security\n\nFor registrations: [https://forms.gle/2NSidpiFGUNUbDdG7](https://forms.gle/2NSidpiFGUNUbDdG7)"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Hacking containers - OWASP MEETUP DEC 2023",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/297732838",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an exhilarating exploration into the realm of container security as deepali, a renowned expert in cybersecurity, takes the stage to demystify the intricate world of container hacking. This event is tailored for technology enthusiasts, developers, and security professionals eager to enhance their understanding of container security.\n\n **What to Expect:**\n\n* **Live Demonstrations:** Deepali will conduct live hacking demonstrations to showcase real-world vulnerabilities within containerized environments. Gain insights into the latest techniques used by cyber adversaries and learn how to protect your systems effectively.\n* **Tools of the Trade:** Delve into the arsenal of tools utilized by security experts to identify and mitigate container vulnerabilities. Discover open-source and commercial solutions that can bolster your security posture.\n* **Best Practices:** Deepali will share proven best practices for securing containers, offering actionable insights that you can implement immediately within your own projects. From image scanning to runtime protection, learn the critical steps to fortify your containerized applications.\n* **Q&A Session:** Engage directly with deepali during the dedicated Q&A session. Get answers to your burning questions and gain personalized advice on securing your containerized infrastructure.\n\n **Who Should Attend:**\n\n* Developers and DevOps professionals\n* IT and Security Managers\n* System Administrators\n* Cybersecurity Enthusiasts\n\nFor registration : [https://forms.gle/unMXEbM1ForE4KeN8](https://forms.gle/unMXEbM1ForE4KeN8)"
    },
    {
        "group": "Curitiba",
        "repo": "www-chapter-curitiba",
        "name": "Owasp Curitiba - Segurança desde a concepção do Projeto",
        "date": "2023-12-13",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-curitiba-chapter/events/297614280",
        "timezone": "America/Sao_Paulo",
        "description": "Owasp Curitiba - Segurança desde a concepção do Projeto"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP December Meet - In person",
        "date": "2023-12-12",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/297764535",
        "timezone": "America/Chicago",
        "description": "OWASP Dallas is ready to host in-person meets.\n\n\"** The Dark Side of Open Source Productivity**\nThere is a dark side to productivity with open source. In modern applications, the majority of code on which an application is built isn’t code written by your team. Modern applications are built on the backs of volunteer communities and open-source software. These volunteers and their software delivery practices all become potential attack vectors. The truth is that most organizations do not factor open-source supply chain attacks into their organization’s threat models today. Security incidents such as the CodeCov bash uploader script, the npm colors, and faker intentionally introduced malicious commits, and the recent PyPi backdoors targeting AWS credentials highlight the impact of supply chain attacks as a scalable attack pattern. To spread awareness on supply chain attacks so that organizations can scalably handle them we propose baking supply chain attacks into existing threat modeling procedures and software development culture so that organizations can champion supply chain management of open source in the places where they are most impactful, at development time. We will present a comprehensive, comprehensible, and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents and validated by experts in the domain. Following, we will discuss the types of defenses you can put in place to detect and respond to such modern day attacks and how you can work these defenses in based on your program’s maturity"
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Evaluasi Malware 2023 dan trend Malware 2024",
        "date": "2023-12-21",
        "time": "9:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/297555833",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n• Tool dan standar keamanan aplikasi\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n• Kendali keamanan dan pustaka standar\n• Cabang lokal di seluruh dunia\n• Riset terkini\n• Konferensi lengkap di seluruh dunia\n• Mailing list\n• Dan banyak lagi … di www.owasp.org\nKali ini di OWASP ID akan membahas :\n1\\. Evaluasi Malware 2023 dan trend Malware 2024\nSpeaker : Alfon Tanujaya (Security Enthusiast / Pengamat Sekuriti Vaksincom)\n\nLinkedin : https://www.linkedin.com/in/alfonstanujaya\n\nTopic: OWASP Jakarta - Evaluasi Malware 2023 dan trend Malware 2024.\nTime: Dec 21, 2023 07:00 PM Jakarta\n\nBergabung Zoom Rapat\nhttps://zoom.us/j/95692246978?pwd=VzdvL1QzWE9IZzAweFNYZ2tobW5aQT09\n\nID Rapat: 956 9224 6978\nKode Sandi: 652201\n\nsupported by appsec.co.id"
    },
    {
        "group": "Kolkata",
        "repo": "www-chapter-kolkata",
        "name": "OWASP KOLKATA MEETUP #9",
        "date": "2023-12-09",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-kolkata/events/297717123",
        "timezone": "Asia/Kolkata",
        "description": "#### Proposed sessions for this event:\n\n* The Mysterious Paradigm of Fuzzing by **Rakesh Seal**\n* Digital Personal Data Protection Act by **S Ramakrishnan**\n* Beyond Boundaries: The Power of Zero Trust Networking by **Mohammed Danish Amber**\n* OWASP Top 10 by **Mukunda Tamly**"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "New Year's OWASP Chapter Limassol meetup.",
        "date": "2023-12-15",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/297479557",
        "timezone": "Asia/Nicosia",
        "description": "[Location](https://www.google.com/maps/place/BrainRocket/@34.6979542,33.0460735,20z/data=!4m6!3m5!1s0x14e733f291b01fad:0x5ff57bb6ed3f9838!8m2!3d34.6979152!4d33.0461381!16s%2Fg%2F11q_08mvzb?entry=ttu) is the restaurant at the Brain Rocket office.\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the second meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/)! We cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19-00 — 19:35 \"Happy DDOS to you! Or how we saved the Christmas\" **[Ivan Agarkov](https://www.linkedin.com/in/annmuor)**\n19-35 — 20:05 \"How to find the balance between compliance and real security?\" **[Mariia Erokhina](https://www.linkedin.com/in/mariia-s-erokhina)**\n20:05 — 20:30 A short break\n20-30 — 21:00 \"Observability for security. Deep dive into Osquery\" **[Artem Mishchenko](https://www.linkedin.com/in/artem-mishchenko-155082159/)**\n21:05 — 21:40 \"Beyond IT/Fintech: Between Good and Evil. EA/SA and CSO/ISO: To Hire or To Fire?\" **[Albert Fedoseev](https://www.linkedin.com/in/albert18041986/)**\n21:45 — 23:00 Eat, drink, networking!\n\nWe'll have catering, a cocktail bar, a DJ, and a shisha zone all set up to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly VIRTUAL Meeting - DEC 13, 2023",
        "date": "2023-12-13",
        "time": "1:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297807990",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Making the OWASP Top 10 2024\nPack your brown bag and join us during lunch to hear about the new Top-10 list first hand from Andrew van der Stock, Executive Director of OWASP Foundation.\n*\\*\\* RSVP to see the Zoom link \\*\\**\n\n**ABSTRACT**: The OWASP Top 10 2024 is underway. Let's learn about how the OWASP Top 10 2024 is made, and how you can contribute.\n\n**SPONSORSHIP** Opportunities Available\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "EOY Hangout - Final Meetup of 2023!",
        "date": "2023-12-14",
        "time": "7:30+11:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/297790571",
        "timezone": "Australia/Melbourne",
        "description": "It's almost the End of 2023! Can you believe it!\nLet's end the year with one last meetup - a social hangout at a bar.\n\nIt's been a while since we caught up, with the whirlwind of cyber events the past few month. Let's grab a pint, and a meal together. Join us.\n\nThere's no agenda.\nUs organisers, will be sitting outside and getting on the beers. We'll be there at The Bottom End from 5:30pm. If you're there early, just grab a table outside the bar.\n\nHope to see you there :)\n\nPlease RSVP if you're attending so that we know if we need to sort out a booking. Thanks heaps."
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "December virtual meet: OWASP tool lunch & learn - Dependency Check",
        "date": "2023-12-13",
        "time": "2:00-06:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/297608399",
        "timezone": "America/Chicago",
        "description": "Join OWASP-MSP chapter leads Zoa Buske and Nathan Larson for a demo of longstanding OWASP flagship project Dependency Check and a discussion of Software Composition Analysis (SCA).\n\nPasscode will be sent out shortly before the event opens.\n\n[https://owasp.org/www-project-dependency-check/](https://owasp.org/www-project-dependency-check/)\n[http://jeremylong.github.io/DependencyCheck/](http://jeremylong.github.io/DependencyCheck/)"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation to create secure by design software.",
        "date": "2023-12-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Holiday Happy Hour and Year End Celebration!",
        "date": "2023-12-14",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/297779979",
        "timezone": "America/New_York",
        "description": "The next OWASP NoVA event - Holiday Happy Hour will be Thursday, December 14th, 5:30PM til 7:30 at Old Ox Brewery (44652 Guilford Dr, #114, Ashburn, VA).\n\nWe will be looking to end the year with a casual holiday social to share InfoSec war stories, recap 2023, and discuss ideas for 2024. It'll be a great time to meet and reconnect with some like-minded Security Professionals. We will be joining up with our friends at NOVABeerSec for this event. See you all there!\n\nVenue for December:\nOld Ox Brewery (https://www.oldoxbrewery.com/) is a family owned and operated commercial brewery. Our family works together. Plays together. Celebrates together. Faces life's obstacles together. We've founded our brewery on hard work and a commitment to the community. We are looking for ways to partner with the artists, farmers, restaurants, retailers, and other businesses that make Loudoun County a special place to live.\n\nWe chose Old Ox Road as the inspiration for our brewery. Old Ox is one of the oldest roads in Loudoun County and was originally built to connect the agricultural producers of Loudoun County to the markets in Fairfax County and beyond. It is this same sense of connection that we want to provide for our customers…whether they are here in our tasting room or enjoying a pint in their favorite restaurant or tavern."
    },
    {
        "group": "Sao Paulo",
        "repo": "www-chapter-sao-paulo",
        "name": "OWASP Sao Paulo - Mulheres na Linha de Frente da Cibersegurança",
        "date": "2023-12-13",
        "time": "8:00-03:00",
        "link": "https://www.meetup.com/owasp-sao-paulo-chapter/events/297739744",
        "timezone": "America/Sao_Paulo",
        "description": "**Desafios e Empoderamento: Mulheres na Linha de Frente da Cibersegurança**\n\nO OWASP São Paulo Chapter está entusiasmado em anunciar mais um encontro virtual, focado em um tema crucial e inspirador: \"**Desafios e Empoderamento: Mulheres na Linha de Frente da Cibersegurança**\". Este evento especial será marcado pela presença de três mulheres excepcionais que se destacam no cenário da cibersegurança: **Eva Pereira, Paula Papis e Carolina Bozza.**\n\nO bate-papo será moderado pela **Professora Ines Brosso e Patricia Sanches**, e trará à tona temas relevantes de cibersegurança, será debatido também sobre os desafios extras que mulheres precisam enfrentar para entrar e crescer dentro da área de Segurança da Informação.\n\nAcesse nossa pagina no LinkdIn para ver mais sobre os nossos convidados.\n\nEste evento será um espaço inclusivo e esclarecedor, destacando não apenas a importância das mulheres na cibersegurança, mas também abordando desafios enfrentados por elas no campo profissional.\n\nEste evento oferecerá uma oportunidade única para discutir, aprender e se inspirar com a experiência e a sabedoria dessas mulheres excepcionais na cibersegurança.\n\n**Marque em sua agenda e não perca esta oportunida**de única de mergulhar no mundo da cibersegurança e do papel crucial que cada indivíduo desempenha na proteção dos dados e informações.\n\nA transmissão será realizada ao vivo no canal do YouTube da OWASP São Paulo Chapter e pela nossa pagina do LinkedIn. **Inscreva-se agora para receber atualizações e lembretes sobre este evento imperdível!**\n\nFique ligado para mais detalhes e não deixe de participar deste diálogo fascinante sobre o fator humano na segurança digital. Nos vemos lá!\n\n**SOBRE A OWASP SÃO PAULO**\n\nA OWASP São Paulo é um dos 9 capítulos brasileiros entre os mais de 270 ativos em todo o mundo. O objetivo é disseminar a missão da fundação, tornando a segurança das aplicações visível para que as pessoas e as organizações possam tomar decisões conscientes sobre os verdadeiros riscos que correm.\n\nSão realizados encontros periódicos para compartilhamento de conhecimentos, discussão de temas e aprendizado sobre segurança de software.\n\n**Participe!**"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-12-13",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296623321",
        "timezone": "America/Los_Angeles",
        "description": ""
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "OWASP South Florida Chapter Meeting December 2023 ",
        "date": "2023-12-13",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/297622240",
        "timezone": "America/New_York",
        "description": "We will be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.\n\nPlease join us virtually for our December 2023 Meeting. **Make sure** you **don’t miss this final session of 2023!**\n\nBYOB - Bring Your Own Beverage\n\n**Agenda**\n===\n\n* Chapter update/news\n* Talk by Rohini Sulatycki\n* Virtual Networking\n\n**Talk Title:** Zero Trust Demystified - NIST 800-207 and the CISA ZT Maturity Model\n**Talk Summary:** This is a fast paced session that will cover the following.\n\n* What is Zero Trust?\n* What are the challenges in ZT adoption?\n* How does NIST 800-207 define a Zero Trust Architecture?\n* Review the CISA ZT Maturity Model v2"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Pub evening - Lucia OWASP meet up and after-work near Odenplan",
        "date": "2023-12-13",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/297092224",
        "timezone": "Europe/Stockholm",
        "description": "Time for a Lucia/near xmas get together. This is the perfect opportunity for all of us app-sec interested folks to get together and meet up in real life for a relaxed chat and maybe a beer or some other refreshments.\n\n When: 13th December, 2023\n Where: The Old Brewer - Public House & Dining Room at Luntmakargatan 98, 113 51 Stockholm\n\nExpect:\n Quick AppSec Tips\n Networking\n Drinks & Laughter\n\nThe meeting will start at 17:00, but it's a casual event so turn up when it suits."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Call for Speakers and Venues: Sydney OWASP Chapter Meetup in 2023!",
        "date": "2023-12-31",
        "time": "2:00+11:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/292598127",
        "timezone": "Australia/Sydney",
        "description": "The Sydney OWASP Chapter is dedicated to fostering a thriving community focused on application security and collaboration among industry professionals. With our goals of promoting equality, education, and community, we're excited to announce that we're actively looking for speakers and venue hosts for our upcoming events throughout the year.\n\n**Call for Speakers**\nDo you have a passion for cybersecurity and would like to share your expertise with our growing community? We invite you to submit a talk proposal for our upcoming meetups! This year's theme revolves around diverse applied topics in cybersecurity. We welcome presentations from experienced speakers, as well as those giving their first talk.\n\nTo submit your proposal, please email the following details to [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org):\n\n* Proposed topic\n* Abstract (100-200 words)\n* Brief speaker bio (100-200 words)\n\n**Call for Venues**\nWe're also searching for venue hosts who can accommodate 30-50 attendees and provide a screen for presentations. Hosting an OWASP meetup is a fantastic opportunity to demonstrate your commitment to security excellence while supporting the cybersecurity community. Please note that hosts are expected to cater pizza and beverages for attendees.\nIf you're interested in becoming a venue host, please reach out to us at [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org).\n\nBy contributing as a speaker or venue host, you're helping to advance our mission of fostering collaboration, education, and diversity within the cybersecurity field. We look forward to hearing from you and hope to see you at our next event.\n\nDeb, Blair, and Nick\nOWASP Sydney Chapter Committee"
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Cybersecurity Careers: Insights from a Panel of Security Leaders",
        "date": "2023-12-14",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/296891549",
        "timezone": "America/New_York",
        "description": "Join a panel of leaders in the Cybersecurity field, talk about their career journey, and offer advice."
    },
    {
        "group": "Tallinn",
        "repo": "www-chapter-tallinn",
        "name": "OWASP Tallinn - Cybersecurity & AI - Vol. 1",
        "date": "2023-12-15",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-tallinn-chapter/events/297697716",
        "timezone": "Europe/Tallinn",
        "description": "** Welcome to the Inaugural Event of OWASP Estonia: Cybersecurity & AI - Vol. 1 **\n\n Get ready to dive into the world of AI technology and cybersecurity at our first-ever event! We are thrilled to present a lineup of distinguished speakers and groundbreaking topics.\n\n **Featuring a Core Member from OWASP Top 10 LLM:** Delve into the depths of cybersecurity with insights from a key figure behind the renowned OWASP Top 10 for large language models. Learn about the latest trends, challenges, and strategies in securing large language models and AI systems.\n\n **TalTech’s Cybersecurity RA for AI-Driven Autonomous Ships:** Join our guest from TalTech, a leading assistant researcher in cybersecurity, specializing in AI-driven autonomous ships. Discover how AI is revolutionizing maritime technology and the critical role of cybersecurity in this innovative domain.\n\n **And That's Not All - More Surprises Await!** Whether you're a cybersecurity professional, a tech enthusiast, or just curious about the future of AI, there's something for everyone.\n\n **Connect, Collaborate, and Create:** This event is more than just talks - it's a platform to connect with like-minded individuals, collaborate on ideas, and contribute to the ever-evolving field of cybersecurity and AI.\n\n **Mark Your Calendars:**\nFriday 15th December at 18:30 - 20:30\nWIP Maakri 19, Tallinn\n\n **Join us at OWASP Estonia's inaugural event, Cybersecurity & AI - Vol. 1!**"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #24: Bug Bounty and Cloud Security [ONLINE]",
        "date": "2023-12-14",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/297677302",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be Online\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter. Theme sessions - Theme: Bug Bounty and Cloud Security\n**`18:00`**` Welcome participants`\n**`18:15`**` Introduction, OWASP News & Updates - Catalin Curelaru`\n**`18:30`**` Bug Bounty(Again) - Tomi Koski (Visma)`\n**`19:00`**` The bigger picture - Ovidiu Cical (Cyscale)`\n**`19:30`**` Networking`\n**Tomi Koski** \\- Red Team Engineer @ VISMA \\| Tomi Koski has been working with IT\\-systems for many moons\\, actually since \\(the wonderful\\) 1990’s\\. He is passionate about anything related to security\\, combining both physical and virtual worlds\\. He is a constant learner and very curious person about life and bug bounties\\. Currently\\, he is working for Visma as a Red \\(read: Purple\\) Teamer\n*Bug Bounty(Again)* Abstract: My journey in the world of Bug Bounties, the good and bad. Story about how bug bounties have changed my life and why I think these are super fun and educational.\n**Ovidiu Cical** \\- Cloud Security Architect @ Cyscale \\| Ovidiu is a cybersecurity enthusiast with 20 years of experience in IT\\. Ovidiu speaks at international conferences covering different topics of Cybersecurity and is not a stranger to the pro\\-bono work of running the OWASP chapter in Cluj\\-Napoca for many years in the past\\. Currently\\, he leads Cyscale\\, a cloud security startup developing a product from the heart of Cluj\\-Napoca\\.\n*The bigger picture* Abstract: The bigger picture: a context is critical in understanding your security posture. Why a certain problem in one part of your cloud infrastructure may affect other areas of your cloud apps, how cloud data is secured, and how safe is the rest of your cloud estate."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "December Cybersecurity Social",
        "date": "2023-12-14",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248523",
        "timezone": "America/Vancouver",
        "description": "**Biggest Cybersecurity Social of the year!** This Vancouver area Cybersecurity Social is jointly organized by VanCitySec, OWASP Vancouver, and DC604 DEFCON Group. It's a perfect chance to mingle, make new connections, talk shop, geek out, and otherwise have a blast with like-minded folks.\n\nPlease register so we have an idea of how many people are coming (tickets not required for entry). See you there!\n\nDecember 14, 6-9PM at **Relish the Pub**\n\n**Follow us at:**\nOWASP Vancouver: [https://www.meetup.com/OWASP-Vancouver-Chapter/](https://www.meetup.com/OWASP-Vancouver-Chapter/)\nVanCitySec: [https://twitter.com/VanCitySec](https://twitter.com/VanCitySec)\nDC604 (DEFCON group): [https://www.meetup.com/defcon604/](https://www.meetup.com/defcon604/)\nChannels on MARS Slack: **#owasp-vancouver** and **#dc604**\nJoin MARS Slack: [https://fourthplanet.ca/slack/](https://fourthplanet.ca/slack/)"
    },
    {
        "group": "Vitoria",
        "repo": "www-chapter-vitoria",
        "name": "Fundamentos e Melhores Práticas da Inteligência de Ameaças Cibernéticas",
        "date": "2023-12-11",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-capixaba/events/297701972",
        "timezone": "America/Sao_Paulo",
        "description": "Palestrante: Paulo Trindade\nTema: Os Fundamentos e as Melhores Práticas da Inteligência de Ameaças Cibernéticas na Prevenção de Ataques\nData: 11/12/2023 às 19:30"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-12-13",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889913",
        "timezone": "America/New_York",
        "description": "Welcome to our final 2023 monthly SAMM community call Wednesday 13th December, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EST.\n\nJoin Zoom Meeting: [Zoom link.](https://zoom.us/j/96866048960?pwd=TmZkTSs3ZmlWU09DbHJoSnVZWmdiUT09)"
    }
]