[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2023 (Online)",
        "date": "2023-04-25",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705726",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* -- [Eventbrite](https://owasp-austin-2023-april.eventbrite.com)\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nThe Three Trends Driving Cybersecurity Forward in 2023\n\nDramatic trend shifts in threat management and data protection are having a profound impact on cybersecurity best practices. This session will explore these trends, with an emphasis on pragmatic use cases, delivered by a 29-year cyber veteran from IBM’s Security business.\n\nSpeaker: Bob Kalka"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combined monthly meet-up ",
        "date": "2023-04-22",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/292584332",
        "timezone": "Asia/Kolkata",
        "description": "Exploiting Android Activities by UJJAYANI PRADHAN\n\nSecurity Testing on login pages by srinivas\n\nCloud Pentesting by Mukesh kumar Rao\n\nCyber Threat intel and mitre attack by Tarun Sai"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "April Meetup",
        "date": "2023-04-12",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/292582745",
        "timezone": "America/Los_Angeles",
        "description": "Our April Meetup is hosted by Check Point at their San Carlos location.\n\nPlease note: You will be required to show picture ID to enter the building.\n\n**Location**\nCheck Point Software Technologies 959 Skyway Rd #300, San Carlos, CA 94070\n\n**Agenda**\n5:30 - Doors open\n5:30 - 6:00 Food and drinks, networking\n6:00 - 6:45 Ryan Rasmuss - Leveraging ML/AI to advance Application Security\n6:45 - 7:30 Kiran Kamit - Reducing Alert Fatigue with Container Scans: Correlate, Prioritize and Filter Based on Usage\n7:30 - 8:15 Jim Downey - Why are malicious bots still so difficult to mitigate?\n8:15 - Close\n\n**We will have three talks this month**\n\n**Talk 1:**\n*Leveraging ML/AI to advance Application Security*\n\nDescription:\nWeb Applications and APIs are always vulnerable to new CVEs and victim to constant probing of threat actors. When a new vulnerability is released, we have to identify if our application is susceptible and then build a rule(s) to protect against these exploits. Pair this with applications and APIs that change with every release and we are left feeling uncertain.\n\nIn today's session we will deploy open source tools that leverage machine learning for web applications and APIs. These tools will help us learn about our applications and automatically apply the relevant protections. We can also learn about new exploits in the wild before an official CVE is released.\n\nSpeaker:\nRyan Rasmuss has been working as a security engineer for Check Point Software Ltd for about 5 years. During that time he’s focused on Application Security and Threat Intelligence. Outside of work he’s a big fan of local CTFs, golf, and camping!\n\n**Talk 2:**\n*Reducing Alert Fatigue with Container Scans: Correlate, Prioritize and Filter Based on Usage*\n\nDescription:\nToday, developers and devops engineers are being asked to address vulnerabilities and apply chain risks in container images. However, the volume of noisy security alerts often leads to developers ignoring them entirely or wasting valuable sprint time researching “false positives.”\nThis session will focus on how engineering teams can correlate vulnerabilities with runtime information, prioritize alerts based on usage, and filter out false positives that don’t represent a true exposure of a vulnerability. Prioritizing security updates to only used packages in your container image is a highly effective approach to reducing alert fatigue with your container scans. In addition, your DevOps team can even consider removing some of the unused packages and shrink your container images. As an example, this session will include a demonstration of a typical SCA static container scan of a sample open-source test application and then show how an engineering team can filter alerts to reduce the number of vulnerable and used alerts that actually need to be fixed by developers by up to 90%.\n\nSpeaker:\nKiran Kamity is the Founder & CEO of Deepfactor. He is a serial Silicon Valley entrepreneur with a passion for building products that meet a need and make a business impact—with Deepfactor that’s empowering engineering teams to create secure cloud native applications. Prior to Deepfactor, Kiran was the Head of Product at Cisco Cloud BU, Founder/CEO at ContainerX (acquired by Cisco), and the Founder/VP at RingCube (acquired by Citrix). Kiran is a TEDx speaker and loves nature, travel, and food\n\n**Talk 3:**\n*Why are malicious bots still so difficult to mitigate?*\n\nDescription:\nThe first anti-bot technology, CAPTCHA, was developed over 20 years ago, yet bots are still buying up concert tickets, ruining sneaker launches, taking over bank accounts through credential stuffing, and costing organizations tens of millions of dollars in fraud and lost revenue. Let’s learn why bots are still so difficult to mitigate, what techniques no longer work, and what it takes to effectively mitigate bots to keep your customers safe.\n\nSpeaker:\nJim Downey evangelizes app security for F5, which offers a comprehensive app security stack across data centers, edge, and multi-cloud. Formerly a Director of Engineering at Shape Security, acquired by F5, Jim focuses foremost on defending web, mobile, and APIs from malicious bot attacks."
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Birmingham Chapter Meetup May 2023",
        "date": "2023-05-04",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/292724936",
        "timezone": "Europe/London",
        "description": "Welcome from OWASP Birmingham to our first Meetup of 2023 and we're in person @Hays at One Colmore Square Thursday 4th May for two great Infosec talks.\n\nTalks to be confirmed but we have Dave Archer from Contrast Security and Stefania Chaplin (DevStefOps) from Gitlab.\n\n(Rough timings below)\n\n5.45pm - Doors open\n6.15pm - Welcome and Food\n6.30pm - TALK #1\n7.00pm - Break\n7.15pm - TALK #2\n7.45pm - Questions/Any Other Business\n8.00pm - Close\n\n***\n\nSpeaker Bios:\n\nTBC\n\nNathan + Jim"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "Introducing the OWASP Top 10 for Kubernetes",
        "date": "2023-05-10",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/292729353",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person or online (link to be provided).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nFor our May meeting, Andrew Josephides, Director of Security Research at KSOC, will give a talk introducing the [OWASP Kubernetes Top 10](https://owasp.org/www-project-kubernetes-top-ten/).\n\nGiven the growth and adoption of Kubernetes, a number of projects have been published in the OWASP community to help practitioners assess and secure the security of their containerized infrastructure including the recently released Top Ten for Kubernetes ([https://owasp.org/www-project-kubernetes-top-ten/](https://owasp.org/www-project-kubernetes-top-ten/)). This OSS project is a community-curated list of the most common Kubernetes risks backed by data collected from organizations varying in maturity and complexity. This session will discuss the project in detail, examples for each of the risks in the list, and how to get involved."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Vulnerability Management for Scalable Teams",
        "date": "2023-04-18",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/292718908",
        "timezone": "Australia/Brisbane",
        "description": "Today, software engineering teams are increasingly focused on results and strive for autonomy, often by embracing various agile methodologies and organizational structures. This move presents numerous challenges for security teams, who are typically responsible for ensuring a vulnerability-free platform.\nThis month, Andrew will explore strategies for effectively integrating vulnerability management into these dynamic agile teams and fostering a robust security culture.\n\nSee you all there Tuesday the 18th of April at Thoughtworks."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - May 2023",
        "date": "2023-05-09",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044026",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk - ZAP and Burp the Walkthrough",
        "date": "2023-04-25",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044037",
        "timezone": "Europe/London",
        "description": "For the past two years I've been using OWASP ZAP and PortSwigger's Burp Suite (Community Edition), switching between the two as I learned hacking techniques and took part in CTFs. Each has their own pros and cons, features I like, quirks, and even room for improvement.\nFor this event we will be taking a slow walk through the interfaces and features of both tools side-by-side with both pointed at a vulnerable target.\nThis will be an interactive session where you can ask questions throughout. This event is aimed at the beginner who wishes to know more about these two popular tools. This is an unbiased demonstration and both tools will be in an out-of-the-box state with no optional extras / add-ons / plugins installed.\n\n**Agenda:**\n\n* OWASP updates\n* Live interactive demonstration of ZAP and Burp Suite CE\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nThis talk will not be recorded."
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "Les applications web: Amélioration ou mise en danger de la vie des utilisateurs",
        "date": "2023-04-20",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/292382900",
        "timezone": "Africa/Porto-Novo",
        "description": "Ce meeting du chapitre OWASP-Cotonou a pour thème général: \"Les applications web: amélioration ou mise en danger de la vie des utilisateurs ?\" Il s'articulera autours des deux thèmes suivants:\n\n**Impacts de la digitalisation sur les internautes,** par **Orace KPAKPO**, Ing Réseaux et Systèmes, Analyst Cybersécurité à EMES SARL, leader du chapitre OWASP Cotonou\n\n**Digitalisation et sécurité au Bénin,** par **Victor OYETOLA**, Expert TIC, responsable du SPTIC à l'UAC"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP April Meet ",
        "date": "2023-04-18",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/292685322",
        "timezone": "America/Chicago",
        "description": "**Gaining Visibility and Reducing Risk in the SaaS Attack Surface**\n\nWith many recent SaaS related breaches (GitHub, Okta, LastPass, Dropbox, Microsoft, HubSpot), more and more attention is being focused on SaaS applications and potential security gaps. To further exacerbate the challenge, security practitioners often lack both visibility and domain expertise of the SaaS application control set required to mitigate the risk of data theft and breaches.\n\nIn the hands of the business, SaaS enables organizations to move more quickly and with greater agility, but they often do so without any security guard rails or checks beyond a supplier risk assessment during procurement. With industry analysts estimating that 99% of data leaks and breaches in SaaS will be due to application and platform misconfigurations, this leaves companies exposed to potential ticking time bombs or blind spots.\n\nJoin this virtual event to discuss:\n\n\\- Common security gaps in SaaS applications and data exposure points\n\\- Pitfalls of building on top of the PaaS layer and inadvertently leveraging security by obscurity techniques\n\\- The anatomy of a SaaS breach and best practices for the SaaS threat model\n\\- Comparisons of different cloud and SaaS security technologies and approaches\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nJoin Zoom Meeting\nhttps://us06web.zoom.us/j/89925436170?pwd=RXlmSHlQWlFqZ3VzdkkySy9JWGMyZz09\nMeeting ID: 899 2543 6170\nPasscode: 534889\nOne tap mobile\n+13462487799,,89925436170# US (Houston)\n+12532050468,,89925436170# US\nDial by your location\n+1 346 248 7799 US (Houston)\n+1 253 205 0468 US\n+1 253 215 8782 US (Tacoma)\n+1 669 444 9171 US\n+1 669 900 6833 US (San Jose)\n+1 719 359 4580 US\n+1 309 205 3325 US\n+1 312 626 6799 US (Chicago)\n+1 360 209 5623 US\n+1 386 347 5053 US\n+1 507 473 4847 US\n+1 564 217 2000 US\n+1 646 931 3860 US\n+1 689 278 1000 US\n+1 929 436 2866 US (New York)\n+1 301 715 8592 US (Washington DC)\n+1 305 224 1968 US\nMeeting ID: 899 2543 6170\nFind your local number: https://us06web.zoom.us/u/kc1kZ35Pml"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Avril 2023",
        "date": "2023-04-17",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/292654833",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **Theodo** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #60 - Security Revolution: Women Leading the Way in AppSec",
        "date": "2023-04-26",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291521942",
        "timezone": "Europe/Berlin",
        "description": "Hi all, for our last OWASP Frankfurt Chapter event before the upcoming [German OWASP Day 2023](https://god.owasp.de/2023/) edition, join us for our **Women in AppSec Special**, where we'll be tackling two of the most pressing topics in the industry today: enhancing security culture through security champions, and offensive security beyond the checkbox. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **CHECK24 Frankfurt.**\n\n_What are we going to talk about?\n\n* _Talk 1 - \"**AI-Enhanced Application Security: A Modern Approach**\" by **Diana Waithanji**, Cybersecurity engineer at SAP.\nThis talk will discuss how AI is being used to solve application security issues. We will explore the potential benefits of using AI in this area, such as increased efficiency and effectiveness in identifying vulnerabilities and threats. Additionally, we will discuss some of the challenges and limitations that come with using AI in application security and how they can be addressed.\n* _Talk 2 - \"**Beyond the Checkbox: Breaking out of Testing Frameworks**\" by **Jiska Classen**, As mobile applications handle sensitive data, ensuring their security is crucial. However, simply securing individual apps is not enough to stop real-world attackers who exploit devices through other avenues. This talk will explore unconventional security testing approaches that can help improve app security by addressing vulnerabilities in the operating system, hardware, and third-party libraries. Discover how attackers can exploit wireless interfaces, sandboxing, privilege checking bypasses, and more. Let's explore why these attack vectors are relevant in practice and how to address them beyond standard security testing checklists.\n\n_Afterwards? We will pre- and conclude the evening with the possibility to **socialize** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24 Frankfurt**.\n\n_When\nOur Meetup takes place on the last Wednesday of the month in April, namely on 26.04.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "OWASP Raider [hybrid]",
        "date": "2023-04-18",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/292754451",
        "timezone": "Europe/Berlin",
        "description": "Hi all! We're going back **on-prem** with our next Stammtisch meeting! Or to be more precise, for those which cannot attend in Hamburg we're going hybrid as we'll actually try out some new toys to stream this event in parallel!\n\nWe'll start the meeting itself at 18:00 CEST and will begin the main talk and streaming at around 18:30 CEST!\n\nIn a nutshell\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nLocation: Kuehne+Nagel, Großer Grasbrook 11-13, 20457 Hamburg\nStart: 18th of April, 6pm CEST (start of stream \\~6:30 CEST)\nTitle: OWASP Raider [hybrid]\nSpeaker: Daniel Neagaru\nNetworking: After-talk beer somewhere in the vicinity of the venue\n\nAbstract\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nRaider was created to fill a gap in current tooling for pentesting the authentication process. It abstracts the client-server information exchange as a finite state machine. Each step comprises one request with inputs, one response with outputs, arbitrary actions to do on the response, and conditional links to other stages. Thus, a graph-like structure is created. This architecture works not only for authentication purposes but can be used for any HTTP process that needs to keep track of states.\n\nA few years ago, the author had the task of helping developers to build OAuth directly from RFCs, supporting them with security topics and questions. In the beginning, the project ran into some challenges. Early on, we faced the fact that authentication is a stateful process, while HTTP is a stateless protocol.\n\nBurpSuite and ZAProxy were incepted when the web did not have states, so they inherited a stateless architecture. REST APIs became popular some years after those tools were created. They have workarounds like Burpsuite macros and ZAP Zest scripts to pass information between requests, but we found that functionality lacking and too complex to implement.\n\nSo the author wrote custom python scripts to pentest this. It worked fine, but doing this makes the scripts usable only on this system. Therefore, the author decided to create a tool that fills that gap.\n\nRaider's configuration is inspired by Emacs. Hylang is used, which is LISP on top of Python. LISP is used because of its \"Code is Data, Data is Code\" property. It would also allow generating configuration automatically easily in the future. Flexibility is in its DNA, meaning it can be infinitely extended with actual code. Since all configuration is stored in cleartext, reproducing, sharing or modifying attacks becomes easy.\n\nProject Links:\n\\- Website: [https://raiderauth.com/](https://raiderauth.com/)\n\\- Source: [https://github.com/OWASP/raider](https://github.com/OWASP/raider)\n\\- Documentation: [https://docs.raiderauth.com/en/latest/](https://docs.raiderauth.com/en/latest/)\n\\- Twitter: @raiderauth\n\\- Mastodon: @raiderauth@infosec\\.exchange\n\nHow to participate\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nA) Come to the venue! We'll meet afterwards for a beer.\nB) If not possible: Join the talk online!\n\nA) We’re happy to see you in person!\nB) OWASP Hamburg Meetup members who cannot make it in person: [https://lecture.senfcall.de/dir-o5v-cka-yx7](https://lecture.senfcall.de/dir-o5v-cka-yx7) is your friend. Please wait until the bouncer lets you in. ;-) Make sure when the talk starts your video is off and you are muted. We´ll be guest of senfcall (a German membership corporation) which provides us with a privacy friendly video conference facility. Thank you!\n\nOur OWASP \"Stammtisch\"\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nOur meeting is about web applications and their (in)security and/or about IT security in general. People come together who care as a hobby or in their job about information security: developers, managers, pen testers and everybody else who's interested. The atmosphere is open and relaxed. Who's coming to sell products or services: Move on, this is not the right place. OWASP is about education and sharing (mostly) technical information.\n\nFeel free to forward our meetup URL to your colleagues or friends. They are welcome, too. Participation is free and open -- as the O in OWASP.\n\nCheers, Dirk & Björn"
    },
    {
        "group": "Gla University Mathura",
        "repo": "www-chapter-gla-university-mathura",
        "name": "WebSec101: Building Your Foundation in Web Application Testing",
        "date": "2023-04-15",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-gla-university-mathura-student-chapter/events/292764562",
        "timezone": "Asia/Kolkata",
        "description": "Are you interested in learning more about web application testing? Join us for an exciting meetup conducted by OWASP Chapter GLA University, designed specifically for beginners!\n\nRegister here: [https://us06web.zoom.us/meeting/register/tZEqcuyspjgqE9ZeSF5DsLF0FqtukcIRtH62#/registration](https://us06web.zoom.us/meeting/register/tZEqcuyspjgqE9ZeSF5DsLF0FqtukcIRtH62#/registration)\n\nDuring this meetup, our members will provide an overview of web application testing and cover the most essential concepts that every beginner should know. Some of the topics we will cover include:\n\n1. **Introduction to web application testing**: What is web application testing, and why is it essential for organizations to test their web applications regularly?\n2. **Types of web application vulnerabilities:** We will discuss the most common types of vulnerabilities that can be found in web applications, such as SQL injection, Cross-Site Scripting (XSS), and Cross-Site Request Forgery (CSRF).\n3. **Tools and techniques for web application testing:** We will introduce popular tools and techniques used for web application testing, such as Burp Suite, OWASP ZAP, and manual testing.\n4. **OWASP Top 10**: We will discuss the OWASP Top 10, a list of the most critical security risks for web applications, and how to test for them.\n5. **Hands-on lab:** Attendees will have the opportunity to apply what they have learned in a hands-on lab, where they will test a vulnerable web application and learn how to identify and exploit vulnerabilities.\n\nWhether you are a student, professional, or simply curious about web application testing, this meetup is perfect for anyone who wants to gain a foundational understanding of this critical field. Don't miss out on this opportunity to learn from experts in the industry and take the first step towards becoming a web application testing professional!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-05-08",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/291605620",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - APR 26, 2023",
        "date": "2023-04-26",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/291490081",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: How to Identify Threat Modeling Limitations\nJoin us for great networking, dinner and drinks, and see a presentation by Joshua Williams, Senior Solutions Architect at IriusRisk.\n\n**ABSTRACT**: Many cyber and application security tools love to say they can do everything needed to protect your assets. It isn’t rocket science to know that’s not true. It’s helpful to consider the limitations of tools and processes. This presentation will take attendees through how to define the limitations of threat modeling correctly, understand best practices in how, when, and by whom a proper threat model should be performed, and how this process of identifying threat model limitations can help users better understand its utility to systems and processes.\n\n**Thanks to our Sponsor**: [IriusRisk](https://www.iriusrisk.com/)\n*When it comes to application development, security is paramount. With **IriusRisk**’s automated, scalable and easy-to-use threat modeling platform, your engineers can iron out architectural security flaws before writing code, helping you avoid costly re-design and get to market faster with secure products your customers can rely on.*\n\n*Vendors interested in sponsoring send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "1st Annual 2023 OWASP Maine Secure Coding Tournament",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/292101163",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 1st annual OWASP Maine Secure Coding Tournament! This will be an in person meetup where we welcome all software developers and appsec professionals from entry level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2023!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* $500 VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* $100 VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* $50 VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Wednesday April 19th 2023 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:** [https://discover.securecodewarrior.com/tournament-maine23.html](https://discover.securecodewarrior.com/tournament-maine23.html)\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "April 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-04-20",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/292323208",
        "timezone": "Europe/Amsterdam",
        "description": "This is an online meeting and will be streamed on YouTube.\n\n19:00 - 19:10 - **Welcome and OWASP updates**\n19:10 - 19:55 - **The Rise of the Security Verification Standard** by **Josh Grossman**\n19:55 - 20:05 - **Questions and** **Break**\n20:05 - 20:50 - **OWASP Juice Shop** by **Björn Kimminich**\n\n**The Rise of the Security Verification Standard**\n*Abstract:*\nWe are currently seeing a big uptick in the progression of the OWASP Application Security Verification Standard (ASVS) as well as the Mobile version (MASVS). Not only are two major releases in the pipeline (5.0 and 2.0 respectively) but we are now seeing industry stand up, take notice and start expecting more from applications, based on these standards. In this talk, Josh Grossman (one of the ASVS project leaders) will take you through these key developments including our vision for the upcoming version 5.0 of the ASVS and how you and your employer can be involved in the final release.\nThis will also be a chance to hear first-hand about a couple of new programmes where you will see the SVSs being more widely used and required and how you can prepare your organizations for this significant impact this will have, whether you are developing applications or you are assessing them.\n\n*Bio:*\nJosh Grossman has worked as a consultant in IT and Application Security and Risk for 15 years now, as well as a Software Developer. This has given him an in-depth understanding of how to manage the balance between business needs, developer needs and security needs which goes into a successful software security programme.\n\nJosh is currently CTO for Bounce Security where he helps clients improve and get better value from their application security processes and provides specialist application security advice. His consultancy work has led him to work, speak and deliver training both locally and worldwide including privately for ISACA and Manicode and publicly for OWASP's Global AppSec conferences. In his spare time, he co-leads the OWASP Application Security Verification Standard project and is on the OWASP Israel chapter board.\n\nHe was also recognized as a Key Contributor for the OWASP Proactive Controls project and has also contributed to the OWASP Top 10 Risks project and the OWASP JuiceShop project.\n\n**OWASP Juice Shop**\n*Abstract:*\nOWASP Juice Shop is probably the most modern and sophisticated insecure web application! It can be used in security training, awareness demos, CTFs and as a guinea pig for security tools!\n\nJuice Shop encompasses vulnerabilities from the entire OWASP Top Ten along with many other security flaws found in real-world applications!\n\nAt this event, we will take a tour through the application, hack it live on screen, learn about Coding Challenges, CTF mode, cheat detection, custom theming, and more!\n\n*Bio:*\nBjoern Kimminich works as Product Group Lead Application Ecosystem at Kuehne + Nagel, responsible – among other things – for the Application Security program in corporate IT. He is an OWASP Lifetime Member, the project leader of the OWASP Juice Shop, and a co-chapter leader for the OWASP Germany Chapter. Björn also currently chairs the OWASP Project Committee."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP NZ - Auckland Meetup - May 2023",
        "date": "2023-05-09",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291720878",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for May will be **A07:2021 - Identification and Authentication Failures.**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Fantastic Software Supply-Chain Vulnerabilities and How to Defend Against Them",
        "date": "2023-04-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/292807454",
        "timezone": "America/New_York",
        "description": "Abstract:\n\nIn this enlightening and engaging talk, Abhay will delve into the world of software supply-chain vulnerabilities and explore the most effective strategies for defending against them. As the software development ecosystem becomes increasingly complex and interconnected, the risks associated with supply-chain vulnerabilities have also grown exponentially.\n\nBy sharing captivating anecdotes, insightful case studies, and live demos, Abhay will shed light on the hidden dangers lurking within the software supply chain and offer practical advice for safeguarding organizations against these threats. The talk will cover a wide range of topics, including:\n\n\\- The evolving landscape of software supply\\-chain vulnerabilities: An overview of the most notorious incidents and their far\\-reaching consequences\\.\n\n\\- Understanding the attack surface: A deep dive into the common entry points for attackers\\, such as third\\-party dependencies\\, open\\-source libraries\\, and CI/CD pipelines\\.\n\n\\- Case studies: Real\\-life examples of high\\-profile software supply\\-chain attacks to illustrate the severity and complexity of these threats\\.\n\n\\- Risk assessment and mitigation: Essential tools and techniques for identifying and managing software supply\\-chain risks\\, such as Software Composition Analysis \\(SCA\\) and Software Bill of Materials \\(SBOM\\)\\.\n\n\\- Live demos: Hands\\-on demonstrations of how attackers exploit supply\\-chain vulnerabilities and how to effectively defend against them using best practices and cutting\\-edge solutions\\.\n\n\\- Building a resilient software supply chain: Proactive steps organizations can take to secure their software development lifecycle\\, including vendor management\\, DevSecOps integration\\, and continuous monitoring\\.\n\nBy the end of this talk, attendees will have gained a comprehensive understanding of the current state of software supply-chain vulnerabilities, as well as the knowledge and tools necessary to protect their organizations from these ever-evolving threats."
    },
    {
        "group": "Oakland County",
        "repo": "www-chapter-oakland-county",
        "name": "Kubernetes – “containers aren't just for leftovers”",
        "date": "2023-04-13",
        "time": "9:00-04:00",
        "link": "https://www.meetup.com/owasp-oakland-county-chapter/events/292303253",
        "timezone": "America/New_York",
        "description": "An exploratory look at what Kubernetes is, how it works, and how it can be implemented to provide modern solutions to dated problems.\n\n5:30pm - Socializing (Towne Square Food and Spirits)\n7:00pm - Announcements followed by this month's speaker presentation starts\n8:00pm - presentation ends, socializing\n\nTowne Square Food and Spirits entrance:\nPark in the East parking lot of 1 Town center and look for the awning to the right of the main entrance of the 1 town center building. That is the restaurant. We meet in the main dinning center to the right of the restaurant's entrance. The presentation is given in the room to the left of the Bar you face once you enter. It's advised first time attendees show up before to socialize but also follow the group into the presentation area."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "How to Identify Threat Modeling Limitations & CTF Surprise Workshop",
        "date": "2023-04-27",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/292674721",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Speaker 1: Joshua Williams, Senior Solutions Architect Team Leader at IriusRisk**\nJoshua Williams is a Senior Solutions Architect Team Leader at IriusRisk and is responsible for designing and implementing threat modeling solutions for customers. He has 20 years of experience in IT and has worked with various startups from stock exchanges to cloud security vendors. Prior to that he worked as an Engineer with and for other Government organizations. Joshua started his career with the United States Marine Corps where he taught marksmanship, martial arts and led cyber teams worldwide for 12 years. He currently teaches as an Adjunct Professor of Computer Science at a local college, and volunteers as an OWASP Leader. His interests include reading classics, playing music, playing board games with his family, home automation, losing money with crypto assets, and the outdoors.\n**Title: How to Identify Threat Modeling Limitations**\n**Abstract:**\nMany cyber and application security tools love to say they can do everything needed to protect your assets. It isn’t rocket science to know that’s not true. It’s helpful to consider the limitations of tools and processes. This presentation will take attendees through how to define the limitations of threat modeling correctly, understand best practices in how, when, and by whom a proper threat model should be performed, and how this process of identifying threat model limitations can help users better understand its utility to systems and processes.\n\n**Speaker 2: Jonathan Marcil, NorthSec Challenge Designer**\nJonathan is a board member of the OWASP Orange County chapter. Originally from Montreal, he is part of NorthSec CTF as a challenge designer. He is passionate about Application Security and enjoys architecture analysis, code review, threat modeling and debunking security tools. Jonathan holds a bachelor's degree in Software Engineering from ETS Montreal and has more than 19 years of experience in Information Technology and Security.\n**Title: CTF Surprise Workshop**\n**Abstract: TBD**\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa April 19th 2023:Passing Compliance with DevSecOps,GraphQL with Burp",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/292471760",
        "timezone": "America/Toronto",
        "description": "This is the second of two events for OWASP Ottawa in the month of April.\n\n**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\n**Health Notice:**\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/channel/UCxSU-KvNmYusZEq6v4YK5Lw). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=mf3-pPYpnr0\n\n**6:00 PM EDT** Arrival, setup, mingle\n**6:30 PM EDT** Technical Talks\n\n1. **Introduction to OWASP Ottawa, Public Announcements.**\n2. **Passing Compliance Audit with DevSecOps is Easier than You Think. Here’s How.**\n***Abstract:***\nBusiness people may not always understand all the technicalities of cyber threats and vulnerabilities, but rest assured they know what will happen if they don’t comply with applicable laws and regulations which can easily result in hefty fines, revoked licences, losing customers, or even going to jail.\nThe challenge that many small, medium and even large companies that practice DevOps face is how to pass a compliance audit quickly and painlessly without breaking the bank on manual labour or spending months ferociously fighting auditors. It took almost a decade for IT to meld Dev and Ops into one cohesive consonance, but getting compliance, risk and audit folks to understand and accept DevOps as a new and unavoidable way of developing and running software sometimes creates an even greater challenge.\nIn this presentation, Simon Sulyma will explain where traditional compliance audits fell short in today’s modern environments and explore how DevOps processes and tools can be used to effectively audit controls.\n***Bio:***\nSimon is a network administrator turned cyber security and risk professional, an avid hiker and mountain biker, a self-made chef, and a recovering ice cream addict. Simon is also raising two teenage kids, so you can't scare him. Simon spent his last 17 years designing, building, securing and auditing complex IT systems and networks, mostly at big banks. Simon is currently leading a team of eight amazing folks who do threat risk assessments at a large insurance company. He is a big fan of vendor-neutral certifications that start with \"C\" and holds a number of them as he thinks they look good in his resume.\n3. **We Taught Burp to Speak GraphQL: Automated Security Scanning of Your GraphQL API With Burp**\n***Abstract:***\nRest APIs have been the backbone of webapps for over a decade now, and it’s treated us well. Inevitably, a challenger has approached and is gradually becoming the new industry standard. That is GraphQL, a query a language for your API. But shifts in tech trends also bring another inevitability, new and interesting ways to hack stuff. GraphQL is a growing target, and the pentesting tools have yet to keep up, leaving the criminals with more time and opportunity to probe and exploit vulnerabilities in your web apps.\nBurp Suite has been the defacto tool for Application Security professionals running DAST scans and penetration tests against web apps, and it’s amazing Active Scan feature badly needed to be able to parse GraphQL. Our new plugin for Burp Suite allows the Active Scanner to competently point it’s library of payloads at a GraphQL API, giving the defenders a chance to detect vulnerabilities before the criminals do.\n**Bio**:\nJared Meit, OSWE, has always had a passion for taking things apart, learning how they work, and forgetting how to put them back together. He was a professional software developer for 12 years before shifting his focus to Application Security 5 years ago. His dev experience allows him to create tools that developer's will actually want to use."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa April 12th 2023: Kanata, Github Actions, 3 Friends of OWASP Top10",
        "date": "2023-04-12",
        "time": "5:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/292502745",
        "timezone": "America/Toronto",
        "description": "This page described the first of two OWASP Ottawa Meetups in April. The first, at the Trend office in Kanata. The second will be at our regular location at the University of Ottawa.\n\n**Welcome to our in Person Meetup at the Trend Office in Kanata**\nBefore the pandemic we use to meetup every so often in Kanata at lunch in the Trend offices amongst others. Now, we are restarting this tradition this April at the newly renovated Trend office in Kanata.\n\nTrend has renovated their Ottawa location and keen to show it off so they have a tour, refreshments (as in beer), and talks.\n\n**Trend office Location**:\n40 Hines Rd.\n**Trend Signup Page**: [https://resources.trendmicro.com/owasp-ottawa.html](https://resources.trendmicro.com/owasp-ottawa.html)\n\n**Live Stream**:\nWe will continue to Live Stream on our YouTube channel. Details to follow.\n\n**YouTube Live Stream Link**:\n\nNote that talks start at 5.\n\n| 3:00 - 3:30 | Reception Coffee |\n| ----------- | ---------------- |\n| 3:30 - 4:30 | Welcome & Office Tour |\n| 4:30 - 5:00 | Refreshments |\n| 5:00 - 5:15 | Trend Micro Welcome and Introductions |\n| 5:15 - 5:30 | How to get more from a Cloud-native application protection from One Platform |\n| 5:30 - 6:00 | Garth Boyd: Three Friends from the OWASP Top 10 |\n| 6:00 - 6:30 | Magno Logan: Github Actions 101: Creating a DevSecOps Pipeline |\n| 6:30 - 8:00 | Q&A & Networking |\n\n**Garth Boyd: Three Friends from the OWASP Top 10**\nThe OWASP Foundation is best known for its flagship project, the \"OWASP Top 10\". First released in 2003, the project has had several reorganizations and updates as it has reached a global audience. This presentation will briefly talk about OWASP the foundation, and OWASP Top 10 the project. But one hour is insufficient to talk about each element of the top 10. Instead, this presentation focuses on the investigation, lessons learned, and thrills and chills associated with The Three Friends that keep Garth up at night.\n\n**Speaker Bio**:\nGarth Boyd is a Senior Application Security Architect/Cloud Security Architect specializing in Secure Software Architecture and Ethical Hacking. He supports organizations wishing a designer, creator, and breaker to help them on their security path. A lifelong learner who enjoys crafting solutions to interesting and tough problems through architecture, threat modelling, mitigation design, and penetration testing. Researching new ideas, troubleshooting, communication, and thinking of six impossible things before breakfast are part of the journey. Currently, Garth is the OWASP Ottawa Chapter Leader and an independent consultant currently working with Mirai.\n\n**Magno Logan: Github Actions 101: Creating a DevSecOps Pipeline**\nOne of the main tools used in this process is a continuous integration (CI) tool that automates code changes from multiple developers working on the same project. In 2019, GitHub released its own CI tool called GitHub Actions. According to GitHub, GitHub Actions help you automate tasks within your software development life cycle, and it has been gaining a lot of adoption from developers.\nThis talk will demonstrate how GitHub Actions work and show security tools to protect your applications from attackers. First, we’ll dive deeply into the Actions, the language, and the runners, the servers provided by GitHub to run your Actions. Then, we’ll show how to run SAST, DAST, and SCA using open source or free tools into your pipeline just using GitHub Actions. We’ll set up Actions for each tool to scan our application for security vulnerabilities at every pull request. We’ll leverage CodeQL and Semgrep for SAST, OWASP ZAP and Nuclei for DAST, and Dependabot and OWASP Dependency Check for SCA.\n\n**Speaker Bio:**\nMagno Logan works as an Information Security Specialist for Trend Micro. He specializes in Cloud, Container, and Application Security Research, Threat Modelling, and DevSecOps. In addition, he has been tapped as a resource speaker for numerous security conferences around the globe."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-04-27",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/292659929",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - HTTP Request Smuggling + lightning talks",
        "date": "2023-04-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/292727744",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\n[OWASP](https://owasp.org/) is a worldwide, non-profit organisation focused on application security issues and we are Polish chapter of this initiative.\n\nOur main dish for this meeting is HTTP Request Smuggling attack & defence. Besides we have a room for lightening talks. **If you want to have lightning talk** please let us know in advance by [filling the form](https://forms.gle/7JFiD3z2tKifogvs5). This will help us to plan the meeting.\n\nAgenda:\n\n1. **The vulnerability of complex systems - (HRS) HTTP Request Smuggling** (Przemek Samsel)\nPresentation is about a never-ending story of HTTP Request Smuggling. Since it was born in 2005 due to research by Watchfire, it would disappear for a few years only to emerge back only now and then. Recent years have shown a real avalanche of reports related to HTTP misconfigurations, developing several variations of the attack and related attacks. In this short, technical talk, I'd like to show a few interesting examples of this vulnerability and try to answer the question - why it is so difficult for us to finally get rid of it? (about 30 min + discussion)\n2. After the break there is a room for **short lightning talks** with discussion (typical format is 5-10 minute talk followed by 5-10 minute discussion). [Please submit your ideas](https://forms.gle/7JFiD3z2tKifogvs5) or just show up.\n3. Job announcements. If you are an employer, there will be a chance to present who you are looking for.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this** with friends and in social media.\n\nWe would like to thank Codete for enabling us to organise our meetups in their Techie's Space.\n[Codete](https://codete.com/) is a software company based in Poland that specializes in custom software development and IT consulting."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "1st Annual 2023 OWASP Maine Secure Coding Tournament",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/292101163",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 1st annual OWASP Maine Secure Coding Tournament! This will be an in person meetup where we welcome all software developers and appsec professionals from entry level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2023!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* $500 VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* $100 VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* $50 VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Wednesday April 19th 2023 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:** [https://discover.securecodewarrior.com/tournament-maine23.html](https://discover.securecodewarrior.com/tournament-maine23.html)\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "April Meetups",
        "date": "2023-04-19",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/292421031",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of the month. We will announce topics 2-3 weeks in advanced of our meetups.\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Intro to the chapter\n* Desired outcome from the community\n* Brief Threat Model of AWS Security"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-04-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292263676",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-04-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292263675",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Hands-on walkthrough of API Security & Automated Testing for Complex API",
        "date": "2023-05-10",
        "time": "9:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/292823383",
        "timezone": "Asia/Singapore",
        "description": "Ashwath (co-author of ATOR Burp Plugin) and Avneesh (employee of Akto) will be doing a hands-on walkthrough of API security and talk about automating testing for complex API scenarios. They will cover the following topics:\n\n1\\. What is API Security\n2\\. Why is it important?\n3\\. Why do BB hunters find more bugs than appsec/internal folks?\n4\\. Common problems with API Security\n5\\. Automated tools that are in the market:\na. Burp native scanning\nb. Burp plugins - ATOR\nc. Akto open source\n6\\. Running ATOR against some basic scenarios \\- Demo & Hands on\n7\\. Running Akto against a test setup \\- Demo & Hands on\n8\\. Q&A\n9\\. Wrap\\-up\n\n**Target Audience:** Appsec engineers, Developers who work on APIs, Bug Bounty Hunters\n\n**What will they gain at end of session**:\n1\\. Why is API security important?\n2\\. How do misconfigurations happen?\n3\\. How to build an inventory of APIs?\n4\\. How to automate testing for complex scenarios \\(chained login\\, multi\\-step API request etc\\.\\)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - May 2023",
        "date": "2023-05-09",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291864867",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "ZAP and Burp the Walkthrough",
        "date": "2023-04-25",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291848350",
        "timezone": "Europe/London",
        "description": "For the past two years I've been using OWASP ZAP and PortSwigger's Burp Suite (Community Edition), switching between the two as I learned hacking techniques and took part in CTFs. Each has their own pros and cons, features I like, quirks, and even room for improvement.\n\nFor this event we will be taking a slow walk through the interfaces and features of both tools side-by-side with both pointed at a vulnerable target.\n\nThis will be an interactive session where you can ask questions throughout. This event is aimed at the beginner who wishes to know more about these two popular tools. This is an unbiased demonstration and both tools will be in an out-of-the-box state with no optional extras / add-ons / plugins installed.\n\nAgenda:\n\n* OWASP updates\n* Live interactive demonstration of ZAP and Burp Suite CE\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nThis talk will not be recorded."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Software Bill of Materials (SBOM) And Security Via Transparency",
        "date": "2023-04-12",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/292763892",
        "timezone": "America/Toronto",
        "description": "TALK\n\nThe Software Bill of Materials (SBOM) and Security Through Transparency\n\nSummary:\n\nThe recent software supply chain attacks that have been rocking the internet show how important it is to have the right solution to ensure immediate visibility of the blast radius of new vulnerabilities. Join us to learn one of the most effective ways to rapidly identify systems impacted through a proper SBOM Strategy, to help organizations secure their software supply chain and reduce risk of cyber attacks. We’ll dive into:\n\n• SBOM Analogy\n• SBOM History\n• Why it makes sense?\n• SBOMs, Languages and Formats\n• Difference between VEX and SBOM\n\nPresenter:\n\nDmitry Raidman\n\nDmitry is a Canadian-Israeli entrepreneur and cybersecurity professional who has been around the technology ecosystem for over two decades. Dmitry’s specialty is in the area of application security, cloud architecture, DevOps, DevSecOps, and automation of cyber-defense mechanisms. Dmitry co-founded Cybeats in 2016. In late 2018 Dmitry joined the NTIA group that worked to shape the SBOM standard. In 2020 Dmitry invented the SBOM Studio solution to help Enterprises consume and manage SBOMs. To give back to the cybersecurity community, Dmitry co-founded the Security Architecture Podcast during COVID-19 pandemic in 2020. Today Dmitry is leading the innovation, technology, and product in Cybeats as CTO and participates in various working groups to define the future of SBOM, VEX, CSAF, PACE, and OpenC2."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "AppSec Roundtable, hosted by Chris Romeo",
        "date": "2023-04-27",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/291207489",
        "timezone": "America/New_York",
        "description": "Following up on the success of our first AppSec round table in January, we'll continue the format for our April meeting. The host will present questions to get the conversation going, and the group will share insights and wisdom!"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Tracing webapp exploitability through code review and taint analysis",
        "date": "2023-04-20",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248498",
        "timezone": "America/Vancouver",
        "description": "**Title**: Tracing web application exploitability through code review and taint analysis\n**Speaker**: Dana Epp\n\nCome learn how to look at your web apps and APIs more offensively to discover the exploitability of your code before your adversaries do.\n\nThis event is sponsored by **Microsoft** \\- thanks for providing us space and food\\."
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "Secure Your Apps: A Cybersecurity Event by OWASP Victoria",
        "date": "2023-05-11",
        "time": "8:30-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/292413504",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter is pleased to present an In-Person Application Security Event on May 11, 2023. Join us at Fort Tectoria from 6:30 PM to 9:00 PM for an informative and engaging event focused on the latest trends and best practices in cybersecurity. We are excited to announce that Tanya Janca and Roberto Salgado will deliver two live presentations!\n\nTanya will present \"Pushing Left to Secure Software,\" and Roberto will present \"A Summary of Cybersecurity in 2022\". Whether you're a seasoned security professional or just getting started in the field, you'll leave with valuable insights, actionable takeaways to improve your organisation's security posture, and a chance to win swag/prizes!\n\nIn addition to the presentations, hors d'oeuvres, and prize giveaways, there will be ample opportunities for networking and collaboration with like-minded professionals. You'll have the chance to connect with peers, learn from industry leaders, and exchange ideas about the latest tools and techniques for staying ahead of the ever-evolving cybersecurity landscape.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in cybersecurity. If you would like to attend, please click the RSVP button to reserve your spot, as we have limited seats available.\n\nWe would also like to give a special thanks to Websec and SheHacksPurple for sponsoring this event.\n\n‎\n**Who This Event is For**\n\n* IT and Cybersecurity Professionals\n* Developers and Engineers\n* Executives and Managers\n* Researchers, Academics, and Students\n* IT Vendors and Service Providers\n* Hobbyists\n\n‎\n\n**Speaker Biographies**\n**Tanya Janca**\nTanya Janca, also known as SheHacksPurple, is the best-selling author of 'Alice and Bob Learn Application Security'. She is also the founder of We Hack Purple, an online learning academy, community, and podcast that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years and has been everywhere from startups to public service to tech giants (Microsoft, Adobe, & Nokia). She has worn many hats; startup founder, pentester, CISO, AppSec Engineer, and software developer. She is an award-winning public speaker, active blogger, and streamer and has delivered countless talks and training sessions across six continents. She values diversity, inclusion, and kindness, which shines through in her countless initiatives.\n\n**Roberto Salgado**\nRoberto Salgado, a co-founder of Websec, became fascinated with technology at a very young age and eventually found his niche in Cybersecurity. Through his passion and dedication to this field, he researched and devised new methods of attack and defence; this led Roberto to present his research at several security conferences and contribute to various open-source projects. Roberto also created and maintains the SQL Injection Knowledge Base, one of the most comprehensive references available. During his time at Websec, he has served many roles, from security tester to business developer, which has allowed him to gain a broad perspective and understanding of the field of information security."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #60 - Security Revolution: Women Leading the Way in AppSec",
        "date": "2023-04-26",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291521942",
        "timezone": "Europe/Berlin",
        "description": "Hi all, for our last OWASP Frankfurt Chapter event before the upcoming [German OWASP Day 2023](https://god.owasp.de/2023/) edition, join us for our **Women in AppSec Special**, where we'll be tackling two of the most pressing topics in the industry today: enhancing security culture through security champions, and offensive security beyond the checkbox. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **CHECK24 Frankfurt.**\n\n_What are we going to talk about?\n\n* _Talk 1 - \"**AI-Enhanced Application Security: A Modern Approach**\" by **Diana Waithanji**, Cybersecurity engineer at SAP.\nThis talk will discuss how AI is being used to solve application security issues. We will explore the potential benefits of using AI in this area, such as increased efficiency and effectiveness in identifying vulnerabilities and threats. Additionally, we will discuss some of the challenges and limitations that come with using AI in application security and how they can be addressed.\n* _Talk 2 - \"**Beyond the Checkbox: Breaking out of Testing Frameworks**\" by **Jiska Classen**, As mobile applications handle sensitive data, ensuring their security is crucial. However, simply securing individual apps is not enough to stop real-world attackers who exploit devices through other avenues. This talk will explore unconventional security testing approaches that can help improve app security by addressing vulnerabilities in the operating system, hardware, and third-party libraries. Discover how attackers can exploit wireless interfaces, sandboxing, privilege checking bypasses, and more. Let's explore why these attack vectors are relevant in practice and how to address them beyond standard security testing checklists.\n\n_Afterwards? We will pre- and conclude the evening with the possibility to **socialize** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24 Frankfurt**.\n\n_When\nOur Meetup takes place on the last Wednesday of the month in April, namely on 26.04.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]