[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - October",
        "date": "2021-10-26",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Aarhus-Chapter/events/281291184/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>Notice, that this is a physical event and that Cryptomathic will be hosting it. By signing up, you accept that OWASP Aarhus will hand over a list of participants to Cryptomathic for the sole purpose of hosting this event.</p> <p>19:00 - 19:30<br/>\"Welcome, Food and Drinks\"<br/>Thomas Ljungberg Kristensen - Co-Chapter Leader OWASP Aarhus<br/>Dennis Perto - Co-Chapter Leader OWASP Aarhus</p> <p>19:30 - 20:15<br/>Waiting for final confirmation - Stay tuned!</p> <p>20:30 - 21:15<br/>\"Cryptography and it’s flaws in practice\"<br/>Marcus Sellebjerg, Student at Aarhus university with a passion for cybersecurity and cryptography</p> <p>About the presentation:<br/>It’s widely acceptable that security on the internet is very important. Still many developers doesn’t know how to implement security mechanisms and particularly cryptography is a very error prone area. For many cryptography is a black box of math-magic and while that is fine, it’s important to use this black box in a correct manner which is sadly not easy. In this talk I’ll give you an introduction on how to use the cryptography black box and how it can be exploited if not used correct.</p> <p>About Marcus:<br/>My name is Marcus, I’m currently a masters student at Aarhus University with a huge interest in cryptography and the math behind it. Beside university I compete in capture the flag tournaments together with my team (Kalmarunionen), where we look at different security solutions and tries to circumvent the implemented security mechanisms, both crypto and other areas. I also work in the cryptography department of Danske bank and have been programming since I was around the age of 12, where the concept of hiding information in plain sight also found my interest.</p> <p>21:15 - 21:30<br/>Goodbyes and plans going forward<br/>Thomas Ljungberg Kristensen - Co-Chapter Leader OWASP Aarhus<br/>Dennis Perto - Co-Chapter Leader OWASP Aarhus</p> "
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE - Component Analysis vs SCA (by Steven Springett)",
        "date": "2021-10-21",
        "time": "17:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/280073211/",
        "timezone": "Europe/Brussels",
        "description": "<p>On October 21st, we have scheduled Steven Springett with Component Analysis vs SCA - How SBOMs are the driving force for change.</p> <p>This chapter meeting is part of a series of virtual chapter meetings (every 3rd Thursday of the month).</p> <p>Our chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed. Registered attendees can join via Zoom, and ask questions to the speakers.</p> <p>More info on this series of chapter meetings or on the Belgium OWASP chapter can be found at <a href=\"https://owasp.org/www-chapter-belgium/\" class=\"linkified\">https://owasp.org/www-chapter-belgium/</a> .</p> "
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Projects and Cyber Security Research Ideas - October 2021",
        "date": "2021-10-16",
        "time": "10:00",
        "link": "https://www.meetup.com/OWASP-Cairo-Chapter/events/281242844/",
        "timezone": "Africa/Cairo",
        "description": "<p>OWASP Cairo Chapter Event</p> <p>Location:Online Event</p> <p>Date: Saturday, October 16, 2021</p> <p>Event Agenda:</p> <p>1- How to open an OWASP project [By: Mohamed Alfateh]. 10:00 to 10:15<br/>2- OWASP Incubator projects, ideas for Research (1) [By: Ahmed Yousif]. 10:15 to 11:00<br/>3- OWASP Incubator projects, ideas for Research (2)[By: Joey Joseph]. 11:00 to 11:45<br/>4- OWASP Lab projects [By: Mahmoud Elhindy]. 11:45 to 12:30<br/>5- OWASP Flagship projects [By: Mohamed Ahmed]. 12:30 to 13:00<br/>6- Online Live Competition - Winners will get OWASP T-Shirt. 13:00 to 13:30</p> "
    },
    {
        "group": "Charlotte",
        "repo": "www-chapter-charlotte",
        "name": "October 2021 Meetup - Topic TBA",
        "date": "2021-10-21",
        "time": "19:00",
        "link": "https://www.meetup.com/owaspCLT/events/274988455/",
        "timezone": "US/Eastern",
        "description": "<p>Topic is TBA.</p> "
    },
    {
        "group": "Cluj",
        "repo": "www-chapter-cluj",
        "name": " “Put your White Hat on!” and join us",
        "date": "2021-10-14",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cluj/events/281244746/",
        "timezone": "Europe/Bucharest",
        "description": "<p>Put your White Hat on!” and join us.</p> <p>OWASP (The Open We Application Security Project) chapter in Cluj presents an open online event for the specialists in Information Security in Cluj, as well as anyone interested or aspiring to a career in this domain.</p> <p>We’re building up a Cybersecurity Community and there’s no better way than gathering all experts and future experts to a first event that marks this beginning.</p> <p>Register today to find out hands-on information about how can you prevent and manage Information Security breaches and incidents, learn best practices and more.</p> <p>Find below the speakers and topics of the meetup:</p> <p>Romeo Andreica, Information Security Engineer arobs<br/>The Impact of Day 0 in Informations Security:<br/>• The information attacks in the contexts of Day-Zero vulnerabilities<br/>• The incidence of these type of attacks in the prezent context and remote work<br/>• Identification, evaluation and classification mechanisms<br/>• Remedies, backup-restrore and patching in case of security incidents</p> <p>Cristian Șerban, Cyber Architect arobs<br/>Rust Language Security – Best practices<br/>• Features review<br/>• How does Rust prevent buffer overflow, integer overflow, memory corruption and others<br/>• It guarantees complete memory safety</p> <p>Securing Data Demo<br/>Alin Oprea, Junior Security Engineer arobs<br/>Andrei Gherasim, Junior Security Engineer arobs<br/>Ioana Oltean, Junior Security Engineer arobs<br/>Adelina Dumitraș, Junior Security Engineer arobs</p> <p>Please join the zoom meeting with the<br/>ID 884 3632 7774<br/>or use the link bellow<br/><a href=\"https://us06web.zoom.us/j/88436327774\" class=\"linkified\">https://us06web.zoom.us/j/88436327774</a></p> "
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Secure Code Warrior CTF",
        "date": "2021-10-28",
        "time": "12:00",
        "link": "https://www.meetup.com/Columbus-OWASP/events/281270826/",
        "timezone": "US/Eastern",
        "description": "<p> Secure Code Warrior Tournament + OWASP Columbus</p> <p> When: October 28th, 12:00PM ET<br/>October 30th, 5:00PM ET</p> <p>Secure Code Warrior brings you a defensive security-based tournament from a developer's perspective. The tournament allows you to test your skill against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability. You don’t need extensive programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but is also secure.</p> <p> You can find the tournament step-by-step guide here: <a href=\"https://youtu.be/o8XhKK_eOOs\" class=\"embedded\">https://youtu.be/o8XhKK_eOOs</a></p> <p>The tournament is run virtually so you can join through your laptop from the most convenient location and time. It should take only a few hours, drop-in as you see fit during the duration of the event to complete all the challenges and win prizes!</p> <p>Instructions for playing:<br/> 1) Register for the Secure Code Warrior platform here: <a href=\"https://discover.securecodewarrior.com/OWASPColumbus.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPColumbus.html</a><br/> 2) Check your email for the confirmation and access the unique link to create your profile.<br/> 3) Once logged in: click “Tournaments”<br/> 4) Join the OWASP Columbus Secure Coding Tournament</p> <p>The Secure Code Warrior platform will be open before and after the tournament, so feel free to practice in the “Training” tab.</p> <p> Monitor the live leaderboard to see how you're performing!</p> "
    },
    {
        "group": "Cork",
        "repo": "www-chapter-cork",
        "name": "Neurodiversity in Cyber Security",
        "date": "2021-11-03",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Cork/events/281395587/",
        "timezone": "Europe/Dublin",
        "description": "<p>Our next meetup is supporting HAYS and Genius Within's discussions around neurodiveristy as it applies to cybersecurity. An interesting and important topic which we are excited to hear more about.</p> <p>Expert speakers Daniel CM Browne (<a href=\"https://www.linkedin.com/in/dcmbrowne/\" class=\"linkified\">https://www.linkedin.com/in/dcmbrowne/</a>) and Jacqui Wallis (<a href=\"https://www.linkedin.com/in/jacquiwallis/\" class=\"linkified\">https://www.linkedin.com/in/jacquiwallis/</a>) talk openly about how businesses, business leaders, and all of us in the Cyber/Tech world can do more to attract, support, and retain Neurodiverse talent. We intend to have a thought-provoking conversation, that will hopefully drive some habitual changes and do more to support the neurodiverse community.</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP November Meeting",
        "date": "2021-11-09",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/280769873/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>What is an SBOM, why do I care, and how does my organization get started?</p> <p>Description:</p> <p>It’s nice to know what’s in the food on the shelf at the store so you can make an informed decision whether you should buy it. And when there are recalls of certain ingredients it’s nice to quickly know whether those ingredients are already in your cupboard. Software Bills of Materials enable you to know what’s in the software you consider procuring, and let you quickly know what’s already inside your organization. Of course, you can even use them to understand the risk in the portfolio of software your organization baked itself! Since the May Executive Order on Improving the Nation’s Cybersecurity SBOMs have gotten a lot more attention, but what does it really mean for an organization to make the most of this capability? This talk will help you prepare your organization for the near future when generating, evaluating, and leveraging SBOMs will be expected.</p> <p>Bio:</p> <p>Greg Mohler is a Manager within KPMG's Cyber Defense practice, and has spent the past four years helping over 20 clients solve difficult problems related to DevSecOps, Application Security, and Vulnerability Management. He is passionate about minimizing the distraction of security incidents so that businesses can focus on innovation, growth, and speed to market. Greg has led the delivery of services that not only uplift clients' technical capabilities, but also bolster security education &amp; culture.</p> <p>Caleb Queern is a Director in KPMG's Cyber practice and is based in Austin. He has more than 15 years of technology and information security experience. His focus is reducing risk and improving performance so organizations can meet business goals and enable growth. Caleb has lead engagements in technology companies, pharmaceutical companies, higher education, financial services, manufacturing, and others. His specialties include secure DevOps and application security, security operations, and operational excellence.</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP October Meeting",
        "date": "2021-10-19",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/268956961/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>Financial-grade API (FAPI)</p> <p>Description:</p> <p>Financial-grade API (FAPI) is a security framework devised by the OpenID foundation for securely using APIs specifically in the finance industry. The framework introduces more stringent security controls and strengthens the existing OAuth2 and OpenID Connect specifications. In this session Vinod will discuss various aspects of the framework and how they will address specific weaknesses in the traditional OAuth flows.</p> <p>Bio:</p> <p>Vinod Kannan is a seasoned cybersecurity professional with over 19 years of experience in cybersecurity with special interest in DevSecOps, Identity and Access Management, and Application Security. He has currently taken up the role as a Principal Consultant with Synopsys in its Software Integrity Group (SIG) and is focusing on managed security services offerings. Prior to this he has worked with Ernst &amp; Young and HPE and various financial services firms such as JPMC and Bank of America. He is passionate in learning about new developments in the cybersecurity space that enables him in presenting the right solutions to clients.</p> "
    },
    {
        "group": "Doha",
        "repo": "www-chapter-doha",
        "name": "Cyber Security Virtual Meetup Doha - \"OT Security Monitoring Approach\"",
        "date": "2021-10-20",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Doha-Chapter/events/281317694/",
        "timezone": "Asia/Qatar",
        "description": "<p>Announcing online information security meetup supported by the local information security community Doha, Qatar.</p> <p>Agenda &amp; Schedule for this meetup Dated 20/10/2021</p> <p>6:00 PM to 6:30 PM: OT Security Monitoring Approach<br/>6:30 PM to 6:40 PM : Questions &amp; answer session</p> <p>Topic : OT Security Monitoring Approach<br/>Speaker : Bilal Hansrod</p> <p>This event is free to attend for both members and non-members of ISC2/OWASP/Null and is open to anyone interested in information security and cybersecurity awareness. Please note that you MUST RSVP it will help us in organizing.</p> <p>As this will be a recurring event, we welcome as many paper submissions as possible, and reserve keeps interesting talk proposals for future editions.</p> <p>The talk proposal should abide by the isc2/OWASP/Null principles: to promote and disseminate knowledge and tools in cybersecurity that respect its core values, openness, support for innovation, global reach, and integrity. The talks should be vendor-neutral, which is not publicity talks for a specific company or a proprietary tool, but about interesting experiences insecurity that can engage and foster discussion in the local community.</p> "
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Q4 Meetup (Placeholder)",
        "date": "2021-10-28",
        "time": "19:00",
        "link": "https://www.meetup.com/indyowasp/events/280097107/",
        "timezone": "US/Eastern",
        "description": "<p>We'll share more details closer to the event, but I'll say I'm _very_ excited about the topic!</p> "
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Online meeting ",
        "date": "2021-11-08",
        "time": "18:45",
        "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/nnccjsyccpblb/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-10-25",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccnbhc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Kyiv",
        "repo": "www-chapter-kyiv",
        "name": "OWASP Kyiv Fall 2021 ONLINE Meetup",
        "date": "2021-10-30",
        "time": "10:00",
        "link": "https://www.meetup.com/kyiv-meetup-group/events/279752085/",
        "timezone": "Europe/Kiev",
        "description": "<p>The fourth OWASP Kyiv chapter meetup in 2021 will be held on October 30 in the online format. The attendance is free of charge.<br/>If you want to be a speaker or present your workshop, please feel free to fill the form here: <a href=\"https://cfp.owaspukraine.org/okfall2021/cfp\" class=\"linkified\">https://cfp.owaspukraine.org/okfall2021/cfp</a></p> "
    },
    {
        "group": "Las Vegas",
        "repo": "www-chapter-las-vegas",
        "name": "Hybrid Event! 2021 OWASP Top 10: What's New?",
        "date": "2021-10-16",
        "time": "14:00",
        "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/281156996/",
        "timezone": "US/Pacific",
        "description": "<p>Join the OWASP LV at the Tech Alley in person or virtual! (Link post registration)</p> <p>Tech Alley Meetup Link: <a href=\"https://www.meetup.com/tech-alley/events/278983744/\" class=\"linkified\">https://www.meetup.com/tech-alley/events/278983744/</a></p> <p>Join OWASP Vegas for a look at the latest changes to the infamous OWASP Top 10. there are three new categories, four categories with naming and scoping changes, and some consolidation in the Top 10 for 2021. We will be holding an open discussion forum as we walk through each, and share how it may affect us. Whether you are a seasoned AppSec ninja or just interested, it will be informative and fun for everyone!</p> "
    },
    {
        "group": "Leeds Uk",
        "repo": "www-chapter-leeds-uk",
        "name": "November OWASP meet ",
        "date": "2021-11-10",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Leeds-Chapter/events/281093548/",
        "timezone": "Europe/London",
        "description": "<p>After the recent success of the re-booted Leeds Chapter, we've decided to do another!</p> <p>Speakers TBA and if you'd like to speak - please get in touch.</p> <p>See you there, drinks and nibbles will be provided</p> "
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly Virtual Meeting - OCT 27, 2021",
        "date": "2021-10-27",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Los-Angeles/events/278725579/",
        "timezone": "US/Pacific",
        "description": "<p>Come join us as we hear the monthly presentation by Aaron Guzman, Head of Product &amp; Application Security with Cisco Meraki</p> <p>TOPIC: OWASP &amp; CSA IoT: Impacting Medical Security</p> <p>ABSTRACT: The Open Web Application Security Project (OWASP) IoT Project is designed to help manufacturers, developers, and consumers better understand the security issues associated with the Internet of Things as well as enable users in any context to make better security decisions when building, deploying, or assessing IoT technologies. Similarly, CSA's IoT Working group is dedicated to understanding IoT deployments and defining actionable guidance to secure ecosystems. Their efforts are often used to develop medical security guidelines for developers and manufacturers alike but also to influence IoT security assessment methodologies for later use on commercial IoT certification schemes. This session will provide insights into current project initiatives, including those that directly impact medical devices and how you can save lives by getting involved.</p> <p>BIO: Aaron Guzman is a published author and a technical reviewer for several security books. He is the Head of Product &amp; Application Security with Cisco Meraki where he focuses on building security into enterprise IoT products and crafting designs that keep users safe from compromise. Aaron spearheads many open-source initiatives, raising awareness about IoT hacking and proactive defensive strategies under OWASP’s IoT and Embedded Application Security projects. A co-chair of Cloud Security Alliance’s IoT Working Group, he has extensive public speaking experience delivering conference presentations, training, and workshops globally. Follow Aaron on Twitter @scriptingxss.</p> <p>Meeting info will be available on meetup - BE SURE TO RSVP to access the link</p> <p>ATTENTION SPONSORS: YOUR NAME COULD BE HERE<br/>Check out sponsorship opportunities here<br/><a href=\"https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471\" class=\"linkified\">https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471</a></p> "
    },
    {
        "group": "Luxembourg",
        "repo": "www-chapter-luxembourg",
        "name": "OWASP Luxembourg Chapter - Meeting#2 - OWASP Top 10:2021 Overview",
        "date": "2021-10-27",
        "time": "17:30",
        "link": "https://www.meetup.com/owasp-luxembourg-group/events/281144615/",
        "timezone": "Europe/Luxembourg",
        "description": "<p>Description of the talk:<br/>Learn about the new OWASP Top 10:2021 that was released in September, 2021. This talk will walk through the process we used to build the new Top 10 and provide a brief overview of each of the risk categories in this updated list. Hear how the OWASP Top 10:2021 can fit into your organization and provide a baseline for secure development.</p> <p>About the speaker:<br/>Brian Glas, OWASP Top Ten Leader | Assistant Professor Of Computer Science, Union University Brian has over 20 years of experience in various roles in IT and over a decade and a half of that in application development and security. His day job is serving as an Assistant Professor teaching a full load of Computer Science and Cybersecurity classes at Union University. He helped build FedEx's AppSec team, worked on the Trustworthy Computing team at Microsoft, consulted on software security for years, and served as a project lead and active contributor for SAMM v1.1-2.0+ and OWASP Top 10 2017 and 2021. Brian is a contributor to the RABET-V Pilot Program. He holds several Cybersecurity and IT certifications and is currently working on his Doctor of Computer Science in Cybersecurity and Information Assurance.</p> <p>Who should attend?<br/>Both existing OWASP members and people unfamiliar with OWASP. Information security practitioners of all levels, IT professionals, and business leaders. Developers, development managers, product owners, QA professionals, program managers, and anyone involved in building software, etc.</p> "
    },
    {
        "group": "Manchester Nh",
        "repo": "www-chapter-manchester-nh",
        "name": "OWASP Manchester, New Hampshire Chapter Meeting - October 2021",
        "date": "2021-10-20",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Manchester-NH/events/281248223/",
        "timezone": "US/Eastern",
        "description": "<p>Join us for an informal discussion around operational Vulnerability Management, and OpenVAS, an open source VM scanner</p> <p>Video call link: <a href=\"https://meet.google.com/fev-ouxk-nnd\" class=\"linkified\">https://meet.google.com/fev-ouxk-nnd</a><br/>Or dial: ‪(US) +1 319-382-9461‬ PIN: ‪621 952 993‬#</p> "
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "October 2021 OWASP Chapter Netherlands Meetup",
        "date": "2021-10-28",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Chapter-Netherlands-Meetup/events/281228990/",
        "timezone": "Europe/Amsterdam",
        "description": "<p>19:00 - 19:15 Welcome<br/>19:15 - 20:00 Our Secrets Management Journey: From Code to Vault by Jeroen Willemsen<br/>20:00 - 20:15 Break<br/>20:15 - 21:00 Doing Security in DevOps, the right way! by Irfaan Santoe</p> <p>Our Secrets Management Journey: From Code to Vault</p> <p>So you have an access key that you need to store somewhere. Maybe it is better not to put it in your code, nor in your container. But what about Kubernetes? What about a custom secrets storage solution? Of course, we tried many, sometimes funny, things to get our secrets secured. And luckily we ended up with a combination of safe methods, with Vault at its core. Want to know more? Join us, as we will go through various examples and their challenges!</p> <p>Jeroen Willemsen is a Principal Security Architect at Xebia and a jack of all trades in security. He loves to develop new software, set up DevSecOps support tooling, and help companies with security programs. He enjoys sharing knowledge, which is why he published articles, blogs and gave trainings and talks about various subjects.</p> <p>Doing Security in DevOps, the right way!</p> <p>Automation is not DevSecOps, but without automation there is no DevSecOps! Secret management, SAST, DAST, Pen Testing, Container Security, Secure Config Management etc. are about automating security. But let me ask you, can one reach nirvana in securing DevOps with solely automation? This talk will address ALL dimensions required for doing security in DevOps, so we get it right!</p> <p>Irfaan Santoe is a Global Security Director at Wolters Kluwer advising the Business &amp; IT on the information security ambition &amp; implementation. Prior to Wolters Kluwer, Irfaan was the Global Head of Security Engineering at ABN AMRO bank and lead the security implementation of ABN AMRO’s IT transformation towards DevOps. This transformation program is set to uplift more than 500+ Dev-teams to become DevOps and increasing security without breaking DevOps! Irfaan is a Master in Computer Science (a programmer by heart) and is fascinated by the Inner Science of Yoga &amp; Meditation.</p> <p>The YouTube link will be added to this page.</p> "
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "(Alert Level 1 permitting) The new OWASP Top 10 Web Application Security Risks",
        "date": "2021-10-27",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-Zealand-Chapter-Christchurch/events/281034378/",
        "timezone": "Pacific/Auckland",
        "description": "<p>Important! Traction on Demand (formerly Trineo) is not hosting events under Alert Level 2, so this is a tentative placeholder for the next meetup. Details to be added soon…</p> "
    },
    {
        "group": "Omaha",
        "repo": "www-chapter-omaha",
        "name": "Q4 Meeting: Securing your Applications with the OWASP ASVS",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspomaha-meetup-group/events/280673562/",
        "timezone": "US/Central",
        "description": "<p>Michael Born, Director of Security Consulting at SecureSky, Inc. will walk the audience through how to employ the OWASP Application Security Verification Standard to harden modern applications. This presentation will also provide guidance for deploying applications in Microsoft Azure that comply with the OWASP ASVS.</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The beauty of runtime AppSec done right",
        "date": "2021-10-21",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-OC/events/281070205/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Daniel Blazquez, Technical Product Marketing Lead, Hdiv Security</p> <p>Topic: The beauty of runtime AppSec done right</p> <p>Live stream: <a href=\"https://www.twitch.tv/owaspoc\" class=\"linkified\">https://www.twitch.tv/owaspoc</a></p> <p>Abstract:<br/>Traditionally, application security practices oscillate between static activities (code scans, code reviews, threat modeling, etc.) and runtime activities (penetration testing, scanners, and WAFs). Static activities have context and depth, but lack visibility on the true behavior of the software. On the other hand, runtime activities have no direct access to the internals of the application because they follow an external approach.</p> <p>DevOps teams are demanding a more complete picture of the security of the applications, combining static and dynamic activities. In this practical talk, I want to propose a new approach based on runtime observability, that provides not only vulnerabilities and attacks, but also app deployment intelligence, sensitive data visibility, and API discovery capabilities.</p> <p>Speaker Bio:<br/>Daniel Blazquez leads the technical marketing and developer advocacy practice at Hdiv Security, a VC-funded application security company focused on application security automation. As an ex-Java programmer and recovering corporate strategy professional, Daniel brings a holistic view to the S-SDLC practice: from coding to product management, all the way to growth strategy. His education includes a Computer Science master's and undergrad, and an MBA at UCLA Anderson.</p> <p>Our meeting sponsor, Shiftleft, will provide a $40 Amazon gift card to all attendees who fill out our survey during the meeting. The URL for the survey will be given out during the meeting.</p> <p>--------------------------------------------------------------------------------------<br/>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa October 2021: CISSP: Not just for squares",
        "date": "2021-10-20",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Ottawa/events/281189833/",
        "timezone": "Canada/Eastern",
        "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=tBdfEITSQNQ\" class=\"embedded\">https://www.youtube.com/watch?v=tBdfEITSQNQ</a></p> <p>7:00 PM EDT Technical Talks</p> <p>1. Announcements</p> <p>2. CISSP: Not just for squares</p> <p>Abstract:<br/>\"On what type of fire would you use a Class C extinguisher?\" \"What is the difference between SLE and ARO?\" ...Are you still awake?</p> <p>These may be fine questions to ponder if you are a CISO putting together the DRP, agonizing over MTD and RTO. But what if you are a pentester or a security researcher, and you only care about kill chains and exfil channels?</p> <p>I embarked on a CISSP journey with hesitation, but can now confidently say that it was time well spent. In this talk I outline my reasons for why I think CISSP is a worthwhile pursuit even for the hardcore red-teamer.</p> <p>Bio:<br/>Dmitriy Beryoza - Senior Security Researcher, Vectra AI<br/>Dmitriy is a Senior Security Researcher at Vectra AI. He spent over 25 years of his life building software before realizing that breaking it is much more fun. Dmitriy is passionate about all things security, with particular interest in reverse engineering, binary exploitation, secure software development, and CTF competitions.</p> "
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "Virtual Happy Hour - OWASP Sacramento October Meetup",
        "date": "2021-10-28",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/281403542/",
        "timezone": "US/Pacific",
        "description": "<p>Agenda:<br/>- Community Topics<br/>- Main Topic: Virtual happy hour, open format. Grab yourself your favorite drink, maybe an appetizer and let's chat about security, the chapter, and whatever else comes up.</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "
    },
    {
        "group": "Saint Louis",
        "repo": "www-chapter-saint-louis",
        "name": "OWASP Meetup - CTF",
        "date": "2021-10-18",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-STL/events/277429716/",
        "timezone": "US/Central",
        "description": "<p>Capture the Flag (CTF) is a computer security competition. CTF contests are usually designed to serve as an educational exercise to give participants experience in securing a machine, as well as conducting and reacting to the sort of attacks found in the real world. Reverse-engineering, network sniffing, protocol analysis, system administration, programming, and cryptanalysis.</p> <p>* This will be an open CTF which means this is open book. You may use any tool or internet accessible resource: Burpsuite, IDE, Metasploit, etc.</p> <p>* Work in single or 2 person teams</p> <p>* Be the person/team with the most challenges completed to win (time will determine a tie)</p> <p>This CTF will run from October 18th-21st.<br/>* October 18th Kickoff @ 7PM<br/>* October 21st Finish &amp; Demo @ 7PM</p> "
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "October 2021 Chapter Meeting (in person! - during SaintCon)",
        "date": "2021-10-21",
        "time": "17:00",
        "link": "https://www.meetup.com/owasp-slc/events/281371383/",
        "timezone": "US/Mountain",
        "description": "<p>Our October meetup will be at SaintCon. Meet the local AppSec group and grab a bite to eat Thursday evening (5pm) in downtown Provo.</p> <p>Please RSVP, and we'll sponsor enough seats/food ;)</p> <p>Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-wuvxjhp2-~oHXAUB5KeHn9MUOTWccYw\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-wuvxjhp2-~oHXAUB5KeHn9MUOTWccYw</a>) to suggest any additional topics.</p> <p>AGENDA:<br/>- Meetup in person &amp; Eat food<br/>--Round Table--<br/>- Updates with coming with OWASP Top 10 (DRAFT)<br/>- AppSec training for Devs<br/>- And other topics...</p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "OWASP Top Ten Updates: A Costume Party!!",
        "date": "2021-10-21",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccnbcc/",
        "timezone": "US/Pacific",
        "description": "<p>Put on your favorite costume, turn on your webcam, and watch chapter leader Christian DeHoyos walk through the OWASP Top Ten updates for 2021!</p> <p>Learn why OWASP updates its \"top ten\" every four years. Learn which risks got promoted, which got dropped, and WHY some things got consolidated. Come with your hottest takes, frankest concerns, and exciting anecdotes. Christian will attempt to keep this discussion exciting, factual, relevant, and from derailing into a trainwreck!</p> <p>He will likely fail but the attempt should be entertaining, so come on through!</p> <p>As always, be respectful or get bounced. Best costume will receive an award!</p> <p>---------------<br/>Christian DeHoyos is a Sr Cloud Security Architect @ Lenovo. Christian is an OWASP San Diego Chapter leader and local Oside resident. Chrisian dislikes long bios.</p> "
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Zero Trust Identity-Based Micro-segmentation (SPIFFE) & Secure Software Factory",
        "date": "2021-10-19",
        "time": "19:30",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/280590027/",
        "timezone": "Asia/Singapore",
        "description": "<p>With the significant increased adoption in cloud-native technologies and against the backdrop of supply chain attacks (Solarwinds hack), what can all of us do to ensure what we build and deploy to Production is indeed secure? In this session, Nathan Aw will expound on the need for a Secure Software Factory (SSF), share some useful cloud-native security checklists and finally demo some security and compliance tools that can help to secure our cloud-native supply chain.</p> <p>Speaker: Nathan Aw<br/>A hands-on microservices developer turned AppSec architect and practitioner, Nathan Aw unyielding passion lies in building and deploying secure and scalable software that can run anywhere. Through the actual hands-on setup of a Secure Software Factory (SSF), Nathan understands intimately the importance of setting up a first-class secure software factory that is able to quickly deliver trusted and secure digital services to its customers. More on Nathan can be found at <a href=\"https://sg.linkedin.com/in/awnathan\" class=\"linkified\">https://sg.linkedin.com/in/awnathan</a></p> "
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Owasp Stockholm DevOps and security & Benefits of Cloud Thinking",
        "date": "2021-10-21",
        "time": "17:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/281022013/",
        "timezone": "Europe/Stockholm",
        "description": "<p>Welcome to a OWASP Stockholm event!</p> <p>Finally we can meet IRL again and we will fire off with a Secure Development event hosted by Omegapoint at their new office site.</p> <p>Location: Jakobsbergsgatan 24, Auditorium.<br/>Time: October 21, 17.00 – 20.00<br/>Lighter food &amp; drinks will be served. The talks will begin at 17.30.</p> <p>The meeting will also be made available online for those who cannot make it in person. To join the meeting you need a zoom account.</p> <p>Join Zoom meeting:<br/><a href=\"https://us06web.zoom.us/j/84859502930\" class=\"linkified\">https://us06web.zoom.us/j/84859502930</a></p> <p>Session 1. DevOps and security<br/>A presentation of a development lifecycle inspired by the DevOps loop with activities related to modern development and security with a discussion at the end.</p> <p>Bio<br/>Mats Persson, Consultant @ Omegapoint, passionate about Secure Development, Modern Ways of Working and Security in the Cloud</p> <p>Session 2. Benefits of Cloud Thinking<br/>Are Advanced Persistent Threats (APT) becoming the new normal? Should we get used to businesses getting pawned and having sensitive data leaked? Absolutely not! In this talk, we will present how designs often used in the cloud not only reduces risk of APTs, but also improve overall quality of your application – regardless if you’re running in the cloud or not.</p> <p>Bio<br/>Daniel Deogun &amp; Dan Bergh Johnsson are authors of the book Secure by Design and have collectively been working with security and development for several decades. They are developers at heart and understand that security is often a side-concern. They’ve also evolved work habits that enable them to develop systems in a way that promotes security while focusing on high-quality design habits – something that’s easier for developers to keep in mind during their daily work. Both are established international speakers and often present at conferences on topics regarding high-quality development and security.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney - Fun with Hack the Box",
        "date": "2021-11-11",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/279765803/",
        "timezone": "Australia/Sydney",
        "description": "<p>Please join us to play/train in Hack The Box (HTB), what you need is a Hack the Box account, free is cool, join us in discord (link <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a>) - FC-Announcements-Voice Channel, please ensure, after registration in Discord you go to the Bot and accept the Code of Conduct, otherwise, you won't be able to access the channels.</p> <p>There is no format to this night, we just want to get together to have some fun playing some battlegrounds, doing some of the machines or challenges; having fun overall!</p> <p>Please make sure you know the basics about HTB, eg. how to connect to the HTB VPN and that you have a valid account.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Sydney OWASP Night -  Interview Tips & Tricks",
        "date": "2021-10-19",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/280634417/",
        "timezone": "Australia/Sydney",
        "description": "<p>Say welcome to our guest Mon Siv who wants to help you become more confident in yourself when you next interview for a job, whether it’s in cybersecurity or in any other industry. His tips and tricks will ensure you establish the right skills to understand the interview process, what’s expected of yourself, and how to be ready to smash your goals.</p> <p>Her top tips are:<br/>Having the right mindset - Focus on the things you can control.<br/>Research and preparation - The role and audience you will be presenting to.<br/>Etiquette - Do’s and don’ts in an interview.</p> <p>Mon Siv has spent 15 years working in the recruitment industry, recently moving to a new role with Fortian to help build and mature their internal recruitment function on their growth journey.</p> <p>He has also worked in the agency world, specialising in the cybersecurity domain, helping candidates at various levels navigate through the recruitment process to secure their next role on their career path.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney - Fun with Hack the Box",
        "date": "2021-10-14",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/279765791/",
        "timezone": "Australia/Sydney",
        "description": "<p>Please join us to play/train in Hack The Box (HTB), what you need is a Hack the Box account, free is cool, join us in discord (link <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a>) - FC-Announcements-Voice Channel, please ensure, after registration in Discord you go to the Bot and accept the Code of Conduct, otherwise, you won't be able to access the channels.</p> <p>There is no format to this night, we just want to get together to have some fun playing some battlegrounds, doing some of the machines or challenges; having fun overall!</p> <p>Please make sure you know the basics about HTB, eg. how to connect to the HTB VPN and that you have a valid account.</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2021-10-28",
        "time": "18:30",
        "link": "https://www.meetup.com/owasptriangle/events/pqfzhsyccnblc/",
        "timezone": "US/Eastern",
        "description": "<p>TBA</p> "
    },
    {
        "group": "University Of Washington",
        "repo": "www-chapter-university-of-washington",
        "name": "Cybersecurity Career in pandemic and post-pandemic environment",
        "date": "2021-10-28",
        "time": "14:30",
        "link": "https://www.meetup.com/owasp-university-of-washington-meetup-group/events/281365340/",
        "timezone": "US/Pacific",
        "description": "<p>We will discuss Cybersecurity career opportunities in the pandemic and post-pandemic environment.<br/>Speaker: TBD</p> "
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Life, the Universe and everything Application Security",
        "date": "2021-10-21",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Vancouver-Chapter/events/281285275/",
        "timezone": "Canada/Pacific",
        "description": "<p>It is OWASP Vancouver's annual panel conversation and this time it will be an Ask Me Anything... about Application Security. We want YOU to pick what we should talk about, what is on YOUR mind?</p> <p>We can talk about:<br/>- Supply chain attacks in the AppSec space<br/>- Web application safety of vaccine passports<br/>- Application Security tooling<br/>- Security career questions</p> <p>The topics are endless and the panelists are ready!</p> <p>The rockstars on the panel are:<br/>Farshad Abasi<br/>Dana Epp<br/>Amiran Alavidze<br/>Harini Rangarajan</p> <p>------------------------------------------------------------------------------------</p> <p>Dana Epp has spent decades as a security architect that focuses on helping secure software, data and infrastructure. You might say he’s been on and led Blue and Red Teams well before it was even a thing.</p> <p>When he’s not helping to build and grow software companies focused on developing security tools he’s advising others on how to build and break their own applications and environments. As both a Microsoft Regional Director and a Microsoft Security MVP for 16 years, these days he spends a great deal of time on security (de)engineering in the cloud, especially in Microsoft Azure.<br/>------------------------------------------------------------------------------------</p> <p>Amiran is currently Director, Security and Risk Management at Tasktop, building a product security program. With over 20 years in information security in roles ranging from system engineering and security operations to governance, risk and compliance, Amiran is advocating a pragmatic, business-focused approach to security. Security is not just a job, it’s a passion.</p> "
    },
    {
        "group": "Vilnius",
        "repo": "www-chapter-vilnius",
        "name": "OWASP Vilnius Meetup #2 (Online)",
        "date": "2021-10-21",
        "time": "18:00",
        "link": "https://www.meetup.com/owasp-vilnius/events/281220797/",
        "timezone": "Europe/Vilnius",
        "description": "<p>Let's meet on a dark October evening online and hear two interesting presentations:</p> <p>- \"CodeQL for security researchers\". Jaroslav Lobačevski, Security researcher @ GitHub Security Lab.<br/>An introduction into CodeQL - semantic code analysis engine, its capabilities and usage scenarios. The audience will learn how to query code as data and apply variant analysis to find security vulnerabilities at scale.</p> <p>- “Detecting threat activity”. Arturs Ermanis, Senior SecOps Engineer @ Accenture<br/>It's not a matter of \"if\" but \"when\". Malicious actors can disrupt our daily routine and cause anxiety. Thanks to the right tools, a plan and staff training, we build our strengths against challenging activities to detect, mitigate and remediate.</p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Cloud Security Tooling for the Sole Practitioner",
        "date": "2021-10-24",
        "time": "10:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/276120026/",
        "timezone": "Canada/Eastern",
        "description": "<p>You're the sole practitioner of cloud security at your organization. You're happy to get your hands dirty in your cloud environment use some tools to lock things down, but it seems like there are new cloud security tools coming out every week. Where do you start? How do you prioritize which ones will have the most impact upfront?</p> <p>In this show, Kinnaird McQuade, Lead Security Engineer at Salesforce will go over what sole practitioners need to build out their own \"lean but mean\" cloud security toolkit.</p> <p>KINNAIRD McQUADE</p> <p>Kinnaird McQuade is a Lead Security Engineer at Salesforce, where he specializes in building, breaking, and automating security controls in cloud infrastructure and CI/CD. Kinnaird is the author of several cloud security tools - Cloudsplaining and Policy Sentry among them - and is passionate about making security easy via automation. You can find him on kmcquade.com (<a href=\"http://kmcquade.com/\" class=\"linkified\">http://kmcquade.com/</a>) and on Twitter @kmcquade3.</p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Demystifying Mobile Security With a COVID App",
        "date": "2021-10-17",
        "time": "10:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/280920802/",
        "timezone": "Canada/Eastern",
        "description": "<p>In this episode, we will unveil the mystery of mobile security. The presentation will be in parts. We will discuss the OWASP Mobile Top 10, and then delve into components of an Android application, sample tools for mobile security. Next, we'll look at core files in an Android app followed by the results of reverse engineering a COVID app. Finally, we will end the presentation with the next steps to continue learning mobile security.</p> <p>JASMINE JACKSON<br/>Jasmine shares her passion for Information Security by presenting and teaching workshops with over ten years of Information Security experience. She is currently the Jeopardy-style Capture The Flag (CTF) Coach for the inaugural US Cyber Games. She is also an Adjunct Professor at Drexel University and City University of Seattle with additional courses with Cybrary. Finally, Jasmine has certifications in Secure Programming, Web Application Pentesting, and Cloud Security. Jasmine has a master’s degree in Computer Science and a Graduate Certificate in Information Security and Privacy from the University of North Carolina, Charlotte. Currently, she works as a Senior Application Security Engineer for a Fortune 500 company. She has presented her work domestically and internationally for such conferences - The Diana Initiative, Bugcrowd, Blacks in Cybersecurity, and NotPinkCon in topics of Mobile Security, and Web Application Security.</p> <p>In her spare time, she likes to stay up to date on security vulnerabilities by completing capture the flag write-ups on her blog, vulnerability disclosures, and YouTube channel. Besides Jasmine’s passion for teaching, she also has a passion for educating the next generation of Information Security professionals by volunteering with organizations - Biohacking Village, BlackGirlsHack, Open Web Application Security Project (OWASP), and Women’s Society of Cyberjutsu.</p> <p>Reach out to her on all social media platforms - @thefluffy007.</p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "How to Analyze Code for Vulnerabilities using Joern",
        "date": "2021-10-15",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/280834756/",
        "timezone": "Canada/Eastern",
        "description": "<p>Code analysis is the process of analyzing the code of a program to find security vulnerabilities. It is the most effective way to identify many types of security issues, from injection vulnerabilities to issues like leaked secrets and vulnerable dependencies. But the process of manually analyzing code for vulnerabilities can be very time-consuming. Is there a better way to do this?</p> <p>In this talk, Vickie and Suchakra will demonstrate how to use open-sourced code analysis tool Joern to make code analysis more efficient. How do you effectively trace user input in code? How can you efficiently link bug sources to sensitive sink functions? This is the second edition of How to analyze code for vulnerabilities (<a href=\"https://www.youtube.com/watch?v=A8CNysN-lOM\" class=\"embedded\">https://www.youtube.com/watch?v=A8CNysN-lOM</a>), this time, we’ll talk about how to do it efficiently using Joern.</p> <p>VICKIE LI<br/>Vickie Li is the resident developer evangelist at ShiftLeft. She is an experienced web developer with an avid interest in security research. She can be found on <a href=\"https://vickieli.dev\" class=\"linkified\">https://vickieli.dev</a>, where she blogs about security news, techniques, and her latest bug bounty findings. She also hosts “Security Simplified”, a developer education series focusing on web security: <a href=\"https://www.youtube.com/c/vickielidev\" class=\"embedded\">https://www.youtube.com/c/vickielidev</a>.</p> <p>SUCHAKRA SHARMA<br/>Suchakra Sharma is Staff Scientist at ShiftLeft Inc. where he builds code analysis tools and hunts security bugs. He completed his Ph.D. in Computer Engineering from Polytechnique Montréal where he worked on eBPF technology and hardware-assisted tracing techniques for OS analysis. As part of his research, he also developed one of the first hardware-trace based virtual machine analysis techniques. He has delivered talks and trainings at venues such as RSA, USENIX LISA, SCALE, Papers We Love, Tracing Summit, etc. When not playing with computers, he hikes and writes poems.</p> "
    }
]