[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2024-01-30",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/297958036",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus and ITM8/Improsec are happy to invite you to the next OWASP Aarhus meetup.\n\nITM8/Improsec will be the host and we will provide more information as we get closer to the event."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Transforming Threat Modeling: Harnessing ChatGPT for Automated Security Analysis",
        "date": "2024-01-25",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/298291376",
        "timezone": "America/New_York",
        "description": "Traditional manual threat modeling is resource-intensive. This talk explores a game-changing approach using ChatGPT, an advanced language model, to automate and enhance threat modeling. Attendees will understand ChatGPT's potential in revolutionizing cybersecurity processes.\n\n**Session Highlights:**\n\n1. **Introduction to ChatGPT:** Uncover the versatility of advanced language models in cybersecurity. Explore their applications in threat modeling.\n2. **Automating Threat Modeling:** Learn how ChatGPT streamlines threat modeling, increasing efficiency by reducing manual efforts.\n3. **Generating Dynamic Threat Models:** See how ChatGPT assists in crafting threat models from system architecture, user stories, and design documents.\n4. **Elevating Accuracy and Scope:** Discuss techniques for refining accuracy and coverage of automated threat models generated by ChatGPT.\n5. **Integration and Synergy:** Explore seamless integration of automated threat modeling into existing security processes. Understand how collaboration between AI systems and security professionals can be encouraged.\n\n**Key Takeaway:** Attendees gain insights into leveraging ChatGPT for efficient threat modeling, enabling organizations to identify and mitigate security risks effectively."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - January 2024 (Online)",
        "date": "2024-01-30",
        "time": "1:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298206929",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "January 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-01-11",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298294318",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, January 11th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar @ Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Salvador Technologies](http://www.salvador-tech.com/)\n\n*Salvador Technologies provides security failover technology for cyber-attack recovery and downtime prevention in Industrial Control Systems (ICS) and Operational Technology (OT) organizations. Its innovative solution bypasses standard cyber-attack recovery protocols and forensics measures, minimizing downtime, and regains operations within an astonishing 30-second timeframe. The company’s platform is used by some of the world’s most secure critical infrastructure organizations, including manufacturing, aerospace, maritime, energy and water companies.*\n\n*For more information, please visit [www.salvador-tech.com.](https://www.salvador-tech.com/)*"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "January meetup",
        "date": "2024-01-17",
        "time": "7:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/298342170",
        "timezone": "America/Los_Angeles",
        "description": "Host(Synopsys) requires full name and email address to pre-register the attendees. Host has assured that this data will not be used for marketing or any other purpose. Kindly use use the below link to register:\n\n**[https://www.eventbrite.com/e/january-meetup-tickets-790684256897?aff=oddtdtcreator](https://www.eventbrite.com/e/january-meetup-tickets-790684256897?aff=oddtdtcreator)**\n\nHappy New year, Please join us at Synopsys HQ in Sunnyvale to Meet-Up and discuss some of the challenges that we face securing software and building TRUST into the products/services that we use daily. Along with informative talks around AppSec, there will also be some awesome food & drinks, as well as access to an outdoor patio for network throughout the event.\n\nBrief agenda below:\n5:00 – 6:00: Networking/Food\n6:00 – 6:25: What is Application Security Posture Management (ASPM)?\n6:30 – 6:55: Coverage - The Missing Link of WebApp/API Security Testing\n6:55 – 7:10 : Short Break\n7:10 – 7:35: TBD\n7:35 – 8:00: Networking\n\n**What is Application Security Posture Management (ASPM)?**\nCompanies adopt many application security testing (AST) tools to pinpoint critical software issues and keep compliant with OWASP standards. Yet despite this AppSec investment, they still fail to get an accurate view of risk, and struggle integrate testing, triage, and remediation within developer workflows. This has driven the evolution of application security posture management (ASPM).\nIn this session, we’ll dive into:\n\\- What is ASPM\\, and capabilities that a comprehensive solution should have\n\\- Best practices on using ASPM to accelerate AppSec transformation and consolidate data\\, workflows\\, and visibility\n\\- How ASPM is central to helping your teams keep up with OWASP compliance and mitigate software risk at scale\\.\n\n**Speaker:-** Natasha is a Senior Product Marketing Manager at Synopsys, driving go-to-market strategy for Software Risk Manager, an ASPM solution. She has worked for ten years in the cybersecurity and enterprise networking space. Prior to Synopsys, Natasha was with ServiceNow, where she managed product marketing initiatives for ServiceNow Security Operations, a SOAR platform for incident and vulnerability management. She has also held roles in product marketing and software product management at Imperva and A10 Networks.\nTalk#2: **Coverage - The Missing Link of WebApp/API Security Testing**\nMost DAST tools will boast about how many hundreds of thousands of attacks/checkers/vulns they scan for. But most still have a hard time automatically finding all of the pages/endpoints/actions in modern applications (e.g. SPAs) and APIs. Not to mention figuring out how to test everything they find in both a meaningful way and a reasonable amount of time. After all these years and entire markets built on web scraping, why is crawling for security testing still so hard? Why isn't an OpenAPI/Swagger spec enough to properly test an API? And what are we doing about it? In this session we'll dive in to those missing links and explore how we can actually feel confident in our automated testing coverage.\n\n**Speaker2**: Steve Chappell, SW Manager & API Security Evangelist\nSteve has done a little bit of everything in his 10 years at Synopsys (R&D, Sales, and yes, he even got suckered into Marketing for a while), but currently loves his role as a SW Engineering Manager, leading a team developing novel dynamic testing engines targeting webapps and APIs. When he's not evangelizing Application/API security, you might find him playing or creating word/puzzle games at the top of a multi-pitch climb drinking a craft or Belgian beer... or coaching youth sports.\n\n**Talk3#** TBD"
    },
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "Finding Your Niche",
        "date": "2024-01-16",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-bonita-springs-chapter/events/297926252",
        "timezone": "America/New_York",
        "description": "We're cohosting an event with SWFLSec and SpaceCoastSec!\n\nOne of the most difficult questions about getting started in a cybersecurity career is \"Where do I start?\". Our presenter recently made the transition from an HR / Talent Acquisition role to a cybersecurity role and will present their unique perspective on finding your niche in the cybersecurity realm."
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "OWASP Chennai Offline Meetup - Jan 20,2024",
        "date": "2024-01-20",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/298322892",
        "timezone": "Asia/Kolkata",
        "description": "**Title**: Unveiling Vulnerabilities: Hacking Adult entertainment and dating sites\n\n**Abstract:** Explore the hidden world of cybersecurity exploits in adult entertainment and dating sites. Our presentation reveals bug bounty findings, exposing vulnerabilities like SSRF, Authentication Bypass, BAC and much more. Real-world case studies shed light on security gaps, providing insights into bug bounty challenges. Beyond exploits, gain practical strategies for stability and persistence in theme-based bug bounty hunting.\n\n**Title:** Attack Surface Management Role in Ransomware Defence\n\n**Abstract:** Amidst rising ransomware threats, this study explores Attack Surface Management (ASM) as a pivotal defense. Delving into ASM's strategies, tools, and real-world successes, it equips organizations to fortify against evolving cyber risks. Covering vulnerabilities, risk mitigation, and future trends, this research empowers proactive defense in today's dynamic threat landscape.\n\n**Registration Form**: https://forms.gle/ER4LesKYrf5ouj7J9"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS January 2024 - SPECIAL EVENT HANDS-ON LAB",
        "date": "2024-01-13",
        "time": "0:00-07:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/297982531",
        "timezone": "America/Denver",
        "description": "**HANDS-ON LAB**: James Smith will lead us in creating a hands-on web application security testing lab\n\n**Bring your own laptop**; hardware requirements:\n\\- Intel chipset \\(no ARM\\, no Mac silicon\\)\n\\- 60GB free diskspace\n\\- Administrator account access \\(to install virtualization software\\)\n\nCoffee / donuts / pizza provided\n\nLocation: National Cyber Center (NCC):\n\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "How to File Upload for Developers",
        "date": "2024-01-18",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295118782",
        "timezone": "America/New_York",
        "description": "Coming Soon"
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A night of Jim Manico",
        "date": "2024-01-23",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/297956007",
        "timezone": "Europe/Copenhagen",
        "description": "We're so incredibly lucky that Jim Manico, a global forerunner and huge capacity in appsec efforts within the OWASP organization and globally for decades and more recently in AI security, is moving to Copenhagen and is dedicated to giving back to our community.\n\nJim has offered to do not just one talk but bot a talk and a short course on his favorite topics: AI Security and appsec. And you're hereby cordially invited to join. As usually there'll be pizzas and drinks and as usually everything will be for the amazingly attractive price of nothing!\n\nSchedule:\n17.00: Introduction to OWASP Copenhagen\n17.05: Navigating the AI Labyrinth: Ethics, Security, and Best Practices\n18.00 Pizzas and drinks\n18.30: Appsec training\n\nHere's a description of both events:\n\n**Navigating the AI Labyrinth: Ethics, Security, and Best Practices**\nThis talk offers a comprehensive exploration of Artificial Intelligence (AI) from its historical evolution to the latest developments in AI security and ethics. Key topics include:\n\n* A Brief History of AI: A snapshot of the pivotal milestones in AI development.\n* AI and Ethics: Understanding AI's business impact, ethical guidelines, best practices, and risk mitigation strategies.\n* Robustness & Reliability of AI Code Generation: Addressing common misuse patterns and reliability metrics in AI systems.\n* Artificial Intelligence Security Introduction: Analyzing historical AI failures to draw lessons and improve future applications.\n* OWASP Top Ten for Large Language Models (LLMs): A deep dive into security considerations specific to LLMs, ranging from prompt injection to model theft.\n* Threat Modeling AI Systems: Outlining methodologies to assess and mitigate AI-related threats.\n* Hugging Face Open Source AI Tools: Exploring the utility and application of these tools in AI research.\n* Differential Privacy and AI: Discussing the principles of differential privacy in the context of AI.\n* NIST AI Risk Framework: An overview of NIST's guidelines for AI risk management.\n* EU AI Act: Analysis and impact on AI development and use.\n\nThe talk aims to provide attendees with a nuanced understanding of AI's ethical implications, security challenges, and practical approaches for secure and responsible AI deployment.\n\n**AppSec Training**\nIn the rapidly evolving realm of web development and application security, the OWASP Top 10 remains a cornerstone document, acting as a beacon for developers and security professionals alike. Reflecting a broad-based consensus, it spotlights the most critical security risks threatening web applications, thereby shaping the frontier of secure coding techniques.\nWith an ever-increasing emphasis on web-based interactions, the significance of a deep understanding of these risks is paramount. As developers etch lines of code giving life to web applications, a firm grasp of secure coding practices becomes not merely beneficial, but essential.\nThis immersive and engaging presentation seeks to equip attendees with a comprehensive understanding of the OWASP Top Ten 2022 release, intending to empower developers with the knowledge necessary to author secure, resilient software. As we navigate through this labyrinth, we shall focus on in-depth discussions around:\n\n* A01:2021-Broken Access Control\n* A02:2021-Cryptographic Failure\n* A03:2021-Injection\n* A04:2021-Insecure Design\n* A05:2021-Security Misconfiguration\n* A06:2021-Vulnerable and Outdated Components\n* A07:2021-Identification and Authentication Failures\n* A08:2021-Software and Data Integrity Failures\n* A09:2021-Security Logging and Monitoring Failure\n* A10:2021-Server-Side Request Forgery\n\nJoin us as we embark on this enlightening journey, delving into the unique intricacies of each risk, exploring defense strategies, and fostering a culture of security-minded web application development. This presentation aims to instill a robust defensive mindset, helping attendees to weave a narrative of secure coding that transcends the bounds of standard practices."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP January Meetup - Join Us!",
        "date": "2024-01-17",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/298208909",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on in the new year on January 17th for food, drinks, networking and an exciting presentation on \"**Threat Modeling the AI Pipeline**\". Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Presentation Title:** Threat Modeling the AI Pipeline\n\n**Presentation Details:** Rapid advancements in AI technologies have opened up a plethora of opportunities, but they’ve also introduced significant risks and challenges. One crucial yet often overlooked aspect of AI development is threat modeling. Threat modeling AI systems gives companies an edge in secure by design principles. This session aims to illuminate these potential threats within the AI pipeline and provides strategies for identifying, analyzing, and mitigating them."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "[InterSec] OWASP IoT Top 10 Rists",
        "date": "2024-01-17",
        "time": "5:45+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/297500599",
        "timezone": "Asia/Dubai",
        "description": "OWASP Dubai Chapter is announcing an upcoming event about \"OWASP IoT Top 10\"\nEveryday, technology gets more helpful yet more complex\nEveryday, we relay more and more on technology and software solutions\nEveryday, new cyber threats and attacks are created and activated.\nIn this session, we will discuss:\n\\- The new Era of IoT and how it is changing the daily life of people around the globe\n\\- The top 10 security risks associated with IoT and how IoT is expanding the attack surface according to OWASP guide\n\\- How to mitigate IoT associated security risks to design and build more resilient IoT products\nEvent Speaker is [Mahmoud Hussein](https://www.linkedin.com/company/90810901/admin/#), OWASP Dubai Chapter Leader.\nEvent is online and Free on Monday, 20th March 2023 @ 9:00am - 11:00am Dubai time.\nRegistration is now open on the link below\nJoin our meetup group to keep up with all updates and events.\n**#IoT** **#security** **#design** **#events** **#software** **#cybersecurity** **#technology** **#cyber** **#business** **#business** **#dubai** **#safety** **#event**"
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "[InterSec] AI and LLM Security Challenges ",
        "date": "2024-01-17",
        "time": "5:15+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/297500567",
        "timezone": "Asia/Dubai",
        "description": "The event on LLM (Large Language Models) and AI security challenges convened experts and professionals from diverse fields to address the pressing issues surrounding the deployment and use of advanced language models. Participants engaged in insightful discussions on the ethical implications, privacy concerns, and potential risks associated with the increasing capabilities of LLMs.\n\nThe event delved into the intricate balance between harnessing the power of language models for innovation and confronting the security challenges they pose.\n\nKey topics included mitigating biases, ensuring robust encryption, and implementing responsible AI practices to safeguard against misuse. The collaborative atmosphere fostered an exchange of ideas, laying the groundwork for future collaborations and strategies to navigate the evolving landscape of AI security."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Janvier 2024",
        "date": "2024-01-15",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/298276192",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **PayFit** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "OWASP Houston Chapter API Security Study Group Session 4 - crAPI Challenges",
        "date": "2024-01-08",
        "time": "8:30-06:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/298262458",
        "timezone": "America/Chicago",
        "description": "Starting with this session, we will start working with the actual challenges listed on the crAPI page. We will also discuss the Postman collection and how that can be used to better understand how the challenges can be completed. In later sessions, we will look at how to create your own collection by proxying the traffic.\n\n[completely ridiculous API (crAPI)](https://owasp.org/crAPI/)\n\n[crAPI Architecture](https://github.com/OWASP/crAPI/blob/develop/docs/crAPI_architecture.md)\n\n[Challenges](https://github.com/OWASP/crAPI/blob/develop/docs/challenges.md)\n\n[Postman Collection](https://github.com/OWASP/crAPI/tree/develop/postman_collections)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-01-08",
        "time": "8:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/297721755",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Ljubljana",
        "repo": "www-chapter-ljubljana",
        "name": "Vulnerability Hunting With Static Analysis",
        "date": "2024-01-11",
        "time": "6:30+01:00",
        "link": "https://www.meetup.com/owasp-ljubljana-chapter/events/297258995",
        "timezone": "Europe/Belgrade",
        "description": "Static application security testing (SAST) tooling is commonly used in CI pipelines to catch security issues early. However, I see it used much less often to manually hunt for vulnerabilities. Let's say you found a vulnerable pattern in a million line code base and need to verify that there are no other cases, what do you do? In this talk I will try to convince you that if your answer is grep, then you are missing out. We will talk about SAST tooling, custom rules, custom tools and more."
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2024-01-11",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-london/events/298027909",
        "timezone": "Europe/London",
        "description": "**This event is kindly sponsored and hosted by JustEat. There is limited seating available for in-person attendees. Registration required. Please note that all our events are live-streamed on YouTube for the online audience. Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: JustEat, Fleet Place House, 2 Fleet Pl, London, EC4M 7RF (note: the entrance is directly opposite Starbucks front doors)\n**Nearest Tube Station:** St. Pauls (Central Line) - 6 mins walk\n**Doors Open at 6pm** for registration, food, drinks and networking. The talks start at **6:30pm** (we start on time).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Sherif Mansour and Andra Lezza\nWelcome and a brief update on OWASP Projects & upcoming OWASP Conferences from the OWASP London Chapter Leaders\n\n**\"A Data-Led Approach to Cybersecurity\"** \\- Disha Mukherjee\nCome along on a journey as we explore the transformative power of big data in the realm of cybersecurity. We'll dive into the data deluge, the might of data analytics in sniffing out threats, and the crucial role of real-time monitoring. Learn how a data-focused approach to security can revolutionize your defenses, from harnessing advanced analytics to envisioning the future of AI in cybersecurity. Get set to unlock the potential of big data in strengthening your systems and reducing risks. Together, let's boost security with data and chart a path towards enhanced protection against ever-evolving cyber threats.\n\n**\"How To Write Insecure Code and Other Stories\"** \\- Shruti Kulkarni\nWe live in a \"speed-to-market\" era. Including security controls in applications sometimes may be considered an overhead. However, if security controls are not added to applications during development, it may be challenging to add them later on. In this presentation, we will see how code can be written insecurely and really how simple it is to include the required security controls in the application.\n\n\"**DevSecOps Worst Practices**\" - Tanya Janca\nQuite often when we read best practices we are told ‘what’ to do, but not the ‘why’. When we are told to ensure there are no false positives in the pipeline, the reason seems obvious, but not every part of DevOps is that intuitive, and not all ‘best practices’ make sense on first blush. Let’s explore tried, tested, and failed methods, and then flip them on their head, so we know not only what to do to avoid them, but also why it is important to do so, with these DevSecOps WORST practices.\n\n**SPEAKERS**\n\n**Disha Mukherjee (**@[DishaMukherjee](https://github.com/DishaMukherjee/)**)**\nDisha is a Data Engineer on the Information Security Team at Just Eat Takeaway. Her job is all about designing, developing, and maintaining efficient data pipelines that help us make informed decisions about all things security-related.\n\n**Shruti Kulkarni ([@shruti-s-kulkarni](https://github.com/Shruti-s-kulkarni))**\nShruti is a cyber security / enterprise security architect with experience in ISO27001, PCI-DSS, policies, standards, security tools, threat modelling, risk assessments. Shruti works on security strategies and collaborates with cross-functional groups to implement information security controls in software development life-cycle, service operations, service delivery such that security controls support business requirements.\n\n**Tanya Janca ([@shehackspurple](https://twitter.com/shehackspurple))**\nTanya Janca, also known as SheHacksPurple, is the best-selling author of ‘Alice and Bob Learn Application Security’. She is also the founder of \"We Hack Purple\", an online learning community that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years, won countless awards, and has been everywhere from public service to tech giants, writing software, leading communities, founding companies and ‘securing all the things’. She is an award-winning public speaker, active blogger & podcaster and has delivered hundreds of talks on 6 continents. Tanya values diversity, inclusion, and kindness, which shines through in her countless initiatives. Advisor: Nord VPN, Aiya Corp Faculty: IANs ResearchFounder: We Hack Purple, OWASP DevSlop, #CyberMentoringMonday, WoSEC\n\n**TICKETS**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST book your place to be admitted to the event by the building security - your name will be checked against the guest list.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: https://owasp.org/www-policy/operational/code-of-conduct"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JAN 24, 2024",
        "date": "2024-01-24",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297383153",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Privacy by Design for Web Developers\nJoin us for great networking, dinner and drinks, and see a presentation by **Miguel (Mike) O. Villegas**, President and Founder of iSecurePrivacy, LLC.\n\n**ABSTRACT**: In today's digital landscape, the protection of user privacy has become a paramount concern. As web developers, it is our responsibility to ensure that the websites and applications we create not only deliver exceptional user experiences but also prioritize the privacy and security of user data. This lecture, \"Privacy by Design for Web Developers,\" explores the foundational principles and practical strategies that empower web developers to integrate privacy into every facet of their work.\nIn this lecture, we will delve into the concept of Privacy by Design (PbD) and its significance in the context of web development. We will examine how PbD serves as a proactive approach to safeguarding user data, fostering trust, and complying with evolving privacy regulations such as the GDPR and CCPA/CPRA.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Assembly and Disassembly, an OWASP guide to application security. ",
        "date": "2024-01-15",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/297939867",
        "timezone": "Europe/London",
        "description": "Hello & Welcome\n\nIn this session we'll be discussing application security.\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name when signing up to the event.\n\nPlease note this event will be recorded so we can put these talks on our YouTube channel afterwards. We will also be trying out our live streaming capabilities.\n\n**6:00 - Open doors & networking & drinks**\n\n**6:30 - Stuart Crawford - Appsec in the Enterprise - in-flight testing and Shifting Left**\nIn a world where web-based applications are ubiquitous, penetration testing is well-established as a way of verifying those applications are secure, but how do we stop finding ourselves falling into an endless cycle of 'deploy, test, fix'?\nThe answer is by paying closer attention to security in the development lifecycle, and I'll provide an example of how we're doing this at one of, if not the largest Independent Software Vendors in the UK\n\n**7:15 - Refreshments (Food & Drinks & Networking)**\n\n**8:00 - Tom Blue - Basic Assembly and Memory**\nThis talk would be an overview of how basic assembly and memory works, the structure of programs compiled in C and how to follow the logic of disassembled programs. I’ll show how to use tools such as ghidra to decompile code and to make the reverse engineering process more efficient and cover things such as buffer overflows, patching code and return oriented programming.\n\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAmazon - MAN11\nHanover Building, Hanover Street, Manchester, M4 4GW\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Stuart Crawford**\nStuart is Appsec program manager at one of the largest SaaS companies in the UK\n\n**Tom Blue**\nTom is a second year student at Lancaster University studying computer science. He’s passionate about cybersecurity, having worked in the industry for two years, as well as helping run LUHack and LUCompSoc, Lancaster University's hacking and computing societies. He works the university as a casual researcher and is currently looking at embedded systems security and I'm helping write the Cyber Physical Systems module for the cybersecurity masters degree. He also worked as an intern for Digital Interruption, a Manchester based cyber security consultancy.\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAmazon - Venue Sponsor\nPentest - Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\n\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation to create secure by design software.",
        "date": "2024-01-27",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "January 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-01-18",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/297919320",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Trend Micro Nederland\n\n**Address:** Herikerbergweg 92, 1101 CM Amsterdam\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Challenges in modern Red Teaming, external vs internal point of view** by **Marcin Wolak**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Red Teaming on MacOS** by **Ahmed Sherif & Ivan Kozlov**\n\n**Challenges in modern Red Teaming, external vs internal point of view**\n***Abstract***:\nThe presentation will try to demonstrate limitations of external red teaming and show how internal red teaming could possibly fill in identified gaps.\n\n***Bio***:\nMarcin is a well renowned ethical hacker / red teamer, blogger & researcher with over twenty years experience in IT and cybersecurity\n\n**Red Teaming on MacOS**\n***Abstract:***\nThe focus of the Red Teaming has predominantly been on Windows environments, reflecting its widespread use in corporate settings. However, the recent shift in corporate preferences towards MacOS necessitates a reevaluation and development of Red Teaming strategies specific to this. Our presentation delves into the challenges in MacOS during the red teaming excercises (i.e. initial foothold, persistence, lateral movement, etc.).\n\n***Bio:***\n*Ahmed Sherif*: A professional offensive security expert with 7 years of experience in pentesting / red teaming. Ahmed is working at ING global CISO.\n*Ivan Kozlov*: Red teamer at Global CISO of ING who hated macOS so hard that decided to dedicate his spare time in finding vulnerabilities and new red teaming tricks on Apple workstations. Reverse engineered and decrypted state actor malware using MS Paint."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Training Day - Hamilton (Jan 2024)",
        "date": "2024-01-27",
        "time": "8:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780340",
        "timezone": "Pacific/Auckland",
        "description": "We're pleased to announce that we'll be holding an OWASP Training Day event in Hamilton, on Saturday, 27th January.\n\nClasses will run 8:45 a.m. - 5:30 p.m. Tea breaks and lunch will be provided. Registration check-in opens at 8:00 a.m.\n\n**Registration Fee:** $99 per attendee (plus GST and booking fees)\n\n**Classes on offer:**\n\n* Threat Modelling: From None to Done (John DiLeo)\n* Like ISO/IEC27001, but Backwards (Stephen Coates)\n\n**To Register:** https://events.humanitix.com/owasp-training-day-hamilton-jan-2024"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2024-01-25",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296056640",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - AI+security",
        "date": "2024-01-30",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/298327716",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\n[OWASP](https://owasp.org/) is a worldwide, non-profit organisation focused on application security issues and we are Polish chapter of this initiative.\n\n[intro]\n\nAgenda:\n\n1. **Machine learning security (Karol Przystalski)**\nMachine learning (ML) and other terms related to it became buzzwords. Many companies would like to introduce machine learning models, even if there are simpler solutions. In the presentation, we show recent security issues related to machine learning models. Next, we do an overview of possible security issues that can happen during building such models. Finally, we demonstrate how to prevent the most popular security problems related to ML on the examples of applications in e-commerce, fintech, and other sectors.\n2. After the break we will have a discussion.... [TBD]\n3. There will be also a room for **short lightning talks** with discussion (typical format is 5-10 minute talk followed by 5-10 minute discussion). [Please submit your ideas](https://forms.gle/7JFiD3z2tKifogvs5) or just show up.\n4. Job announcements. If you are an employer, there will be a chance to present who you are looking for.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this** with friends and in social media.\n\nWe would like to thank Codete for enabling us to organise our meetups in their Techie's Space.\n[Codete](https://codete.com/) is a software company based in Poland that specializes in custom software development and IT consulting."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Hacking a SaaS: A Practical Guide to Understanding Attack and Defense",
        "date": "2024-01-18",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/297889289",
        "timezone": "America/Los_Angeles",
        "description": "*Hacking a SaaS: A Practical Guide to Understanding Attackers and Defending Against Them*\n\nIn this talk, we will delve into the mindset of an attacker and explore the vulnerabilities they exploit in SaaS systems. We will cover the following topics:\n\n* What motivates hackers to target SaaS systems (5%)\n* How hackers conduct reconnaissance on SaaS systems (50%)\n* The anatomy of exploit chains (40%)\n* Strategies for defending against attacks (5%)\n\nOur goal is to provide a practical guide to understanding attackers and defending against them. We will share lots of hacker tips and tricks, and provide plenty of quiz moments to train your intuition. Our focus will be on vulnerabilities that hackers actually care about, rather than theoretical ones. All of our examples will be based on real-world exploit chains, and we will explore multiple vulnerabilities chained together to create media-news-headline-worthy outcomes. By the end of this talk, you will have a better understanding of how attackers think and operate, and you will be better equipped to defend against their attacks.\n\nOur January host and sponsor is Solutional Inc, and the talk will take place in their Portland office at 301 SE 2nd Ave.\n\nPlease RSVP here if you are planning to attend.\n\nThis is a monthly event of OWASP's Portland chapter."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC / Wasatch AppSec -January Meetup-In person @ (Cottonwood Heights, UT)",
        "date": "2024-01-25",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/297931007",
        "timezone": "America/Denver",
        "description": "**Agenda**:\n\n1. Introductions / Lunch\n2. Presentation by TBA:\n3. Q&A\n\nCome join us for a lunch meetup at the Aumni building in Cottonwood Heights.\nCasual group and anyone interested in Application Security is welcome to attend. We'll discuss software security tips and practices others are implementing to support their organization's AppSec efforts.\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-01-10",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/297834961",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Top 10 for LLM:s",
        "date": "2024-01-17",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/297944649",
        "timezone": "Europe/Stockholm",
        "description": "Artificial Intelligence is reshaping nearly every sector and will influence our society in ways that we are only now starting to comprehend. Rapid evolvement of tools, methods, and novel approaches is prompting businesses to swiftly adopt fresh solutions to harness the potential of this emerging paradigm. However, as new technologies, methodologies, and work practices are introduced, hackers also adapt and innovate, always staying one step ahead.\nThis session led by cybersecurity specialist Krister Hedfors will explore the techniques that hackers use to leverage, manipulate, and exploit GenAI systems, such as ChatGPT and Code Llama. He will also give an introduction to OWASP top 10 list for Large Language Models (LLM).\n\nThe meeting will start with a mingle at 18:00, the main presentation beginning (with online attendees) at 18:30"
    }
]