[
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "Finding Your Niche",
        "date": "2024-01-16",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-bonita-springs-chapter/events/297926252",
        "timezone": "America/New_York",
        "description": "We're cohosting an event with SWFLSec and SpaceCoastSec!\n\nOne of the most difficult questions about getting started in a cybersecurity career is \"Where do I start?\". Our presenter recently made the transition from an HR / Talent Acquisition role to a cybersecurity role and will present their unique perspective on finding your niche in the cybersecurity realm."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS January 2024 - SPECIAL EVENT HANDS-ON LAB",
        "date": "2024-01-13",
        "time": "0:00-07:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/297982531",
        "timezone": "America/Denver",
        "description": "**HANDS-ON LAB**: James Smith will lead us in creating a hands-on web application security testing lab\n\n**Bring your own laptop**; hardware requirements:\n\\- Intel chipset \\(no ARM\\, no Mac silicon\\)\n\\- 60GB free diskspace\n\\- Administrator account access \\(to install virtualization software\\)\n\nCoffee / donuts / pizza provided\n\nLocation: National Cyber Center (NCC):\n\nhttps://cyber-center.org/"
    },
    {
        "group": "Hungary",
        "repo": "www-chapter-hungary",
        "name": "Personal SecOps: bevezető a személyes/eszköz kiberbiztonságba [HU, opinionated]",
        "date": "2023-12-19",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-hu/events/298000314",
        "timezone": "Europe/Budapest",
        "description": "A secure and safe setup of our private devices, including laptops is not obvious, and even hackers implement such security measures which come from biased wisdom. The short instruction would be: iPhone and Lockdown mode. We discuss more of it though. :)\n\n45p előadás, majd tapasztalatok és vélemények megosztása"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-01-08",
        "time": "8:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/297721755",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Evaluasi Malware 2023 dan trend Malware 2024",
        "date": "2023-12-21",
        "time": "9:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/297555833",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n• Tool dan standar keamanan aplikasi\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n• Kendali keamanan dan pustaka standar\n• Cabang lokal di seluruh dunia\n• Riset terkini\n• Konferensi lengkap di seluruh dunia\n• Mailing list\n• Dan banyak lagi … di www.owasp.org\nKali ini di OWASP ID akan membahas :\n1\\. Evaluasi Malware 2023 dan trend Malware 2024\nSpeaker : Alfon Tanujaya (Security Enthusiast / Pengamat Sekuriti Vaksincom)\n\nLinkedin : https://www.linkedin.com/in/alfonstanujaya\n\nTopic: OWASP Jakarta - Evaluasi Malware 2023 dan trend Malware 2024.\nTime: Dec 21, 2023 07:00 PM Jakarta\n\nBergabung Zoom Rapat\nhttps://zoom.us/j/95692246978?pwd=VzdvL1QzWE9IZzAweFNYZ2tobW5aQT09\n\nID Rapat: 956 9224 6978\nKode Sandi: 652201\n\nsupported by appsec.co.id"
    },
    {
        "group": "Ljubljana",
        "repo": "www-chapter-ljubljana",
        "name": "Vulnerability Hunting With Static Analysis",
        "date": "2024-01-11",
        "time": "6:30+01:00",
        "link": "https://www.meetup.com/owasp-ljubljana-chapter/events/297258995",
        "timezone": "Europe/Belgrade",
        "description": "Static application security testing (SAST) tooling is commonly used in CI pipelines to catch security issues early. However, I see it used much less often to manually hunt for vulnerabilities. Let's say you found a vulnerable pattern in a million line code base and need to verify that there are no other cases, what do you do? In this talk I will try to convince you that if your answer is grep, then you are missing out. We will talk about SAST tooling, custom rules, custom tools and more."
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Assembly and Disassembly, an OWASP guide to application security. ",
        "date": "2024-01-15",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/297939867",
        "timezone": "Europe/London",
        "description": "Hello & Welcome\n\nIn this session we'll be discussing application security.\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name when signing up to the event.\n\nPlease note this event will be recorded so we can put these talks on our YouTube channel afterwards. We will also be trying out our live streaming capabilities.\n\n**6:00 - Open doors & networking & drinks**\n\n**6:30 - Stuart Crawford - Appsec in the Enterprise - in-flight testing and Shifting Left**\nIn a world where web-based applications are ubiquitous, penetration testing is well-established as a way of verifying those applications are secure, but how do we stop finding ourselves falling into an endless cycle of 'deploy, test, fix'?\nThe answer is by paying closer attention to security in the development lifecycle, and I'll provide an example of how we're doing this at one of, if not the largest Independent Software Vendors in the UK\n\n**7:15 - Refreshments (Food & Drinks & Networking)**\n\n**8:00 - Tom Blue - Basic Assembly and Memory**\nThis talk would be an overview of how basic assembly and memory works, the structure of programs compiled in C and how to follow the logic of disassembled programs. I’ll show how to use tools such as ghidra to decompile code and to make the reverse engineering process more efficient and cover things such as buffer overflows, patching code and return oriented programming.\n\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAmazon - MAN11\nHanover Building, Hanover Street, Manchester, M4 4GW\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Stuart Crawford**\nStuart is Appsec program manager at one of the largest SaaS companies in the UK\n\n**Tom Blue**\nTom is a second year student at Lancaster University studying computer science. He’s passionate about cybersecurity, having worked in the industry for two years, as well as helping run LUHack and LUCompSoc, Lancaster University's hacking and computing societies. He works the university as a casual researcher and is currently looking at embedded systems security and I'm helping write the Cyber Physical Systems module for the cybersecurity masters degree. He also worked as an intern for Digital Interruption, a Manchester based cyber security consultancy.\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAmazon - Venue Sponsor\nPentest - Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\n\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation to create secure by design software.",
        "date": "2023-12-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle December 2023",
        "date": "2023-12-21",
        "time": "8:30Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/297903170",
        "timezone": "Europe/London",
        "description": "We're back with a virtual event to round out the year with a bang!\n\nRough schedule:\n\n1830 - 1835 OWASP Newcastle Welcome\n1835 - 1920 Talk one\n1930 - 2030 Talk two\n\nTalk overviews:\n\nTalk 1\n**Title:** TBC\n**Speaker:** John Dellinger\n**Speaker Bio:** John is a Chief Security Advisor working within the Microsoft Cyber Defence Operations Center. John has extensive multi-national experience in both the public and private sectors. Expertise across a variety of functions and disciplines including policy formulation and implementation, training, operations, strategic planning, risk management and cyber security.\nHe is a dual U.S. and Australian citizen with twenty years of military experience as an officer, first in the United States Marine Corps and later in the Royal Australian Navy.\n**Talk Synopsis:** TBC\n\nTalk 2\n**Title:** TBC\n**Speaker:** Ros Grindrod\n**Speaker Bio:** Ros is currently Head of Security Services at Opencast Software and has over 6 years of experience working within information security including experience delivering cyber transformation work across a variety of industries. Ros's previous experience includes ethical hacking, social engineering, incident response preparedness, OSINT/threat modelling and all things GRC.\n**Talk Synopsis:** TBC\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there.\n\nYou can also join our Google Group which is how we'll be sending out emails to events and is also going to be used as a forum for discussion.\n\nhttps://groups.google.com/a/owasp.org/forum/#!forum/newcastle-chapter"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-12-28",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/297836577",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-01-10",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/297834961",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Call for Speakers and Venues: Sydney OWASP Chapter Meetup in 2023!",
        "date": "2023-12-31",
        "time": "2:00+11:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/292598127",
        "timezone": "Australia/Sydney",
        "description": "The Sydney OWASP Chapter is dedicated to fostering a thriving community focused on application security and collaboration among industry professionals. With our goals of promoting equality, education, and community, we're excited to announce that we're actively looking for speakers and venue hosts for our upcoming events throughout the year.\n\n**Call for Speakers**\nDo you have a passion for cybersecurity and would like to share your expertise with our growing community? We invite you to submit a talk proposal for our upcoming meetups! This year's theme revolves around diverse applied topics in cybersecurity. We welcome presentations from experienced speakers, as well as those giving their first talk.\n\nTo submit your proposal, please email the following details to [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org):\n\n* Proposed topic\n* Abstract (100-200 words)\n* Brief speaker bio (100-200 words)\n\n**Call for Venues**\nWe're also searching for venue hosts who can accommodate 30-50 attendees and provide a screen for presentations. Hosting an OWASP meetup is a fantastic opportunity to demonstrate your commitment to security excellence while supporting the cybersecurity community. Please note that hosts are expected to cater pizza and beverages for attendees.\nIf you're interested in becoming a venue host, please reach out to us at [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org).\n\nBy contributing as a speaker or venue host, you're helping to advance our mission of fostering collaboration, education, and diversity within the cybersecurity field. We look forward to hearing from you and hope to see you at our next event.\n\nDeb, Blair, and Nick\nOWASP Sydney Chapter Committee"
    }
]