[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - May",
        "date": "2025-05-27",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/303407314",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with the Systematic Software Engineering. By signing up, you consent to us sharing your name and email with Systematic Software Engineering solely for the purpose of visitor pass registration.\n\n**Agenda:**\n**19:00 – 19:10** Welcome by Systematic Software Engineering and OWASP Aarhus\n\n**19:15 – 19:45** \"A04:2021 – Insecure Design ved Systematic\" af Michael Ustrup, Software Security Architect, Systematic Software Engineering\n\nOm præsentationen:\nMichael løfter sløret for sit hjertebarn og giver et indblik i, hvordan Systematic håndterer A04:2021 \"Insecure Design\".\n\n**19:45 – 20:30** Networking break including tapas and drinks\n\n**20:30 – 21:25** \"How (not) to Engage Developers in AppSec\" by Mads Schaarup Andersen, Lead IT Security Consultant, Cyber Strategy & Security Test, BankData\n\nabout the presentation:\nMany appsec programs struggle to make developers engage with security. This ranges from mitigating pentest and security scanning results to simply following the security policy. This often leads to the conclusion that developers don't care about security. However, developers exist in a context where managers, company policies, customer demands all influence how they prioritize tasks and given the right circumstances, most developers do indeed want to do secure software. In this talk, based on experience, research, and methods from human computer interaction, Mads will present the dos and don'ts of how to engage developers and successfully implement appsec.\n\nabout Mads:\nMads is currently working as a lead application security architect and has worked in security and privacy for more than 15 years. He has previously worked as a security and privacy consultant, worked in academic research, and has experience as a software engineer. His approach to application security and privacy is based on developer enablement and involvement through security champions programs - a mainly bottom-up approach where developers’ main tasks and concerns are taken seriously. Furthermore, Mads’s approach has a strong methodological foundation in human computer interaction with methods such as participatory design, design thinking, interviews, focus groups, workshops, etc."
    },
    {
        "group": "Aguascalientes",
        "repo": "www-chapter-aguascalientes",
        "name": "1er Seminario de Ciberseguridad (Redes Seguras y Confianza Digital).",
        "date": "2025-06-07",
        "time": "09:00-06:00",
        "link": "https://www.meetup.com/owasp-aguascalientes-meetup-group/events/306332862",
        "timezone": "America/Mexico_City",
        "description": "En un mundo cada vez más conectado, la ciberseguridad es fundamental para proteger la información personal, corporativa y gubernamental. Por ello **OWASP Aguascalientes** organizan este seminario con el objetivo de concientizar y formar a la comunidad en las mejores prácticas de seguridad digital.\n **¿Qué aprenderás?**\n\n* Cómo proteger tus redes y dispositivos en un entorno digital en constante evolución.\n* Estrategias para fortalecer la confianza digital y mitigar riesgos cibernéticos.\n* Experiencias y conocimientos de expertos en ciberseguridad.\n\n **Agenda del evento:**\n **Conferencia 1:** *Redes seguras: Cómo defender tu información en un entorno digital vulnerable*\n **Conferencia 2:** *La ciberseguridad como pilar de la confianza digital*\n **Coloquio interactivo:** Espacio de preguntas y respuestas con especialistas.\n **Networking:** Conéctate con profesionales y entusiastas de la ciberseguridad.\n **¿A quién va dirigido?**\nEste evento es ideal para estudiantes, profesionales de TI, emprendedores y cualquier persona interesada en mejorar su conocimiento sobre ciberseguridad y protección digital.\n **Regístrate y aparta tu lugar** para ser parte de esta experiencia única. ¡Nos vemos el 7 de junio! "
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Harnessing AI for Offensive Security",
        "date": "2025-06-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/306903233",
        "timezone": "America/New_York",
        "description": "Want to harness AI for offensive security and get real-world, scalable results? Join [Dreadnode](https://dreadnode.io/) Staff Security Researcher and OWASP Top 10 for LLM Applications founding member and tech leader, Ads Dawson, as he dives into adversarial AI and ML, Red Teaming LLMs and chatbots, and next-gen offensive security workflows.\n\nWhether you're an AI red team veteran or just starting out, this session will equip you with the tools, tactics, and knowledge to navigate an AI-native threat landscape."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Hacking AWS IAM: Live Walkthrough",
        "date": "2025-05-29",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/307356952",
        "timezone": "America/New_York",
        "description": "Identity and access management in the cloud remains the most fertile ground for high-value exploitations. So why is it still the least understood part of AWS? For starters, the way RBAC was implemented in the public cloud created a series of unintended consequences (role proliferation, etc) that confound security. Add to that how confusing the interconnecting IAM policy logic tree is. Then consider most are trying to understand ‘identity’ in the cloud as something akin to human credentials… when it’s far from that. Add it all together, and you have the beautiful mess we’re trying to manage today.\n\nJeff Moncrief’s been puzzling through the how and why of cloud IAM for the past few years. He found the best way to learn IAM is to just break it. Join Jeff as he deploys his ‘IAM walker’ script and shows the holes in a typical AWS environment, moves laterally from a typically ec2 exploit, abuses privilege escalation, steals data, and exfiltrates successfully without detection. Along the way, he’ll discuss:\n\n* Why we misunderstand the purpose of IAM in AWS\n* Rethinking IAM responsibilities of devs vs. security without breaking workloads\n* Different control points in AWS, like implementing service-level security and designating ‘sensitive permissions’"
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "12. OWASP Augsburg Stammtisch",
        "date": "2025-05-28",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/307772680",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Gastgeber: Nuvotex (https://nuvotex.de/)**\n\n**Agenda**\n**Vortrag:** **tbd** (vielleicht über die Content-Security-Polivcy ;-) )\n-> Du hast auch eine Idee und Lust einen Vortrag zu halten? Meld dich!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2025 (Online)",
        "date": "2025-05-27",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489299",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nWe are meeting at Emerson/NI! The chapter would like for folks to attend personally if possible! **Please do not pull an in-person ticket if you are only attending online, we order food for every in-person ticket the Friday before the meeting and we do not want to waste food by over ordering and wasting donated money.**\nIf you would like to register for in-person attendance, please see [Eventbrite](https://owasp-austin-2025-may.eventbrite.com)\n\nPlease be aware that we open the meeting 30 minutes prior to the beginning of presentations. So 30 minutes of meet-and-greet and free discussion, then onto OWASP and Chapter information, then ..\n\nPresentation: **Why Your Security Metrics Suck, And How to Fix This**\n\nBack in 2014, Rafal gave a talk about metrics, specifically on enterprise software security ( [https://www.youtube.com/watch?v=Kl7ZAR9U0xs](https://www.youtube.com/watch?v=Kl7ZAR9U0xs \"https://www.youtube.com/watch?v=Kl7ZAR9U0xs\") ) and it's been haunting him ever since. He regularly gets emails and DMs from people asking him to help them with their security program metrics and given that it's been 10 years since he last presented this, it's time to revisit.\n\nThis talk focuses on metrics for security organizations in general, and AppSec related metrics in specific. In other words, how do security organizations measure their impact, and whether they're doing a \"good job\" or not? What do you measure, how do you measure it, and why does anyone care? Let's dive deep into a boring topic that nobody wants to talk about, but you all know you need to master.\n\n**Speaker:**\nRafal Los"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 24 May 2025 Null/OWASP",
        "date": "2025-05-24",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/307820582",
        "timezone": "Asia/Kolkata",
        "description": "Join the OWASP® Foundation Bangalore & Null Bangalore Combined Meetup – May 24th, 2025\n\n Date: May 24th, 2025\n Location: Bangalore\n Venue: TBD\n⏰ Time: 09:30 AM – 02:00 PM\n Open to Everyone \\| Free Entry \\| No Registration Limits\nJoin us for an exciting meetup featuring top-notch security talks, hands-on discussions, and networking opportunities!\n Proposed Sessions\n TBD"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "May OWASP Bay Area Meetup",
        "date": "2025-05-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/307730758",
        "timezone": "America/Los_Angeles",
        "description": "We’re excited to announce that our **May OWASP Meetup** will be **hosted by Adobe**!\nJoin us for an evening of great conversations, community networking, and insightful security discussions — all in an awesome venue provided by Adobe. And yes, there will be **delicious food and drinks** generously provided by our hosts!\n\n5:30 PM : Doors open, Networking, food and drinks\n5.45 PM :- Chapter introductions\n6-6.45 PM :- Proactive Defense: Preventing Account Takeovers Before They Begin\n6.45-7.30 :- Implementing Secure guardrails\n\n**Talk #1 Proactive Defense: Preventing Account Takeovers Before They Begin**\nAccount Takeovers (ATOs) have become the silent enablers of modern breaches—where attackers don’t break in, they log in. Whether sourced from phishing campaigns, infostealer logs, or vast combolists circulating on the dark web, leaked credentials continue to fuel unauthorized access across both enterprise and customer-facing environments.\nThis session will explore practical strategies for preventing ATOs, with a focus on:\n\n* Proactively detecting and remediating leaked credentials across employees and customers.\n* Leveraging phishing visibility to detect early signs of compromise.\n* Introducing AI-driven analysis using the Model Context Protocol (MCP): an experimental approach within Cursor that enhances AI’s ability to search, contextualize, and support on-demand investigation of leaked credentials\n\nAttendees will learn how to integrate these methods to build a strong defense against account takeovers, strengthening security and resilience against cyber threats. By adopting proactive credential defense and tools like MCP, organizations can develop an adaptive response to account takeover threats.\n**Speakers: Barath Subramaniam**, Senior Product Security Engineer at Adobe, has over 16 years of experience. He manages security data exchange programs between security and product teams, focusing on security automation, AI, data engineering, identity monitoring for stolen credentials, brand abuse detection, and phishing.\n\n**Alessio Iacovone** is a Product Security Engineer at Adobe with three years of experience on the Data and AI Engineering team, specializing in applying AI to enhance security efforts.\n\n**Talk#2** Implementing Secure guardrails\nIn the fast-paced world of AI software development, balancing rapid innovation with robust security is a persistent challenge. Security guardrails offer a solution by providing protective boundaries that guide developers towards secure practices without hindering agility.\n\nThis talk delves into a pragmatic methodology for establishing and scaling security guardrails within your organization. Drawing from real-world experiences at leading tech companies, we'll explore:\n\n* Implementing security controls across infrastructure, applications, and dependencies.\n* Identifying areas to implement guardrails.\n* Establishing secure defaults in foundational services\n* Leveraging static code analysis to steer developers towards secure coding patterns.\n* Prioritizing common security issues to standardize best practices.\n* Building a library of quick wins and integrating them into development workflows.\n\nWe'll also discuss the iterative journey of building guardrails, from laying foundational safety nets to developing contextual and strategic controls that align with your organization's evolving security maturity.\n\n**Speaker:** Srajan Gupta, Dave, Senior Security Engineer. An avid threat modeling practitioner and advocate of secure design practices"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Cairo Chapter: AI Security & SBOM ",
        "date": "2025-06-14",
        "time": "14:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/307819323",
        "timezone": "Africa/Cairo",
        "description": "Join us for the third OWASP Cairo Chapter event of the year as we uncover two crucial areas in modern cybersecurity: **AI security guidelines** and the increasingly important concept of **Software Bill of Materials (SBOM)**. This is a must-attend for professionals, students, and anyone passionate about secure software development and emerging risks.\n\n### **Session Lineup:**\n\n###  Session 1\n\n**Speaker:** Hassan Mouarad\n**Title:** *SANS Critical AI Security Guidelines*\n**Description:**\nExplore the most critical recommendations from the SANS Institute on securing AI systems. Learn how to safeguard AI-driven platforms from real-world threats and maintain ethical, resilient deployments.\n\n###  Session 2\n\n**Speaker:** Mohamed AbuMuslim\n**Title:** *SBOM? What is That*\n**Description:**\nEver wondered what a Software Bill of Materials is and why it matters? This session breaks it down in simple terms, explaining how SBOMs help prevent supply chain attacks and how organizations can integrate them into their security workflows.\n\n **Date:** Saturday, May 31st, 2025\n **Time:** 2:00 PM – 5:00 PM\n **Location:** (Online)"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Cairo Chapter: AI Security & SBOM ",
        "date": "2025-05-31",
        "time": "14:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/307819336",
        "timezone": "Africa/Cairo",
        "description": "Join us for the second OWASP Cairo Chapter event of the year as we uncover two crucial areas in modern cybersecurity: **AI security guidelines** and the increasingly important concept of **Software Bill of Materials (SBOM)**.\n\n**Session Lineup:**\n**Session 1:**\n**Speaker:** Hassan Mouarad\n**Title:** *SANS Critical AI Security Guidelines*\n**Description:**\nExplore the most critical recommendations from the SANS Institute on securing AI systems. Learn how to safeguard AI-driven platforms from real-world threats and maintain ethical, resilient deployments.\n\n**Session 2:**\n**Speaker:** Mohamed AbuMuslim\n**Title:** *SBOM? What is That*\n**Description:**\nEver wondered what a Software Bill of Materials is and why it matters? This session breaks it down in simple terms, explaining how SBOMs help prevent supply chain attacks and how organizations can integrate them into their security workflows.\n\n **Date:** Saturday, May 31st, 2025\n **Time:** 2:00 PM – 5:00 PM\n **Location:** (Online)"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "AppSec Crisis Simulation: Executive Tabletop Exercise for Security Leaders",
        "date": "2025-05-26",
        "time": "13:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/307845235",
        "timezone": "Africa/Cairo",
        "description": "The **OWASP Cairo Chapter**, in collaboration with **Caisec Event**, invites you to \"Executive Tabletop Exercise for Security Leaders\" Workshop.\n\n **IMPORTANT:** No conference ticket needed. However, **Filling the registration form is mandatory. Your spot is *not confirmed* until the team reviews and approves your application.**\nRSVP alone will **not** guarantee entry.\n **Apply here**:\n[https://docs.google.com/forms/d/1WcKetJtk9T7jV5S39nAPbuFLwUoYuNL0mVTLsZ7lwPE/edit?pli=1](https://docs.google.com/forms/d/1WcKetJtk9T7jV5S39nAPbuFLwUoYuNL0mVTLsZ7lwPE/edit?pli=1)\n\n **Date & Time**: 26 May 2025 at 2:00 PM\n **Location**: Royal Maxim Palace Kempinski\n **Audience**: CISOs, Security Managers, Incident Response Leads, Senior IT Risk Professionals\n **Level**: Advanced (incident-response experience recommended)\n **Speakers**: Mohamed Al Fateh & Ayman Hussein\n\n###  What You’ll Experience\n\n **Realistic Threats**\nSimulated supply-chain attacks, API breaches, CI/CD sabotage\n **Executive-Level Stress**\nHandle legal, PR, and customer backlash on top of technical response\n **Cross-Functional Mayhem**\nWork alongside mock Legal, PR, and Risk teams\n **Battle-Tested Takeaways**\nSharpen your response playbooks and executive alignment under fire\n\n###  Format\n\n* 90-minute interactive simulation\n* Small group scenario with live injects\n* No slides. Just decisions, pressure, and outcomes\n\n **Again, RSVP alone won’t get you in. You must fill out the form and wait for confirmation from the team.**\n **Apply now**:\n[https://docs.google.com/forms/d/1WcKetJtk9T7jV5S39nAPbuFLwUoYuNL0mVTLsZ7lwPE/edit?pli=1](https://docs.google.com/forms/d/1WcKetJtk9T7jV5S39nAPbuFLwUoYuNL0mVTLsZ7lwPE/edit?pli=1)"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "The need for new methods to assure biomanufacturing processes",
        "date": "2025-06-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/306917658",
        "timezone": "America/New_York",
        "description": "In the true spirit of \"We changed the W from Web to Worldwide\" we have a talk that seems way out of the usual Application Security talk to discuss threats to bioinformatics and the manufacturing process. If you are thinking \"Wait, what does that have to do with application security, Bill?\" the answer is ... everything.\n\nThis talk outlines several challenges inherent to the biomanufacturing industry, such as the poorly understood and highly dynamic nature of biomanufacturing processes. Instruments critical to assessing quality and safety are described as among the least defensible apparatus humanity has ever built, leaving the sector exposed to adversarial threats. Despite recent progress in bioengineering, the explainability of these manufacturing processes is still built on fragile foundations.\n\nTo address these issues, Peter suggests moving away from flawed traditional methods of assessment and adopting physics-based probabilistic models, which offer better assurance and explainability. he emphasizes the importance of formal methods to ensure reliability and manage risks without completely rebuilding the system. Additionally, he advocates for accepting manageable risks and enhancing manufacturing trust through practical, science-based solutions."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "OWASP Edmonton Spring Social",
        "date": "2025-05-29",
        "time": "16:00-06:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/307868021",
        "timezone": "America/Edmonton",
        "description": "**Join Us for the OWASP Edmonton Spring Social 2025**\nThe OWASP Edmonton Chapter is excited to invite you to our Spring Social 2025, an evening dedicated to cybersecurity enthusiasts, professionals, and anyone interested in the field. This informal gathering offers a fantastic opportunity to network, share ideas, and discuss the latest trends in application security.\n\n**Event Details:**\n\n* **Date:** May 29\n* **Time:** 4:00pm\n* **Location:** Craft Beer Market, Edmonton, Alberta\n* **Admission:** Free (Please RSVP)\n\n**What to Expect:**\n\n* A relaxed atmosphere to connect with fellow cybersecurity professionals and enthusiasts\n* Engaging conversations about current challenges and innovations in application security\n* Delicious food and a wide selection of craft beers available for purchase\n* Information about upcoming OWASP Edmonton events and initiatives\n\n**Who Should Attend:**\nWhether you're a seasoned cybersecurity expert, a developer interested in secure coding practices, or someone new to the field, this event is open to all. OWASP events are inclusive and aim to foster a collaborative community focused on improving software security.\n**RSVP:**\nTo help us manage the venue arrangements, please RSVP.\nCome and be part of a community that is passionate about making technology more secure. We look forward to seeing you there!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gotheburg: Unofficial Security Fest Pre-Party",
        "date": "2025-06-03",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/307821609",
        "timezone": "Europe/Stockholm",
        "description": "Welcome to OWASP Gothenburg’s unofficial wamup session to Security Fest for an evening with food, drink and interesting keynotes with the Cybersecurity Community!\n\n**Where**: Assured Security Consultants,Norra Allégatan 7, 413 30 Göteborg\n\n**Agenda**:\n\n* **17:30 - 18:00 -** Doors open\n* **18:00 - 18:45** \\- The Single\\-Packet Shovel: Digging for Desync\\-Powered Request Tunnelling\\, Thomas Stacey\n\nHTTP Request Tunnelling is making a comeback thanks to HTTP/2 Desync Attacks, but it’s still living in the shadow of its louder sibling, HTTP Request Smuggling. In this talk, we’ll uncover tunnelling bugs hiding in plain sight across major platforms like IIS, Azure Front Door, and AWS ALB. You'll see a brand-new detection technique in action, blending the sleek “Single-Packet Attack” with classic desync tricks. Along the way, I’ll share the rollercoaster of diving into security research for the first time—and the surprising lessons that came with it. Whether you're a seasoned hacker or just curious, you’ll leave with practical ways to bend existing tools to your will, without the need for any significant coding experience.\n\nThomas is a penetration tester, security researcher and full-time Lego enthusiast with a passion for exploring and applying new (and far too complicated) attack technique.\n\n* **18:45 - 19:00 -** Short break\n* **19:00 - 20:00 -** Coming soon\n* **20:00+ -** Overtime + hangout @ Assured’s office\n\nAfter the talks are done, Assured’s office will remain open for all event participants to hang out. There will be beer and good company served!"
    },
    {
        "group": "Harrisburg",
        "repo": "www-chapter-harrisburg",
        "name": "OWASP Harrisburg - Hello, World!",
        "date": "2025-05-28",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-harrisburg/events/306908330",
        "timezone": "America/New_York",
        "description": "*print(\"Hello, World!\")*\n\nJoin us for our inaugural OWASP Harrisburg chapter meetup as we connect, outline our goals, and brainstorm upcoming topics and activities. Help shape the direction of this new community from day one and be part of building a stronger, more secure future!\n\n*Our events are free and open to everyone. You don't have to be an OWASP member or hold a cybersecurity or software development role to* *attend!*"
    },
    {
        "group": "Hong Kong",
        "repo": "www-chapter-hong-kong",
        "name": "Backdooring Windows PE and Linux ELF practice lab",
        "date": "2025-05-23",
        "time": "18:00+08:00",
        "link": "https://www.meetup.com/owasp-hong-kong-chapter/events/307689582",
        "timezone": "Asia/Shanghai",
        "description": "Hands-on keyboard session to practise executable file parsing and binary patching using a dumb hex editor and debugger.\n\nPrerequisites:\nBring your own laptop with x64 Intel/AMD Windows and Linux OS/VM or any comparable cloud compute instance."
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "AppSec IL 2025 - June 5 2025 - Placeholder",
        "date": "2025-06-05",
        "time": "09:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/306811626",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is excited to announce our AppSec IL 2025!\n\n**This is a placeholder event make sure to register**\n\n Registration is Open – Secure Your Spot!\nWhether you’re a security researcher, developer, or IT professional, OWASP Israel 2025 is the place to be. Don’t miss out on expert talks, hands-on workshops, and top-tier networking opportunities!\n\n **Register now**: https://appsecil2025.forms-wizard.biz\n\nJoin us for an incredible day of learning, networking, and live tech discussions. Follow us on LinkedIn for updates!\nLooking forward to seeing you there!\n\nOWASP Israel 2025 – Keynotes & Live Podcast Announced! Register Now!\n OWASP Israel 2025 is Almost Here – Don’t Miss Out! \nJoin us on June 5, 2025, for Israel’s largest application security conference! This year, we’re bringing together top cybersecurity experts, industry leaders, and innovators for a day packed with cutting-edge talks, hands-on workshops, and networking opportunities.\n Location: Expo Tel-Aviv\n Date: June 5, 2025\n Website: https://appsecil.org\n LinkedIn: OWASP Israel\n\n Keynote Speakers & Live Podcast!\nRan Bar-Zik – Keynote Speaker\nWe’re excited to announce Ran Bar-Zik, renowned security researcher and journalist, as our keynote speaker! His deep expertise in cybersecurity, software development, and online privacy ensures a thought-provoking and insightful talk.\nLive Podcast: Weekly Sync with Tor Tsuk & Navot Volk\nFor the first time at OWASP Israel, Weekly Sync, the popular tech podcast hosted by Tor Tsuk & Navot Volk, will be recording a live episode on stage! Expect deep dives into the latest in tech, security, and industry trends—this is one session you won’t want to miss.\n Check out their podcast: https://linktr.ee/weeklysync"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2025",
        "date": "2025-06-19",
        "time": "14:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/307102067",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy will host the next OWASP Italy Day 2025 on June 19th. It will be a full-day event dedicated to application security (AppSec)!\n\n#### **OWASP Italy Day 2025 will take place at Cagliari.** This is a free, one-day, informal event aimed at increasing awareness and knowledge of web application security. **Reserve your seat here:**\n\nhttps://cyberjourney.it/\n\nThe event is primarily intended to appeal to security professionals, software developers, software quality engineers, and computer science students with a strong interest in computer security.\n\n### **PROGRAM**\n\nThe event will take place next 19th June from 4 PM to 22 PM (Italian time). We are working on the program at the moment.\n\n#### **Seba and Martin will be our Keynotes speakers!**\n\n#### \\- Sebastien Deleersnyder\n\nCo\\-founder & CTO at Toreon \\| COO & trainer at DPI \\| whiteboard hacking trainer at Black Hat\n\n#### \\- Martin Knobloch\\, VP Security Engineering at Valtech\\.com\n\nMartin has locally and globally been contributing to various projects and co-organized OWASP AppSec conferences. He served more than 5 years as a member of the Board of Directors, two of them as Chairmen of the board.\n\n### Call For Papers:\n\nPlease submit your idea here:\n[https://sessionize.com/owasp-italy-day-2025-cfs](https://sessionize.com/owasp-italy-day-2025-cfs)\n\n### Call For Sponsorships:\n\n[https://github.com/OWASP/www-chapter-italy/blob/59f792a77ba0a8e8131aa5e4e6a98cb75d595d38/assets/images/2025%20OWASP%20Italy%20Day%20Sponsorship.pdf](https://github.com/OWASP/www-chapter-italy/blob/59f792a77ba0a8e8131aa5e4e6a98cb75d595d38/assets/images/2025%20OWASP%20Italy%20Day%20Sponsorship.pdf)\n\nReserve your seat:\n**[https://cyberjourney.it](https://cyberjourney.it/#)**\n\n#### Why Sponsor OWASP Italy Day 2025?\n\nBrand Visibility: As a sponsor, your brand will be prominently displayed before, during, and after the event. This includes logo placement in event materials, promotional content, and key areas at the venue. Enhance your brand recognition within the cybersecurity and developer communities.\nCommunity Engagement: Engaging with the OWASP community puts your company in the spotlight as a leader in supporting open software and security advancements. This event will provide you with the opportunity to network with industry leaders and cybersecurity professionals, offering a chance to build relationships and share your company’s expertise and solutions.\nLead Generation: With hundreds of attendees from various sectors, sponsoring OWASP Italy Day 2025 gives you direct access to potential clients and customers. The event will provide a focused audience interested in cybersecurity solutions, products, and training.\n\nEvent official site:\nhttps://owasp.org/www-chapter-italy/events/OWASPItalyDay2025-06-19"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "Evolving Your AppSec Program in the Era of AI",
        "date": "2025-06-16",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/307345184",
        "timezone": "America/New_York",
        "description": "**Presentation Summary**\nAI is already transforming how software is built—but for security teams, it’s mostly just making life harder. Developers are shipping AI-generated code at breakneck speed, while security teams struggle to keep up. The challenge isn’t just securing AI-generated code and systems—it’s evolving your AppSec program to keep pace with software development.\n\nWe'll explore how security teams can evolve their programs across two key dimensions: securing AI-driven software development and using AI to enhance security workflows. You’ll learn:\n\n* Strategies for managing risks from AI-generated code and autonomous agents\n* How security teams can use AI to reduce work and improve security outcomes\n* Where AI can enhance security—and where human expertise remains irreplaceable.\n\nAI isn’t just a security challenge; it’s a chance to build a smarter, more efficient security program. Join us to learn how to make AI work for security, not against it."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - May 28, 2025",
        "date": "2025-05-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306589704",
        "timezone": "America/Los_Angeles",
        "description": "**/\\*\\* NOTE NEW LOCATION \\*\\*/**\n**TOPIC:** Adversarial Intelligence: Redefining Application\nJoin us for great networking, dinner and drinks, and see a presentation by **Chris Arciaga,** Account Executive, **Kodem Security**\n\n**ABSTRACT:**\nThis presentation explores Adversarial Intelligence - an approach that views application security from an attacker’s perspective. Drawing from vulnerability research experience at the NSO Group and building Pegasus, the speaker will highlight how overlooked low and medium vulnerabilities can be combined to execute successful attacks. By examining attack chains and application runtime behavior, attendees will see how gaps often missed by traditional methods are exposed. Attendees will learn about effective tools and techniques for detecting and mitigating these threats, especially in cloud-native and distributed systems. Designed for security practitioners and academics, this session provides a deeper understanding of defending against sophisticated attackers by adopting their mindset.\n\n**Thanks to our SPONSOR**: *[Kodem Security](https://www.kodemsecurity.com/)*\n*The AppSec chase is over.*\n*Swap endless alerts with focused action. Simplify the remediation of your most exploitable issues through runtime security.*\n\n**Thanks to our HOST**: *[Accenture](https://www.accenture.com/us-en)*\n*Every day, we embrace change and create value for all our stakeholders around the world.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "LayerOne Security Conference - Pasadena, CA",
        "date": "2025-05-24",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306677485",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** will be hosting a table at the **LayerOne 2025** Security Conference coming up in a little over two weeks, Memorial Day weekend, May 24-25, 2025 at the Pasadena Hilton Hotel!\n\nBe sure to stop by and say hi! See you there.\n\nHead over to the [registration page](https://www.universe.com/events/layerone-2025-information-security-conference-tickets-DXK36S?unii-trigger-open=DXK36S&unii-discount-code=L12025OWASPLA10) and secure your tickets now! Use promo code **L12025OWASPLA10** for 10% off registration courtesy of OWASP Los Angeles.\n\nPre-registration gets you full access to the event, all presentations, contests, villages, and the Saturday Night party.\n\nInterested in **sponsoring** this year’s event, hosting a vendor booth in the main hall, or contributing an awesome contest or event to this year’s conference? Reach out to L1 team at contact@layerone.org and tell them what you’re interested in!\n\nJoin the **Discord** and come hang out with us! Make some new friends and catch up at [https://discord.gg/layeroneconference](https://discord.gg/layeroneconference)."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Leveraging AI Telemetry to reduce MTTR",
        "date": "2025-06-18",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/306404716",
        "timezone": "America/Chicago",
        "description": "Attendees will learn how to ingest telemetry from a variety of sources and protocols then leverage that telemetry against a custom ML and GAI framework to find anomalies that will help resolve attacks and reduce MTTR."
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "The supply chain is dark and full of terrors.",
        "date": "2025-05-29",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/307863427",
        "timezone": "America/New_York",
        "description": "In 2024, we witnessed a surge in attacks targeting the very foundations of our digital infrastructure – the components and methods we use to build the software we rely on. From compromised open-source dependencies to malicious code injected into critical tools, the modern cloud-based software supply chain presents a vast and vulnerable attack surface.\n\nThis session will explore the intricate landscape of today's cloud-native development pipeline, exposing the evolving threat model that security professionals must understand. More importantly, you'll gain actionable insights into a standards-based approach to proactively identify, mitigate, and manage the growing risks within your software supply chain. Leave with practical strategies to improve the security posture of your supply chain and secure your organization's future in the cloud."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Bowling! ",
        "date": "2025-05-29",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916111",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Bowling @ Peterborough Bowl!\n\n**When?**\n\n* \\- Thursday 29th May\n\nEverybody welcome! For this event, please respond on Whatsapp and update your MeetUp attendance as pre-payment may be required.\n\nThank you,\nRyan & Mark"
    },
    {
        "group": "Pittsburgh",
        "repo": "www-chapter-pittsburgh",
        "name": "OWASP Pittsburgh Q2 Meetup:\n\nThe Dark side of AI - Speaker Chris Lindsey",
        "date": "2025-05-29",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-pittsburgh-chapter/events/307703419",
        "timezone": "America/New_York",
        "description": "**The Dark side of AI: Developing unsecure applications in minutes!**\n\nAI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deepunderstanding of how to:\nRecognize and assess the risks AI introduces in your code.\nImplement secure coding practices and enforce security policies.\nIntegrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security.\n\nChris Lindsey: https://www.linkedin.com/in/chris-lindsey-39b3915/"
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Secure by design ",
        "date": "2025-06-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/307980299",
        "timezone": "Europe/Warsaw",
        "description": "**New venue for our meetups!**\nBrowar Nowa Wytwórnia, Fabryczna 13 (-1 floor)\n\nJoin us for a deep dive into real security failures with Mateusz Lach. Expect a real vulnerabilities found and reported in real network devices, followed by an open discussion on white hat challenges\nwith reporting vulnerabilities and best practices of security by design approach.\n\n**Agenda:**\n**1\\. Hack your router – a deep dive into real vulnerabilites \\- Mateusz Lach\\.**\nWe live in a world where network devices are everywhere — routers, smart cameras, IoT sensors — often bought off-the-shelf and plugged into our homes and businesses without a second thought. We trust that these devices are secure by design, that the manufacturers have our safety in mind, and that someone, somewhere, made sure they won’t become a weak link. But should we really trust them so blindly? In this presentation, I’ll challenge that assumption and show you why relying solely on default security is a risky bet. Through real examples and insights, I’ll demonstrate how this trust can be misplaced—and what that means for our digital safety.\n\n2\\. After the break\\, we will be hosting **a discussion about security by design approach**. What does it mean that something is \"secure by design\". How actually we can design security? And who should do this? How can I build a software in a a more secure way „by design” so it is harder to exploit vulnerabilities? Are there any use cases when security by design is not effective?\n\n**Please RSVP and save the date!**\n\nIf you have a minute, **please share this invitation** with friends and in your social media."
    },
    {
        "group": "Ruhrpott",
        "repo": "www-chapter-ruhrpott",
        "name": "Kick-Off des OWASP Ruhrpott Chapter",
        "date": "2025-05-28",
        "time": "18:30+02:00",
        "link": "https://www.meetup.com/owasp-ruhrpott-chapter/events/307976873",
        "timezone": "Europe/Berlin",
        "description": "Wir laden ein zum ersten Treffen des re-aktivierten OWASP Ruhrpott Chapters.\n\nDas Treffen findet am 28.05.2025, ab 18:30 Uhr an der Ruhr-Universität Bochum Universitätsstr. 150, Gebäude ID, Raum 03/471 statt.\n\n**Was euch erwartet**\n\n* Vorstellung des Ruhrpott Chapters\n* Was ist OWASP?\n* Was wir vorhaben\n\n**Für wen ist das Treffen geeignet?**\nDas OWASP Chapter-Treffen richtet sich an alle, die sich mit dem Thema IT-Sicherheit beschäftigen – unabhängig von Branche oder Erfahrungsstand. Ob im Bereich Offensive Security, Defensive Security, Incident Response, Softwareentwicklung oder Security-Architektur: Wer sich für sichere Systeme, aktuelle Bedrohungen und Schwachstellen interessiert, ist hier genau richtig. Das Treffen bietet eine gute Gelegenheit zum Wissensaustausch, Networking und zur Diskussion aktueller Sicherheitsthemen.\n\n**Weitere Informationen**\nIhr findet weitere Informationen über uns unter https://owasp.org/www-chapter-ruhrpott/"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec/OWASP-SLC - May Meetup (in person @ Murray Park - Pavilion #1)",
        "date": "2025-05-29",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/307857169",
        "timezone": "America/Denver",
        "description": "**Agenda:**\n\n1. Lunch\n2. Discussion: Using LLMs in AppSec\n\nPlease RSVP if you're coming! We'd like to make sure you get some lunch and meet in person :)\n\nSee you all then!\nMurray Park Pavilion #1\n420 E Parkside Drive, Murray, UT 84107\n[https://maps.app.goo.gl/jekhbiovsxghZeio9](https://maps.app.goo.gl/jekhbiovsxghZeio9)"
    },
    {
        "group": "Sao Paulo",
        "repo": "www-chapter-sao-paulo",
        "name": "Meetup Presencial OWASP São Paulo – XP Inc Edition",
        "date": "2025-06-10",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-sao-paulo-chapter/events/307981071",
        "timezone": "America/Sao_Paulo",
        "description": "Temas:\n\nFalhas Lázaro: Por que Certas Vulnerabilidades Sempre Voltam e A OWASP na Prática: Desvendando o Poder da Comunidade para a Segurança de Aplicações\nA OWASP na Prática: Desvendando o Poder da Comunidade para a Segurança de Aplicações\n\nPalestrante:\nCaroline Assunção - Falhas Lázaro: Por que Certas Vulnerabilidades Sempre Voltam\nDiego Martins – OWASP Global Board Member\n\nDescrição do Evento:\n\nPrepare-se para um meetup imperdível da OWASP na XP! No dia 10 de junho, teremos a honra de receber Caroline Assunção e Diego Martins, que compartilharão seus conhecimentos sobre as vulnerabilidades de segurança mais recentes e a importância da fundação OWASP para a comunidade de cibersegurança. Venha aprender, trocar ideias e fortalecer a segurança do seu ambiente digital!\n\nVamos explorar:\nFalhas Lázaro: Por que Certas Vulnerabilidades Sempre Voltam?\nAprofunde-se com Caroline Assunção no intrigante fenômeno das \"Falhas Lázaro\". Você já se perguntou por que algumas vulnerabilidades, mesmo após serem corrigidas, parecem \"ressuscitar\" e reaparecer nos sistemas? Caroline trará luz a essa questão, explorando as causas por trás da persistência de certas falhas e discutindo estratégias eficazes para quebrar esse ciclo vicioso. Prepare-se para insights valiosos sobre como lidar com essas \"vulnerabilidades teimosas\" e garantir uma segurança mais robusta e duradoura.\n\nA OWASP na Prática: Desvendando o Poder da Comunidade para a Segurança de Aplicações\nJunte-se a Diego Martins para explorar o universo da Open Worldwide Application Security Project (OWASP). Diego irá desmistificar a fundação, apresentando seus principais projetos, ferramentas e recursos que são cruciais para desenvolvedores, arquitetos e profissionais de segurança. Descubra como a OWASP empodera a comunidade global a construir e manter aplicações mais seguras, e como você pode se engajar para fortalecer a segurança do seu dia a dia. Uma visão prática e inspiradora sobre como a colaboração pode transformar a segurança de software.\nInscreva-se agora e garanta sua vaga."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-06-11",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306142420",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sofia",
        "repo": "www-chapter-sofia",
        "name": "OWASP Sofia - May 2025 Meetup",
        "date": "2025-05-28",
        "time": "19:00+03:00",
        "link": "https://www.meetup.com/owasp-sofia-chapter/events/307509140",
        "timezone": "Europe/Sofia",
        "description": "Добре дошли в месечната ни сбирка на OWASP Sofia!\n\nС пролетно настроение влизаме в майското събитие на OWASP Sofia Chapter. Отново сме подготвили страхотни теми, свързани с threat modeling, CVSS и .NET Reflection.\n\nЛюбезен домакини на събитието ще бъде [Progress](https://www.progress.com/) ‍.\n\n**Програма за 28 май 2025:**\n\n* 19:00 ч. - Начало и въведение - [Тодор Тодоров](https://todorov.bg) @ [Payhawk](payhawk.com)\n* 19:15 ч. - Иван Иванов @ [Progress](https://www.progress.com/) - **\"How to fail with .NET reflection 101\"**\n* 20:00 ч. - [Йордан Попов (Dan Ny)](https://www.linkedin.com/in/dan-ny/) @ [Scalefocus](https://www.scalefocus.com/) - **\"Effective Threat Modelling\"**\n* 20:45 ч. - [Мартин Георгиев](https://www.linkedin.com/in/martin-georgiev/) @ [VMWare Carbon Black](https://www.broadcom.com/products/carbon-black) - **\"Scoring Vulnerabilities using CVSS\"**\n* 21:30 ч. - Q&A / Networking\n* 22:00 ч. - Закриване\n\nСъбитието ще се проведе на живо в офиса на [Progress](https://maps.app.goo.gl/unHVZspnrL83gLq79). Ако желаете да споделите нещо интересно, свързано с уеб сигурността, моля, изпратете ни вашата сесия на [https://sessionize.com/owasp-sofia/](https://sessionize.com/owasp-sofia/)\n\nОчакваме ви!"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "6th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-06-03",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584778",
        "timezone": "Europe/Berlin",
        "description": "**Modern Authentication Demystified - A deep dive into Spring Security's latest innovations**\n\nIn this session, we explore the latest advancements in Spring Security that are reshaping how we secure modern applications. With a focus on practical applications, we’ll discuss the revolutionary Passkey Authentication, a password-less and phishing-resistant mechanism based on WebAuthn and FIDO2 standards. Next, we’ll examine One-Time Tokens, a robust way to secure sensitive actions and enhance user experience for scenarios like password resets and transaction approvals. Finally, we’ll delve into the emerging concept of Token Exchange, which facilitates seamless cross-service authentication by securely exchanging OAuth tokens. Attendees will gain a clear understanding of how these new features work, their real-world use cases, and best practices for integrating them into their Spring Security applications.\n\n**Agenda:**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Chapter Meeting: CRA and learnings switching from red to blue team",
        "date": "2025-06-17",
        "time": "16:50+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/306275110",
        "timezone": "Europe/Zurich",
        "description": "You are invited to join us for the next OWASP Switzerland Community Event.\nThis time we are guests of Digitec Galaxus, so we meet in their offices at Förrlibuckstrasse 70, 8005 Zürich (Room Pause).\n\nWe have a selection of two talks ready for you:\n\n* We will learn about the impact of the EU Cyber Resilience Act (CRA) and RED Delegated Act (RED DA) on software development from Derek.\n* and get inspired by Tom's learnings when he switched from red team to blue team.\n\n**Agenda**:\n\n* 16:50 Doors opening\n* 17:10 Derek: Coding for Compliance Without Losing Your Mind: Real-world CRA and RED DA Lessons\n* 18:10 Break\n* 18:30 Tom: All Findings, No Context: Tales from Both Sides of the Firewall\n* 19:30 Small Apéro\n\n**Talk Details:**\nSpeaker: Thomas Houiellebecq\nTalk Title: All Findings, No Context: Tales from Both Sides of the Firewall\nAbstract:\nWhat happens when the person who used to write the security reports becomes the one responsible for making them actionable? In this talk, I’ll take you on a journey from life as an external cybersecurity consultant—armed with test cases, idealistic frameworks, risk rated issues and a 1337-page PDF—to leading an internal security team responsible for actually making it all work in the real world.\nWe’ll explore the shift from writing findings to feeling their friction: why business context is everything, how not all recommendations age well in live environments, and the surprises (good and bad) that come with being embedded in the heartbeat of an organization. Expect real stories, tactical insights, and maybe a few laughs about the irony of once saying “just implement zero trust” without knowing what the backend chaos actually looked like.\n\nSpeaker: Derek Yu\nTitle: Coding for Compliance Without Losing Your Mind: Real-world CRA and RED DA Lessons\nAbstract:\nWith the EU Cyber Resilience Act (CRA) and RED Delegated Act (RED DA), best practices in security development have become legal obligations. In this talk, I'll share hands-on experiences helping teams implement security by design, security updates, SBOMs, vulnerability handling, supplier management, and more in real-world products. We’ll cover common developer pitfalls and how to align DevSecOps activities with standards like EN 18031 and future norms. Expect practical takeaways, tooling tips, and insights from the field. If you're building connected products, this will help your team save time and stay ahead of the curve."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Dual Event: Mobile App Testing 101 | OWASP Agentic AI Threats & Mitigations",
        "date": "2025-06-11",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/307827138",
        "timezone": "America/Toronto",
        "description": "**Update:**\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\nIn anticipation of the high level of interest, and to ensure we safely stay within the venue's capacity limit, we will be capping the in-person attendance to **75 people**, in a **first-come, first-serve basis**.\nDoors will open at **6:00 PM**, with the event will start at **6:30 PM** (EDT).\nFor those who cannot attend in person, please join us virtually via the livestream!\n\n**Description**:\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n**Presentation #1: Mobile App Testing 101**\n\nSummary:\n\nThis session equips security professionals—pen testers, researchers, red/blue teams, and mobile devs—with practical techniques to expose and exploit mobile app vulnerabilities using Corellium. Learn how to rapidly configure virtual test environments, uncover insecure data storage, intercept network traffic, and bypass runtime protections.\n\nKey Learnings:\n\n* Intro to Android & iOS app structure\n* Create and configure diverse iOS & Android test environments\n* Understand application data structure to identify insecure data storage\n* Manipulate runtime behaviour on demand\n* Exploit insecure data at rest using Objection\n* Intercept and analyze data in transit\n* Reverse engineer apps and bypass jailbreak detection\n* Automate a significant portion of dynamic testing recommeded by OWASP (MSTG)\n* Integrate testing early in development via SDK\n\n**Presentation #2: OWASP Agentic AI Threats & Mitigations**\n\nSummary:\n\nAgentic AI systems combine generative capabilities with autonomous decision-making—introducing new and complex security risks. This session will walk through key threats and mitigation strategies for agentic AI, drawing from the OWASP AI Threats and Mitigations guide. Attendees will learn how issues like goal drift, memory poisoning, and identity misuse can emerge, and how to build proactive defenses."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-06-19",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510655",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | AI-Driven Testing & Human-Centric Security",
        "date": "2025-06-19",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/307842872",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter invites you to an in-person application-security meetup on June 19, 2025, from 5:30 PM to 8:00 PM at the University of Victoria. Spend the evening exploring the newest trends and proven practices shaping today’s cybersecurity landscape.\n\nWe’re thrilled to feature two live talks: Roberto Salgado will share “Pentesting with AI,” revealing how generative tools are reshaping offensive security, and Kyle Loree will present “The Human Impact of Cybersecurity,” examining the real-world consequences of our technical decisions. Whether you’re a veteran security professional or just beginning your journey, you will leave equipped with tangible insights to elevate your security efforts.\n\nBeyond the presentations, the agenda leaves plenty of room for conversation and collaboration. Meet peers, trade ideas with industry leaders, and compare notes on the tools and techniques that keep organizations safe in an ever-evolving threat environment.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in cybersecurity. If you would like to attend, please click the RSVP button to reserve your spot, as we have limited seats available."
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "A New Paradigm of Trust",
        "date": "2025-06-18",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/307917005",
        "timezone": "America/New_York",
        "description": "**Abstract**\n\nSecurity teams, including AppSec, have very much been focused on “inside out” imperatives, e.g. we are doing x because our security or compliance team says so.\n\nTraditionally, finding and fixing vulnerabilities, evangelizing secure coding practices, pleading with engineering teams to implement the “right” cloud configurations, etc., have been disconnected from the customer and the business. In some cases, AppSec is even positioned as a tax on the business as a necessary cost center; businesses only know it's important because lawsuits, burgeoning regulation, and breach headlines have\ntold them it is. This presents a challenge to get buy-in from stakeholders, which makes our jobs very difficult, sometimes impossible.\n\nHowever, what we do has real, human consequences. We have the opportunity to reframe security practices by focusing on this “outside in” perspective: the perspective of TRUST.\n\n**High-level outline**\nResearch on customer/consumer trust – what is “trust”?\n\n*  Boiled down to four factors: capability, reliability, transparency, and humanity\n*  High levels of trust increase revenue\n*  There is a correlation between security, privacy, resilience, risk, compliance, and customer trust\n\nSecurity is not separate work, security is a foundational feature\n\n*  Customers/consumers expect vendors to protect their data\n*  Security is not a cost center – it’s a revenue enabler (customer trust = customer loyalty = increased revenue)\n\nSecurity practices need to be marketed\n\n*  Human psychology: we want to believe we are special and have a purpose\n*  Communicating the full impact of doing or not doing security practices well\n*  “Customer trust” as a burgeoning discipline within CISO organizations"
    },
    {
        "group": "Yaounde",
        "repo": "www-chapter-yaounde",
        "name": "OWASP Yaounde June 2025 Chapter Meeting",
        "date": "2025-06-07",
        "time": "14:00+01:00",
        "link": "https://www.meetup.com/owasp-yaounde-chapter/events/307910485",
        "timezone": "Africa/Douala",
        "description": "[English]\nJune 2025 OWASP Yaounde chapter meeting.\n\nSchedule:\n\n* Introduction and Chapter Updates by Valery Melou\n* Workshop: \"Understanding the OWASP Top 10 (2021) - Part 1 of 5\" by Ernest Mougoue\n* Networking\n\nSpeakers:\nErnest Mougoue\nErnest is a Chapter Lead for OWASP Yaounde. He has 12+ years of experience in the software security field, having worked as a consultant or cybersecurity team leader for some of the largest companies in the United States. More recently, he is the co-CEO of MBOA DIGITAL, building the Cybersecurity practice.\n\nValéry Melou\nValéry is a Chapter Lead for OWASP Yaounde. Coming from a self-taught background, he is an exceptional and atypical full-stack web developer. He honed his skills developing for various clients as a freelancer on online platforms before joining MBOA DIGITAL over 5 years ago. Today he is the CTO of MBOA DIGITAL focusing on AI research with some interest in Cybersecurity.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n[French]\nPremière réunion du chapitre OWASP Yaoundé.\n\nProgramme :\n\n* Introduction et mises à jour du chapitre par Valéry Melou\n* Atelier : \"Comprendre l'OWASP Top 10 (2021) - Partie 1 sur 5\" par Ernest Mougoue\n* Réseautage\n\nIntervenants:\nErnest Mougoue\nErnest est un chapter lead pour OWASP Yaoundé. Il a plus de 12 ans d'expérience dans le domaine de la sécurité informatique, ayant travaillé comme consultant ou chef d'équipe de cybersécurité pour certaines des plus grandes entreprises aux États-Unis. Plus récemment, il est le co-CEO de MBOA DIGITAL, où il développe le pôle cybersécurité.\n\nValéry Melou\nValéry est un chapter lead pour OWASP Yaoundé. Issu d'un parcours autodidacte, il est un développeur web full-stack exceptionnel et atypique. Il a perfectionné ses compétences en développant pour divers clients en tant que freelance sur des plateformes en ligne avant de rejoindre MBOA DIGITAL il y a plus de 5 ans. Aujourd'hui, il est le directeur technique de MBOA DIGITAL, se concentrant sur la recherche en intelligence artificielle avec un intérêt pour la cybersécurité."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call (Europe-Asia)",
        "date": "2025-06-13",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/305752967",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "June community call - OWASP SAMM",
        "date": "2025-06-11",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/306053408",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    }
]