[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Reducing AppSec Risk with ASPM (Application Security Posture Managament) ",
        "date": "2025-01-23",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304566000",
        "timezone": "America/New_York",
        "description": "In an era of increasingly sophisticated threat actors, application security has become a critical concern for most organizations. This talk, \"Reducing Application Security Risk with ASPM (Application Security Posture Management),\" will explore the emerging role of ASPM in fortifying application security and accelerating DevSecOps and cloud native adoption.\n\nAttendees will gain insights into the current state of application security and DevSecOps adoption trends: challenges and opportunities across people, process, and technology. This also includes the impact of AI.\n\nThe talk will have a focus on ASPM and how it will help overcome some of the challenges and capitalize on the opportunities. We will delve into key ASPM features and how each of these use cases could be leveraged to solve common application security & DevSecOps adoption challenges and further mature your program. Through practical examples and case studies, the session will highlight best practices for implementing ASPM in large scale application development ecosystems to reduce application security risks. Whether you're a developer, security professional, manager or executive, this talk will equip you with actionable strategies to improve your application security posture and accelerate DevSecOps adoption."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "The Menace of Mobile Malware",
        "date": "2025-01-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/305244493",
        "timezone": "America/New_York",
        "description": "As mobile devices become indispensable, they have also become prime targets for malicious actors. \"The Menace of Mobile Malware\" is a live-action presentation designed to expose attendees to the real-world dangers of mobile malware. From trojan horses to full-scale ransomware attacks targeting mobile platforms, this session will explore how these threats operate, their tactics, and how to detect and mitigate them."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "January 2025 OWASP Happy Hour sponsored by Cequence",
        "date": "2025-01-09",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/304571321",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, January 9th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Dhaka",
        "repo": "www-chapter-dhaka",
        "name": "Securing Web Applications with OWASP Dhaka Chapter",
        "date": "2024-12-27",
        "time": "19:00+06:00",
        "link": "https://www.meetup.com/owasp-dhaka-chapter/events/305130285",
        "timezone": "Asia/Dhaka",
        "description": "Join us for an informative event hosted by OWASP Dhaka Chapter, focusing on the latest trends in web application security, penetration testing, and software security. In this session, we will delve into topics such as information security, white hat hacking, and open source tools to defend against cyber threats. Building on the success of our previous events like \"OWASP Mobile Application Security Risk\" and \"Strengthening Software Quality Assurance for Robust Software Security,\" we aim to equip participants with practical skills and knowledge to secure their applications.\n\nWhether you are a cybersecurity enthusiast, software developer, or IT professional, this event offers a valuable opportunity to learn from experts in the field, collaborate with like-minded individuals, and stay updated on the ever-evolving landscape of cybersecurity. Don't miss out on this chance to expand your knowledge, network with industry peers, and enhance your expertise in software security with OWASP Dhaka Chapter."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2025-01-20",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242793",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2025-01-15",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-london/events/305137055",
        "timezone": "Europe/London",
        "description": "**This event is kindly sponsored and hosted by JustEat. There is limited seating available for in-person attendees. Registration required.**\n**This event will be live-streamed on YouTube. Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: JustEat, Fleet Place House, 2 Fleet Pl, London, EC4M 7RF (note: the entrance is directly opposite Starbucks front doors)\n**Nearest Tube Station:** St. Pauls (Central Line) - 6 mins walk\n**Doors Open at 6pm** for registration, food, drinks and networking. The talks start at **6:30pm** (we start on time).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Sherif Mansour and Andra Lezza\n\nWelcome and a brief update on OWASP Projects & upcoming OWASP Conferences from the OWASP London Chapter Leaders\n\n**\"Go Hack Yourself: API Hacking for Beginners\"** \\- Dr Katie Paxton\nOver the past few years, we've really seen API hacking take off as a field of its own, diverging from typical web app security, but yet parallel to it. Often we point to the amorphous blob that is web security and go: \"here you go, now you can be a hacker too\", with top 10 lists, write-ups, conference talks and whitepapers smiling as we do. This creates a major challenge for developers who want to test their APIs for security or just people who want to get into API hacking, how on earth do you wade through all the general web security to get to the meat of API hacking, what do you even need to know?\nThis talk is going to break down API hacking from a developer point of view, teaching you everything you need to know about API hacking, from the bugs you can find and to the impact you can cause, to how you can easily test your own work or review your peers.\n\n**\"Maturing Your Application Security Program\"** \\- Tanya Janca\nAfter working with over 300 companies on their application security programs the most common question I receive is “what’s next?”. They want to know how to mature their programs, and when they look at the maturity models available, they find them intimidating and so far beyond their current maturity level that they feel impossible. In this talk I will take you through 3 common AppSec program maturity levels I have encountered over the years, with practical and actionable next steps you could take immediately to improve your security posture.\n\n**SPEAKERS**\n\n**Dr Katie Paxton-Fear ([@insiderPhD](https://x.com/@insiderPhD))**\nDr Katie Paxton-Fear is an API hacker and content creator at Traceable. She has a PhD in cyber security and artificial intelligence, but if you know her it’s not for her academic work.\nShe’s a hacker and YouTuber who's found bugs in over 30 companies. She wants to show that anyone can be a hacker, and share her passion and knowledge with others. She has hacked everything from the military to social media, reporting her findings promptly and making sure the attackers don't get their first! In her free time she makes videos, teaching her audience of 80k+ how to get into ethical hacking. You can\nfind her all over the internet as InsiderPhD.\n\n**Tanya Janca ([@shehackspurple](https://twitter.com/shehackspurple))**\nTanya Janca, also known as SheHacksPurple, is the best-selling author of ‘Alice and Bob Learn Application Security’. She is also the founder of \"We Hack Purple\", an online learning community that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years, won countless awards, and has been everywhere from public service to tech giants, writing software, leading communities, founding companies and ‘securing all the things’. She is an award-winning public speaker, active blogger & podcaster and has delivered hundreds of talks on 6 continents. Tanya values diversity, inclusion, and kindness, which shines through in her countless initiatives. Advisor: Nord VPN, Aiya Corp Faculty: IANs ResearchFounder: We Hack Purple, OWASP DevSlop, #CyberMentoringMonday, WoSEC\n\n**TICKETS**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST book your place to be admitted to the event by the building security - your name will be checked against the guest list.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: https://owasp.org/www-policy/operational/code-of-conduct"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Secure Coding Tournament with Security Journey",
        "date": "2025-01-22",
        "time": "16:30-06:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885971",
        "timezone": "America/Chicago",
        "description": "TBD"
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "Gerenciamento de bibliotecas vulneráveis com o uso do EPSS",
        "date": "2024-12-27",
        "time": "20:00-03:00",
        "link": "https://www.meetup.com/owasp-natal-chapter/events/305269079",
        "timezone": "America/Fortaleza",
        "description": "Já se perguntou qual vulnerabilidade de sua aplicação representa a maior ameaça real? O **EPSS** (Exploit Prediction Scoring System) pode te ajudar a responder essa pergunta!\nNeste meetup, o **Matheus Cézar** irá nos apresentar essa poderosa métrica que estima a probabilidade de uma vulnerabilidade ser explorada em ataques reais.\n**Você vai aprender:**\n\n* O que é o EPSS e como ele funciona?\n* Qual a importância do EPSS na gestão de vulnerabilidades?\n* Como utilizar o EPSS em conjunto com ferramentas de SCA (Software Composition Analysis)?\n* Casos práticos e exemplos de como o EPSS pode te auxiliar na tomada de decisões."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Capture the Flag [Placeholder]",
        "date": "2025-01-01",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296181595",
        "timezone": "Europe/London",
        "description": "**Cyber Peterborough are hosting a CTF!**\n\nWe're working out the details, in the meantime - please sign up to watch out for updates!\n\n**What?**\n\n* A hosted capture the flag event\n\n**Where?**\n\n* TBD\n\n**When?**\n\n* TBD\n\n**Who for?**\n\n* All ages and abilities will be catered for!"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "January 2025 Meeting",
        "date": "2025-01-07",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/305156490",
        "timezone": "America/Phoenix",
        "description": "**Overview and Usage Feedback for New Patent:**\n**\"Method to encode and decode otherwise unrecorded private credentials, terms, phrases, or sentences.\" (45 - 60 min)**\n\n* The two inventors of patent #US20200387595A1 will share the basic concepts using \"Glyphs\" to encode recallable, robust passphrases.\n* The goal is to get constructive, candid feedback on the practicality of personal and enterprise usage\n* To test the concepts behind GlyphPass, please bring several photos on your phone that have good, non-obvious stories associated with the pictures.\n* Patent can be read here: [https://patents.google.com/patent/US20200387595A1/en?oq=%23US20200387595A1](https://patents.google.com/patent/US20200387595A1/en?oq=%23US20200387595A1) .\n\n**NOTE: We are starting at 7:30 pm since December.**"
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "Shift Left  - A discussion of AppSec Best Practices",
        "date": "2025-01-17",
        "time": "11:00-06:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/305152881",
        "timezone": "America/Chicago",
        "description": "**Shift Left - A discussion of AppSec Best Practices**\n11am-2pm for session\n2pm-3pm for happy hour\n\n**Details**\nTopics- See abstracts below\n\n* **Strategies for Aligning Programs with Modern Expectations-Frost Bank**\n* **Cultivating Developer Adoption in the era of Artificial Intelligence-Synk**\n* **The radical future of app and API security is in production-Contrast Security**\n* **Shift Left: Design for Security and Quality**-**CheckMarx**\n\n**Lunch Provided**\nScuzzi’s Italian Restaurant - 4035 N Loop 1604 W #102, San Antonio, TX 78257\n\n**HAPPY HOUR** networking after session!!\n\n**ZOOM** link provided below for remote attendees\n**https://optiv.zoom.us/j/91529424588?pwd=bgMmGiqvaLkEn9GeX8tISW9lcmPoFc.1&from=addon**\n\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\n\nPlease reply **“ONSITE”** if you plan on attending in person so we can finalize headcount for food and room attendance \n**Presentations will include:**\n\n***I. Strategies for Aligning Programs with Modern Expectations***\n***Vipul Gupta-SVP Frost Bank***\nIn this talk, Vipul plans to share his experience with building and scaling an Application Security program. He will share why engaging with development and business teams is essential for the Shift Left journey.\n\n***II. Cultivating Developer Adoption in the era of Artificial Intelligence-Snyk***\nIn today’s fast-paced, AI-driven development landscape, securing developer adoption is key to integrating security seamlessly into workflows. This presentation explores practical strategies to overcome challenges like trust, tooling complexity, and unclear ownership. By focusing on people, processes, and tools, we demonstrate how to empower developers, reduce friction, and scale security effectively. Attendees will gain actionable insights to foster a collaborative culture where security becomes a natural part of development.\nOne of the biggest challenges that organizations face when shifting left is getting developers to actually adopt the “shift left\" tools. This presentation speaks to how to overcome that.\n\n***III.*** **Development Team Transformation -Contrast Security**\nThe lines between proactive and reactive cyber defenses are somewhat arbitrary. If you blur those lines, you can some serious advantages. A SAST or SCA tool finding is a theoretical vulnerability that may or may not be exploitable, but if you can see that a vulnerability is within the blast radius of active probes or attacks, it suddenly becomes real. What might have been labeled as \"critical\" in pre-prod suddenly becomes \"super-critical\". On the other hand, things that are not exploitable in a production context due to compensating control, can be deprioritized preserving the limited attention of development for things that really matter. Join DevSecOps pioneer, Larry Maccherone, for this thought-provoking discussion on going right to shift left\n\n***IV.*** **Shift Left: Design for Security and Quality**-**CheckMarx**\nThis presentation will discuss the elements of design phase security, highlighting the critical role of design decisions in achieving a secure and high-quality software product."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-01-08",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349987",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    }
]