[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "AI Empowerment vs. Security Risk: Navigating the AppSec Challenges of AI Agents ",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304581179",
        "timezone": "America/New_York",
        "description": "In just a short span, AI Agents and low-code development have transformed how businesses operate, allowing users without coding backgrounds to create applications, automate processes, and streamline workflows. Business users are empowered as never before, using tools that merge AI with productivity—from email and business intelligence to application development. But while these tools amplify efficiency, they also introduce new security risks that challenge the traditional boundaries of IT and AppSec.\n\nAs security teams grapple with vulnerabilities like authorization misuse, data leakage, and the risk of exfiltration, they must decide how to approach the widespread adoption of AI-driven tools and low-code platforms without stifling innovation. In this session, we’ll explore recent research into the security challenges posed by AI agents and low-code development, emphasizing the pitfalls that emerge when business users become app creators. We’ll also outline how AppSec teams can adapt their approaches to balance security with productivity, ensuring they enable the business rather than block it."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - February 2025 (Online)",
        "date": "2025-02-25",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489290",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n(To Be updated)"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "February 2025 OWASP Happy Hour sponsored by Cyera",
        "date": "2025-02-13",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305616287",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, February 13th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cyera](https://cyera.io/)\n*Cyera is an AI-powered data security platform that helps organizations manage and protect their data in today’s complex digital landscape. The company’s platform combines advanced Data Security Posture Management (DSPM) with real-time enforcement controls, providing customers with a comprehensive solution for securing their data assets against evolving threats. Learn more at [Cyera.io](https://cyera.io/).*"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- Web Security Code Review Workshop",
        "date": "2025-02-11",
        "time": "17:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/305674357",
        "timezone": "America/Los_Angeles",
        "description": "Well, the Master himself is in town, so what do we do? Organize a hacker day! :)\nWe are delighted to announce a workshop on Web Security Code Review, led by none other than **Louis Nyffenegger, Founder and CEO of Pentester Lab—yes, our favorite hacker playground!.**\nTraveling all the way from Australia, this is a fantastic opportunity to learn from the master himself.\nThank you very much Semgrep for hosting the event. This meetup is in collaboration with [pacific hackers group](https://www.pacifichackers.org/)\n\n5 PM : Doors open\n5 PM -6 PM Networking\n6-8 PM : Workshop\n\nDetails Below:\n\n**\\# Title:** Web Security Code Review Workshop\n**\\# Abstract:** Learn how to identify vulnerabilities through effective manual security code reviews. In this workshop, we’ll analyze real-world code examples, uncover common flaws like injections and authentication issues, and explore how to leverage built-in security features. You’ll gain practical skills to complement automated tools and confidently tackle security challenges in real codebases. Ideal for developers, AppSec engineers, and code reviewers, this session focuses on practical techniques and real-world impact.\n\n\\# Speaker short bio\nLouis Nyffenegger is a seasoned security engineer and the founder of PentesterLab, a platform dedicated to teaching web penetration testing and security code review. With over a decade of experience in cybersecurity, Louis has focused on penetration testing, architecture analysis, and code reviews."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Foundational lessons in application security",
        "date": "2025-02-10",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/305961700",
        "timezone": "Australia/Brisbane",
        "description": "Join us for an insightful session examining how foundational lessons in application security remain just as relevant today as when Mark Curphey and John Viega introduced them in 2006. This talk will cover:\n\n* Corporate Environment Focus\n\n* Approaches to app development in large organisations\n* Common pitfalls in development, lifecycle management, and security monitoring\n* Key Risks and Recurring Problems\n* Historical and modern examples of vulnerabilities\n* Why ‘all that is old is new again’ in AppSec\n* Strategies for Improvement\n* Practical solutions derived from longstanding security principles\n* Lessons learnt on our own AppSec journey\n* Blending management perspectives with hands-on technical insights\nExpect a pseudo-technical deep dive into building, testing, and maintaining secure applications in complex corporate setups. You’ll walk away with renewed appreciation for established best practices, along with actionable tips to modernise and strengthen your own security lifecycle."
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland: Contrast Security Demonstration",
        "date": "2025-02-18",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/305067809",
        "timezone": "America/New_York",
        "description": "Join us on Tuesday, February 18th at Market Avenue Wine Bar for a hands-on lab demonstration with Contrast Security. The presentation will go over features and limitations of Contrasts RAST tool. This session is designed for everyone, whether you decide to participate or not.\n\nContrast is an Application Security solution used by companies like AARP, InfoSys, Citizens Bank, Snap Finance, and more."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Authentication Demystified: Basic Auth to Web Tokens in 60 minutes",
        "date": "2025-02-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/305318149",
        "timezone": "America/New_York",
        "description": "Welcome to 2025! Both the speaker and I are off at CodeMash in January, so we are going to start our EVERY MONTH transition in February!\n\nWe'll start off with a few highlights related to what is new in the world of appsec, and have a good-of-the-order style chat about the year, and then ... Have you ever searched for \"how to authenticate an API call\" and been confused by the dizzying array of techniques, terminology, jargon, and acronyms that come back?\n\nThis session is designed for anyone that's struggling to make sense of modern authentication options. You'll learn the differences between OAuth, API Keys, HMAC, JSON Web Tokens (JWT), SAML, OpenID Connect, and passkeys using Webauthn. Each technique will be explained in a clear, practical, easy-to-understand way.\n\nThis session focuses on core concepts, not code, and is accessible to anyone that works with technology."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #70 - OWASP meets Legal & Regulations",
        "date": "2025-02-26",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/305522192",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #70! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n* **Rechtssicher durch den Cybervorfall:** We are excited to welcome **Olga Stepanova** and **Dirk Koch** \\- both partners at ByteLaw \\- who will guide you through the rough waters on how you can protect your company from the legal consequences of a cyber incident\\. Experts explain current threats such as ransomware and business email compromise and provide practical tips on how to deal with perpetrators\\, authorities and insurance companies in a legally secure manner\\.\n* **Regulatory Affairs for Hackers:** It's not just since the GDPR that we've known what a resounding impact legal changes can have, but what else can we possibly expect when regulation gets really strict?\n**Leon Holub**, product owner of the Regulatory Radar platform at Johner Institute GmbH tries to give an insight into the world of legal requirements for medical devices, from a perspective of a software developer who has immersed himself in the details of the world's regulatory systems not too long ago.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **26.02.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 , located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Meeting ",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242794",
        "timezone": "America/New_York",
        "description": "Introduction to OWASP projects. New Members drive."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Essentials: An Overview of Key Projects and Best Practice",
        "date": "2025-02-17",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242793",
        "timezone": "America/New_York",
        "description": "Join us for a high-level introduction to the Open Web Application Security Project (OWASP) foundation. We’ll explore its most notable resources—like the OWASP Top 10, Zed Attack Proxy (ZAP), and the Application Security Verification Standard (ASVS)—and discuss practical ways to use them in everyday development and security workflows. This session is perfect for those new to OWASP or looking to brush up on core concepts.\n\nPresented by Francois Fried."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Web Security Code Review Workshop",
        "date": "2025-02-18",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/305822087",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Hands-on Web Security Code Review Workshop\nHello AppSec teams and tech enthusiasts! We're thrilled to roll out an exceptional Web Security Code Review Workshop in collaboration with **OWASP LA** and offered by OWASP.\n\n**Abstract:** Learn how to identify vulnerabilities through effective manual security code reviews. In this workshop, we’ll analyze real-world code examples, uncover common flaws like injections and authentication issues, and explore how to leverage built-in security features. You’ll gain practical skills to complement automated tools and confidently tackle security challenges in real codebases. Ideal for developers, AppSec engineers, and code reviewers, this session focuses on practical techniques and real-world impact.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\nhttps://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "February meetup",
        "date": "2025-02-25",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/305641736",
        "timezone": "America/Chicago",
        "description": "**DefectDojo**\n**(Topic TBA)**\n\nFor February's talk, we welcome DefectDojo, the open-source OWASP flagship project for vulnerability management.\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nDefectDojo is graciously providing food and drink for the event.\n\nPlease remember to register and keep your registration up to date so we know how many to expect."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "February 2025 OWASP Chapter Netherlands Meetup",
        "date": "2025-02-13",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/305251997",
        "timezone": "Europe/Amsterdam",
        "description": "See [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **The AI Who Shagged Me!** by **Ali Abdollahi**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Behind the Breach: Understanding and Preventing Web Vulnerabilities** by **Mitchel Koster**\n\n**The AI Who Shagged Me!**\n*Abstract:*\nIn today’s ever-changing world of cybersecurity, bringing AI into red teaming exercises is an exciting way to boost how we assess our organizational defenses. This approach fits well with frameworks like TIBER, which focus on creating realistic simulations of cyber threats. It’s all about making our defenses stronger and more effective! AI algorithms effectively analyze large datasets to identify emerging threats and tactics, aiding in realistic attack simulations. AI-driven tools help replicate complex attacks, providing red teams with thorough assessments of security measures. Using AI-generated anomalies enhances detection capabilities and strengthens incident response plans. However, the integration of AI into red teaming is not without challenges. This discussion aims to provide a nuanced overview of the application of AI in red teaming exercises, examining its potential benefits and limitations within established frameworks like TIBER. By critically evaluating this integration, we can better understand how to harness AI’s capabilities to strengthen cybersecurity offense and defense.\n*Bio:*\nAli is a cybersecurity researcher with over 12 years of experience. Currently, he is the application and offensive security manager at Canon EMEA. He studied computer engineering, published articles, and holds several professional certificates. Ali is a Microsoft MVP and regular speaker or trainer at industry conferences and events.\n\n**Behind the Breach: Understanding and Preventing Web Vulnerabilities**\n*Abstract:*\n“Behind the Breach: Understanding and Preventing Web Vulnerabilities delves into the transformation of modern web applications and architecture, showcasing how advancements in frameworks and browser technologies have revolutionized security. Yet, even with these innovations, attackers persist in uncovering and exploiting vulnerabilities. Drawing from real-world case studies across industries—from agile startups to global enterprises—this presentation not only demonstrates how a deeper understanding of security can thwart these threats, but also highlights how effectively conveying the potential impact of vulnerabilities is key to prioritizing security efforts.”\n*Bio:*\nMitchel Koster is the Chief Security Researcher at Breachlock, where he leads the development of new security products and conducts research and engagements for high-profile clients. His work includes Red and Purple Team exercises and addressing custom security requirements across diverse sectors, including Aviation and Healthcare. With a background in computer science, embedded systems, and programming, Mitchel bridges the gap between modern software development practices and robust security measures.\n\nFor parking, there’s a (paid) parking space less than 5 minutes away at the Q-Park Hermitage. ([ https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88](https://maps.app.goo.gl/XpJzhnj4BP6Kw9T88) )\n\nAlso a 5 minute walk is the Zaandam station. ([ https://maps.app.goo.gl/3emKrp4ygx41SoN67](https://maps.app.goo.gl/3emKrp4ygx41SoN67) )"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Mastering Reachability Analysis",
        "date": "2025-02-03",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/305831655",
        "timezone": "America/New_York",
        "description": "**Mastering Reachability Analysis: Redefining Product security, bridging Application Security and Cloud Vulnerability Management**\n\nReachability analysis is complex and involves 5 types of reachability analysis. but which one of them is actually useful and applicable to you?\n\nAs appsec and operational security merge into prodsec we seen appsec becoming more complex with containerized environments, and intricate architectures, traditional vulnerability management/ application security has reached its limits. Security teams are often overwhelmed by alerts, many of which pose no real threat. Enter reachability analysis—a transformative approach to vulnerability prioritization that filters out noise and highlights exploitable vulnerabilities.\n\nThis talk demystifies reachability analysis and its five key types, explaining how this methodology helps streamline vulnerability management in modern software ecosystems.\n\nWe’ll address the confusion around reachability techniques and explore how they interact to deliver a more focused, actionable security strategy.\n\nKey Discussion Points:\n\n1\\. What Is Reachability Analysis in ASPM?\n• Understanding the concept of reachability: determining whether vulnerabilities are actually exploitable in runtime environments.\n• The role of reachability in Application Security Posture Management (ASPM): filtering irrelevant issues and reducing vulnerability overload.\n\n2\\. The Five Types of Reachability Analysis:\n• Code Reachability Analysis: Identifying if vulnerable code paths are executed during runtime.\n• Library Reachability Analysis: Assessing whether third-party libraries’ vulnerabilities are actively used in application execution.\n• Container Reachability Analysis: Determining whether vulnerable packages in containerized environments are executed during runtime.\n• Static Reachability Analysis: Analyzing vulnerabilities in the codebase and loaded libraries without runtime execution.\n• Runtime Reachability Analysis: Focusing on vulnerabilities actively being executed in the live environment\n\n3\\. Challenges in Implementing Reachability Analysis:\n• Complexity in integrating reachability across diverse environments.\n• Lack of visibility into dynamic and containerized deployments.\n• Overcoming the limitations of traditional CWE classifications and addressing their practical gaps.\n\n4\\. Leveraging Context and AI for Effective Vulnerability Management:\n• Using contextual deduplication to reduce noise by merging duplicate vulnerabilities across code, containers, and environments.\n• Incorporating cyber threat intelligence to prioritize exploitable vulnerabilities in real-world scenarios.\n• How AI-driven analysis identifies patterns and generates actionable insights for remediation. Takeaways for Attendees:\n• Gain a clear understanding of reachability analysis and its role in reducing vulnerability overload.\n• Learn how to implement and prioritize vulnerabilities using contextual deduplication and threat intelligence.\n• Explore how static and runtime reachability analysis complement each other for a comprehensive approach.\n• Discover practical applications of reachability analysis in modern ASPM solutions to improve security team efficiency.\n\nThis talk offers a roadmap for security teams looking to harness the power of reachability analysis to focus on what truly matters. By bridging the gap between overwhelming alerts and actionable insights, you can redefine your vulnerability management strategy and build a stronger, more resilient security posture."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle February 2025",
        "date": "2025-02-19",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/305613479",
        "timezone": "Europe/London",
        "description": "We're back with our first event of 2025! We’ll be doing our usual two talks and pizza format.\n\nLocation: Opencast Software, Unit 2, The Kiln, Hoults Yard, Newcastle‑upon‑Tyne NE6 1AB.\nThere is free onsite registered parking. To register, attendees must enter their details into an iPad upon entering the Opencast office otherwise a parking fine may be issued.\nNeither OWASP Newcastle or Opencast can assist with or be responsible for parking issues, you do so at your own risk.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1830 OWASP Newcastle Welcome\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk one\n**Title:** Harassed by Hamas: Israel’s Cyberwar\n**Speaker:** Andy Pannell\n**Speaker Bio:** Andy Pannell is an accomplished application security lead with a keen focus on safeguarding product and cloud security for a prominent mobile ride-hailing company. His expertise lies in identifying vulnerabilities, implementing robust security measures, and ensuring the integrity of critical systems.\nOutside the digital realm, Andy indulges in a passion that balances the binary code: endurance racing. Andy spends hours at racetracks, appreciating the symphony of precision engineering and adrenaline-fueled competition.\n**Talk Synopsis:** This presentation examines (in my opinion) one of the most recently overused phrases in the media “cyber war”, and what it actually means in reality for us cyber security practitioners.\nWe will start by examining warfare, and review previous nation states attacks that have crossed the boundary into offensive cyber operations.\nWe will then focus on October 2023 and the tactics deployed by both Hamas and the IDF during the war, from a cyber perspective. To do this we will discuss reverse engineering malware samples, API security and DDoS attacks in detail.\nLastly we will conclude by looking at what the future of cyber warfare looks like, and what we can do to best protect ourselves / our organisations in such events.\n\nTalk two\n**Title:** Scaling Security Through Collaboration: The Role of Security Champions in Modern Organisations.\n**Speaker:** Kimberley Graham\n**Speaker Bio:** Kimberley is the Manager of People-Centered Security at Sage, headquartered in Newcastle. She is responsible for promoting and championing security within Sage.\n**Talk Synopsis:** TBC\n\nThere is a capacity limit on the venue so ticket numbers for the event have been restricted so please cancel your ticket if you are unable to attend.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/)"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-02-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181943",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Glo Golf Mini Golf",
        "date": "2025-02-27",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/305905090",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Mini Golf @ Glo Golf Peterborough\n\n**When?**\n\n* \\- Thursday 27th February\n\nEverybody welcome! For this event, please ensure you contact a host as pre-payment is required.\n\nThank you,\nRyan"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "February 2025 Meeting",
        "date": "2025-02-04",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/305763822",
        "timezone": "America/Phoenix",
        "description": "**Revoked! How WebPKI is Failing Users** (75 minutes)\n\n* For decades, WebPKI has relied on certificate revocation as a safety net to shield users from untrusted websites.\n* The issue is that our current approaches: CRLSet and OCSP, don't fully address the issue and have glaring weaknesses.\n* CRLite was born from Mozilla to challenge the status quo and make certificate revocation a reality.\n* But what lies behind CRLite's success? A fascinating journey through the realms of cryptography and hashing reveals that the solution is rooted in an unlikely place: a 50-year-old mathematical concept.\n* The answer may surprise you, but it's one that could change everything."
    },
    {
        "group": "Reading",
        "repo": "www-chapter-reading",
        "name": "Extreme Shift Left with AI-Powered IDE Plugins",
        "date": "2025-02-07",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-reading-chapter/events/305789651",
        "timezone": "Europe/London",
        "description": "**Event Description:**\nJoin us for an exciting OWASP meetup where we explore how AI-powered IDE plugins are transforming application security. This session will showcase how developers can embrace an **\"Extreme Shift Left\"** approach by integrating security directly into their coding workflows. Featuring innovative capabilities like **AI-powered secure coding assistants** and **real-time scanning**, these tools empower developers to identify and remediate vulnerabilities as they code.\nThis meetup is ideal for developers, security professionals, and DevSecOps teams who want to enhance their security practices and build secure applications faster.\n\n**Key Takeaways:**\n\n* How AI-powered IDE plugins integrate seamlessly into workflows for real-time security.\n* Detecting vulnerabilities and receiving actionable remediation suggestions as you code.\n* Real-world examples of Extreme Shift Left in AppSec.\n* Live Q&A and demo showcasing these capabilities in action.\n\n**Agenda:**\n\n1. Welcome and Introduction (5 min)\n2. The Importance of Shift Left in Application Security (10 min)\n3. AI-Powered IDE Plugins: Features & Capabilities (10 min)\n4. Live Demo: Real-Time Scanning and Secure Coding Assistance (20 min)\n5. Q&A and Networking (15 min)"
    },
    {
        "group": "Riga",
        "repo": "www-chapter-riga",
        "name": "The 2nd OWASP Riga Chapter Meetup [IN-PERSON]",
        "date": "2025-02-13",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-riga-chapter/events/305918541",
        "timezone": "Europe/Riga",
        "description": "**This event is kindly hosted by [Ekonomikas un kultūras augstskola](https://www.augstskola.lv/). There is limited seating available for in-person attendees. Registration required.**\n\n**Venue Location**: [Pērnavas iela 62, Latgales priekšpilsēta, Rīga, LV-1009, Latvia](https://www.google.com/maps/place//data=!4m2!3m1!1s0x46eece2216ab4c0b:0x242a2d93eecba91a?sa=X&ved=1t:8290&ictx=111)\n\n**Doors Open at 17.30** for registration, cookies and networking. The talks start at 18.00 (we start on time!).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** - [Vladislavs Kolosovs](https://www.linkedin.com/in/vladislavs-kolosovs/), [Andrey Gubarev](https://www.linkedin.com/in/andreygubarev/) \\- OWASP Riga Chapter Leaders\n\n**Threat Modelling Workshop** - [Andrey Adamovich](https://www.linkedin.com/in/andreyadamovich/)\nIn this workshop, we’ll collaborate live on a Miro board to analyze a simple system architecture, uncover potential threats, and propose mitigations. We’ll demystify threat modeling using the STRIDE framework to identify risks and the DREAD methodology to prioritize them.\n\n**Applying OWASP to GraphQL -** [Gvido Bērziņš](https://www.linkedin.com/in/gvidob/)\nA lot of people still don't know what is GraphQL and refuse or don't know how to hack it, so let's try to change that, by demistifying it and applying OWASP Top 10 techniques and tools to test it just like a regular old REST API.\n\nGraphQL is still a relatively new technology that is still worth hacking with many implementations and not enough security controls built in, that's what we're going to talk about.\n\n**SPEAKERS**\n\n**Andrey Adamovich**\nAndrey is a software craftsman and CTO with a focus on IT strategy, platform engineering, and security. He helps organizations build scalable and secure technology platforms that improve software delivery. With expertise in DevOps, automation, and cloud technologies, Andrey creates systems that support agile teams and drive efficiency.\n\nAs an educator, Andrey has delivered over 300 courses across Europe, helping teams master software development, automation, and security practices. He is also a regular speaker at international conferences, sharing his insights on modern software development.\n\n**Gvido Bērziņš**\nCyber Security Consultant on the Red Team with experience in software development and other IT fields. Currently works at Possible Security.\n\n**TICKETS**\nOWASP meetups are **free** and open to **anyone** interested in application security. *Please note that you MUST book your place to be admitted to the event by the building security.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\n\nOWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-02-12",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349991",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "4th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-02-11",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584148",
        "timezone": "Europe/Berlin",
        "description": "**AI Security & Insights into OWASP Top 10 LLM**\n\nAs artificial intelligence systems become increasingly integrated into our daily lives, the importance of securing these systems grows exponentially. This keynote introduces the core principles of AI security, highlighting the unique challenges and risks posed by large language models (LLMs). Explore the recently introduced OWASP Top 10 for LLMs—a comprehensive framework that identifies the most critical vulnerabilities and provides actionable guidance for securing AI applications. We'll finish with an oversight of all the initiatives at the OWASP Top 10 LLM community.\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "OWASP Switzerland Community Meetup, February 2025",
        "date": "2025-02-19",
        "time": "17:10+01:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/305296964",
        "timezone": "Europe/Zurich",
        "description": "Join us at the OWASP Switzerland Community Meetup to kick off the year 2025! This meetup will feature two exciting talks on application security. It’s a fantastic opportunity to network with like-minded professionals, exchange ideas, and expand your knowledge in a friendly and collaborative environment.\n\n**Program:**\n**17:10** - **Doors open**: Grab a drink, meet old and new friends from the OWASP Switzerland community\n\n**17:35** - **Uninstallable by Design**: The Role of Pre-installed Apps in Android’s Security Landscape - (Thomas Sutter, PhD Student @ University of Bern)\n\n**18:30** - **Coffee Break**\n\n**18:45** - **Continuous Security with DevSecOps**: How Platform Engineering Transforms Modern Application Security​ - (Romano Roth, Chief of DevOps / Partner @ Zühlke)\n\n**19:40 - 20:10 - Drinks, Fingerfood and Networking:** Grab a bite and chat with old and new friends\n\n**Talk details:**\n\n* **Uninstallable by Design - by Thomas Sutter**: The competitive smartphone market is keen to prevent its intellectual property from being analysed by competitors and the public. As a result, most smartphones are locked when distributed, and anti-reversing techniques are widely used. Consequently, millions of users use smartphones daily without a clear understanding of the software’s functionality and purpose. To lower the bar for security researcher to analyze Android firmware, we developed a novel framework, called FirmwareDroid. In this talk, we discuss the challenges to automate the process of analyzing Android firmware and showcase how we use FirmwareDroid to analyse pre-installed Android apps in academia.\n* **Continuous Security with DevSecOps - by Romano Roth:** Security must be seamlessly integrated into every stage of the software development lifecycle. This talk explores how combining DevSecOps principles with Platform Engineering empowers teams through automation, standardized environments, and reduced complexity. Learn how these approaches transform application security into a proactive, scalable, and collaborative enabler for delivering secure, high-quality software at speed."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-02-20",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510162",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Extra OWASP SAMM community call Europe - Asia",
        "date": "2025-02-14",
        "time": "08:00-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/305496638",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\nWe will share any project news and updates.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #70 - OWASP meets Legal & Regulations",
        "date": "2025-02-26",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/305522192",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #70! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n* **Rechtssicher durch den Cybervorfall:** We are excited to welcome **Olga Stepanova** and **Dirk Koch** \\- both partners at ByteLaw \\- who will guide you through the rough waters on how you can protect your company from the legal consequences of a cyber incident\\. Experts explain current threats such as ransomware and business email compromise and provide practical tips on how to deal with perpetrators\\, authorities and insurance companies in a legally secure manner\\.\n* **Regulatory Affairs for Hackers:** It's not just since the GDPR that we've known what a resounding impact legal changes can have, but what else can we possibly expect when regulation gets really strict?\n**Leon Holub**, product owner of the Regulatory Radar platform at Johner Institute GmbH tries to give an insight into the world of legal requirements for medical devices, from a perspective of a software developer who has immersed himself in the details of the world's regulatory systems not too long ago.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **26.02.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 , located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    }
]