[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Harnessing AI for Offensive Security",
        "date": "2025-06-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/306903233",
        "timezone": "America/New_York",
        "description": "Want to harness AI for offensive security and get real-world, scalable results? Join [Dreadnode](https://dreadnode.io/) Staff Security Researcher and OWASP Top 10 for LLM Applications founding member and tech leader, Ads Dawson, as he dives into adversarial AI and ML, Red Teaming LLMs and chatbots, and next-gen offensive security workflows.\n\nWhether you're an AI red team veteran or just starting out, this session will equip you with the tools, tactics, and knowledge to navigate an AI-native threat landscape."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "13. OWASP Augsburg Stammtisch",
        "date": "2025-06-25",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/308521415",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda:**\nEs gibt bisher keine Vorträge - aber vielleicht wollen wir ja mal was neues probieren? Ein Workshop zum Thema IT-Security? Brainstormen was fehlt, was man machen muss? Ideen? Her damit! :-)\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - June 2025 (Online)",
        "date": "2025-06-24",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489304",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation! (if you want to attend in-person, see [Eventbrite](https://owasp-austin-2025-june.eventbrite.com).)\n\n### **SAST on Rewind: Moving from Pattern-Matching to Contextual Security in the Age of AI**\n\nStatic analysis was built for yesterday’s code. Its rule-based engines still hunt for familiar strings while AI assistants generate brand-new logic paths at record speed. The result? False positives everywhere, real vulnerabilities left open, and developers who treat security findings like background noise.\n\nIn this 40-minute session, **James Wickett**, CEO & Co-Founder of DryRun Security, hits “rewind” to show where traditional SAST got stuck—and fast-forwards to a context-first approach that finally keeps pace with modern development. Drawing on fresh data from the 2025 SAST Accuracy Report and real cod stories, James will:\n\n1. **Contrast patterns vs. context** — why deterministic rules miss IDOR, broken auth, and AI-generated edge cases.\n2. **Unpack probabilistic scanning** — how contextual signals cut noise without sacrificing coverage.\n3. **Contextual Security Analysis in Action** — a live authorization flaw that slipped through regex nets.\n4. **Share a plan for AI readiness for AppSec** — tools, projects, resources to plan for AI readiness for your appsec or product security program.\n\nAttendees will leave with open-source resources, clear ROI talking points for leadership, and a practical roadmap to upgrade their AppSec program for the AI era—no VHS tape required.\n\n**Speaker:**\n**James Wickett**"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 21 June 2025 Null/OWASP",
        "date": "2025-06-24",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/308530110",
        "timezone": "Asia/Kolkata",
        "description": "Join the OWASP® Foundation Bangalore & Null Bangalore Combined Meetup – June 21st, 2025\n\n Date: June 21st, 2025\n Location: Bangalore\n Venue: TBD\n⏰ Time: 09:30 AM – 02:00 PM\n Open to Everyone \\| Free Entry \\| No Registration Limits\nJoin us for an exciting meetup featuring top-notch security talks, hands-on discussions, and networking opportunities!\n​ Proposed Sessions\n\n* ​Intent Vulnerabilities in Mobile Android Application by **Pooja Pawar**\n* ​Defense Evasion by **SHAMEEM P K and Joyo**\n* ​HTML Smuggling by **Ravi Shankar and Nikhil**\n* ​How to select Enterprise Browser by **Mohamed Ismail E**"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "June OWASP Bay Area Meetup",
        "date": "2025-06-24",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/308274407",
        "timezone": "America/Los_Angeles",
        "description": "We’re excited to announce that our **June OWASP Meetup** will be Sponsored by **Oligo Security** and hosted at **Poshmark Inc**\n\nJoin us for an evening of great conversations, community networking, and insightful security discussions — all in an awesome venue provided by **Oligo Security**. And yes, there will be **delicious food and drinks** generously provided by our sponsors!\n\n5:00 PM : Doors open, Networking, food and drinks\n5.30 PM :- Chapter introductions\n5.45-6.15 PM :- Beyond Shift-Left: The Rise of Application Detection and Response (ADR) and the Lessons Learned from RASP\n6.15-7.00 PM :- Android app security - with a dash of LLM\n7.0-7.45 PM :- LLM multi-agent system integrity, threat modeling\n\n**Talk #1** Beyond Shift-Left: The Rise of Application Detection and Response (ADR) and the Lessons Learned from RASP\n\n**Description:** Last year, we explored the challenges of shifting security left—highlighting how pushing security responsibilities onto developers often leads to alert fatigue, noise, and time spent chasing \"theoretical risk.\" This year, we pick up the conversation by examining another major trend in application security: the rise and fall of Runtime Application Self-Protection (RASP) and how it has paved the way for a new category—Application Detection and Response (ADR).\nRASP was introduced with high hopes: the promise of protecting applications from within, in real time. In theory, it was a game-changer. But in practice, many organizations struggled with the reality—RASP tools are difficult to scale, introduce friction, and most critically, had the power to crash the very applications they were meant to protect.\nIn this talk, we’ll explore:\nThe promise of RASP and why it often fails to deliver on its potentialReal-world challenges teams faced when deploying and maintaining RASP solutions—including stability concerns, performance tradeoffs, and operational complexityHow these challenges led to the emergence of Application Detection and Response (ADR) as a more practical, scalable approach to real-time application securityThe core principles of ADR, how it differs from RASP, and why it represents a critical evolution in the application security landscapeLessons learned from early adopters of ADR: what’s working, what’s not, and what’s next\nAttendees will leave with a clearer understanding of:\nThe limits of \"shift-left\" and why real-time protection mattersThe hard-earned lessons from RASP deploymentsHow ADR builds on the vision of RASP while addressing its key shortcomingsPractical insights for integrating ADR into your security strategy without disrupting developer workflows or application stability\nThis talk is ideal for application security practitioners, developers, and technical leaders who want to move beyond theory to practical, actionable strategies for securing modern applications in production.\n\n**Speaker:** **Katie Pistello**, is a Sr. Solutions Engineer at Oligo Security, where she helps organizations navigate the evolving landscape of application security with a focus on real-time detection and runtime context.\nBefore joining Oligo, Katie worked at Snyk where she partnered with engineering and security teams to operationalize developer-first security tooling and scale modern application security programs. Her background positions her to help enterprises take their security programs beyond checkbox compliance and into scalable, actionable practices that reduce real risk.\n\n**Talk#2** Android app security - with a dash of LLM.\n\n**Abstract -** Over 3 billion android devices in use worldwide. The threat landscape increases as more and more devices use the Android platform and it becomes crucial to learn Android app security.\nIn this talk, we will start with some Android basics and key security concepts. After that, we will discuss a hybrid approach where we combine Classic Static analysis with LLMs contextual understanding of the code semantics to go beyond just discovering exported components in Android apps.\nWe will also demonstrate an open source LLM tool that assists in the deobfuscation of Android bytecode and may help in finding vulnerabilities.\n\n**Speaker :-** Vaibhav Agrawal Security Engineer at Google\nA cybersecurity professional with over a decade of experience in safeguarding digital assets, with core expertise in **Application Security**, **Mobile Security**, and **LLM Security**. His skill set spans a broad range of security and privacy domains, developed through both academic and industry experience, including **Infrastructure Security**, **Cloud Security**, and **Windows Active Directory Security**.\nVaibav is **IEEE Senior Member**, a **security conference speaker**, and an active **contributor to open-source projects**. Some of their work can be found on their GitHub repository: [https://github.com/In3tinct](https://github.com/In3tinct).\nResearch and blog contributions include:\n\n* [IEEE Research Paper](https://ieeexplore.ieee.org/document/8405724)\n* [Medium Blog](https://medium.com/@in3tinct)\n\n**Talk # 3 LLM multi-agent system integrity, threat modeling.**\n\nThis study addresses security and ethical challenges in LLM-based Multi-Agent Systems, as exemplified in a blockchain fraud detection case study. Leveraging blockchain’s secure architecture, the framework involves specialized LLM Agents—ContractMining, Investigative, Ethics, and PerformanceMonitor, coordinated by a ManagerAgent. Baseline LLM models achieved 30% accuracy with a threshold method and 94% accuracy with a random-forest method. The Claude 3.5-powered LLM system reached an accuracy of 92%. Ethical evaluations revealed biases, highlighting the need for fairness-focused refinements. Our approach aims to develop trustworthy and reliable networks of agents capable of functioning even in adversarial environments. To our knowledge, no existing systems employ ethical LLM agents specifically designed to detect fraud, making this a novel contribution. Future work will focus on refining ethical frameworks, scaling the system, and benchmarking it against traditional methods to establish a robust, adaptable, and ethically grounded solution for blockchain fraud detection.\n\n**Speaker:-** Ying-Jung Chen, PhD\nYing-Jung is a machine learning engineer, launching her career in the greater Seattle area. She is deeply passionate about applying advanced modeling techniques to diverse business domains—including finance, agriculture, and hydroclimate—and is committed to leveraging public cloud computing services efficiently. Ying-Jung stays at the forefront of machine learning by reading research papers, attending industry meetups, and participating in major conferences. Her expertise spans statistical modeling, algorithm optimization, and the latest in LLM multi-agent system. She is a PyData Impact Scholar (2021, 2023) and is enthusiastic about sharing her journey in data science, sustainability, and AI technologies. Recently, Ying-Jung has expanded her focus to AI security, engaging with OWASP Multi-Agent System Threat Modeling, CSA (Cloud Security Alliance) frameworks, and the Top 10 for Agentic AI, as well as developing an AI Vulnerability Scoring System (AIVSS). In her free time, she enjoys hiking and playing basketball and pickleball."
    },
    {
        "group": "Beja",
        "repo": "www-chapter-beja",
        "name": "0x03 Assumption: Failed",
        "date": "2025-06-27",
        "time": "15:00+01:00",
        "link": "https://www.meetup.com/owasp-beja-chapter/events/308254444",
        "timezone": "Europe/Lisbon",
        "description": "**Assumption: Failed** is the fourth OWASP Beja meetup, happening on June 27th at 15:00. Join us as we explore what happens when assumptions meet reality, featuring hands-on hardware tinkering and a deep dive into a critical vulnerability that aged far too well.\n\n**Schedule**\n\n15:00 - **Welcome Notes** by OWASP Beja chapter leadership team\n15:10 - **The Parking Chronicles - A DIY Guide to Controller Detection** by David Sopas\n16:10 - **Aged Like a Fine Port: Old Yet Impactful** by Paulo Silva\n17:00 - **Snacks & Drinks**\n\n**Talks**\n\n**The Parking Chronicles - A DIY Guide to Controller Detection**\nby David Sopas, Co-Founder & COO @ Char49\n\nWhat started as a casual curiosity about a local parking system evolved into a hardware exploration into how controllers communicate, hide and sometimes expose more than they should. In this talk, we'll walk through the journey of identifying, locating, and analyzing parking controllers using DIY tools and techniques.\n\nWe'll explore a classic Bluetooth and BLE highlighting how accessible methods can uncover vulnerabilities in seemingly innocuous infrastructure. The goal isn't just to break things but to understand them and show how anyone with a soldering iron, a few scripts and a lot of persistence can demystify some systems.\n\nThis session will give you practical insights, real-world examples and a few laughs along the way.\n\n**About the Speaker**\nDavid Sopas is an experienced security researcher with a wide range of expertise. As COO of Char49, he has played a key role in driving the company’s success. David is also a sought-after speaker, having presented at numerous conferences including Def Con, BSides, and RSA, sharing his ideas and knowledge with audiences around the world. His exceptional work includes being the creator of MindAPI - an open-source API security methodology, which has gained recognition within the industry.\n\n\\-\\-\\-\n\n**Aged Like a Fine Port: Old Yet Impactful**\nby Paulo A. Silva, Principal Security Researcher @ Char49\n\nIn this talk, we will delve into a critical XML Signature Wrapping (XSW) vulnerability (CVE-2023-34923) in a service management platform that remained undetected for over a decade despite regular penetration testing. The vulnerability was found in a Microsoft Azure AD integration, which many assumed to be \"safe by default\" due to the software giant's reputation for adhering to security best practices. However, the responsibility for validating the SAML response remained with the receiving party, and this crucial step had been overlooked. This session will explore the technical details, possible human factors behind the oversight, and the broader lessons for the security community.\n\nThis session will provide a comprehensive look at how seemingly minor assumptions can lead to long-term security blind spots. While XML Signature Wrapping is a well-known and well-documented vulnerability, this illustrates how even established weaknesses can persist when certain assumptions go unchallenged. Attendees will learn about the technical mechanisms of the vulnerability, the psychological factors that might have contributed to its prolonged existence, and practical strategies for identifying similar weaknesses in their own systems. The talk will emphasize the importance of questioning assumptions, thoroughly validating third-party integrations, and giving proper attention to complex, resource-intensive features.\n\nJoin this talk to gain insights into the technical specifics of XML Signature Wrapping and its exploitation, the psychological and operational biases that might have kept it hidden for so long, and practical recommendations to avoid similar pitfalls in your own environments.\n\n**About the Speaker**\nPaulo is a security practitioner with a solid background in software development, who has spent the last decade focused on identifying critical vulnerabilities and breaking software. He is a long-time OWASP volunteer and co-leader of the OWASP API Security Project, where he advocates for secure API practices and contributes significantly to mitigating security risks in the API landscape."
    },
    {
        "group": "Boulder",
        "repo": "www-chapter-boulder",
        "name": "Boulder OWASP June Meetup: The OWASP Access Log Parser Project",
        "date": "2025-06-25",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-boulder/events/308522934",
        "timezone": "America/Denver",
        "description": "The OWASP Boulder Chapter is excited to announce our June 2025 Chapter Meeting! Scheduled for Wednesday, June 25th at the Rule4 office at 6 PM, with complimentary food, beer, and soft drinks. Join us for networking with your peers and a featured talk from Ryan Boyle presenting:\n\nThe OWASP Access Log Parser Project\n\nGenerating log files is a critical first step in defending a web application, but they don't do you much good unless someone actually looks at them. The OWASP Access Log Parser Project is an effort to simplify that process by converting terse and sometimes encoded log files into a format that can more easily be read by people, and more importantly, fed to automated monitoring tools. It also includes the ability to do analysis directly by comparing requests to a library of known attacks.\n\nJoin us as the project's Lead Developer, Ryan Boyle, guides us through the goals, features, and future direction of the project. For more details on the project, check out the OWASP Page: https://owasp.org/www-project-access-log-parser/\n\nSpecial thanks to the Rule4 Team for hosting and sponsoring, we couldn't do these events without our sponsors. If you're interested in sponsoring the #1 AppSec Organization and our Boulder Chapter meetings, please reach out to alex.brown@owasp.org.\n\nPlease follow us on LinkedIn: https://www.linkedin.com/company/owasp-boulder\n\nAnd join our Slack: https://join.slack.com/t/boulder-owasp/shared_invite/zt-2qnxnmmts-IQDaobNC1rcUbpaH1ip8Lg\n\n**AGENDA**\n6:00 - 6:30 Food, Drinks, Networking\n6:30 - 7:15ish Main Topic Presentation\n7:15ish - 7:30 Q&A and Discussion\n7:30 - 8:00 More Networking"
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Seguridad centrada en las personas - Como Concientizar INFOSEC",
        "date": "2025-06-19",
        "time": "20:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/308473582",
        "timezone": "America/Santiago",
        "description": "Seguridad centrada en las personas - Como Concientizar INFOSEC\n\nLa concientización en seguridad de la información, no es solo digital... a veces los errores más peligrosos pueden provenir del factor humano, una imagen o un papel.\nAnalizaremos estrategias preventivas, y casos reales como en la imagen, un error humano que filtra saldos y datos personales de otros clientes impresos en el reverso de un documento bancario.\nEste \"simple\" error siembra una duda legitima... si fallan en algo tan básico como imprimir un documento, ¿qué pasa con nuestros datos digitales?\n\n Por qué los errores humanos son el eslabón más débil\n Cómo reaccionar ante una filtración accidental\n Qué hacer para proteger tu información personal\n Lecciones de ciberseguridad desde el mundo físico\n\n#CiberSeguridad #PrivacidadDatos #InfoSec #SeguridadBancaria"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "The Dark Side of AI: Writing Insecure Apps in Minutes",
        "date": "2025-07-17",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/307693769",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Ox Security](https://www.ox.security/)**\n\nAI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments!\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP JUNE 24TH MEETUP",
        "date": "2025-06-24",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/308311700",
        "timezone": "America/Denver",
        "description": "Join us for community events, we’ll cover: what’s new with our OWASP chapter, trending OWASP projects you can jump into, and speaker topics you want to hear next.\n\nLooking forward to seeing everyone again!"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "The need for new methods to assure biomanufacturing processes",
        "date": "2025-06-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/306917658",
        "timezone": "America/New_York",
        "description": "In the true spirit of \"We changed the W from Web to Worldwide\" we have a talk that seems way out of the usual Application Security talk to discuss threats to bioinformatics and the manufacturing process. If you are thinking \"Wait, what does that have to do with application security, Bill?\" the answer is ... everything.\n\nThis talk outlines several challenges inherent to the biomanufacturing industry, such as the poorly understood and highly dynamic nature of biomanufacturing processes. Instruments critical to assessing quality and safety are described as among the least defensible apparatus humanity has ever built, leaving the sector exposed to adversarial threats. Despite recent progress in bioengineering, the explainability of these manufacturing processes is still built on fragile foundations.\n\nTo address these issues, Peter suggests moving away from flawed traditional methods of assessment and adopting physics-based probabilistic models, which offer better assurance and explainability. he emphasizes the importance of formal methods to ensure reliability and manage risks without completely rebuilding the system. Additionally, he advocates for accepting manageable risks and enhancing manufacturing trust through practical, science-based solutions."
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "OWASP Smart contract vulnerabilities - OWASP Cuddalore",
        "date": "2025-06-28",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-cuddalore-chapter/events/308207222",
        "timezone": "Asia/Kolkata",
        "description": "Join the **OWASP Cuddalore Chapter** for an insightful session on **OWASP Smart Contract Vulnerabilities**. This session will dive into key security challenges in smart contract development and showcase how OWASP standards can help mitigate risks in decentralized applications. Whether you're a developer, security enthusiast, or blockchain professional, this session will enhance your understanding of secure smart contract practices and real-world vulnerabilities.\nDon't miss the opportunity to engage with fellow professionals and strengthen your blockchain security knowledge!"
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP June  Meet - In person",
        "date": "2025-06-24",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/307980322",
        "timezone": "America/Chicago",
        "description": "Evolving Your AppSec Program in the Era of AI\n\nAI is already transforming how software is built—but for security teams, it’s mostly just making life harder. Developers are shipping AI-generated code at breakneck speed, while security teams struggle to keep up. The challenge isn’t just securing AI-generated code and systems—it’s evolving your AppSec program to keep pace with software development.We'll explore how security teams can evolve their programs across two key dimensions: securing AI-driven software development and using AI to enhance security workflows. You’ll learn:\n\n* Strategies for managing risks from AI-generated code and autonomous agents\n* How security teams can use AI to reduce work and improve security outcomes\n* Where AI can enhance security—and where human expertise remains irreplaceable.\n\nAI isn’t just a security challenge; it’s a chance to build a smarter, more efficient security program. Join us to learn how to make AI work for security, not against it."
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "The AI AppSec Nightmare - by Jerry Hoff",
        "date": "2025-06-25",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-delaware-chapter/events/308406032",
        "timezone": "America/New_York",
        "description": "An action packed meeting, with a real live (virtual) speaker!\n\n**AGENDA:**\n\n1. Delaware chapter business - the chapter needs you! Would you like to know more?\n2. The main event - \"**The AI AppSec Nightmare**\" Approx 1 hour including Q&A. How AI-powered attackers are finding and exploiting application security vulnerabilities faster than ever.\n3. Turbo CTF? Maybe hack\\* an AI thing.\n\n(\"Hack\" in this context means testing with permission in a safe environment. No bots will be harmed in this CTF. I, for one, welcome our new AI overlords.)\n\nThe meeting will be held in the library's computer lab to encourage people to get some hands-on web security testing experience. There will be a remote attendance option for those that cannot attend, or those that that prefer AI over IRL ."
    },
    {
        "group": "Gurugram",
        "repo": "www-chapter-gurugram",
        "name": "Protecting Your Web Applications: Best Practices in Web Security",
        "date": "2025-07-05",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/owasp-gurugram-chapter/events/308503571",
        "timezone": "Asia/Kolkata",
        "description": "Join us at the OWASP Gurugram Chapter event where we will dive deep into the best practices for incorporating cybersecurity into software development processes. Our expert speakers will cover topics such as cloud security, computer security, information security, application security, and software security. Learn how to effectively secure your applications, protect your networks, and defend against cyber threats. Whether you're a developer, security professional, or IT enthusiast, this event will provide valuable insights and practical tips to enhance your software security skills. Don't miss this opportunity to network with peers, ask questions, and stay updated on the latest trends in cybersecurity."
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2025",
        "date": "2025-06-19",
        "time": "14:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/307102067",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy will host the next OWASP Italy Day 2025 on June 19th. It will be a full-day event dedicated to application security (AppSec)!\n\n#### **OWASP Italy Day 2025 will take place at Cagliari.** This is a free, one-day, informal event aimed at increasing awareness and knowledge of web application security. **Reserve your seat here:**\n\nhttps://cyberjourney.it/\n\nThe event is primarily intended to appeal to security professionals, software developers, software quality engineers, and computer science students with a strong interest in computer security.\n\n### **PROGRAM**\n\nThe event will take place next 19th June from 4 PM to 22 PM (Italian time). We are working on the program at the moment.\n\n#### **Seba and Martin will be our Keynotes speakers!**\n\n#### \\- Sebastien Deleersnyder\n\nCo\\-founder & CTO at Toreon \\| COO & trainer at DPI \\| whiteboard hacking trainer at Black Hat\n\n#### \\- Martin Knobloch\\, VP Security Engineering at Valtech\\.com\n\nMartin has locally and globally been contributing to various projects and co-organized OWASP AppSec conferences. He served more than 5 years as a member of the Board of Directors, two of them as Chairmen of the board.\n\n### Call For Papers:\n\nPlease submit your idea here:\n[https://sessionize.com/owasp-italy-day-2025-cfs](https://sessionize.com/owasp-italy-day-2025-cfs)\n\n### Call For Sponsorships:\n\n[https://github.com/OWASP/www-chapter-italy/blob/59f792a77ba0a8e8131aa5e4e6a98cb75d595d38/assets/images/2025%20OWASP%20Italy%20Day%20Sponsorship.pdf](https://github.com/OWASP/www-chapter-italy/blob/59f792a77ba0a8e8131aa5e4e6a98cb75d595d38/assets/images/2025%20OWASP%20Italy%20Day%20Sponsorship.pdf)\n\nReserve your seat:\n**[https://cyberjourney.it](https://cyberjourney.it/#)**\n\n#### Why Sponsor OWASP Italy Day 2025?\n\nBrand Visibility: As a sponsor, your brand will be prominently displayed before, during, and after the event. This includes logo placement in event materials, promotional content, and key areas at the venue. Enhance your brand recognition within the cybersecurity and developer communities.\nCommunity Engagement: Engaging with the OWASP community puts your company in the spotlight as a leader in supporting open software and security advancements. This event will provide you with the opportunity to network with industry leaders and cybersecurity professionals, offering a chance to build relationships and share your company’s expertise and solutions.\nLead Generation: With hundreds of attendees from various sectors, sponsoring OWASP Italy Day 2025 gives you direct access to potential clients and customers. The event will provide a focused audience interested in cybersecurity solutions, products, and training.\n\nEvent official site:\nhttps://owasp.org/www-chapter-italy/events/OWASPItalyDay2025-06-19"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Ready, Set, Go: Explorando Condições de Corrida em Golang",
        "date": "2025-07-03",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/308137107",
        "timezone": "America/Fortaleza",
        "description": "Em um mundo onde concorrência e paralelismo são essenciais para desempenho e eficiência, nem sempre chegar em primeiro é garantia de vitória. Race conditions, ou condições de corrida, podem transformar um código aparentemente saudável em uma verdadeira corrida maluca, cheia de resultados imprevisíveis, bugs intermitentes e noites mal dormidas.\nNesta palestra dinâmica e prática, vamos acelerar pelo universo das aplicações concorrentes em Go, identificando os perigos escondidos em acessos simultâneos a recursos compartilhados. Você aprenderá como detectar essas situações problemáticas, compreender suas causas e formas de evitá-las."
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Não adivinhe, modele",
        "date": "2025-06-30",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/308414636",
        "timezone": "America/Fortaleza",
        "description": "**MEETUP ONLINE**\n\nNesta talk, vamos explorar como a modelagem de ameaças pode transformar sua abordagem de segurança, permitindo que você pense como um atacante, identifique riscos antes que eles sejam explorados e tome decisões embasadas para fortalecer seus sistemas."
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2025-06-26",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/308459321",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted by Thought Machine and sponsored by Phoenix Security. There is limited seating available for in-person attendees. Registration required.**\n**This event will be also be live-streamed on YouTube.**\n**Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Thought Machine, 7 Herbrand St, London WC1N 1EX\n**Nearest Tube:** Russell Square (Piccadilly Line) - 2 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS**\n\n* **OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n* **\"You secured your code dependencies, is that enough?\"** \\- Anant Shrivastava\n* **\"AI-Second Threat Centric Agentic Approach on Vulnerabilities\"** \\- Francesco Cipollone\n\n**TALK ABSTRACTS**\n\n**You secured your code dependencies, is that enough?**\nSupply Chain security is a new buzzword for past 2-3 years, the dust is slowly settling and we are now in the phase we people need to evaluate what is going right and what is going wrong.Large number of organizations, introduced SCA tooling and SBoM creation tooling and called it the day. Has that helped? What has been going on in the world of supply chain security.In this talk we will explore the Supply chain security not just from a code base dependency prospective but rather wholistic approach to establishing the right controls in the system for a seamless software delivery.Software supply chain security concerns not just the product organizations creating software of external or internal usage but also for organizations that may be just using the final product as an end user.From your development environment to production, from downloading binaries from internet to running them on network machines we will explore the 360 degree view of supply chain security, the relevant case studies around the exploitation and what is it that industry or Govt bodies have done towards protecting people or organizations against such attacks.Audience will leave with a holistic view of how the full supply chain of the software development looks like and thoughts on what are the possible gaps in security they might have in their organizations.\n\n**AI Second – Threat Centric Agentic approach on Vulnerabilities**\n**\\- Because terrible data in \\-\\> terrible data out – just prettier**\n\nThe application of AI agents in cybersecurity has evolved beyond simple automation tools, becoming powerful systems capable of understanding complex contexts and deriving actionable insights. This talk explores the use of AI agents, specifically retrained models in collaboration with tools like Google Gemini, to accurately identify threats, assess their impact, and determine threat actor involvement.\nCybersecurity teams face the challenge of managing disparate security domains—application security vulnerabilities often exist separately from infrastructure security concerns. This division often leads to fragmented efforts, where one team focuses on threat actor profiling using frameworks like MITRE ATT&CK, while another addresses development processes through appsec best practices. CISOs, in particular, struggle to reconcile these differences into cohesive metrics and strategies.\nAs organizations adopt cloud environments and containerization, a new divide emerges between development teams and security operations. Both groups play critical roles in the overall cybersecurity posture but often fail to collaborate effectively. The friction stems from the lack of a unified view that integrates threat intelligence, vulnerability management, and application security.\nThis session proposes an integrated, threat-centric approach that unifies these domains through the application of AI agents. By using real-world, context-aware agents to analyze threats, we can customize models to detect vulnerabilities with high accuracy, determine the likelihood of exploitation, and assess the potential impact. These agents are retrained to continuously adapt and improve their understanding of threat landscapes, including sophisticated threats like ransomware.\n\n**SPEAKERS**\n\n**Anant Shrivastava** is a highly experienced information security professional with over 15 years of corporate experience. He is a frequent speaker and trainer at international conferences, and is the founder of Cyfinoid Research, a cyber security research firm. He leads open source projects such as Tamer Platform and CodeVigilant, and is actively involved in information security communities such as null, OWASP and various bsides and defcon groups.\n\n**Francesco Cipollone** is a renowned entrepreneur and CISO, founder of Phoenix Security, an ASPM platform offering actionable, contextual code-to-runtime insights. A multi-award-winning podcast host, author, and global speaker, Francesco is known for his visionary contributions to cybersecurity. He serves on the UK&I Cloud Security Alliance Chapter board and is a faculty member at IANS on application and cloud security. His insights have appeared in Forbes, Helpnet Security, and Hacker Noon, and he has been featured in prominent podcasts like Application Security Weekly and Cloud Security Podcast. Francesco has keynoted at major conferences such as AppSec Cali and Cyber Security & Cloud Expo, and previously led application and cloud security at HSBC and served as Senior Security Consultant at AWS. An avid marathon runner, snowboarder, and whiskey enthusiast, Francesco balances his professional accomplishments with a passion for adventure and fine spirits.\n\n**TICKETS**\n\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security - your name will be checked against the registered attendee list!\n\n**CODE OF CONDUCT**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Jun 25, 2025",
        "date": "2025-06-25",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091954",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** The End of Mobile Security Complacency: DMA, Antitrust, and the Rise of Real API Protection\nJoin us for great networking, dinner and drinks, and see a presentation by **Ted Miracco,** CEO, **Approov**\n\n**ABSTRACT:**\nThe security landscape for mobile applications is being redrawn. The EU’s Digital Markets Act (DMA) and landmark legal decisions against Apple’s app store practices are ushering in a new era of mobile security transparency and accountability. At the same time, reports like *Dark Reading’s “Mobile Applications Are a Cesspool of Security Issues”* expose the urgent need for serious mobile app and API protection strategies.\nThis talk uncovers the hidden risks of platform monocultures and challenges Apple and Google’s claim that built-in security is sufficient. It offers a practical roadmap for implementing app attestation, runtime protection, and secure API communication to counteract threats such as API scraping, bot automation, credential abuse, and tampered client applications.\nWe'll dissect recent changes in regulation and litigation and explain why OWASP professionals must lead the charge in adopting more resilient, open, and developer-driven mobile security practices.\nLearning Objectives:\n\n* Understand the regulatory and legal catalysts reshaping mobile app security.\n* Learn how API attacks exploit mobile app weaknesses, despite “built-in” platform defenses.\n* Evaluate tools and frameworks, including app attestation and RASP, that enable secure API communication.\n* Gain insights into how to implement dynamic secrets, certificate pinning, and secure client validation.\n* Explore why monopolistic behaviors hinder innovation and what OWASP chapters can do about it.\n\n**Thanks to our SPONSOR**: *[Approov](https://approov.io/)*\n*Regain Control of Your Mobile App Security.*\n*Approov is a team of passionate developers dedicated to making the future of mobile secure. With focus on developing the world’s most complete end-to-end solution for mobile app security from the device into the cloud, our solutions are used worldwide to secure mobile apps and their APIs in everything from automotive, financial services, healthcare to e-commerce, gaming and media.*\n\n**Thanks to our HOST**: *[Accenture](https://www.accenture.com/us-en)*\n*Every day, we embrace change and create value for all our stakeholders around the world.*\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "DON’T PANIC (or do): an OWASP Guide to Incident Response",
        "date": "2025-06-24",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/307735142",
        "timezone": "Europe/London",
        "description": "Hello & Welcome!\n\nWe're talking all things incident response in the OWASP Manchester June meeting.\n\n**ID Policy**\nAll attendees must provide their full name when registering, and must bring photo ID to the event. The registered name has to match the ID.\n\n**Attendee Policy**\nTo reduce the number of no-shows, we now require all attendees to confirm attendance a week before the event.\n\n**Please monitor your MeetUp messages.**\n\nWe’ll message you roughly a week before the event asking for you to confirm your attendance using a key word. You must reply with the key word to be added to the venues entry list and you must bring ID on the day.\n\nSpaces will then be allocated on a first to respond basis, so are not guaranteed by signing up here.\n\n**To confirm that you have read and understood this policy, please enter \"assurance\" in the relevant question when you sign up.**\n\n—————————————\n\n**6:00 - Open doors & networking & drinks**\n\n**6:30 - Heather Lowrie - When the Worst Happens: Lessons in Resilience from a Major Attack**\nAs cyber threats grow in scale and sophistication, no sector is immune. From retail and education to healthcare and finance, organisations are increasingly targeted by ransomware, data breaches, and extortion campaigns. In this session, Heather Lowrie shares real-world insights from leading responses to major cyber incidents, offering a rare, behind-the-scenes perspective from the CISO’s seat. She explores the real-time decision-making, technical challenges, and stakeholder dynamics that define high-pressure incident response. Drawing on cross-sector experience, Heather outlines critical lessons for building resilience in 2025 and ensuring continuity amid significant disruption.\n\n**7:15 - Refreshments (Food & Drinks & Networking)**\n\n**8:00 - Tim Rawlins** **\\- The Rumsfeld Score of Cyber Resilience**\nTim will look at the \"Rumsfeld Score of Cyber Resilience\" as he walks us through war stories from organisations facing up to significant cyber incidents, including the ransomware attacks on the British Library and others.\n\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJaguar Land Rover\nNeo Building\nFaulkner Street\nM1 4ET\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Heather Lowrie**\nHeather Lowrie is the founder of Resilionix, a deep-tech startup that helps organizations strengthen their resilience. An accomplished leader in cybersecurity, technology, risk, and resilience. Heather has a distinguished career with board-level and CISO experience across both public and private sectors. She serves as a strategic advisor to boards and executive teams, helping them navigate the complexities of modern digital landscapes and implement innovative solutions for enhanced security and resilience.\nA Fellow of the Chartered Institute of Information Security, she was also recognised as the 2024 “CISO of the Year” at SC Awards Europe.\n\n**Tim Rawlins**\nTim is a Director and Senior Adviser at NCC Group, where he works closely with Boards, executives, and senior leadership teams to address business risk and enhance operational resilience.\nTim is a trusted adviser to senior management teams during major crisis events, offering real-time support and direction. He also leads executive-level Gold Team crisis management exercises, preparing clients to navigate the complexities of resilience challenges. Additionally, Tim supports NCC Group's global Public Affairs and Public Relations initiatives, strengthening the organisation’s external positioning and stakeholder engagement.\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**JLR** \\- Venue Sponsor\n**Cytix** \\- Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - [https://forms.gle/zcm9bVNhgDixe8Gq5](https://forms.gle/zcm9bVNhgDixe8Gq5)\n\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - [paul.johnston@owasp.org](http://paul.johnston@owasp.org)"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - July 2025 Meetup",
        "date": "2025-07-02",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/308228928",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nIt was great to see new faces last month. Thank you to those that attended.\n\nIn our last meetup, attendees voted for [Royal Stacks Bourke Street](https://www.royalstacks.com.au/) as our location for next month. On 2nd July 2025 6PM, there we shall meet.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic. )*\n\n**Please remember to update your RSVP if you can no longer attend.** Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get. We will take note of no-shows, and to make sure we've got space for those that do actually attend, your RSVP may be deprioritised for future events.\n\n**If you're having trouble finding us**, send a message to [Dan on Signal](https://signal.me/#eu/4yti0PmJCFvXhLH_vmLcxO7Xy3VAM_yY9wRhOQCA1qn7UqWh1nFBa4rNCccfHyhW).\n\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is[ inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics. *You are expected to participate in the AppSec/ProdSec conversations constructively if you attend*. This isn't the place for BizDev focused conversations.\n\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there."
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "June meetup: The Dark side of AI",
        "date": "2025-06-25",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/307827448",
        "timezone": "America/Chicago",
        "description": "**Chris Lindsey, Field CTO, OX Security**\n**The Dark side of AI: Developing unsecure applications in minutes!**\n\nFor June's talk, we welcome Chris Lindsey. AI is the ultimate accelerant for application development -- it's power unmatched -- but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session by playing with fire. Using ChatGPT-driven prompts, we'll build a fully functional application, and in real time we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security.\n\nApproximate agenda:\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nPlease remember to register and keep your registration up to date so we know how many to expect."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle July 2025",
        "date": "2025-07-02",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/308113161",
        "timezone": "Europe/London",
        "description": "We're back with our second event of 2025! We’ll be doing our usual two talks and pizza format although the break will be shorter this time to accomodate the earlier finish time of 20:00.\n\nLocation: Grainger Hub, Maybrook House, 27 Grainger Street, Newcastle upon Tyne. NE1 5JE.\n\nRough schedule:\n18:00 - 18:15 - Arrival and networking\n18:15 - 18:20 - OWASP Intro & Welcome\n18:20 - 20:00 - TBC\n20:00 onwards - Pub!!!!!!!!!!!!!!!!!!!!!!\n\nTalk overviews:\n\nTalk one\n**Title:** TBC\n**Speaker:** TBC\n**Speaker Bio:** TBC\n**Talk Synopsis:** TBC\n\nTalk two\n**Title:** TBC\n**Speaker:** TBC\n**Speaker Bio:** TBC\n**Talk Synopsis:** TBC\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Charters Summer Bash! ",
        "date": "2025-06-26",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916129",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Social Drinks @ Charter Bar!\n\n**When?**\n\n* \\- Thursday 26th June\n\nEverybody welcome! The sun should be out and shining.\nThank you,\nRyan & Mark"
    },
    {
        "group": "Ruhrpott",
        "repo": "www-chapter-ruhrpott",
        "name": "OWASP Top 10 Infrastructure Security Risks & ToDo",
        "date": "2025-07-03",
        "time": "18:30+02:00",
        "link": "https://www.meetup.com/owasp-ruhrpott-chapter/events/308480421",
        "timezone": "Europe/Berlin",
        "description": "Wir laden ein zum nächsten Treffen des OWASP Ruhrpott Chapters.\nDas Treffen findet am 03.07.2025, ab 18:30 Uhr an der Ruhr-Universität Bochum Universitätsstr. 150, Gebäude ID, Raum 03/471 statt.\n\n**Was euch erwartet**\n\n* Vorstellung der OWASP Top 10 Infrastructure Security Risks\n* Vortrag zu ToDo\n\nIm Anschluss besteht erneut die Möglichkeit in umliegende Lokalitäten zu wechseln für gesellige Gespräche.\n\n**Für wen ist das Treffen geeignet?**\nDas OWASP Chapter-Treffen richtet sich an alle, die sich mit dem Thema IT-Sicherheit beschäftigen – unabhängig von Branche oder Erfahrungsstand. Ob im Bereich Offensive Security, Defensive Security, Incident Response, Softwareentwicklung oder Security-Architektur: Wer sich für sichere Systeme, aktuelle Bedrohungen und Schwachstellen interessiert, ist hier genau richtig. Das Treffen bietet eine gute Gelegenheit zum Wissensaustausch, Networking und zur Diskussion aktueller Sicherheitsthemen.\n\n**Weitere Informationen**\nIhr findet weitere Informationen über uns unter [https://owasp.org/www-chapter-ruhrpott/](https://owasp.org/www-chapter-ruhrpott/)"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Balance Security & Scalability while enabling a high growth, fast paced business",
        "date": "2025-07-16",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/308482201",
        "timezone": "America/Denver",
        "description": "Join us as Ty Ravsten, the Director of DevOps and Security at Nectar, talks to us about how to balance scalability and security while enabling the business to move fast!\n\nVirtual meeting this month. We will meet together in August at our annual campout!\n\nZoom info to be updated soon."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-07-09",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306142423",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": " OWASP Seoul Chapter 6 :   ",
        "date": "2025-06-24",
        "time": "19:00+09:00",
        "link": "https://www.meetup.com/owasp-seoul/events/308298793",
        "timezone": "Asia/Seoul",
        "description": " OWASP Seoul Chapter 2025 6   !\n\n 6 OWASP                .    .\n\n  \n***     ***\n\n* OWASP Foundation  Seoul Chapter \n* OWASP   \n\n *#1: **  :  CISO   ***\n‍ Yashvier Kosaraju - Sendbird CISO\n       .     (CISO) ,      ,          .\n CISO     .   CISO   ,  ,     ,             .           ,          .\n(   , [Cuckoo](https://www.cuckoo.so/)   AI    .)\n\n *#2: **SECURITY CAREER EVOLUTION: 19   ***\n‍  - AWS Sr. Security Consultant\n   19   .   ,    ,      Next  .\n\n  \n\n*  : 2025 6 24() 19:00 \\~ 21:00 (KST)\n*  :   6(   551 ) [https://naver.me/502MT5HC](https://naver.me/502MT5HC) (     )\n*  : \n\n OWASP Seoul Chapter   \n        OWASP Slack   .\n\n*     : [https://open.kakao.com/o/gS5IxXxh](https://open.kakao.com/o/gS5IxXxh)\n* OWASP Slack    ([https://owasp.org/slack/invite](https://owasp.org/slack/invite))   ,   (#chapter-Seoul) .\n\n    \nOWASP         .     seongjin.hong@owasp.org        ."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-July Lunch and Learn",
        "date": "2025-07-18",
        "time": "11:15-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/308270253",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-July Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\n* 11:15am - Registration and Lunch\n* 12:00pm - Speaker - Mic McCully - Deep Application Inspection\n* 1:15pm - Depart\n\n**Speaker**:\nMic McCully is currently Field CTO at Oligo Security and the former Field CTO at Snyk. His background spans over 30 years in the software industry and 20 years of that focused in the security space. Mic’s background in security spans across multiple disciplines including SAST and DAST in the application security space, network security leveraging anomaly based detection, data level security leveraging digital rights management, mobile security leveraging proactive attack detection and most recently developer focused security enabling organizations to scale and address modern cloud native application security concerns. This diverse background has given him an appreciation for the multitude of risks and competing priorities facing organizations today.\n\n**Abstract**:\nDeep Application Inspection - a very specific type of runtime, a nonintrusive, lightweight way to observe applications in realtime to observe realtime behavior and attacks as well as provide mitigating controls inside the app. If you’re tired of proactively spending countless hours trying to find and fix issues before an application is released just to find out the majority of the issues you focused on posed no real security risk or after the application is deployed, waiting for a successful exploitation by an attacker to trigger some reactive scramble to seeing what happened, join us to learn about a new technology providing a layer of visibility not previously available.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W\nSTE 600\nTampa, FL 33607\n\n**Sponsors**:\noligo security \\| [oligosecurity.io](https://www.oligo.security/)"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Secure Code Training Tournament",
        "date": "2025-07-17",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510713",
        "timezone": "America/Vancouver",
        "description": "Join us for a hands-on **Secure Code Training Tournament** hosted by OWASP Vancouver and powered by **Security Journey**. Whether you’re a seasoned AppSec pro or just getting started, this interactive tournament will challenge your secure coding skills across multiple languages in a gamified environment. Participants will tackle real-world vulnerabilities, compete on a live leaderboard, and gain valuable insight into modern software security best practices.\n\nExpect prizes, bragging rights, and some light-hearted competition—all while leveling up your AppSec game.\n\n**Note:** In-person participants must bring their own laptop to access the tournament."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "The Secret Life of Malicious Packages & Malicious Package Detection Engineering",
        "date": "2025-06-19",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510655",
        "timezone": "America/Vancouver",
        "description": "**The Secret Life of Malicious Packages** with **Megg Sage**\n\nSupply chain security has been all the rage recently—we keep hearing story after story about malicious packages popping up across various package repositories. This talk dives into the secret life of malicious packages: what they are, where they lurk, how they operate, and the many creative ways they can wreak havoc. From innocent-seeming typosquats to the compromise of trusted, widely-used packages, we’ll explore the full spectrum of threats and real-world examples that show just how sneaky (and dangerous) these packages can be.\n\nSo how can we protect ourselves from these threats? There are various options such as checking package health, source code reviews/scans, or use of tooling such as SCA tools. SCA scans, while very useful for vulnerability scanning, cannot be relied upon to protect against malicious packages. This talk will discuss their blind spots and other options for adding further protection. It will further reinforce that security should always take a multi-layered approach.\n\n**About our speaker**\nI'm an application security engineer who started out as a web developer. Security drew me in with the endless puzzles and challenges put forth by the field. I love sharing knowledge, particularly when I can both educate and horrify my audience at the same time. After all, what can happen when security goes wrong is pretty scary. I also enjoy working closely with software engineering teams to try to make security work within existing development practices, or at least try to minimize how painful \"doing security\" can be. When not behind a computer, I can usually be found making some sort of costume piece or shiny object.\n\n============\n\n**Introducing malicious package detection engineering** with **Paul McCarty**\n\nAs software supply chain attacks continue to rise in frequency and sophistication, it is crucial for security professionals to adapt their processes to address these threats effectively. One way to do this is to build a detection engineering practice to identify malicious packages as well as identify the threat indicators in those packages. In this talk, we'll examine real detection strategies, covering traditional IOCs like IP addresses and domains found in package-based malware, while also exploring package-specific indicators. Attendees will learn practical approaches to distinguish between accidentally vulnerable code and purposefully malicious packages.\n\n**Paul** is the Head of Research at Safety (safetycli.com) and a DevSecOps OG. He loves software supply chain research and delivering supply chain offensive security training and engagements. He's spent the last two years deep-diving into npm and has made several discoveries about the ecosystem. Paul founded multiple startups starting in the '90s, with UtahConnect, SecureStack in 2017, and SourceCodeRED in 2023. Paul has worked for NASA, Boeing, Blue Cross/Blue Shield, John Deere, the US military, the Australian government and several startups over the last 30 years. Paul is a frequent open-source contributor and author of several DevSecOps, software supply chain and threat modelling projects. He’s currently writing a book entitled “Hacking NPM”, and when he’s not doing that, he’s snowboarding with his wife and 3 amazing kids.\n\n**We would like to thank [Forward Security](https://forwardsecurity.com/) for sponsoring this event.**"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | AI-Driven Testing & Quantum Security",
        "date": "2025-06-19",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/307842872",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter invites you to an in-person application-security meetup on June 19, 2025, from 5:30 PM to 8:00 PM at the University of Victoria. Spend the evening exploring the newest trends and proven practices shaping today’s cybersecurity landscape.\n\nWe’re thrilled to feature two live talks: Roberto Salgado will share “Pentesting with AI,” revealing how generative tools are reshaping offensive security, and Kyle Loree will present “Quantum and What You Need to Know,” examining quantum computing and its real-world implications for cybersecurity. Whether you’re a veteran security professional or just beginning your journey, you will leave equipped with tangible insights to elevate your security efforts.\n\nBeyond the presentations, the agenda leaves plenty of room for conversation and collaboration. Meet peers, trade ideas with industry leaders, and compare notes on the tools and techniques that keep organizations safe in an ever-evolving threat environment.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in cybersecurity. If you would like to attend, please click the RSVP button to reserve your spot, as we have limited seats available."
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "AISVS: A Developer-Centric Standard for Securing AI Applications",
        "date": "2025-07-16",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/307914301",
        "timezone": "America/New_York",
        "description": "**Abstract:**\nAs artificial intelligence systems become integrated into mainstream applications, their attack surface expands dramatically—introducing new threats and compounding existing vulnerabilities. The **OWASP Artificial Intelligence Security Verification Standard (AISVS)** is a new community-driven project designed to define **clear, actionable security requirements** for developers, architects, and testers building AI-enabled software.\n\nIn this session, OWASP leader and security educator **Jim Manico** will introduce AISVS 1.0, walk through its structure and key categories, and explain how it complements traditional application security standards like ASVS. You’ll learn:\n\n* Why we need AISVS: the unique threats AI systems face\n* The structure and scope of AISVS and how it supports different security assurance levels\n* Key controls across AI data governance, model development, and deployment\n* How AISVS integrates with NIST AI RMF, ISO/IEC 42001, and the OWASP LLM Top 10\n* How to start using AISVS in your organization today\n\nWhether you're building AI-driven apps, managing security risk for machine learning models, or curious about adversarial ML and secure prompt engineering—this talk will equip you with the foundation to develop and verify **secure and trustworthy AI systems.**\n\n**Target Audience:**\nDevelopers, AppSec professionals, DevOps teams, AI/ML engineers, and anyone interested in the future of secure software development."
    }
]