[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - Virtual - November",
        "date": "2023-11-21",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/296374615",
        "timezone": "Europe/Copenhagen",
        "description": "Notice that this is a virtual event running on Zoom. Please reach out if the event gets packed, and I will add room for more people.\n\n**Agenda:**\n19:00 - 19:10 – \"Welcome\" by OWASP Chapter Aarhus\n19:10 - 19:55 – Liz Keogh – Value Streams are Made of People\n19:55 – 20:05 – Short break\n20:05 – 20:55 – Simon Bennetts – Introduction to ZAP\n**About Liz Keogh:**\nLiz Keogh is an influential developer and Agile Coach based in London. She is a well-known blogger and international speaker, a core member of the BDD community and a passionate advocate of the Cynefin framework and of Wardley Mapping.\nLiz has over 20 years’ experience in delivering and coaching others to deliver software, from small start-ups to global enterprises. She enjoys coding, has written several automation libraries, and extensively contributed to the BDD framework, JBehave. She particularly loves helping people fulfill their potential, using transparency, positive language, well-formed outcomes and safe-to-fail experiments in making change innovative, easy and fun. She specializes in pragmatic Agile methods that build on existing personal and organizational strengths.\nThe rest of her time is spent gardening, gaming, making sourdough bread, and rebelling against the Climate Crisis.\n**About her presentation: Value Streams are Made of People**\nFor millenia, human beings have survived by learning, then applying our learning to different contexts. We’re so good at it that we’re driven to find those patterns, even when they don’t exist. Our desire for the predictable suffuses everything we do!\n\nIn Lean Production, mapping value streams can help us find, and eliminate, sources of unpredictability. Software Development though is not like a factory, building the same thing over and over again. In this talk we look at how to embrace the unpredictability inherent to innovation, making value streams out of the people involved in them: not from the sum of their parts, but from the product of their relationships.\n**About Simon Bennetts:**\nSimon Bennetts is the Zed Attack Proxy (ZAP) Founder and Project Leader, and works full time on ZAP thanks to the Software Security Project.\n\nHe has talked about and demonstrated ZAP at conferences all over the world, including Blackhat, JavaOne, FOSDEM and OWASP AppSec EU, USA & AsiaPac.\n\nPrior to making the move into security he was a developer for 25 years and strongly believes that\nyou cannot build secure web applications without knowing how to attack them."
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 25 November 2023 ",
        "date": "2023-11-25",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/297194585",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 25 November 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* Reconnaissance techniques by **Nimish Dudhe**\n* Dissecting stealer malware by **Pavan Karthick M**\n* Snapshot fuzzing with WTF(what the fuzz) by **Micky Thongam**\n* USing DArk Web to strengthen your Security skills by **Mudit Bansal**\n* Automation testing for complex API scenarios using ATOR by **Suchith Narayan**\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BeNeLux Days 2023",
        "date": "2023-11-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/296033531",
        "timezone": "Europe/Brussels",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2023\" edition on November 23rd-24th in Hasselt, Belgium. \n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Bham November Meetup!",
        "date": "2023-11-16",
        "time": "8:00Z",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/296510816",
        "timezone": "Europe/London",
        "description": "Greetings OWASP Birmingham members!\n\nWe are excited to announce our second Meetup of 2023 on Thursday, November 16th once again at Hays in One Colmore Square.\n\nThis in-person Meetup will feature two fantastic infosec talks from our knowledgeable speakers.\n\n5.45pm - Doors open\n6.15pm - Welcome and Food\n6.30pm - TALK #1 \"Social engineering adventures of a pentester\"\n\nSpeaker: Tirath Rai\nSynopsis : This is about my experience of performing social engineering (SE) assessments as a pentester who is no expert on the subject of performing physical work.\nI volunteered to be pushed in at the deep end on an SE job and had to learn quickly which was a little scary. I hope there will be something useful you take away from the talk, whatever your interest in security relates to.\n\n7.00pm - Break\n7.15pm - TALK #2 \"The art of secure software: Zero-trust delivery pipelines\"\nSpeaker: Jim Gumbley\nSynopsis: Jim will delve into the world of zero-trust delivery pipelines and present a secure architecture for deployment pipelines in the cloud, combining not only effective vulnerability management but also robust protection from penetration by attackers.\n\n7.45pm - Questions/Any Other Business\n8.00pm - Close\n\nRSVP when you get a chance so we can plan accordingly. We look forward to catching up with you all next month!"
    },
    {
        "group": "Bolivia",
        "repo": "www-chapter-bolivia",
        "name": "OWASP DAY-BO 1",
        "date": "2023-11-18",
        "time": "5:00-04:00",
        "link": "https://www.meetup.com/owasp-bolivia-meetup-group/events/297185993",
        "timezone": "America/La_Paz",
        "description": "El capítulo OWASP Bolivia te invita a participar de la primera reunion del año. HORAS: 15:00 No te lo pierdas, si deseas ser parte del foro de expositores escríbenos al correo elvin.mollinedo@owasp.org o al correo roxana.calderon@owasp.org\n\n## ¿Como puedo participar?\n\nCualquier persona con criterio de seguridad y tecnología puede participar, estudiantes, docentes, profesionales todos somos iguales dentro de nuestra comunidad, nadie es más ni menos jerárquico en nuestra comunidad."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Exploring CTF creation",
        "date": "2023-11-16",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/297107209",
        "timezone": "Australia/Brisbane",
        "description": "Capture the Flag (CTF) competitions are held globally, and are in constant need for new participants to help build them. In this discussion: Explore CTF creation, Aaron Burrows and Jake Dunn will discuss CTF challenge types: services, web apps, binary, video games, and infrastructure, and ideas to get your next challenge written."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "November Meetup - Threat modelling",
        "date": "2023-11-28",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/296990209",
        "timezone": "Europe/London",
        "description": "Robin Fewster is going to start with a talk on **Threat modelling**,\n\nAfter the break, we will have a semi-structured **discussion** on **Threat Modeling in Practice**. the intention is to draw on the experiences of everyone in the room to learn more about the subject.\n\n\\-\\-\\-\n\nDrawing on some client experiences, Robin will discuss different threat modelling approaches and tools available, and how they went down with development teams.\n\nRobin Fewster has spent the last 21 years working in cyber security. His current role is Senior Security Testing Manager at Hargreaves Lansdown. Robin has spoken at various OWASP chapter events over the years, and used to be a chapter leader for OWASP Newcastle. Current interests are application security, specifically AI and threat modeling."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Every risk is not a CVE - Bolster up against software supply chain attacks",
        "date": "2023-11-16",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295118628",
        "timezone": "America/New_York",
        "description": "3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\n\nWe will present a comprehensive, comprehensible and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy, available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\n\nMantium AI will be providing snax."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A night of Backdoors & Breaches with a virtual touch of John Strand",
        "date": "2023-12-05",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/297344292",
        "timezone": "Europe/Copenhagen",
        "description": "*Following our return from hibernation in September, OWASP Copenhagen invites you, to join us for a night of Backdoors & Breaches!*\n\nJohn Strand from Black Hills Information Security (BHIS) will join us online and tell us about their incident response game; Backdoors & Breaches, why you should use it and how it can help you raise awareness among your peers\n\nAfterwards Jon Bevers (also from BHIS) will show us how to play Backdoors & Breaches. Jon will also join us online.\n\nJon is one of BHIS' European community ambassadors and travels Europe from his home in Krakow, Poland. Jon was in Copenhagen recently as part of BSides København where he also had the opportunity to talk to you about Backboors & Breaches and he might even have given you a deck already. If not, fear not as we will have plenty of decks to share with you (and keep).\n\nAfter the talk and demo from John and Jon it's time for pizza, drinks and the opportunity to get some hands on experience and try to game for yourself.\n\nWe hope to see you there!"
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Dorset November In Person Meetup",
        "date": "2023-11-29",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/297354538",
        "timezone": "Europe/London",
        "description": "OWASP Dorset are proud to bring out latest in-person event, hosted with Hays Recruitment Bournemouth.\n\nThis time, we bring you talks from 4 different speakers!\n\n**Talks**\n\n**Shruti Kulkarni**\nWe live in a \"speed-to-market\" era. Including security controls in applications sometimes may be considered an overhead. However, if security controls are not added to applications during development, it may be challenging to add them later on. In this presentation, we will see how code can be written insecurely and really how simple it is to include the required security controls in the application.\n\nShruti is a cyber security / enterprise security architect with experience in ISO27001, PCI-DSS, policies, standards, security tools, threat modelling, risk assessments. Shruti works on security strategies and collaborates with cross-functional groups to implement information security controls in software development life-cycle, service operations, service delivery such that security controls support business requirements.\n\n**Ross Brown of the SWCRC (South West Cyber Resilience Centre)**\nI am a retired Detective officer who during my service carried out numerous roles, although primarily operating within mainstream Criminal investigations. As a trainer with Dorset Police I led a team who implemented training for a new force wide Records Management System as well as devising and writing the supervisors course. During a number of career breaks I have experience of running large scale engineering projects in the middle east.\n\nI joined the South West Cyber Resilience Centre as a Detective Inspector and head of cyber and innovation and served in that post until my retirement. I have subsequently taken on the same role as a member of Police staff.\n\nThe Cyber Resilience Centre for the South West supports and helps protect SMEs and supply chain businesses and third sector organisations in the region against cyber crime.\nWorking with local Universities and Police forces in the South West provides access to the latest local as well as national information on emerging cyber threats, criminal trends, best practice for cyber resilience and new technology to provide timely advice to prepare and protect business.\n\n**James Walsh**\nJames Walsh of Hays recruitment will be giving us an insight into the latest salary guide for the cyber security industry.\n\n**Dylan Collins**\n\"A system's biggest vulnerability is the user. With frequent software patches becoming more and more necessary to maintain security standards, does the urge to protect a system actually make people more exposed? Naïve users jumping at sudden update prompts may be jumping through hoops for an attacker.\" - A research question from local software developer, Dylan Collins.\n\n**Event and Venue**\nWe will be joining Hays Recruitment in Bournemouth for this event, there is a limit on numbers, so signup is essential. Names will be required upon arrival to enter the building.\n\nThere will be food and drink provided for this event, so please let us know of any dietary requirements or allergies."
    },
    {
        "group": "Fortaleza",
        "repo": "www-chapter-fortaleza",
        "name": "OWASP Fortaleza - Meetup da Comunidade",
        "date": "2023-11-18",
        "time": "8:30-03:00",
        "link": "https://www.meetup.com/owasp-fortaleza/events/296988916",
        "timezone": "America/Fortaleza",
        "description": "Este será um encontro de Entusiastas, Profissionais e estudantes da área de Cyber Segurança, o intuito desses encontros é o compartilhamento de conhecimento, fomentar a cultura segurança no estado e fazer networking.\n\nLocal: Digital College Sul\n\nPalestrantes:\n**Marcus Lima:** Coraza WAF + Proxy-WASM: Como manter a compatibilidade de seu WAF independente do seu proxy\n*LinkedIn:* https://www.linkedin.com/in/marcsvll\n\n**Vinicius Fernandes:** Segurança em Pipeline: A importância da segurança a nível de desenvolvimento\n**LinkedIn:** https://www.linkedin.com/in/vinicius-f-a76ba51b5/\n**GitHub:** http://github.com/souzomain\n\n**Inscrição para evento:**\n**Vagas Limitadas: 60 pessoas**\n\nEsperamos sua presença."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #63 - GenAI Security",
        "date": "2023-11-29",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/296455863",
        "timezone": "Europe/Berlin",
        "description": "Hi all, we are delighted to host the next in-person event in Frankfurt! This time we have a special focus on GenAI security, where will we have a range of talks delivered by leaders within the AI security space. There will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup with a strong focus in Security in Generative AI hosted by **CHECK24**.\n\n_What are we going to talk about?\n**Talk 1 - The Dark Side Of Large Language Models: Uncovering And Overcoming Of Code Vulnerabilities**\n\n*Javan Rasokat* *\\- Senior Security Specialist at Sage\\, Researcher and Lecturer at DHBW\\, Germany*\n\nIn his talk, Javan will discuss the role of large language models in cybersecurity, highlighting both their potential and pitfalls. Using GitHub Copilot as a case study, he'll emphasize the importance of secure coding practices and manual code reviews in AI-driven development.\n\n**Talk 2 - Seeing is Not Always Believing: The Rise, Detection, and Evasion of Deepfakes**\n\n*Niklas Bunzel, PhD student at TU-Darmstadt and research scientist at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\n*Raphael Antonius Frick, research fellow at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\nIn an era where digital information dominates, the saying “seeing is believing” has been cast into doubt with the emergence of deepfakes — AI-generated media that manipulates reality. This talk delves into the sophisticated technologies behind the creation of these deceptive videos and images. We’ll explore cutting-edge methods for detecting such manipulations, ensuring the authenticity of digital content. However, as detection techniques advance, so too do evasion strategies, including adversarial attacks and prompt injection methods. This poses the question: Can we still believe everything that we see?\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24**.\n\n_When?\nOur Meetup takes place on 29.11.2023 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg OAuth2 and Offensive Security",
        "date": "2023-12-06",
        "time": "7:15+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/297221787",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Omegapoint's office for an awesome evening with food and drinks, and talks about OAuth2 pitfalls and Pentest war stories!**\n\n**Where:** Omegapoint, Rosenlundsgatan 3, 411 20 Göteborg\n\n**Agenda:**\n**17:00 - 17:30:** Welcome to Omegapoint\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n**17:45 - 18:30:** *How to f\\*ck up at OAuth2 while following BCPs*\nBest current practices (BCPs) for implementing OAuth2 and OIDC have undergone many changes over the years. In this presentation we highlight the risks of staying with the ancient (roughly 2019-2021) “current” best practices. The current (circa 2022) BCPs bring many changes, such as deprecation of the implicit flow, required usage of PKCE and the BFF pattern which mitigates some of the previous attack vectors. It takes time for new concepts to fully mature and secure defaults emerge. While following the latest BCPs it’s still possible to make mistakes and end up with a broken implementation. This presentation will show some common OAuth2/OIDC security pitfalls and why it is bad practice to use reverse proxy catch-all routing in your BFF, an OAuth2 client with access to many scopes, together with APIs that do authorization based on just a valid token and scopes. Does your BFF enable authenticated SSRF as a Service? During the presentation we will demonstrate both attacks and defences for a OAuth2/OIDC application running locally.\n**Pontus Hanssen** in an experienced security researcher and penetration tester. He loves to hack everything that blinks or has an IP address. Pontus performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security.\n**Tobias Ahnoff** is an experienced developer and architect with focus on application security. He specializes in implementing authentication flows and authorization for web applications and APIs that manage sensitive data. Tobias performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security. He also gives courses in application security and is an appreciated speaker in OAuth2 and OpenID Connect areas.\n\n**18:30 - 19:15:** Food\n\n**19:15 - 20:00:** *Pentesting War Stories*\nWorking in penetration testing generates quite a few interesting stories\nabout spectacular vulnerabilities found in tested systems.\nOften these stories are not shared outside of a small circle of people.\nThis presentation goes through a selection of vulnerabilities found\nduring assignments in the recent years. The titles of the stories are:\n“The omnipotent client cert” (automotive app), “Next level XSS“ (web),\nNo route to boat” (network), and ”Having a conversation with a door\nhandle\" (embedded).\n**Emilie Barse** is an experienced IT security consultant with a deep\ninterest in security testing and log analysis. She has worked in IT\nsecurity since 2005 and has worked in numerous different industries, and has tested applications, networks, cloud environments, IoT systems, and cars. Emilie has a PhD in computer security from Chalmers University of Technology.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston AppSec Happy Hour sponsored by Checkmarx and Orasi Saltworks",
        "date": "2023-11-30",
        "time": "6:00-06:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/297237891",
        "timezone": "America/Chicago",
        "description": "Please join us for the Houston AppSec Happy Hour from 4-6 PM on Thursday November 30th at Kirby Ice House located at 1015 Gessner Rd, Houston, TX 77055.\n\nThis happy hour event is sponsored by Checkmarx and Orasi Saltworks who will be providing the drinks.\n\nWe hope to see you there."
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": " OWASP Houston Chapter API Security Study Group Session 3 - Exploring crAPI ",
        "date": "2023-11-20",
        "time": "8:30-06:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/297260466",
        "timezone": "America/Chicago",
        "description": "Starting with this session, we will begin working with crAPI using the tools we installed in lesson 2.\n\n[completely ridiculous API (crAPI)](https://owasp.org/crAPI/)"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy November 2023 Online Meetup ",
        "date": "2023-11-24",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/297256302",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy online Meetup is a 2 hours conference focused on web application and software security, application security testing tools and technologies.\n\nNext 24th November we will 2 exceptional speakers:\n\n* **Luca Compagna** \\- Senior Scientist / Research Architect at SAP Security Research\n* **Claudio Merloni** \\- Security Research Manager at Semgrep\n\nLuca will talk about: \"Testability Patterns for Web Applications – an OWASP project\"\n\nClaudio will focus on: \"Scaling your AppSec program with secure defaults\"\n\nThis Meetup provided a unique opportunity to learn about application security topics and to network with application security professionals/managers, software engineers, software quality engineers/testers and computer science students.\n\nSecure now your spot for the upcoming online event!\n\nMore information and the Agenda at the following URL:\nhttps://owasp.org/www-chapter-italy/events/owaspit-24112023"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#05 The Cake",
        "date": "2023-11-15",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/296853686",
        "timezone": "Europe/Lisbon",
        "description": "Join us for an evening of celebration and preparation as OWASP Lisbon marks its one-year anniversary! As we reflect on the past year's achievements, we're excited to kick off a series of meetups that will lead us into the highly anticipated OWASP Global AppSec Lisbon Event. This first meetup of the series will set the stage for an incredible journey towards building more secure applications and connecting with fellow appsec enthusiasts.\n\nThe meetup takes place on November 15th, 2023, at 18:00, at the OLX office, and is **sponsored by OLX and AP2SI**.\n\nThe schedule is the following:\n18:00 - **The Cake** by the OWASP Lisboa chapter leadership team\n18:15 - **Seeing What’s Wrong Just Right** by Jasvir Nagra\n19:10 - **Why everyone in your cyber security team needs to be an AI expert** by Dinis Cruz\n20:00 - **Drinks & Dinner** by OLX\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Seeing What’s Wrong Just Right**\n\nSpeaker: **Jasvir Nagra**\n\nAbstract:\nWriting web applications is hard. Debugging them is harder. Security bugs are even harder because not only does an application have to work, it has to stop working when the input is malicious. One approach web developers have taken to managing the complexity of writing large web programs is to make it harder to write incorrect programs. Static type checkers, linters, tests and testing frameworks have all made it easier to write correct code. Nevertheless, incorrect and vulnerable programs still exist. In fact, the very success of these tools in avoiding common errors has meant developers spend increasing amounts of time debugging only subtle bugs. In distributed systems, the challenge is even harder because debugging tools give you glimpses into the program state—some on the server, some on the client—without giving you a coherent view of the entire system. Not only are web programs inherently distributed between the server and the client, any one web page in the browser is itself made up of different iframes, events and event handlers, and sometimes service workers all communicating asynchronously. In this talk, I will share a few painful distributed web app debugging anecdotes and an alternate approach to get a holistic view of a program to track down elusive bugs. This approach uses virtualization to create complete traces of just those aspects of the program we suspect are buggy without having to model all program state. Virtualization allows us to momentarily ignore incidental bugs discovered while hunting the core one without it getting in the way, and visualization of the collected traces to build up causal diagrams to inform our intuition when our mental models deviate from reality. I will demonstrate how to recognize and tackle debugging problems with this approach and cover pitfalls you may run into with virtualization.\n\nBio:\nJasvir Nagra is widely recognized as a thought leader in software protection. He is co-author of Surreptitious Software, the definitive textbook on software protection, and an early researcher in obfuscation, software watermarking, and fingerprinting. With more than 12 years of experience, his professional path includes companies such as Instart, Dropbox and Google - where he led the Caja project. As an advisor to Jscrambler, he is helping cybersecurity startups address key technological challenges.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Why everyone in your cyber security team needs to be an AI expert**\n\nSpeaker: **Dinis Cruz**\n\nAbstract:\nSimilar to how electricity revolutionised our lives and is now ubiquitous, Gen AI is poised to become an integral part of everything Cyber Security teams do everyday. Therefore, there is an increasing need to deepen our understanding and expertise in this transformative technology. It's time to embrace the opportunities AI presents and equip ourselves with the knowledge to thrive in this rapidly evolving landscape.\n\nBio:\nDinis Cruz is the Chief Scientist of Glasswall and the CISO of Holland & Barrett, who brings a unique blend of Security and Engineering expertise with 20+ years experience in Cyber Security and Software Development. Dinis is focused on creating Gen AI powered teams and environments where engineering and security are enablers and accelerators for the business, with a big focus on the productisation and commercialisation of advanced technologies."
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON] at TikTok London HQ",
        "date": "2023-11-16",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-london/events/297245227",
        "timezone": "Europe/London",
        "description": "**This event is kindly sponsored and hosted by TikTok London HQ. There is limited seating available for in-person attendees. Registration required.**\n\n**Venue Location:** TikTok London HQ, Kaleidoscope, 4 Lindsey Street, Barbican, London , EC1A 9PL\n**Nearest Tubes:** Farringdon Elizabeth Line (1 min walk); Barbican (4 min walk)\n**Doors Open** at 6pm for registration, food, drinks and networking. The talks start at 6:30pm (we start on time).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News - Sam Stepanyan**\nWelcome and a brief update on OWASP Projects & Conferences\n\n**\"Introduction to OWASP depscan - the SCA tool that is built to forget\" - Prabhu Subramanian**\n\nSoftware composition analysis tools, both commercial and open source, have some problems. They are too noisy, constantly distracting developers and AppSec with needless pull requests and non-actionable alerts. In this talk, we introduce OWASP depscan, the SCA tool that is purpose-built to cut the noise, make security actionable, and help dev teams forget the tool even exists in their CI pipeline.\n\n**\"ChatGPT Tutorial for Developers - 10X your AWS Security Skills\" - Ashish Rajan**\n\nThis talk will go through the foundational cloud security components of deploying AWS with security at scale traditionally. Then we will attempt the same with ChatGPT for those who are perhaps new to AWS but would like the new way of learning cloud security\n\n**SPEAKERS:**\n\n**Prabhu Subramanian (@_prbh)**\n\nPrabhu Subramanian is the author and OWASP leader behind projects such as CycloneDX Generator (cdxgen) and depscan. He specializes in Supply Chain Security and offers consultancy to global clients via his company, AppThreat Ltd.\n\n**Ashish Rajan (@hashishrajan)**\n\nAshish Rajan is the host of the wildly popular Cloud Security Podcast, a CISO, CyberSecurity Influencer, a SANS Trainer for Cloud Security and an outspoken opinion leader on all things Cloud Security & DevSecOps.\nHe is a frequent contributor on topics related to public cloud transformation, DevSecOps, Future Tech and the associated security challenges for practitioners and CISOs.\n\n**TICKETS:**\n\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you must RSVP - your name will be checked by the TikTok building security against the guest list.\n\n**CODE OF CONDUCT:**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\nOWASP aims to provide a harassment-free experience for everyone, regardless of gender, sexual orientation, disability, physical appearance, body size, race, age, or religion. We do not tolerate harassment of event participants in any form.\nAdditionally, participating in OWASP events means you shall also adhere to the OWASP Code of Conduct which you can find here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - NOV 29, 2023",
        "date": "2023-11-29",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294514939",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: TBA\n***\\*\\*\\*\\*\\*\\* NOTE***: New Date due to Thanksgiving Holiday! **\\*\\*\\*\\*\\*\\*\\***\n\n**ABSTRACT**: TBA\n\n**Thanks to our Sponsor**: *!***Thanks to our Sponsor**: *[VIRTIS](https://virtis-us.com/)*\n*Providing today's leading organizations peace of mind that their entire digital network perimeter is safe from hackers and data breach. Our singular focus on information security delivers unparalleled solutions and services. We are revolutionizing web application & API protection and modernizing vulnerability management. VIRTIS solves the toughest web application challenges faced by organizations in all industries across all verticals in an ever-evolving digital threat landscape.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Cybersecurity of Critical SAP Apps at Rising Tide Brewery",
        "date": "2023-11-21",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-maine/events/297121352",
        "timezone": "America/New_York",
        "description": "**RESCHEDULED - OWASP Maine: Addressing Cybersecurity on Business Critical SAP Applications**\n\nApplication and software security are so vitally important in all aspects of the business especially with every company becoming a software company as they navigate through digital transformations.\n\nWith that being said ERP systems are some of **THE MOST** critical applications within enterprises today and come with their own unique set of security challenges.\n\nThe fine folks at Onapsis who 100% specialize in SAP and ERP application security will be on site to dive deep into these specific challenges. They will also review real world attacks on SAP ERP environments and discuss the best in class strategies and measures you can do to mitigate the risk of exploitation of your ERP environments.\n\nAnyone who is involved in SAP ERP environments from both a software development and security perspective would gain a tremendous amount of knowledge attending this meetup.\n\n\\*Food and drinks will be provided by Onapsis\n\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation on Microsoft Azure and Amazon AWS",
        "date": "2023-11-24",
        "time": "5:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai November Meet 2023",
        "date": "2023-11-25",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/297212098",
        "timezone": "Asia/Kolkata",
        "description": "Introduction to OWASP Mumbai\n\n**Session:** Lessons Learned from past Cyber Ransomware Incident Pharma Sector\n**Speaker**: Ravindra\n\nQnA and FeedBack"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "OWASP BeNeLux Days 2023",
        "date": "2023-11-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/295925893",
        "timezone": "Europe/Amsterdam",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2023\" edition on November 23rd-24th in Hasselt, Belgium. \n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "After Hours Drinks",
        "date": "2023-11-15",
        "time": "7:00-05:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/296596047",
        "timezone": "America/New_York",
        "description": "Join OWASP NYC for After Conference Happy Hour Drinks. We're thrilled to be back in person!\n\nEmail [Guy.Osa@owasp.org](mailto:Guy.Osa@owasp.org) for OWASP Bar @ the Marquis."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-11-21",
        "time": "8:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721034",
        "timezone": "Pacific/Auckland",
        "description": "For November, we're shifting our Meetup by one week, to work around several other events going on in the region - the NZITF Conference is taking place in Wellington Monday and Tuesday, 13-14 November; the ISANZ Awards Dinner is on the evening of 14 November; and John will be in Melbourne for the OT Cyber Resilience Summit on the 14th.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for November will be **A10:2021 - Server-Side Request Forgery (SSRF)**, wrapping up the cycle [we'll begin again, with A01:2021, next March...unless a new edition is published].\n\n**Technical Topic Speaker:** John DiLeo\n**Talk Title:** Creating Test Cases for Security Features\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the second Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "The ML(Ops) Security Landscape",
        "date": "2023-11-28",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-oslo/events/297278006",
        "timezone": "Europe/Oslo",
        "description": "Welcome to OWASP Oslo's November meetup, hosted by Ardoq!\n\nYou are welcome to arrive anytime between 17:00 and 17:30. We plan to kick off the talk around 17:30.\n\n**More Tools Mean More Misconfigurations - The ML(Ops) Security Landscape**\nIn this talk, we will cover some of the issues related to the emerging field of Machine Learning and AI security. We will cover some low hanging fruits related to ML security - we will show how attackers can get access to victims' secrets, source codes and API keys. We will also talk about OWASP's initiatives for AI security, such as the OWASP Top10 for ML, the OWASP Top10 for LLM, and the OWASP AI Security Guide."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa November 15th 2023: DevSecOps: Containers, Vulnerabilities, & SCA ",
        "date": "2023-11-15",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/297215389",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564 **(Note Room Change again)**\n\n**Health Notice:**\n\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **DevSecOps: Containers, vulnerabilities and SCA**\n\n**Abstract:**\nA whirlwind tour of a tech stack evolutionary journey at a scale-up and tidbits of lessons learned from along the way. Some thoughts on the experience of taking an app from Elastic Beanstalk onto ECS, and the shift in how to approach patch/vulnerability management. Along with the different strategies to software composition analysis (SCA) in a containerized environment. Hopefully with a glimpse into an approach for embedding security into every stage of the software development lifecycle; a la the DevSecOps way.\n\n**Speaker Bio:**\nGreg Sienkiewicz is a DevSecOps engineer at Rewind, a Ottawa based startup on a mission to help businesses protect their SaaS and cloud data. He is curious about cyber security, especially in public cloud environments and holds multiple industry certifications; including AWS Certified DevOps Engineer Professional and AWS Certified Security Specialty as well as ISC2 Certified Cloud Security Professional (CCSP)."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social [Glo Golf]",
        "date": "2023-11-30",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296056636",
        "timezone": "Europe/London",
        "description": "Christmas Social Special!\n\n**What?**\n\n* Glo Golf, bring your best putting game!\n\n**Where?**\n\n* Glo Golf Peterborough (Town Center)\n\n**When?**\n\n* Thursdsay 30th November\n\nSign up by responding to this event! (Note, this is a self-funded social, entry is £8.50)"
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Architect Organizational Resiliency around your Generative AI Applications",
        "date": "2023-11-16",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/297145977",
        "timezone": "America/Los_Angeles",
        "description": "Organizations wish to move quickly and maintain a high standard of security and privacy for innovation, but often find themselves stymied when extending existing governance and controls design to AI, ML and Generative AI workload research and development. This talk provides guided steps referencing OWASP Top 10 for LLM Applications for aligning incentives and priorities between AI R&D and Security teams to facilitate identifying threats and opportunities, identifying and evaluating tradeoffs, implementing baseline controls, defining organizational governance for intelligent systems, and more. Attendees will take away steps for driving incremental improvement and readiness in their teams and organizations. This talk will be accessible to those with a security-minded curiosity, and does not assume expertise or experience in AI/ML security.\n\nThanks to Cambia Health Solutions for hosting our event this month.\n\nDoors open at 5:30 pm and the presentation will begin at 6pm."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Cybersecurity of Critical SAP Apps at Rising Tide Brewery",
        "date": "2023-11-21",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-maine/events/297121352",
        "timezone": "America/New_York",
        "description": "**RESCHEDULED - OWASP Maine: Addressing Cybersecurity on Business Critical SAP Applications**\n\nApplication and software security are so vitally important in all aspects of the business especially with every company becoming a software company as they navigate through digital transformations.\n\nWith that being said ERP systems are some of **THE MOST** critical applications within enterprises today and come with their own unique set of security challenges.\n\nThe fine folks at Onapsis who 100% specialize in SAP and ERP application security will be on site to dive deep into these specific challenges. They will also review real world attacks on SAP ERP environments and discuss the best in class strategies and measures you can do to mitigate the risk of exploitation of your ERP environments.\n\nAnyone who is involved in SAP ERP environments from both a software development and security perspective would gain a tremendous amount of knowledge attending this meetup.\n\n\\*Food and drinks will be provided by Onapsis\n\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - November Meetup-In person @Slapfish (Lehi)",
        "date": "2023-11-30",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/297244046",
        "timezone": "America/Denver",
        "description": "Casual event, we'll meet at Slapfish for lunch.\n\nWe'll discuss:\n\n1. Wins & Lessons learned from SaintCon-AppSec Community last month.\n2. (time permitting) LLMs and using them in the AppSec space\n\nSee you there!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-12-13",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296623321",
        "timezone": "America/Los_Angeles",
        "description": ""
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Cybersecurity Careers: Insights from a Panel of Security Leaders",
        "date": "2023-12-14",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/296891549",
        "timezone": "America/New_York",
        "description": "Come join a panel of leaders in the Cybersecurity field talk about their career journey, and offer advice."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "ISSA / OWASP Tampa Chapters Q4 Year-end Minicon",
        "date": "2023-12-06",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/296916076",
        "timezone": "America/New_York",
        "description": "**Welcome to our joint ISSA & OWASP End of Year Minicon!**\n\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This half day minicon will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda:**\n\n* 8:30am - Registration\n* 9:00am - First Talk\n* 10:00am - Second Talk: Tony Cook, Sr. Dir, DFIR & Threat Intel\n* 11:00am - Third Talk: Jadee Hanson, CISO Code42\n* 12:00pm - Lunch\n\n**Speakers:**\n\n* Tony Cook is the Sr. Director of DFIR & Threat Intelligence on GuidePoint Security’s consulting team, where he manages digital forensics and incident response engagements on behalf of the firm’s clients. His career background includes high-level national security activities in cybersecurity operations for several clients over various verticals.\n* Jadee Hanson is the Chief Information Security Officer at Code42, where she is responsible for business technology strategy and purchasing, as well as leading global risk and compliance, security operations, incident response, and insider threat monitoring and investigations.\n\n**Location:**\n3030 N Rocky Point Drive W\nSte 600\nTampa, FL\n\n**Sponsors:**\n[Code42](https://www.code42.com/)\n[GuidePoint Security](https://www.guidepointsecurity.com/)"
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "Charla sobre: Introducción a OWAPS ZAP (Zed Attack Proxy)",
        "date": "2023-11-25",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-tegucigalpa-chapter/events/296929802",
        "timezone": "America/Tegucigalpa",
        "description": "Charla sobre: Introducción a OWAPS ZAP (Zed Attack Proxy) El escáner de aplicaciones web más utilizado del mundo. Libre y de código abierto. Mantuvo activamente a un equipo internacional dedicado de voluntarios. Un proyecto de GitHub Top 1000."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Privacy by Design (PbD)",
        "date": "2023-11-21",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-toronto/events/297246491",
        "timezone": "America/Toronto",
        "description": "TALK\n\nPrivacy by Design (PbD)\n\nSummary:\n\nThis presentation will discuss Privacy by Design (PbD) and what it can look like when put into practice. PbD will be looked at as a best practice and as a requirement set out by privacy laws and regulations. In this talk, you will learn about the foundational principles of PbD, and concepts to consider that can help you in your role and collaboration with stakeholders.\n\nPresenter:\n\nHoria Tabatabaei Soltani\n\nHoria is currently the Director (Fellow) of Privacy at Canon Canada. She oversees the development and maturity of Canon Americas (Canada, US, Latin America) privacy program. She is also completing her Masters of Law (LLM) at Osgoode Law School, York University in Privacy and Cybersecurity."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Drink Your Own Champagne: How to Threat Model Your Threat Modeling Program",
        "date": "2023-11-15",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasptriangle/events/296265774",
        "timezone": "America/New_York",
        "description": "We threat model our technology to ensure strong, resilient designs. As a critical control, our practice of threat modeling demands the same rigor. Learn to drink your own champagne by threat modeling your program's weaknesses to design better strategies and unlock more business value from your threat models."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "LLM and NLP APIs: A Journey to Avoiding Data Breaches",
        "date": "2023-11-16",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248521",
        "timezone": "America/Vancouver",
        "description": "**Ads Dawson**, v1.1 Technical Release Lead & Entry Lead for the OWASP Top 10 for Large Language Model Applications and a seasoned security engineer at Cohere, will take us on an insightful journey through the challenges and solutions involved in securing large language models and natural language programming APIs. With his extensive experience, Ads will shed light on how to avoid data breaches, fortify against attacks, and enhance the security of these crucial technologies through the use of tools like OWASP Top 10 for LLMs. Don't miss this opportunity to learn from a true expert in the field!"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | From Basics to Burp: Navigating PortSwigger Academy",
        "date": "2023-11-16",
        "time": "8:30-08:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/296919377",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria chapter is pleased to present a workshop hosted by Wyatt Harvey and Sebastian Bethell titled \"From Basics to Burp: Navigating PortSwigger Academy\".\n\nThe event will be held on November 16, 2023 from 6:30 PM to 8:30 PM at Fort Tectoria (doors open at 6 PM).\n\nThe event will feature the workshop, including an introduction to PortSwigger Academy and working through some of the introductory labs using BurpSuite, a comprehensive tool for performing security testing on web applications. Snacks, networking, and fun will also be included.\n\nPortSwigger Academy is an online platform offering interactive learning materials and labs focused on web application security and instructions on how to identify and exploit a wide range of web application vulnerabilities.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in web application hacking. If you would like to attend, please click the RSVP button to reserve your spot as we have limited seats available.\n\nBring your laptop with BurpSuite installed and join us for a hands-on evening of application security fun!\n\nBurpSuite Community can be installed from the following link:\n\n* [https://portswigger.net/burp/communitydownload](https://portswigger.net/burp/communitydownload)\n\n‎\nWe would also like to give a special thanks to First West Credit Union for sponsoring this event."
    },
    {
        "group": "Vilnius",
        "repo": "www-chapter-vilnius",
        "name": "OWASP Vilnius #5",
        "date": "2023-11-16",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-vilnius/events/297277762",
        "timezone": "Europe/Vilnius",
        "description": "I'm super happy to announce, that there will be a physical event again organised with VU Cyber Security Lab in the Vilnius University premises (Baltupiai, Vilnius).\n\nThe agenda:\n\n1) \"AI reguliavimo perspektyvos kibernetinio saugumo srityje''. - Dr. Neringa Gaubienė, Vilniaus universiteto Teisės fakulteto lektorė, Vilniaus Universiteto Teisės Fakulteto mokslinės tyrimų grupės narė.\n\n2\\) Kajus Sestokas \\(AppSec Engineer \\| Flo\\) \\- \"Mobile Top 10: What's new for 2023 and experiences from the field\\.\"\nDuring the talk, a hands-on run-through of the latest OWASP Mobile Top\n10 will be presented, clarifying each concept with simple explanations\nand live demonstrations. Additionally, the session will include\npractical advice and techniques derived from experience in the field,\nfocusing on the discovery, resolution, and prevention of security\nvulnerabilities in mobile applications.\n\n3\\) Kestutis Parchutikas \\(Senior Penetration Tester \\| Visma\\) \\- \"Baseline\nsecurity tests for Web applications.\"\nSecurity risks are changing, but the baseline tests are not. In this\ntalk I will share the personal approach to web applications\npenetration testing.\nThe talk should benefit by providing answers to the following:\n\\- How to not lose your head over massive amounts of technical resources\\.\n\\- How to answer the eternal question \\- \"What has been tested?\"\\.\n\\- How to develop/improve your own methodology/approach\\.\n\nLocation: VU MIF, Didlaukio g. 47, 103 auditorium. You can leave your car on the Didlaukio street.\n\nNOTE: This event won't be broadcasted or recorded.\n\nSee you soon!"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-12-13",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889913",
        "timezone": "America/New_York",
        "description": "Welcome to our final 2023 monthly SAMM community call Wednesday 13th December, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EST.\n\nJoin Zoom Meeting: [Zoom link.](https://zoom.us/j/96866048960?pwd=TmZkTSs3ZmlWU09DbHJoSnVZWmdiUT09)"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #63 - GenAI Security",
        "date": "2023-11-29",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/296455863",
        "timezone": "Europe/Berlin",
        "description": "Hi all, we are delighted to host the next in-person event in Frankfurt! This time we have a special focus on GenAI security, where will we have a range of talks delivered by leaders within the AI security space. There will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup with a strong focus in Security in Generative AI hosted by **CHECK24**.\n\n_What are we going to talk about?\n**Talk 1 - The Dark Side Of Large Language Models: Uncovering And Overcoming Of Code Vulnerabilities**\n\n*Javan Rasokat* *\\- Senior Security Specialist at Sage\\, Researcher and Lecturer at DHBW\\, Germany*\n\nIn his talk, Javan will discuss the role of large language models in cybersecurity, highlighting both their potential and pitfalls. Using GitHub Copilot as a case study, he'll emphasize the importance of secure coding practices and manual code reviews in AI-driven development.\n\n**Talk 2 - Seeing is Not Always Believing: The Rise, Detection, and Evasion of Deepfakes**\n\n*Niklas Bunzel, PhD student at TU-Darmstadt and research scientist at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\n*Raphael Antonius Frick, research fellow at Fraunhofer Institute for Secure Information Technology (SIT) and the National Research Centre for Applied Cybersecurity - ATHENE*\n\nIn an era where digital information dominates, the saying “seeing is believing” has been cast into doubt with the emergence of deepfakes — AI-generated media that manipulates reality. This talk delves into the sophisticated technologies behind the creation of these deceptive videos and images. We’ll explore cutting-edge methods for detecting such manipulations, ensuring the authenticity of digital content. However, as detection techniques advance, so too do evasion strategies, including adversarial attacks and prompt injection methods. This poses the question: Can we still believe everything that we see?\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24**.\n\n_When?\nOur Meetup takes place on 29.11.2023 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]