[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - June",
        "date": "2024-06-25",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460542",
        "timezone": "Europe/Copenhagen",
        "description": "**IMPORTANT:**\n\n* **You need to reverse into the parking spot!**\n* **Please please provide your email to Thomas to receive a private link to register in the guest system at Vesta before the event**\n* **Please register your car before the event. See the image for parking**\n\nAgenda:\n**19:00 – 19:10** Welcome by Vestas and OWASP Aarhus\n\n**19:10 – 20:00** ”Automated attack path discovery and alerting with Adalanche” by Rasmus Have.\n\nRasmus Have is a Senior Cyber Security Architect at Vestas where he works with security architecture across the IT and OT domains. Rasmus has a background from the startup world and military security over the last 25 years. He aims to close the gap between the theoretical architecture work and the practical engineering work with a hands on approach to security.\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** How to leverage AI in web protection - OWASP Juiceshop\" by Rasmus Dalsgaard Andersen, CheckPoint\n\nOWASP Juice Shop is probably the most modern and sophisticated insecure web application! I will show you how AI can be leveraged in a WAF to protect against attacks."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Attack Surface Mapping with OWASP Amass",
        "date": "2024-06-27",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/301614198",
        "timezone": "America/New_York",
        "description": "In the ever-evolving landscape of cybersecurity, understanding your attack surface and adopting an adversarial perspective are critical components for building a robust security program. This talk will delve into the strategic importance of these concepts, emphasizing how they can preemptively identify and mitigate potential security threats. We will explore the methodologies behind attack surface mapping, highlighting the necessity of viewing your infrastructure through the lens of an attacker to uncover vulnerabilities that might otherwise go unnoticed. By embracing this mindset, organizations can proactively defend against sophisticated attacks, ensuring their defenses are as robust and comprehensive as possible.\n\nThe talk will shift to a demonstration, centered around the Amass Project, OWASP’s powerful tool designed for in-depth attack surface mapping and asset discovery. Attendees will have the opportunity to gain hands-on experience with Amass, learning how to leverage its capabilities to uncover and visualize the full extent of an organization’s external exposure. The session will cover practical examples, showcasing how Amass can be integrated into security workflows to enhance situational awareness and threat intelligence. By the end of the presentation, participants will have a clear understanding of how to implement these strategies in their security programs, ultimately fortifying their defenses against potential adversaries."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "3. OWASP Augsburg Stammtisch",
        "date": "2024-06-26",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/301438471",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda**\n\n#### tbd - Du hast einen Vortrag? Du hast ein Thema, das dich interessiert? Zeig es uns! Vorträge sind immer willkommen!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-04",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301645041",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-27",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301511246",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - June 2024 (Online)",
        "date": "2024-06-25",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207011",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation! Presentation begins at 12CDT!\n\nIf you would like to attend in person and have a free lunch, please register at [https://owasp-austin-2024-june.eventbrite.com](https://owasp-austin-2024-june.eventbrite.com)\n\nPresentation: **Full of SaaS and TOTALLY SECURE**\n\nManaging shadow IT in the age of SaaS application sprawl is an important component of managing risk, especially since so many of us depend on SaaS/PaaS as part of our critical infrastructure. However, traditional approaches (blocklisting, brute force, etc.) have proven ineffective and are, oftentimes, too late to prevent any real security issues.\nIn this session, we’ll discuss some of the psychology behind why we’re referred to as the “department of NO” as well as how to start shifting that perception. You will also learn of some tactics to identify and mitigate shadow IT as well as proactive measures that may help avoid future sprawl."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-06-20",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301366702",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Thursday with Pacific Hackers & OWASP – CTF Time",
        "date": "2024-06-27",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/301426321",
        "timezone": "America/Los_Angeles",
        "description": "**Want to tap into your inner evildoer and test your skills in hunting down web application vulnerabilities?**\nJoin us at this joint event between Pacific Hackers and OWASP Bay Area to immerse yourself in the industry’s most authentic environment, where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense are all about thinking on your feet. For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard as you vie for the top spot!\n\n**About the Range:**\nThe CMD+CTRL Cyber Range is ideal for anyone interested in learning how web applications are attacked, furthering their cybersecurity acumen, or honing the skills needed to protect the enterprise. From curious bystanders to active practitioners to Risk and Security Executives, there’s something for everyone.\n\nRegistration:\nPlease register here to get more event details and help us organize food and drinks [https://web.securityinnovation.com/owasp-bayarea](https://web.securityinnovation.com/owasp-bayarea)\n\n**Agenda:**\n5 PM – Food & Networking\n5:30 PM – 8:30 PM – CTF Time\n8:30 PM – Prizes"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Bay Area OWASP June Meetup",
        "date": "2024-06-26",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/301448414",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming June meetup, which will be hosted by the wonderful **Traceable** team at **Harness** HQ in San Francisco. Refreshments will be sponsored by **Defy Security**. Get ready for insightful discussions and the chance to network with some of the brightest minds in the industry.\n\n**Agenda:**\n5:00 - 5:45: Doors open, networking and food\n\n5:45 - 6:30: Talk 1: API Security Blunders: Tales from the Cyber Trenches - Anjum Ahuja\n6:30 - 7:15: Talk 2: Had a Cyber Incident? Better Call Saul! - Daniel Davis\n7:15 - 8:00: Talk 3: Details to follow\n\n**Talk 1:**\nSpeaker:\nAnjum Ahuja\n\nTitle:\nAPI Security Blunders: Tales from the Cyber Trenches\n\nAbstract:\nIn this session, we dive into API Security by dissecting real-world blunders that have caused security breaches. We'll guide you through the process of identifying these anti-patterns and provide insights to effectively defend against such attacks.\n\nSpeaker Bio:\nAnjum is the Director of Security Research at Traceable.ai. He has worked on different aspects of security engineering specifically Detection engineering & Incident response, AppSec and Threat Intelligence. He has presented at conferences like BSidesSF, BSidesCharm, and has multiple patents issued for IOT Security.\n\n**Talk 2:**\nSpeaker: Daniel Davis\n\nTitle: Had a Cyber Incident? Better Call Saul!\n\nAbstract: If you’re a CISO, you’re already calling your lawyer. The rest of you are going - huh??? From the SEC’s legal action against Solarwinds to the looming specters of CMMC 2.0 and CIRCIA, when will cybersecurity’s transformation into a legal domain be complete?\n\nSpeaker Bio:\nNo, Daniel isn’t a lawyer, but he did stay at a Holiday Inn Express last night (does that one still hold up???). Cybersecurity isn’t the first technical discipline to be “legal-lite” as he learned running safety programs for military aerospace programs. When things go wrong, people will always want to know who “signed off on it”.\nThis experience led Daniel to Lyft’s autonomous vehicle division to create a public-private partnership to develop a framework for safety and cybersecurity for AVs. Today, he’s the founder of Mindpipe, which will be open sourcing a next generation, end-to-end RAG pipeline leveraging open knowledge graph frameworks."
    },
    {
        "group": "Belo Horizonte",
        "repo": "www-chapter-belo-horizonte",
        "name": "OWASP BH está de volta!",
        "date": "2024-06-29",
        "time": "10:00-03:00",
        "link": "https://www.meetup.com/owasp-belo-horizonte-chapter/events/301344829",
        "timezone": "America/Sao_Paulo",
        "description": "**OWASP BH está de volta!**\n\nJunte-se a nós no nosso primeiro meetup de 2024 e celebre a reabertura do capítulo OWASP BH!\n\nAgenda:\n**10h00 - 10h30:** Boas-vindas e reabertura oficial do capítulo OWASP BH: Apresentação da OWASP e dos planos do capítulo para 2024.\n**10h30 - 11h30:** Palestra \"IA Generativa e o Cenário da Segurança Cibernética\": Descubra os desafios e oportunidades da inteligência artificial na segurança.\n**11h30 - 12h00:** Palestra a definir\n**12h00 - 13h00:** Networking e encerramento"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "The Truman Show: Real-world application attacks instead of canned demos",
        "date": "2024-06-20",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/300788193",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nIn this presentation, Kevin Johnson of Secure Ideas will walk attendees through various scenarios used in penetration testing of applications. These demonstrations will use real attacks and discuss how a penetration tester views applications. This talk will explain the mindset of an attacker, using actual applications as well as demonstration apps to allow for exploitation.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS June 2024",
        "date": "2024-06-27",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/301577788",
        "timezone": "America/Denver",
        "description": "Speaker: Jeff Tomkiewicz; \"InfluenceOps: Practical Pretexing\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Lessons from recent breaches",
        "date": "2024-07-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301083987",
        "timezone": "America/New_York",
        "description": "Jay Bobo from CoverMyMeds is speaking! I'll get an abstract up here shortly, but it will be fantastic.\n\nAnd we are at a NEW location! Check it out!"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP Bordeaux Juin 2024",
        "date": "2024-06-20",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/301293664",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup OWASP France sur Bordeaux aura lieu le 20 Juin a partir de 18h\n\nIl aura lieu dans les locaux de Peaksys/CDiscount.\n\nAdresse : Hall B, 8 quai Lawton, 33300 Bordeaux (l’entrée se fait à gauche à coté de la boulangerie Honoré)\n\nAu programme :\n\n* Welcome to OWASP Bordeaux ; par Sebastien Gioria & PeakSys\n* Threat Modeling for Developers par Jonathan Marcil ; talk en Francais\n* Kubernetes par Maxime Girardet (Pentester chez Advens)\n*Durant ce talk, Maxime GIRARDET vous présentera le niveau de sécurité par défaut d'un cluster Kubernetes, différents scénarios réalistes d'attaques ainsi que les remédiations associées, au niveau système et applicatif*.\n\nLe nombre de places est limité a 50 personnes sur inscription. Du aux contraintes de sécurité, nous vous remercions d'avoir avec vous un document justifiant de votre identité (Badge pro, CI, Passeport, ....)"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - June 2024",
        "date": "2024-06-23",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/300284889",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is thrilled to announce our next Meetup event! \n\nGet ready for a vibrant gathering of the AppSec community, featuring delicious food, refreshing drinks, networking opportunities, and insightful security discussions.\n\nThis special occasion will be graciously hosted by Axonius!\n\n====================================================================\nAgenda:\n 18:00 - 18:30 - gathering and food - We will gather at Axonius's office for drinks, great treats and mingling.\n 18:30 - 18:35 - Meetup kickoff + Microphone tuning\n 18:35 to 19:20 - From Challenge to Triumph: Transforming AppSec with AI and Automated Code Reviews - A Journey of Lessons Learned\n*Michael Goberman - Director of Product Security and Aviad Feig - Product Security Architect @ Axonius*\nMaintaining a robust application security program with a lean team of experts is challenging. We’re eager to share with the community a practical and innovative approach that worked for us: How we were able to move away from manually reviewing every feature developed while increasing the thoroughness of our security oversight. We’ll explain how we succeeded at integrating generative AI tools using GitHub actions to automate the code review process and broaden security oversight in a highly efficient way. Attendees will learn from our journey and discover how they, too, can automate routine security checks, engaging human experts only when their expertise is truly needed.\n 19:20 to 19:30 - Beer Break\n 19:30 to 20:15 - Pains and advantages of application anomaly detection in containerized applications\n*Ben Hirschberg - CTO @ ARMO*\nIn this talk an open-source based application anomaly detection system to detect malicious activity. The solution focuses on applications running in Kubernetes orchestration system.\nIn the talk I will cover these points:\n\\* Main attack vectors to these kinds of applications: exploit remote vulnerabilities, supply-chain attacks\n\\* Anomaly detection dimensions: process, file, network and system-call activity\n\\* What detection dimension is working (or not working) with what kind of applications\n\\* What anomalies are bound to what kind of attacks\n\\* Live demo with the Kubescape project to show results\n\n 20:15 to 21:00 - The Dark Side of AI: The Hidden Risks in Open-Source AI Models\n*Jossef Harush Kadouri - Security Researcher @ Checkmarx*\nThis talk is for anyone who is using open source in their daily routine. The purpose is to bring awareness to the risks of software supply chain attackers lurking in some of our open-source code and to show how ridiculously easy it is for them to launch attacks.\nJoin me as we unravel the construction of AI models, focusing on their weak spots. Through multiple demos, witness how AI models can be manipulated to become malicious.\n\n====================================================================\nThis event is hosted by Axonius in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2024",
        "date": "2024-06-20",
        "time": "16:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/300592625",
        "timezone": "Europe/Rome",
        "description": "OWASP Italy will host the next OWASP Italy Day 2024 on June 20th. It will be a full-day event dedicated to application security (AppSec)!\n\n#### **OWASP Italy Day 2024 will take place at Cagliari.** This is a free, one-day, informal event aimed at increasing awareness and knowledge of web application security. **Reserve your seat here:** [https://clicqui.net/2Lst5](https://clicqui.net/2Lst5)\n\nThe event is primarily intended to appeal to security professionals, software developers, software quality engineers, and computer science students with a strong interest in computer security.\n\n### **PROGRAM**\n\nThe event will take place next 20th June from 4 PM to 22 PM (Italian time). We are working on the program at the moment.\n\n#### **Dinis Cruz, Founder @ The Cyber Boardroom, Chief Scientist @ Glasswall, vCISO and GenAI expert, will be the esteemed keynote speaker at the upcoming OWASP Italy Day 202**4!\n\n### **Call for papers**\n\nThose who are interested in participating as speakers to the conference can submit an abstract of their proposed talk via Easychair by April, 2024. The Easychair link for submission is reported on this page.\nThe abstract must be in PDF format and should contain the following information:\nName and surname of the speaker Institutions and roles of the speaker therein Short biography of the speaker Title of the contribution Abstract of the presentation The submission must be no longer than 2 pages overall. No additional formatting requirements are in place.\nThe submission will be reviewed by the program committee and the most interesting talk proposals will be selected for the conference.\n[CFP OWASP Italy Day 2024](https://easychair.org/cfp/CJ24)\n\n### **Call for Sponsorship**\n\nWe are excited to offer sponsorship opportunities for the OWASP Italy Day 2024, taking place in Cagliari on June 20th. This event provides a unique platform to connect with professionals from multiple facets of the software industry, including security experts, developers, engineers, and influential academics.\n\n#### Why Sponsor OWASP Italy Day 2024?\n\nBrand Visibility: As a sponsor, your brand will be prominently displayed before, during, and after the event. This includes logo placement in event materials, promotional content, and key areas at the venue. Enhance your brand recognition within the cybersecurity and developer communities.\nCommunity Engagement: Engaging with the OWASP community puts your company in the spotlight as a leader in supporting open software and security advancements. This event will provide you with the opportunity to network with industry leaders and cybersecurity professionals, offering a chance to build relationships and share your company’s expertise and solutions.\nLead Generation: With hundreds of attendees from various sectors, sponsoring OWASP Italy Day 2024 gives you direct access to potential clients and customers. The event will provide a focused audience interested in cybersecurity solutions, products, and training.\nPlease see **[here for details](https://owasp.org/www-chapter-italy/assets/images/2024%20OWASP%20Italy%20Day%20Sponsorship.pptx.pdf)**\nFor detailed information on our sponsorship packages please read the details [here](https://owasp.org/www-chapter-italy/events/OWASPIt24SponsorKit)\n\n**RESERVE YOUR SEAT:**\n[https://clicqui.net/2Lst5](https://clicqui.net/2Lst5)\n\nEvent official site:\nhttps://owasp.org/www-chapter-italy/events/OwaspItalyDay2024-06-20"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-07-15",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686440",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUN 26, 2024",
        "date": "2024-06-26",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/298386242",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: **What's in your AI code? Learn why every SCA tool is wrong, and how to deal with it.**\nJoin us for great networking, dinner and drinks, and see a presentation by **Darren Meyer**, Lead Solution Architect at Endor Labs.\n\n**ABSTRACT**: With the rise of AI-fueled by Python-based libraries, it has become of paramount importance to scan Python-based projects and their dependencies for OSS vulnerabilities. Python relies on package managers like pip or conda to manage declared dependencies. Dependencies are declared in manifest files which the package manager uses to install the correct version of the required dependency. However, Python’s dependency management system coupled with its dynamic type nature makes it an especially challenging language to deal with.\n\nOf particular focus is the phenomenon of phantom dependencies which are unreported dependencies in a project's manifest profile. These hidden dependencies, which are often provided dependencies (which is especially true for libraries such as tensorflow and pytorch which are essential for AI), challenge software composition analysis (SCA) of Python code, impacting the reliability of vulnerability results.\n\n**Thanks to our Sponsor**: *[Endor Labs](https://www.endorlabs.com/)*\n*Endor Labs’ Dependency Lifecycle Management Platform is designed to address the weakest link in software supply chain security: the ungoverned sprawl of open source software in the enterprise. Endor Labs’ mission is to help developers spend less time dealing with security issues and more time accelerating development through safe code reuse. With this solution, development and security teams are able to maximize software reuse by safely evaluating, maintaining, and updating dependencies at scale.*\n\n**Thanks to our Host**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "OWASP Summer Scavenger Hunt",
        "date": "2024-07-13",
        "time": "13:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/301505213",
        "timezone": "Europe/London",
        "description": "**To register for this you MUST go to our Eventbrite:** https://www.eventbrite.co.uk/e/owasp-summer-scavenger-hunt-tickets-921543680957?utm-campaign=social&utm-content=attendeeshare&utm-medium=discovery&utm-term=listing\n\nDo you like running round Manchester doing pointless challenges that may or may not be Hacker related for the chance of winning a £100 Amazon voucher?\n\nYes?!?\n\nThen this is the event for you!\n\nThis July OWASP Manchester will be hosting the first inaugural Charity Summer Scavenger Hunt. What you need to know:\n\nWho’s running it?\nManchester OWASP and Silverphish, you may have entered a similar one at one of the BSides or at Steelcon.\n\nWhere is it?\nOur base is the Piccadilly Central pub opposite Piccadilly Station, but the challenges will be all over the city centre.\n\nTeams\nYou can enter as a team of up to five people or as an individual. It costs £5 per person to enter and the proceeds will go to the Mustard Tree.\n\nRunning Time\nRegistration is between 1pm - 2pm at Piccadilly Central, closing and prizes will be at the pub at 7pm. We’re welcome to stay on at the pub after, and may take a turn round the Gay Village.\n\nPrizes\nThere will be £100 Amazon voucher PER TEAM for highest score and best submission, theres a £50 Amazon voucher for runner ups (second highest score).\n\nWho will Judge?\nSilverphish, Ben from OWASP and two exciting celebrity judges.\n\nAre there sponsors?\nHell yes there are! We’d like to thank PTP for supplying the prizes and FireDuck for sponsoring the infrastructure.\n\nWill we provide refreshments?\nNo. You’re on your own with that. Please eat before hand, and make sure to grab a Greggs during the hunt. Obvs as the base is a pub you’ll be able to buy a drink there too.\n\nIs the event suitable for Children?\nHell no. It’s in a pub. It’s also not totally safe for work either, so be prepared for some mild adult content.\n\nDo you need technical knowledge to enter?\nYou do not!!! There will be some mildly technical challenges but there will be plenty that are just silly or for fun.\n\nWhat should you bring with you? (These are suggestions, you’re grown-ups so we take zero responsibility for you)\n\n* A water bottle\n* Snacks\n* Comfortable shoes (preferably on your feet)\n* Sun cream\n* A brolly (it’s Manchester after all)\n* A sense of adventure\n* Probably some money\n\n**To register for this you MUST go to our Eventbrite:** https://www.eventbrite.co.uk/e/owasp-summer-scavenger-hunt-tickets-921543680957?utm-campaign=social&utm-content=attendeeshare&utm-medium=discovery&utm-term=listing"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - June 2024 Meetup",
        "date": "2024-06-26",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/301574282",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nOWASP Melbourne is (finally) meeting again. But, in a different format. Our sincere apologies for the silence these past few months; it's been a rough time, in many ways. The landscape and conditions for meetups have changed, especially in the last year, thus, we must adapt to carry-on.\n\nSo, what's happening?\nThe TLDR: We'd meet at 6pm on a Wednesday monthly (except Dec/Jan), at a (different) food place each meetup. Hangout, and together contribute and decide on the AppSec topics we'd want to discuss, while we all grab a bite to eat (at own cost). All these finishing up by 7pm.\n\nFor RSVPs, please do try to keep it updated so that whomever that arrives first at the food place, can try to grab a table/seats for us. We'd be trying to just walk-in and grabbing a table.\n\nPlease see this Google Form for the details, and a quick poll on which Wednesday y'all prefer: [https://forms.gle/U3ArrazUpt9R5EGH8](https://forms.gle/U3ArrazUpt9R5EGH8)\nWe'll close this poll by the 21st June 2024.\n\nWe've picked the first event's date and location, to get the ball rolling.\nSee you there.\nThank you."
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai Online Meetup - 29th June 2024",
        "date": "2024-06-29",
        "time": "12:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/301597640",
        "timezone": "Asia/Kolkata",
        "description": "#### Session Details:\n\nIntroduction to OWASP Mumbai\n\n**Talk:-** How to be a Malware Researcher\n**Speaker:-** Adhokshaj Mishra\n\nQnA and FeedBack"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Digital Safeguards: Your Essential Blueprint for Navigating Cyber Threats\"",
        "date": "2024-06-19",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300436528",
        "timezone": "America/Chicago",
        "description": "Outdated cybersecurity tactics leave us vulnerable. This thought-provoking talk introduces the “Cyber Risk Manifesto”, drawing upon the wisdom of military intelligence and corporate defense methodologies. Explore innovative strategies for predicting threats, reinforcing defenses, and empowering everyone to become cybersecurity guardians. Discover how outmaneuvering attackers is the key to digital resilience."
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "Desvendando o ransomware ShrinkLocker",
        "date": "2024-06-24",
        "time": "21:00-03:00",
        "link": "https://www.meetup.com/owasp-natal-chapter/events/301699547",
        "timezone": "America/Fortaleza",
        "description": "Você está preparado para mergulhar no mundo da cibersegurança e desvendar os segredos por trás de um incidente envolvendo o ransomware ShrinkLocker? Não perca o evento imperdível do chapter da OWASP Natal!\nData: 24 de junho\nHorário: 21h\nAprenda com um dos melhores! Junte-se a nós para uma sessão online envolvente e informativa, onde o especialista Cristian Souza irá compartilhar insights valiosos sobre a análise de um incidente envolvendo o ransomware ShrinkLocker. Esta é uma oportunidade única para expandir seu conhecimento e aprimorar suas habilidades no campo da cibersegurança.\nMarque esta data em sua agenda e convide seus colegas e amigos para se juntarem a nós nesta jornada fascinante!\nNão perca esta chance de aprimorar suas habilidades e ficar um passo à frente no mundo da segurança cibernética. Esperamos vê-lo lá!"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "June 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-06-20",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/300855942",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** VU, Amsterdam - **Theater 7, 4th floor, wing C** at the New University Building\n**Address:** De Boelelaan 1105\n**Parking information:** [https://www.parkerenbijvu.nl/](https://www.parkerenbijvu.nl/)\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Ship Happens: The Stormy Seas of Supply Chain Security** by **David Archer**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Technical leverage: dependencies are a mixed blessing** by **Fabio Massacci**\n\n**Ship Happens: The Stormy Seas of Supply Chain Security**\n*Abstract:*\n“The more I know about how software is made, the less I want to know” - Me\n\nAs a software developer with over a decade of experience and countless interactions with application security teams, I’ve discovered the unsettling complexities of modern software production. Despite what I thought I knew, the reality was far more intricate.\n\nModern software development is a sprawling network of open-source dependencies, sophisticated build tools, plugins, pipelines, and runtimes. These components are fundamental in securing critical sectors of our daily lives—finance, healthcare, infrastructure, transportation, and social interactions. However, this supply chain is under relentless attack and many of the potential threats are poorly understood.\n\nThis talk will delve into specific vulnerabilities, such as dependency poisoning and pipeline compromises, that exemplify the challenges we face. We’ll explore strategies to mitigate these threats and discuss practical takeaways that attendees can immediately implement in their software development practices. Expect to leave with a deeper understanding of supply chain security and with ideas to fortify your software factory against these escalating threats.\n\n*Bio:*\nDavid Archer is a Solution Architect at Endor Labs. He began his career as a software developer and witnessed significant shifts in how software is built over the last two decades. After spells as a development lead, product director and pre-sales consultancy roles David consistently saw a concerning trend: security often took a backseat amidst the hustle and bustle of development priorities.\n\nSeeking to help address this balance David took an opportunity in 2018 to work full-time in the field of application security with a particular focus on technologies that promise to enhance security without impeding development speed. Through his extensive experience with secure coding practises and hands-on experience with the myriad of code analysis tools like IAST, SAST, DAST, RASP and SCA, he gained valuable insights into their relevance and effectiveness in a modern software factory.\n\n**Technical leverage: dependencies are a mixed blessing**\n*Abstract:*\nModern applications are build upon a large supply chain of (possibly open source) libraries and tools. In finance, leverage is the ratio of debts (other people’s money) vs equity (your money) and the Lehman Brothers have made that concept famous. For software, technical leverage is the ratio between other people’s code and your own code. I will argue with some examples from the Maven, Python and the NPM ecosystems that this is both a risk and an opportunity. The Lehmans Brothers were 30 to 1, what about the Software Sisters?\n\n*Bio:*\nFabio Massacci is a co-author of CVSS v4. Among other things, he is also a professor at Vrije Universiteit. He has been a speaker at hackers’ venues (BlackHat USA, Asia) scientific security conferences (IEEE S&P, CCS), software engineering (ICSE,MSR) and risk analysis (SRA). He coordinates the EU project Sec4AI4Sec (name tells it all) and an NWO project on using AI for security threat intelligence. While almost all professors are sellers of tech (through their papers or their spin-offs) he was also for 7 years deputy for ICT procurements and services supervising a 70+ workforce and few millions Euro in outsourcing contracts. Being a buyer of tech makes a difference in perspective."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-07-16",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297786381",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for July will be **A03:2021 - Injection**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle June 2024",
        "date": "2024-06-19",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/300468663",
        "timezone": "Europe/London",
        "description": "We're back with our second event of 2024! We’ll be doing our usual two talks and pizza format.\n\nLocation: Precursor Security (at the old Newcastle Building Society office)\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1830 OWASP Newcastle Welcome\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk one\n**Title:** Supercharging Enterprise DFIR - 'Forensics as Code', AI, Automation and Cloud.\n**Speaker:** Michael L\n**Speaker Bio:** Currently the Director of SOC/DFIR for Precursor Security, experienced working in different SOC teams across public sector, financial services and managed services. I've lead DFIR engagements for a varied client base across EMEA.\n**Talk Synopsis:** This talk will introduce the latest techniques to supercharge your response to threat actors at enterprise scale. We will cover techniques I've employed to combat Lockbit, Akira and other TA's in challenging and diverse environments, focusing on new trends shaking up the DFIR corner such as performing forensics investigations 'as code', harnessing AI for DFIR and utilising Azure for automation and almost limitless scale.\n\nTalk two\n**Title:** Utilizing PowerBI for DFIR and incident investigation.\n**Speaker:** Venkatraman Krishnamoorthy\n**Speaker Bio:** Working as SOC manager for Sage . I have lead critical investigations, detection engineering efforts, Security automation.\nProviding free cyber security Mentoring for economically modest students.\n**Talk Synopsis:** Leveraging Power BI for Digital Forensics and Incident Response (DFIR): Enhancing Data Analysis and Visualization\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Lies are the new truth: breaching enterprises by exploiting generative models",
        "date": "2024-06-20",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/301549621",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, June 17th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Abstract**\nGenerative AI systems like ChatGPT are all the hype and are indeed very useful in enhancing workforce productivity. Reuters reports that the popular chatbot reached 100 million users in just two months after its launch. The app had 13 million daily unique visitors making it the fastest-growing consumer app in history.\n\nChatGPT uses Large Language Models and produces excellent content in the form of answers to the questions users may ask of it. However, the weakness lies in validating the truth in the training data. Where was the training data sourced from? If there are no guardrails on training data, bad data, incorrect facts and artifacts can make its way into the models. This can quickly spiral out of control as the AI then continuously learns from its echo chamber of misinformation. And yet the responses it returns will sound highly confident - the “hallucination” effect which is the true danger for recipients of the misinformation. There has been misinformation on the web for decades - the key difference here is in the conversational response misleading the recipient to believe the answer is from a true human expert."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Chapter Meeting",
        "date": "2024-06-27",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/300859951",
        "timezone": "America/New_York",
        "description": "This is an In-Person Event\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **Marc Frankel**\n\nTopic: AIBOM - summary TBD\n\nSpeaker 2: **TBD**"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa June 19th 2024: OWASP Top 10 for LLM Applications-A Detailed Review",
        "date": "2024-06-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/301345606",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=RvGPRaQUkoI\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **OWASP Top 10 for LLM Applications: A Detailed Review**\n\n**Abstract:**\nAs the adoption of Large Language Models (LLMs) in corporate and governmental organizations becomes increasingly common, it introduces unique security challenges that need immediate and effective management. This presentation provides a detailed overview of the OWASP Top 10 for LLM applications, which in less than eight months has already become a trusted resource on how to secure LLMs within and outside of the global cybersecurity community. The goal of the publication is to equip organizations with the knowledge to successfully navigate LLM security challenges. Beginning with a technical primer on AI, Machine Learning, and LLMs, the presentation will ensure a foundational understanding of the technology and its potential security risks. We will then review critical vulnerabilities such as Prompt Injection, Insecure Output Handling, Training Data Poisoning, Model Denial of Service, and Supply Chain Vulnerabilities, among others, and highlight the importance of recognizing and mitigating these risks as well as provide actionable advice for secure LLM implementation. Through this presentation, the audience will learn how to safeguard their LLM deployments against emerging threats, ensuring both the security and efficacy of these powerful AI tools in their organizational context.\n\n**Speakers:**\n**Simon Sulyma** is an expert in the fields of cybersecurity and information risk, with close to 20 years of experience designing, building, securing, and auditing complex IT systems at large financial institutions across Canada. Simon currently leads the Governance, Risk, and Compliance (GRC) function at the Global Wealth and Asset Management segment at Manulife. He frequently speaks at conferences, trainings, and meetups, organizes and participates in community events, and mentors people entering the cybersecurity field. Simon holds a Master's degree in Information Security and a number of certifications including CISA, CISSP, CISM, CRISC, CCSP, and AZ-500.\n\n**Diana Rogachova** is a Data Science and Machine Learning professional. In 2023, she graduated from a bootcamp where she subsequently worked as a Teaching Assistant for Data Science students. Her areas of interest are the intersection of Generative AI, cybersecurity, and privacy as well as the ethical use of AI. Diana holds the Machine Learning certification from Amazon Web Services (AWS) and is currently pursuing the Cybersecurity Certificate from ISC2. She also has a Bachelor’s Degree in Criminology and Criminal Justice from Carleton University and three years of experience in the criminal justice field."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-06-27",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/301347316",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "Secure Application Design: The Good, The Bad, and The Horrendous ",
        "date": "2024-06-25",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/301598509",
        "timezone": "America/New_York",
        "description": "For every application design \"best practice\", there is a matching \"worst practice\", or what some call security patterns and anti-patterns. Join us to review common anti-patterns, identify their accompanying secure design patterns, and commiserate about the worst offenders we've seen in the wild."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Designing an Efficient Penetration Test Suite",
        "date": "2024-07-18",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/301487187",
        "timezone": "America/Los_Angeles",
        "description": "How do you define the scope of penetration testing for a web application project? Is it the OWASP Top Ten, formal guidelines established by organizations such as NIST, security stories developed by the product owner and the security team, or recommendations made by your development team? The answer is all the above depending on the client, your development environment, and your capacity to take the risk.\n\nThis presentation will share experiences gained from penetration testing of a web application hosted by a Government agency providing professional licenses to its prospective clients. The nature of the project touched numerous areas such as CJIS (Criminal Justice Information Service), Personal Identifiable Information (PII), Access Control (Authorization in particular), and adherence to the security standard’s office guidelines. The challenge was to identify and prioritize the test suite that will cover these specific areas in a constrained time period. To enhance the coverage, the test suite had to include DAST (using ZAP) and some specific general scenarios.\n\nThe audience will take away some approaches that when applied can lead to a well balanced (both effective and efficient) penetration testing.\n\nSCHEDULE\nDoors open at 5:30. The talk will begin about 6pm.\n\nENTRY\nThere are doors on Washington and Broadway. Both of them auto-lock at 6pm. From 6 to 6:15pm, only the door on Broadway will be available. Take the elevator to the 11th floor.\n\nNO ENTRY AFTER 6:15 PM\nIt will not be possible to enter the building after 6:15.\n\nACKNOWLEDGEMENTS\nOur host again this month is NedSpace, a co-working space in downtown Portland--a friendly place to work when you don't want to work from home.\n\nFOOD\nWe don't yet have a sponsor for July, so there may not be food this time. Plan accordingly. (If you know a company that might like to sponsor, please put them in touch with us.)"
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro #15 [ONLINE]",
        "date": "2024-07-18",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/301724132",
        "timezone": "America/Sao_Paulo",
        "description": "Em julho teremos o nosso próximo encontro, online e com participação de todos através do **ZOOM**.\n\nVenha aprender e conversar **com um dos principais colaboradores** do OWASP Top 10 For LLM.\n\n**Link para a transmissão:**\nhttps://us06web.zoom.us/j/87962925968\n\n**Confira nossa agenda:**\n\n 19h30 \\~ 20h30\n**\"Segurança de IA na Prática: OWASP Top 10 para LLM Apps\"**\n\nNesta apresentação, exploraremos as melhores práticas de segurança para aplicações que utilizam Modelos de Linguagem de Grande Escala (LLM). Vamos discutir o OWASP Top 10, um guia essencial para identificar e mitigar os principais riscos de segurança nessas aplicações. Através de exemplos práticos e insights detalhados, você aprenderá como proteger suas implementações de IA, garantindo conformidade e segurança robusta. Esta sessão é fundamental para profissionais de segurança, desenvolvedores e líderes de tecnologia que buscam fortalecer suas defesas contra ameaças emergentes no campo da inteligência artificial.\n\n**Palestrante:** Emmanuel Guilherme Junior \\(Cybersecurity Leadership \\| AI & LLM Security \\| Cloud Security \\| OWASP Top 10 for LLM Core Team Member\\)"
    },
    {
        "group": "Scotland",
        "repo": "www-chapter-scotland",
        "name": "OWASP Scotland Chapter Meeting - June",
        "date": "2024-06-20",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-scotland-chapter/events/301560170",
        "timezone": "Europe/London",
        "description": "Join us at the OWASP Scotland Chapter Meeting where we have an exciting talk lined up focusing on mainframe hacking alongside a brief update from the OWASP Scotland Chapter leaders on OWASP flagship projects and global events.\n\nThis event is perfect for software developers, ethical hackers, and cybersecurity enthusiasts interested in learning about the latest trends in cyber security.\n\nAs usual, refreshments and a bite to eat will be provided.\n\n#### Talk 1 - OWASP Update\n\n**Speakers:** Rob Jansson, Sean Wright and Jim Slaughter\n\n#### Talk 2 – Hacking the Crown Jewels - The Mainframe!\n\n**Speakers:** Kev Milne & Hubert Januzewski\n'The Mainframe' is often overlooked as a legacy system that holds little importance in today's computing world. It is certainly seen as some mystical black box that should not be touched. The lack of access to Mainframes such as the IBM zSeries often does not make it easy to conduct research on these systems that process billions of transactions per year and hold sensitive data.\nDuring this talk we will give an insight into the history of Mainframes, some of their weaknesses (and strengths) and demonstrate some of the tools and exploitation techniques that can be used to assess, gain a foothold, and escalate privileges to SPECIAL. Finally, we will provide information on where to start learning about Mainframes with special attention paid to tapping into the free resources and emulators that exist out there.\n\n**About us**\nKev Milne is a technical specialist with 30 years of experience, and over 20 years of Cyber Security experience having started Pen Testing first in 1999. He is currently the Training and Infrastructure Manager for Security Testing in the Finance Industry. His job is to mentor, and motivate the next generation of testers whilst maintaining the Security Testing Labs.\nHubert Januszewski is a graduate of Abertay University Ethical Hacking course and is currently part an Offensive Security Testing Team in the Finance Industry where he conducts tests on everything from Infrastructure, Web Applications, Cloud and Mainframes! Hubert's interests include CTFs, Sci-fi books, games, and technology."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-07-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539096",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Practical Web App Pentesting for Beginners",
        "date": "2024-06-28",
        "time": "11:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/301592291",
        "timezone": "America/Los_Angeles",
        "description": "*Join us for a two-hour workshop designed to introduce you to the exciting world of web application penetration testing. This event is proudly delivered by [TCM Security Academy](https://academy.tcm-sec.com/), [OWASP Seattle](https://owasp.org/www-chapter-seattle/), and [WiCyS Western Washington](https://www.linkedin.com/company/women-in-cybersecurity-wicys-western-washington/).*\n*The workshop is perfect for beginners looking to start their journey in application security. You'll learn practical skills for identifying and exploiting common web vulnerabilities, with a focus on real-world scenarios and hands-on exercises.*\n*[Alex Olsen,](https://www.linkedin.com/in/alex-olsen-ase/) from [TMC Security](https://tcm-sec.com/) will be delivering this practical workshop focusing on the basics of web app pentesting, exploring the [OWASP Top 10 vulnerabilities](https://owasp.org/www-project-top-ten/), and diving into specific issues like injection flaws, logic problems, and access control weaknesses. We'll also discuss where to go next in your learning journey, including career paths in AppSec and resources for skill development. The event will conclude with a Q&A session, giving you the opportunity to ask questions and gain insights from experienced professionals.*\n*Whether you're a developer, IT professional, or simply curious about cybersecurity, this workshop will provide valuable knowledge and practical experience to kickstart your path in web application security.*\n*Google Meet link will be shared with all registered participants 24 hours prior to the event.*"
    },
    {
        "group": "Tallinn",
        "repo": "www-chapter-tallinn",
        "name": "OWASP Tallinn - Modern Cryptography - Vol. 2",
        "date": "2024-07-04",
        "time": "18:30+03:00",
        "link": "https://www.meetup.com/owasp-tallinn/events/301615501",
        "timezone": "Europe/Tallinn",
        "description": "** Welcome to the Summer Event of OWASP Estonia: Modern Cryptography - Vol. 2 **\n\n In this event we'll host two very special speakers:\n\n**Stefano Alberico**, tech lead mentor at **NATO DIANA** accelerator and founder at Skudo, is a technology visionary with 25 years of international experience.\n\nHe is very problem solving oriented and prefers to set up a demo with a Raspberry Pi rather than only explaining things on a PPT.\n\nHe is now focused on hardware encryption (HSM and PKI) for space and drone applications, based on Skudo's own FPGA implementation.\n\n Speech: *more details coming soon*\n\n\\-\\-\\-\n\n**Jelizaveta Vakarjuk** is a junior researcher in Cybernetica and industrial PhD student at Tallinn University of Technology. Her research focuses on post-quantum cryptography, privacy-preserving cryptography, and security of voting systems. Mainly she studies post-quantum digital signatures, but also focuses on the aspects of migration to post-quantum cryptography.\n\n Speech: **Obstacles of migration to post-quantum cryptography**\n\nWith the rising development of quantum technologies there is an urgent need to secure existing IT infrastructure against quantum threats. Introducing post-quantum cryptography to present systems could protect them against future quantum computer attacks. Still, post-quantum migration is a challenging process which requires systematic planning and years of execution. In this talk, I will share what are the main migration obstacles in example of Estonian e-services.\n\n **And That's Not All - More Surprises Await!** Whether you're a cybersecurity professional, a tech enthusiast, or just curious about cryptography, there's something for everyone!\n\n **Connect, Collaborate, and Create:** This event is more than just talks - it's a platform to connect with like-minded folks!\n\n **Mark Your Calendars:**\nThursday 04th July at 18:30 - 20:30\nWorkland Maakri 19\n\n **Limited seats, registration on Meetup required!** "
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Webauthn - WTF or FTW?",
        "date": "2024-07-18",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516371",
        "timezone": "America/Vancouver",
        "description": "**Webauthn - WTF or FTW?** with Don Burks\n\nWhile it has been around for a few years, the Web Authentication Standard (or Webauthn) is just starting to become mainstream. This talk will explore some of the real-world applications of this technology, in particular discussing adoption strategies, observability practices, and evaluating Webauthn against other strategies such as OAuth and 2FA.\n\n**Don Burks** is a technical leader who has been working in the industry for over 25 years. Former Head Instructor of Lighthouse Labs and with experience both in startups and FAANG companies, Don's background in software development and technical leadership has provided a wealth of experience which he shares in books, talks, and the great teams with which he gets to work. Currently, Don is the Director of Engineering for Bulletproof Studio Tools, based in Vancouver, BC."
    }
]