[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - September",
        "date": "2023-09-26",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/295755057",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus og DEIF holder vores næste meetup tirsdag d. 26. september i Aalborg fra 19.00 - 21:30.\n\nVi vil meget gerne, hvis I hjælper hinanden ved at arrangere fælleskørsel. Skriv meget gerne her!\n\nDetaljerne er ikke helt på plads, men Jens Myrup Pedersen kommer og fortæller om hans erfaring med Cyberlandsholdet og Robert Nedergaard Nielsen fortæller om Haaukins-platformen.\n\nOm Jens:\n\nJens Myrup Pedersen er professor på Aalborg Universitet, hvor han primært forsker i netværkssikkerhed og tidlig detektion af skadelig aktivitet, og hvor han er ansvarlig for kandidatuddannelsen i Cybersikkerhed. Jens er også involveret i en række projekter der skal øge viden om og interesse for cybersikkerhed blandt unge, herunder Cyberskills - og så har han siden 2021 været landstræner for Cyberlandsholdet.\n\nTitel: Cyberlandsholdet For The Win\n\nKort beskrivelse:\n\nKom med på rejsen bag Det Danske Cyberlandshold, der i 2022 - som det mindste land nogensinde - vandt de Europæiske Mesterskaber i tæt konkurrence med store lande som Tyskland og Frankrig. Hvert år dyster hundredevis af unge danskere om en plads på Cyberlandsholdet. En konkurrence, der starter med åbne online trænings-sessions der er tilgængelige for alle og ingen særlige forudsætninger kræver, og som går gennem Kvalifikationsrunde, Regionale Mesterskaber og Nationale Mesterskaber til den eftertragtede Bootcamp med kun 25 pladser, hvoraf 10 ender på landsholdet. Men det er ikke kun en konkurrence: Det er også et vigtigt projekt for at øge interessen for cybersikkerhed blandt unge, og derfor er det så vigtigt også at skabe noget fedt for det store flertal der ikke kommer på Landsholdet. “Cyberlandsholdet For The Win” handler om landsholdets sejr, om arbejdet med at øge interessen for cybersikkerhed blandt unge, og om hvorfor de to dele hænger så tæt sammen.\n\n\\- Robert Nedergaard Nielsen er videnskabelig assistent på Aalborg Universitet\\, hvor han spiller en hovedrolle i projekter som Cyberskills og De Danske Cybermesterskaber\\. Han har mere end 5 års erfaring med udvikling\\, drift og anvendelse af træningsplatformen Haaukins\\, der kombinerer CTF\\-formatet med læring og træning\\.\n\n\\- Robert vil præsentere Haaukins\\-platformen\\, og de valg der ligger bag i forhold til at skabe en platform\\, der er egnet til “begyndere” indenfor cybersikkerhed \\- herunder de mange IT\\-professionelle\\, der gerne skal opnå en grundlæggende viden om sikkerhed uden nødvendigvis at blive eksperter\\. Deltagerne får også mulighed for selv at arbejde med på nogle af opgaverne\\, der indgår som eksempler i oplægget\\."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2023 (Online)",
        "date": "2023-09-26",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705763",
        "timezone": "America/Chicago",
        "description": "*Due to the meeting location host supplying lunch for attendees, so we have sufficient foods, if you would like to attend in-person at NI, please see* -- [https://owasp-austin-2023-september.eventbrite.com](https://owasp-austin-2023-september.eventbrite.com).\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Baku",
        "repo": "www-chapter-baku",
        "name": "OWASP Baku - Show Must Go On",
        "date": "2023-09-29",
        "time": "5:00+04:00",
        "link": "https://www.meetup.com/owasp-baku-chapter/events/295899957",
        "timezone": "Asia/Baku",
        "description": "## Fortifying the Future of Application Security\n\nJoin us for an exciting online event, **OWASP Baku - Show Must Go On**! This is your chance to dive into the world of web application security and network with like-minded professionals. Our expert speakers will share their knowledge and insights on the latest trends, challenges, and best practices in the field. Don't miss out on this incredible opportunity to learn, grow, and connect with the cybersecurity community. Mark your calendars and get ready for an unforgettable experience!\n\n**Event Agenda**\n\n1. **Azar Alili** \\- Welcoming 3:00 PM \\- 3:10 PM\n2. **Sabuhi Safarov** \\- Threat Modeling 3:10 PM \\- 3:25 PM\n3. **Aghadadash Guliyev** \\- The Art of Deception 3:25 PM \\- 3:40 PM\n4. **Sakhavat Suleymanli** \\- Secure Coding Best Practices 3:40 PM \\- 3:55 PM\n5. **Javid Alizadeh** \\- DevSecOps vs\\. DevOps 3:55 PM \\- 4:10 PM\n6. **Orhan Jan** \\- Mobile Application Pentest: Best Practices and Emerging Threats 4:10 PM \\- 4:25 PM\n7. **Q&A** 4:25 PM - 5:00 PM"
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "OWASP Belfast September meetup",
        "date": "2023-09-28",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/295904214",
        "timezone": "Europe/London",
        "description": "Hello OWASP Belfast!\n\nWe are delighted to announce our next hybrid event for 2023 with an exciting lineup of talks from local industry leaders. The Meet up will be in partnership with ESO, who have also kindly offered to host the evening and provide pizza, beers, and soft drinks for everyone.\n\n**Date: 28th September 2023**\n\n**Time: 6.00 PM**\n\n**Location: ESO, 42 Fountain St, Belfast BT1 5EF.**\n\n**Zoom Link:** [https://eso.zoom.us/j/95951081970?from=addon](https://eso.zoom.us/j/95951081970?from=addon)\n\nFirst, we will share an example of how identifying and assessing an attack on an application was used to gain insights into attacker behavior, and how invaluable this can prove in informing future actionable steps to prevent exposure. Next, we will present an overview of the key vulnerabilities associated with the use of social media in business and how easy it is to experience a breach when you do not have the correct policies and procedures in place. We will then delve into the world of ethical hacking, exploring the most common \"low-hanging fruit\" issues encountered over the past year. We will focus on prevalent vulnerabilities like HTML injection, Insecure Direct Object References (IDOR), and authentication flaws. Finally, we will finish with a technical talk from Ciaran from Rapid 7 who will take you through software supply chain software issues – malicious attackers, unsuitable licenses, and deprecated code which can all lead to problems in stuff that used to \"just work\". He will talk about how (despite what sales teams might tell you) there’s no single simple solution to this and show you how to manage your risk in an achievable way.\n\n**Agenda:**\n\n6.00 - 6.20 Networking & Food\n\n6.20 - 6.30 Welcome to ESO Finian / Sarah\n\n6:40 - 7:00 Talk 1: \"The Safety Law of An Idiot Next to You\" by Tanya Vacarda\n\n7:00– 7:20 Talk 2: \"From Likes to Leaks: Understanding the Security Risks of Social Media\" by Anne-Marie O'Donnell\n\n7:20 – 7:30 BREAK (10 min)\n\n7:30 – 7:50 Talk 3: \"Hacking For Devs: Bridging the Gap Between Developers and Hackers\" by Jacob Steadman\n\n7:50 – 8:10 Talk 4 \"A Pragmatic Approach to Software Supply Chain Security\" by Ciaran Conliffe\n\n8.10 - 8.30 Networking and Exit\n\n**Disclaimer**\n\nAs always, our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nOWASP, the Open Web Application Security Project, is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. So come along to Belfast chapter meetings if you would like to hear about, or share information with the community on how to ethically hack your own systems, how to defend your applications, and how to build security into your applications. Chapter meetings also provide a great opportunity to meet like-minded people with similar interests for general discussion, chit-chat, and banter!\n\n**Speaker Info:**\n\nTanya Vacarda - Allstate NI, Sr. Consultant [https://www.linkedin.com/in/tanyavacarda/](https://www.linkedin.com/in/tanyavacarda/)\n\nJacob Steadman- Vertical Structure Ltd, Ethical Hacker/Lead Penetration Tester [https://www.linkedin.com/in/jacob-steadman-08b17395/](https://www.linkedin.com/in/jacob-steadman-08b17395/)\n\nAnne-Marie O'Donnell, BH Consulting Ltd, Cybersecurity Consultant [https://www.linkedin.com/in/anne-marie-o-donnell-71536411a/](https://www.linkedin.com/in/anne-marie-o-donnell-71536411a/)\n\nCiaran Conliffe, Security Architect, Rapid7 [https://www.linkedin.com/in/ciaran-conliffe-7133843a/](https://www.linkedin.com/in/ciaran-conliffe-7133843a/)\n\n**Additional Information**\n\nESO is located between Waterstones bookshop and the back of Boots in Belfast city center. They have two working lifts. ESO employees will be at the door to welcome attendees and show them to the meetup space."
    },
    {
        "group": "Bogota",
        "repo": "www-chapter-bogota",
        "name": "RESUMEN DE DEFCON, BSIDES Y BLACK HAT EN LAS VEGAS",
        "date": "2023-09-28",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-bogota-meetup-group/events/296199949",
        "timezone": "America/Bogota",
        "description": "Después de un tiempo sin poder reunirnos, estamos listos para iniciar con las charlas y laboratorios. El próximo evento se llevará a cabo el **28 de septiembre de 2023, de 6:00 a 8:00 P.M. en la Universidad del Rosario**\n\nEn esta ocasión, exploraremos los eventos de DEFCON, BSIDES y BLACK HAT en Las Vegas, tres de las conferencias de seguridad más destacadas en el mundo. Analizaremos las tendencias, avances y noticias más relevantes que surgieron en estos eventos, contaremos con compañeros que vivieron estos eventos y nos contarán su experiencia.\nAdemás, durante la reunión, los asistentes tendrán la oportunidad de ganarse uno de los dos bags oficiales de DEFCON que tenemos para ustedes. No te pierdas la oportunidad de adquirir nuevo conocimiento y la posibilidad de ganarte uno de estos premios.\nEsperamos que este espacio nos permita reconectarnos como comunidad\n\nUn agradecimiento muy especial a la Universidad del Rosario\n\nLos esperamos!!"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter October 2023 Meetup",
        "date": "2023-10-11",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/295661579",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person at 5:30pm or online at 6:30pm (link to be provided to attendees).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nPresentation and speaker update coming soon!"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "October Meetup",
        "date": "2023-10-17",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/295904341",
        "timezone": "Europe/London",
        "description": "We're back, somewhere near Queen Square, exact details to be confirmed Soon™... but it should at least be on Tuesday 17th October!"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - September 2023",
        "date": "2023-09-26",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/295901737",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "Adding SAST to CI/CD, Without Losing Any Friends",
        "date": "2023-09-26",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-cambridge-meetup/events/295961836",
        "timezone": "Europe/London",
        "description": "Hosted by the Cyber Security & Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, & BCS Cybercrime Forensics SG\n\n**Background**\n\nThe **BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG)** promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.\n\n**OWASP (Open Web Application Security Project)** is a 501(c)(3) not-for-profit worldwide charitable organisation focused on improving the security of application software. Their mission is to make application security visible, so that people and organisations can make informed decisions about true application security risks.\n\n**The Cyber Security and Networking (CSN) Research Group** at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, CIISec & the Cyber East Cluster amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment.\n\n**Abstract : Adding SAST to CI/CD, Without Losing Any Friends**\n\nEveryone wants to put tests into the release pipeline, but no one wants to wait hours for them to finish. In this learning lab we will discuss multiple options for adding static application security testing (SAST) to your CI/CD, in ways that won’t compromise speed or results, such as learning which results can be safely ignored, writing your own rules, company-specific checks, scanning PRs instead of commits, splitting blocking scans versus deep audit scans, etc. We will also cover ways to continuously find vulnerabilities.\n\n**Provisional Agenda**\n\n16:45 - Webinar waiting lobby opens\n17:00 - Start of Presentation\n17:50 – Questions & Answers"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS September 2023",
        "date": "2023-09-28",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/295850529",
        "timezone": "America/Denver",
        "description": "Speaker: Jeff Tomkiewicz: \"Gone Vishing: A DEFCON 31 Social Engineering Story\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\n\nhttps://cyber-center.org/"
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "Le métier de l’auditeur informatique: Défis et Opportunités",
        "date": "2023-10-19",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/295924258",
        "timezone": "Africa/Porto-Novo",
        "description": "**Les normes et standards d’audit de la fonction informatique au sein d’une organisation: Valeurs pratiques.** Après avoir présenté l’importance des normes et standards pour l’audit de la fonction informatique au sein d’une organisation, le conférencier fera la genèse des normes et standards propres au Bénin. Il mettra l’accent sur comment les entreprises béninoises pourront s’approprier ces normes pour leur permettre d’aligner la fonction informatique\navec les besoins métiers. Quelles sont les normes et standards qui s’imposent à une entreprise béninoise? Comment s’approprier ces normes et standards? En quoi la mise en œuvre de normes et standards sont bénéfiques pour une organisation?\n\n**L’importance de l’audit dans la vie d’une organisation: Leçons apprises.**\nLe conférencier de part son expérience d’auditeur au sein des structures publiques et privées de finance présentera les leçons apprises de l’audit. Quelles leçons peut-on apprendre après plus de 10 années d’audit de structures financières? Quels sont les défis? Quelles sont les opportunités?"
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Exploring MITRE ATT&CK Framework Adoption With Cybera",
        "date": "2023-10-04",
        "time": "7:00-06:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/296139404",
        "timezone": "America/Edmonton",
        "description": "## Details\n\n  \n**RSVP to attend** – **limited space available.** This assists in fire code compliance and planning CATERING and DOOR PRIZES for everyone's enjoyment.\n  \n\n**Event Description:**\nPrepare to embark on a cybersecurity odyssey as OWASP Edmonton proudly presents an illuminating event in collaboration with [Cybera](https://www.cybera.ca/), a cybersecurity trailblazer. Join us for a captivating session where Cybera will unravel their remarkable voyage through the MITRE ATT&CK framework and share invaluable lessons gleaned from their adoption journey.\n\n**Who is Cybera? (cybera.ca)**\nCybera is Alberta's research and education network facilitator, responsible for driving connections, collaborations and skills growth through the use of digital technology.\n\nTheir mission is to connect Alberta to the world, enabling and advocating for better services, collaborations and skills growth through the use of digital technology.\n\nTheir vision is to ensure a connected, secure and equitable digital future for every Albertan.\n\n**Navigating the Adoption Process:**\nCybera will divulge their experiences, offering insights into the intricacies of implementing the MITRE ATT&CK framework. Explore the challenges they surmounted and the victories they achieved. Learn firsthand from their expedition through the cybersecurity landscape and how this framework fortified their defenses against cyber threats.\n\n**Culinary & Sponsor Notes: iON United (ionunited.com)**\nTo fuel your cybersecurity exploration, iON United generously sponsors a delectable pizza feast for all attendees. Savor a slice while mingling with peers and immersing yourself in conversations about the ever-evolving cybersecurity landscape.\n\nDon't miss this unparalleled opportunity to broaden your horizons, gain practical insights, and expand your professional network. Whether you are a seasoned cybersecurity practitioner or a newcomer to the field, this event promises to inspire, inform, and empower.\n\n**Date & Time:**\nOctober 4th, 5:00 PM -6:30 PM\n\n**Location:**\nNorquest College\n*10215 108 St NW, Edmonton, AB T5J 1L6*\n*Room 3-071 - SCFL - Downtown*\n\nFor parking, please see the highlighted area in the photo below."
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "[on-prem] Ein Erfahrungsbericht zu Responsible Disclosure",
        "date": "2023-09-26",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/296182090",
        "timezone": "Europe/Berlin",
        "description": "Moin / Hi,\n\nnext talk will be in German.\n\nWir sind zu Gast bei Check24 am Anfang der Außenalster (Nähe Hotel Atlantic) In Fußmarschentfernung vom Hauptbahnhof.\n\nAus planungstechnischen Gründen (Verpflegung) unseres Hosts sag mir bitte per Mail oder hier bei Meetup Bescheid, wenn du dazustoßen möchtest.\n\nGeplant ist, den Vortrag auch zu streamen. In dem Fall bitte NICHT auf \"RSVP: ja\" drücken, da das sonst die Planung unseres Gastgebers durcheinander bringt (Stream-URL: https://lecture.senfcall.de/dir-o5v-cka-yx7)\n\n**TL;DR**\n===\n\nTitel: \"Responsible Disclosure at Scale: ein Erfahrungsbericht\"\nSprecher: Max Maaß\nLokation: Check24, An der Alster 64, 20099 Hamburg\nStart: 26.9.2023, 18:30 Uhr, Einlass ab 18 Uhr\nNetworking danach: TBD\n\n**Abstract**\n===\n\nIn Zeiten automatischer Scanner wird es zunehmend leichter, im großen Stil Webseiten auf Sicherheits- und Datenschutzprobleme abzuklopfen. Doch was macht man eigentlich, wenn man fündig geworden ist? Wie kriegt man die Betreiber:innen der Webseiten dazu, die Probleme zu beheben? Das war die Frage, die sich uns vor ein paar Jahren stellte - und wenn man schon an einer Uni promoviert, dann macht man eben ein paar Studien zu dem Thema.\nIn diesem Talk möchte ich euch einen kurzen Überblick darüber geben, was danach geschehen ist. Ich berichte von den Antworten, die wir auf unsere Benachrichtigungen bekamen - von Geschenken über Misstrauen bis hin zu Verschwörungstheorien. Und ich berichte über die Ergebnisse der Studien: Was hat funktioniert, und was nicht? Am Ende des Vortrags habt ihr hoffentlich eine bessere Idee, was euch bei einer solchen Aktion erwartet - im Guten wie im Schlechten.\n\n**Generelles zum OWASP-Stammtisch**\n===\n\nBei unseren offenen Treffen geht es um Software und deren Sicherheit im Internet und/oder IT-Security allgemein. Es treffen sich Leute, die sich beruflich oder privat damit auseinandersetzen: Entwickler, Manager, \"Pentester\" und alle an (Web)sicherheit interessierte. Die Atmosphäre ist offen und locker. Uns geht's um den Erfahrungsaustausch, Technikschnack und ums Netzwerken. Wer Produkte oder Dienstleistungen verkaufen will, ist hier falsch. Ihr seid herzlich willkommen, Kollegen oder Bekannte den Hinweis auf unser Treffen weiterzuleiten. Alle Treffen sind frei, für jeden offen und kostenlos.\n\nSchönen Gruß, Björn / Dirk"
    },
    {
        "group": "Hong Kong",
        "repo": "www-chapter-hong-kong",
        "name": "DevSecOps Lab",
        "date": "2023-10-13",
        "time": "6:00+08:00",
        "link": "https://www.meetup.com/owasp-hong-kong-chapter/events/296247917",
        "timezone": "Asia/Shanghai",
        "description": "DevSecOps Lab - Security in the CI/CD pipeline as code.\nPrerequisite: GitHub account, AWS account."
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "OWASP Houston Chapter API Security Study Group",
        "date": "2023-09-26",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/296209716",
        "timezone": "America/Chicago",
        "description": "This is the kickoff for the study group sessions. This first round of sessions will cover API Security. It will last several months with end date TBD.\n\nThis session is an introduction to API Security Top 10 2023.\nhttps://owasp.org/www-project-api-security/\n\nFuture sessions will include lab setup and working through crAPI challenges.\nhttps://github.com/OWASP/crAPI"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-10-09",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/296020744",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - SEPT 27, 2023",
        "date": "2023-09-27",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294467841",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Safety in your Embedded Systems, how to Prepare for the next Generation\n\nJoin us for great networking, dinner and drinks, and see a presentation by **Stephen Olsen**, Principal Field Application Engineer for North America with BlackBerry QNX.\n\n**ABSTRACT**: Discover the intricate connection between safety and security in product development, where safeguarding against external threats and internal risks is paramount. Delve into the nuances of isolating safety and non-safety functions, along with securing data. This talk addresses the significance of safety across various industries, particularly in the evolving medical field. Gain insights into the concept of virtualization and its optimal application. Explore why safety matters, its diverse applications, and the critical need to protect cutting-edge devices. A must-attend discussion for those shaping the future of embedded systems.\n\n**Thanks to our Sponsor**: *[BlackBerry QNX](https://blackberry.qnx.com/en)*\n\n*BlackBerry® QNX® is a trusted supplier of commercial operating systems, hypervisors, development tools, support, and services, all purpose-built for the world’s most critical embedded systems. BlackBerry QNX helps customers streamline their development efforts to efficiently launch safe, secure, and reliable systems. Our technology is trusted in more than 235 million vehicles and is deployed in embedded systems around the world across a range of industries including aerospace and defense, automotive, commercial vehicles, heavy machinery, industrial controls, medical, rail and robotics.*\n\n**SPONSORSHIP Opportunities Available**\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "October 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-10-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/296179697",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Radboud University, Huygens building\n**Address:** Heyendaalseweg 135, Nijmegen\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **TBA** by **Marinus Kuivenhoven**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Unveiling the secrets in your code: Detecting and Triaging exposed credentials at scale** by **Ingmar Vis**\n\n**Unveiling the secrets in your code: Detecting and Triaging exposed credentials at scale**\n*Abstract:*\nSecurity misconfigurations are often easy to exploit but also easy to avoid. How can we raise security awareness and at the same time prevent security misconfigurations (such as leaked credentials) from reaching production? Is there an easy way to scan, triage and follow-up on exposed secrets at enterprise scale? ABN Amro open sourced Repository Scanner and runs Repository Scanner internally at scale, exposing secrets in source code repositories and thereby raising security awareness while at the same time improving the security posture by remediating security misconfigurations.\n\n*Bio:*\nIngmar Vis has been working in CICD for 7 years. In his current role, Ingmar acts as a Product Owner for 2 teams at ABN Amro. 1 team is responsible for delivering the Secure Coding capability for all developers, the 2nd team is responsible for the infrastructure and automation of CICD tooling. Ingmar works on aspects such as Static Analysis, Software Composition Analysis, Container Security, and Secret Detection."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Global AppSec - Singapore",
        "date": "2023-10-03",
        "time": "4:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/294274627",
        "timezone": "Pacific/Auckland",
        "description": "Join us for the 2023 Global AppSec-Singapore (virtual) conference.\n\nConference will be presented through the conference's Whova app (access provided after registration) and training will be presented via Zoom (private links provided to registrants).\n\n**NOTE:** The conference's schedule is 9:00 a.m. - 5:00 p.m. Singapore Time (UTC+8) each day.\n\nDesigned for private and public sector InfoSec professionals, the one-day OWASP conference equips developers, defenders, and advocates to build a more secure web. We are offering educational\n\n* Three (3) one-day training courses, 4th October - US $260\n* API Security Testing 101 (Abdessamad Temmar)\n* Threat Modelling: From none to done (John DiLeo)\n* Don’t trust my input: Frontend Security for Developers (Gian-Luca Frei)\n* One (1) two day training course, 3rd-4th October - US $1,010\n* Hacking Modern Web Apps - Master the Future of Attack Vectors (Ashwin Shenoi)\n* One-day conference, 5th October - US $35.00\n\nConference and Training schedule: [https://singapore.globalappsec.org/schedule/](https://singapore.globalappsec.org/schedule/)\nRegistration link: [https://whova.com/portal/registration/owasp_202310/](https://whova.com/portal/registration/owasp_202310/)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Safety in your Embedded Systems / An Enterprise on Fire",
        "date": "2023-09-28",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/296097192",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n**Thanks to our Sponsor**: *[BlackBerry QNX](https://blackberry.qnx.com/en)*\n*BlackBerry® QNX® is a trusted supplier of commercial operating systems, hypervisors, development tools, support, and services, all purpose-built for the world’s most critical embedded systems. BlackBerry QNX helps customers streamline their development efforts to efficiently launch safe, secure, and reliable systems. Our technology is trusted in more than 235 million vehicles and is deployed in embedded systems around the world across a range of industries including aerospace and defense, automotive, commercial vehicles, heavy machinery, industrial controls, medical, rail and robotics.*\n\n**Speaker 1:** **Rich DesMarais** & **Stephen Olsen**\n\n**Topic1 :** Safety in your Embedded Systems, how to Prepare for the next Generation\n\n**Abstract:**\nDiscover the intricate connection between safety and security in product development, where safeguarding against external threats and internal risks is paramount. Delve into the nuances of isolating safety and non-safety functions, along with securing data. This talk addresses the significance of safety across various industries, particularly in the evolving medical field. Gain insights into the concept of virtualization and its optimal application. Explore why safety matters, its diverse applications, and the critical need to protect cutting-edge devices. A must-attend discussion for those shaping the future of embedded systems.\n\n**Bio:**\nRich DesMarais is the Regional Sales Manager for Aerospace & Defense in the US as well as Medical, Industrial, and Rail in the Southwest working with customers on embedded Real-Time Operating Systems and Security software. His background includes helping customers to create Safe & reliable systems. His design background was in Printed Circuit Processor Boards, Application Specific Integrated Circuits, Embedded Devices and supporting ECAD Software.\n\nStephen Olsen is an embedded industry expert with extensive experience in embedded software\ndevelopment and communications. He is currently a Principle Field Application Engineer for North\nAmerica with BlackBerry QNX. Stephen worked with several other real time operating systems in many\nroles, including product line management, system architecture, and engineering management. He co-\nchaired VSIA's hardware dependent software working group, and has authored many papers on safety\ncertifiable systems, system architecture, USB, and multicore/multi-OS design, and power management.\n\n**Speaker 2:** K \"Turb0Yoda\" Singh & Bluescreenofwin\n\n**Topic 2:** An Enterprise on Fire: Successful Strategies in Triage\n\n**Abstract:**\n0900 PST. You grab your cup of coffee and get into your chair. You begin the day with some small cheese factory in Wisconsin claiming that they've been hacked. As you log in, you behold default creds, no MFA, and a small Cisco firewall set to ALLOW ANY:ANY because hey, having a rule means passing compliance checks. In the corner of your eye, you suddenly start to see alerts appear. Mimikatz, Metasploit, some Cobalt Strike Beacons, LSASS dumps, the lot quickly piles on and on in your environment. No amount of caffeinated adrenaline will help as you watch your environment go up in flames.\nEven the most seasoned veterans can be stricken by keyboard fright when facing the unknown state of a compromised system. Maybe your playbooks are woefully inadequate, out of date, or simply don't exist. Perhaps you've assumed that your tooling will feed you information, but the right information may not always be available or easily consumable. It can be daunting when faced with the prospect of manual box-by-box triage.\nIf you've ever been in any of the aforementioned situations and have stared in incredulity at your terminal then this talk is for you.\nWe will examine the compromised environment from the 2023 WRCCDC security competition and discuss the foundation of the competition and the infrastructure from where all the data was pulled.\n\n**Bio:**\n“K” Singh is currently an Incident Response Consultant at CrowdStrike. Previously an Incident Response Consultant and the Forensic Lab Manager for the Global Incident Response Practice at Cylance - \"K\" has worked with multiple Fortune 500 companies, sector-leading firms, and healthcare organizations in a variety of engagements ranging from Incident Response to Traditional “Dead Disk” Forensics and E-Discovery.\n\nBluescreenofwin is a senior security engineer and Windows hacker. He is currently employed in the \"entertainment\" business making sure your favorite time on the Internet goes uninterrupted. He runs infrastructure for WRCCDC, brews copious amounts of delicious beer for consumption, and is a connoisseur of dank memes and handsome squidwards. Will vCISO for dogecoin.\n\n**Schedule:**\n6:00pm - 6:30pm Networking, Food & Drink\n6:30pm - 7:30pm First Presentation\n7:30pm - 8:30pm Second Presentation"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-09-28",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/295239486",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Poland Day 2023 - The truly underground IT security conference",
        "date": "2023-10-04",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/295385092",
        "timezone": "Europe/Warsaw",
        "description": "OWASP Poland Day 2023 - Guido Coal Mine - Zabrze\n\n**[Register using this link](https://owasp-poland-day-2023.eventbrite.com/?aff=meetup)**\n\n(event is paid, but we are doing our best to keep it as low as possible)\n\nOWASP Poland Day is the largest annual security conference in Poland focused on topics related to application security. The conference brings together developers, penetration testers and CISOs responsible for ensuring application security. Apart from great presentations delivered by leading application security professionals and researchers the conference will be fantastic networking opportunity.\n\nAfter the pandemic we are back with an even better conference. Since we organize it in Silesia, it will be very unique – probably the only one in the world application security conference:\n\n* 320 meters under the ground\n\n* Held in coal mine and museum\n\n* 2 tracks, 17 presentations. 300+ attendees.\n\nIf you want to attend, you have to use Eventbrite for registration. Please do not RSVP using Meetup. It's a paid event but we are doing our best to keep entrance fee as low as possible, just to cover venue, coffee and lunch, speakers expenses, evening networking event etc.\n\n**Register at: [https://owasp-poland-day-2023.eventbrite.com/?aff=meetup ](https://owasp-poland-day-2023.eventbrite.com/?aff=meetup)**\n\nAgenda and speaker list at: [https://owasp-poland.day/](https://owasp-poland.day/)\n\nPlease spread the word!"
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro 013 [ONLINE]",
        "date": "2023-09-28",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/296067036",
        "timezone": "America/Sao_Paulo",
        "description": "Em setembro teremos o nosso próximo encontro, será no dia 28/09 (quinta-feira), a partir das 19h30, online em nosso canal do YouTube.\n\n**Link para a transmissão:** https://www.youtube.com/watch?v=-xYckJK3VY8\n\n**Confira nossa agenda:**\n\n**19h30-20h30**\n**\"Generative AI na Criação de Ataques Cibernéticos\"**\n\nNesta palestra sobre \"Generative AI na Criação de Ataques Cibernéticos\", exploraremos como a inteligência artificial generativa, como as Redes Generativas Adversariais (GANs), está sendo utilizada por cibercriminosos para criar deepfakes e conteúdo sintético enganoso. Abordaremos os desafios e riscos que essa tecnologia traz para a segurança cibernética e a privacidade, discutindo casos reais de ataques prejudiciais. Além disso, examinaremos técnicas de detecção e defesa contra ameaças geradas por IA e refletiremos sobre questões éticas e regulamentações necessárias para um uso responsável da Generative AI.\n\n**Palestrante:** Alestan Alves (Data Lead na TOTVS)\n\nAlestan Alves é um criador, hacker ético e dev desde sempre. Trabalha na TOTVS como Data Lead e compartilha sobre tecnologia na página @ackercode . Ama a área de dados, hacking e inteligência artificial e está acostumado com linguagens como Go, Python e Rust."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-10-11",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296259961",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Pub evening - OWASP meet up and after-work near Odenplan",
        "date": "2023-09-28",
        "time": "7:00+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/293021766",
        "timezone": "Europe/Stockholm",
        "description": "While the summer holidays may be behind us, there's no reason to stop the fun. This is the perfect opportunity for all of us app-sec interested folks to get together and meet up in real life for a relaxed chat and maybe a beer or some other refreshments.\n\n When: September 28th, 2023\n Where: The Old Brewer - Public House & Dining Room at Luntmakargatan 98, 113 51 Stockholm\n\nExpect:\n Quick AppSec Tips\n Networking\n Drinks & Laughter\n\nThe meeting will start at 17:00, but it's a casual event so turn up when it suits."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - September 2023",
        "date": "2023-09-26",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/295821190",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Unlocking Cybersecurity Insights: New Open Source Tools for Defense Modeling",
        "date": "2023-10-13",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/296273644",
        "timezone": "America/New_York",
        "description": "Join us for an OWASP chapter meeting that delves deep into the world of cybersecurity defense modeling! In this enlightening session, we'll explore the art of attack path mapping and unveil a dynamic duo of innovative open-source tools designed to bolster your security posture. Our first tool, ADM, is a powerful command-line interface (CLI) solution engineered to effortlessly process .adm files structured in accordance with the attack-defense model. As we dive further, you'll discover ADSM, an ingenious tool that can seamlessly associate attack and defense specifications, all elegantly composed in the ADM language, with each entity and flow within your security model.\nThese cutting-edge tools promise to revolutionize your approach to cybersecurity by providing clearer insights into vulnerabilities and defense strategies. Whether you're a seasoned security professional or just starting your journey in the field, this meeting is a must-attend to stay ahead of the game in today's ever-evolving threat landscape. Don't miss out on the opportunity to strengthen your defenses and enhance your understanding of cyber threats – secure your spot today!"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup: Developer mode",
        "date": "2023-09-27",
        "time": "8:30-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/296064633",
        "timezone": "America/Montevideo",
        "description": "¿Te interesa una práctica de ciberseguridad pensada **exclusivamente para desarrolladores**?\n\nEn esta Meetup, utilizando el proyecto [OWASP Secure Coding Dojo](https://owasp.org/www-project-secure-coding-dojo/) tendremos una sesión de ejercicios que incluyen **revisión de código** y **detección de vulnerabilidades**. Los desafíos son guiados y se cuenta con el apoyo de expertos en seguridad de aplicaciones.\n\nSolo precisas **llevar una notebook** para participar, sin descarga de materiales o herramientas. Solo se utilizará un navegador.\n\nEn esta instancia la Meetup será en las oficinas de [Switch Software Solutions](https://goo.gl/maps/D9c8LeWwP8ebYzJ29).\n\n**IMPORTANTE**: *Las medidas de seguridad del host requieren que los asistentes provean de antemano **nombre** y **documento de identidad**. Al ingresar a las oficinas además se pedirá el **número de teléfono**. Estos datos se pedirán a los asistentes confirmados **el día previo al evento**. Dejamos a criterio de los asistentes si quieren ofrecer tal información o desistir de atender. **Habrá lista de espera** para incluir a quienes en esta instancia no entren en el cupo.*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Rating API Business Risks based on OWASP Top-10 API Security Vulnerabilities",
        "date": "2023-10-19",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248518",
        "timezone": "America/Vancouver",
        "description": "Web APIs are a common glue that connect people and processes with digital systems all across the globe. Not surprisingly, Web APIs contribute more than 80% of the Internet traffic today. Given the importance of APIs, OWASP has recommended top-10 API specific security vulnerabilities (such as Broken Authentication/Authorization and Excessive Data Exposure problems) that organizations must address to strengthen their security posture. Albeit useful, these API specific vulnerabilities do not necessarily translate to the same business risks. For instance, two APIs from an organization with Broken Object Level Authorization (BOLA) may pose very different business risks to that organization.\n\nIn this session, we'll talk about API Risk Rating System (ARRS) that maps API specific vulnerabilities to business risks such as Legal/Contractual, Operational, Financial, Reputational and Regulatory. Similar in-principle yet different than Common Vulnerability Scoring System (CVSS), the main objective of ARRS is to prioritize API specific vulnerabilities based on their business risks. We'll describe the methodology behind the system developed using thousands of APIs that are being tracked at a global scale. We’ll also share some hands-on practical scenarios.\n\nThe work presented was done by Samantha Sanchez, Jun Hee Lee, Alberto Ciconi and Baljeet Malhotra. Samantha, Jun Hee and Alberto are MSc Cybersecurity students at NYIT. Baljeet is an Adjunct Professor at NYIT, UBC, UVic, UNBC, and CEO of TeejLab Inc."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-10-11",
        "time": "5:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889799",
        "timezone": "America/New_York",
        "description": "Welcome to our monthly SAMM community call Wednesday 11th October, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EDT/EST.\n\nJoin Zoom Meeting:"
    }
]