[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Attacking IACS: Strategic Industrial Exploitation",
        "date": "2025-04-24",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/306049408",
        "timezone": "America/New_York",
        "description": "**Overview:**\nOperational technology (OT) perimeters are rapidly emerging as a new frontier for attackers, mirroring the adversarial challenges seen in traditional IT boundaries. This talk explores crucial vulnerability classes and real-world exploitation tacticsaffecting common OT perimeter technologies. We will highlight significant risks and potential impacts of perimeter compromise on industrial environments. Attendees will gain a deeper understanding of the emerging threats at the OT boundary and the exploitation techniques adversaries may leverage.\n\n**Abstract:**\nAttacking IACS: Strategic Industrial Exploitation Industrial Automation and Control Systems (IACS) underpin critical infrastructure worldwide but often rely on outdated security paradigms, which may leave them vulnerable to modern attacks. This presentation explores technical attack methodologies targeting IACS, contrasting them with traditional enterprise network exploitation techniques. Drawing on extensive experience in vulnerability research, exploit development, and red teaming, I will highlight the unique challenges and attacker opportunities presented by IACS environments—such as reliance on legacy technologies, proprietary protocols, and stringent operational constraints.\n\nStructured around the IEC/TR 62443-3-1 standard, this presentation addresses critical gaps in modern security guidance for IACS environments. I will use examples to demonstrate strategic attack opportunities and illustrate how vulnerabilities are exploited differently within industrial settings compared to enterprise environments. Attendees will gain technical insights into the challenges of securing IACS against sophisticated attacks and leave with actionable defense strategies that address current IACS security gaps."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "11. OWASP Augsburg Stammtisch",
        "date": "2025-04-23",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/307200649",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda**\n**Vortrag:** \"IAM Benn¡\" ;-)\n\nIn meinem Vortrag möchte ich erklären, was ein IAM ist und warum es sinnvoll ist, sich damit zu beschäftigen. Außerdem möchte ich meine Erfahrungen zu diesem Thema mit euch teilen und freue mich auf euer Wissen, eure Fragen und spannende Diskussionen.\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2025 (Online)",
        "date": "2025-04-29",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489295",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nWe are meeting at NI! The chapter would like for folks to attend personally if possible! **Please do not pull an in-person ticket if you are only attending online, we order food for every in-person ticket the Friday before the meeting and we do not want to waste food by over ordering and wasting donated money.**\n\nIf you would like to register for in-person attendence, please see the [Eventbrite](https://owasp-austin-2025-april.eventbrite.com)\n\nPlease be aware that we open the meeting 30 minutes prior to the beginning of presentations. So 30 minutes of meet-and-greet and free discussion, then onto OWASP and Chapter information, then ..\n\n### **Presentation:**\n\n### ***Building the Next Generation in AppSec***\n\nToday's challenges cannot be solved with yesterday's methods. There is a great need for a new generation of skilled appsec professionals, but there are few entry-level jobs and places to learn. That needs to change. This session will talk about work Robert has done with several different universities (University of Southern California, University of Arizona, Arizona State University, and Grand Canyon University) to help bring application security awareness to students in a variety of fashions and some of the ways this helps them find work after graduation. Particular attention will be given to work as part of the CHOPS (CyberSecurity Hands On Problem Solving) certification program at Arizona State, and to work done with USC related to their MBV program.\n\n### **Speaker:**\n\n**Robert Cuddy**"
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE chapter meeting (24/04/2025, Antwerp)",
        "date": "2025-04-24",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/306971354",
        "timezone": "Europe/Brussels",
        "description": "On April 24th, we organize our next OWASP Belgium chapter meeting at Karel de Grote Hogeschool (Antwerp).\n\nWe'll have two talks centered around ethical hacking and bug bounty hunting, stay tuned for more details on the speakers and their topics.\n\n**Agenda**:\n\n* 17:30-18:00: Welcome with snacks & drinks\n* 18:00-18:10: **OWASP update**\n* 18:10-19:00: **Robbe Verwilghen** \\- Understand what you hack\\, not how you hack it\\.\n* 19:10-20:00: **Hendrik Noben** \\- Real Stories from Behind the SSDLC Curtain; A Game of SSDLC Mistake Bingo\n* 20:30: End of the meetup\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": " OWASP Bhopal CTF: Hack, Learn, Secure! ",
        "date": "2025-04-27",
        "time": "13:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/306875181",
        "timezone": "Asia/Kolkata",
        "description": "Get ready for an exhilarating **Capture The Flag (CTF)** competition hosted by **OWASP Bhopal**! Whether you're a **cybersecurity enthusiast, ethical hacker, or a beginner**, this event is designed to **test your skills, enhance your knowledge, and challenge your problem-solving abilities**.\nExpect **real-world security challenges** covering **web exploitation, cryptography, forensics, reverse engineering, and more**. Compete with some of the best minds in security, **solve exciting puzzles, and climb the leaderboard** to prove your expertise.\n\n **Who Can Participate?** – Open to all security enthusiasts, students, professionals, and CTF lovers!\n **What’s in it for You?** – Hands-on experience, recognition, and bragging rights as a top ethical hacker!\nStay tuned for more details on **registration, format, and prizes!** Are you ready to **Hack, Learn, and Secure**? "
    },
    {
        "group": "Boulder",
        "repo": "www-chapter-boulder",
        "name": "Boulder OWASP April Meetup: Building a Modern AppSec Pipeline",
        "date": "2025-04-23",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-boulder/events/307328608",
        "timezone": "America/Denver",
        "description": "The OWASP Boulder Chapter is excited to announce our April 2025 Chapter Meeting! Scheduled for Wednesday, April 23rd at the Rule4 office at 6 PM, with complimentary food, beer, and soft drinks. Join us for networking with your peers and a featured talk from [Parker Brissette](https://www.linkedin.com/in/parkerbrissette) presenting:\n\nBuilding a Modern AppSec Pipeline: Continuous Security in the DevSecOps World\n\nIn today's evolving security landscape, traditional approaches fall short. Discover how to build a modern AppSec pipeline for continuous security in the DevSecOps world. We'll tackle the speed vs. security dilemma, explore common bottlenecks, and highlight the cost of late-stage discoveries. Learn the fundamentals of an AppSec pipeline, its integration into CI/CD, and key components like automated scanning, security as code, and vulnerability management.\n\nGain practical insights into implementation strategies, tool selection, and securing buy-in. A real-world case study will showcase tangible benefits and lessons learned. We'll also address common pitfalls like tool overload and cultural resistance. Join us for actionable takeaways and a Q&A to build a resilient and modern AppSec pipeline.\n\nSpecial thanks to the Rule4 Team for hosting and sponsoring, we couldn't do these events without our sponsors. If you're interested in sponsoring the #1 AppSec Organization and our Boulder Chapter meetings, please reach out to alex.brown@owasp.org.\n\nPlease follow us on LinkedIn: https://www.linkedin.com/company/owasp-boulder\n\nAnd join our Slack: https://join.slack.com/t/boulder-owasp/shared_invite/zt-2qnxnmmts-IQDaobNC1rcUbpaH1ip8Lg\n\n**AGENDA**\n6:00 - 6:30 Food, Drinks, Networking\n6:30 - 7:15ish Main Topic Presentation\n7:15ish - 7:30 Q&A and Discussion\n7:30 - 8:00 More Networking"
    },
    {
        "group": "Fortaleza",
        "repo": "www-chapter-fortaleza",
        "name": "OWASP Fortaleza - Chapter Meetup 2025.1",
        "date": "2025-05-10",
        "time": "09:00-03:00",
        "link": "https://www.meetup.com/owasp-fortaleza/events/307083615",
        "timezone": "America/Fortaleza",
        "description": "Anunciamos oficialmente nosso primeiro encontro em 2025 da comunidade OWASP Fortaleza.\n\nGaranta sua vaga.\n\n**Teremos:**\nPalestras,\nSorteios\n\nEm breve mais informações."
    },
    {
        "group": "Heilbronn",
        "repo": "www-chapter-heilbronn",
        "name": "OWASP Stammtisch Heilbronn – Wir sind zurück!",
        "date": "2025-05-08",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-heilbronn-chapter/events/307177537",
        "timezone": "Europe/Berlin",
        "description": "Nach einer längeren Pause melden wir uns mit neuem Schwung zurück und laden herzlich zum **Reboot des OWASP Stammtischs Heilbronn** ein!\n\n Termin: 8. Mai 2025\n Einlass: ab 18:00 Uhr\n Programmstart: 18:30 Uhr\n Ort: Restaurant Cäcilie, Heilbronn\n [https://restaurants.schwarz/restaurant-caecilie](https://restaurants.schwarz/restaurant-caecilie)\n\n Unsere Vortrags-Highlights zum Reboot:\n\n* **Tobias Glemser**: \"OWASP ist so viel mehr als die Top 10\"\n* **Benjamin Häublein**: \"OAuth sicher mit Single-Page-Applications nutzen: Architektur-Pattern und Best Practices\"\n\nIm Anschluss laden wir zum gemütlichen Austausch bei Snacks ein – ideal zum Netzwerken, Fachsimpeln und Wiedersehen \n\n Voranmeldung erbeten – entweder über:\n Meetup: [https://www.meetup.com/owasp-heilbronn-chapter/events/307177537/](https://www.meetup.com/owasp-heilbronn-chapter/events/307177537/)\n DFN Terminplaner: [https://terminplaner6.dfn.de/de/b/0c4d54ba94959fae375841a1abef14d3-1179298](https://terminplaner6.dfn.de/de/b/0c4d54ba94959fae375841a1abef14d3-1179298)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Meeting ",
        "date": "2025-05-19",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/306968954",
        "timezone": "America/New_York",
        "description": "Monthly local meetup to discuss security related topics."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "AppSec in Action: Navigating SAST, SCA & DAST with Threat-Driven Remediation",
        "date": "2025-04-21",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/306773578",
        "timezone": "America/New_York",
        "description": "In this session, we will walk through the fundamentals of modern application security, focusing on three key types of scanning: Static Application Security Testing (SAST), Software Composition Analysis (SCA), and Dynamic Application Security Testing (DAST). We’ll look at common tools for each type of scan, what kinds of issues they’re designed to catch, and how to prioritize and address those issues based on real-world risk. This is a high-level overview designed for anyone looking to get a clearer picture of how these tools work together to improve code and application security.\n\nPresented by J.P. Pesare."
    },
    {
        "group": "Klagenfurt",
        "repo": "www-chapter-klagenfurt",
        "name": "OWASP Klagenfurt Chapter Meetup #4 – Breaking Free from Big Tech?",
        "date": "2025-05-05",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-klagenfurt-chapter/events/306917180",
        "timezone": "Europe/Vienna",
        "description": "** OWASP Klagenfurt Chapter Meetup – Breaking Free from Big Tech?**\n\nJoin us for our next OWASP Meetup in Klagenfurt, where we dive into a hot and highly relevant topic for developers, security professionals, and tech enthusiasts alike:\n\n**\"How to move away from the dependency on US tech companies – is it even possible?\"**\n\nIn today’s world, where privacy, sovereignty, and digital independence are more important than ever, we’ll explore how feasible it is to reduce reliance on large US-based tech providers—without compromising on security.\n\n **Interactive Workshop**\nThis time, we’re running a more open and participatory format:\nWe want *you* to share your experience!\nHave you tried moving from Outlook 365 to Proton? Hosting your own services at home? Replacing Google Workspace with open-source alternatives?\nThen we want to hear from you.\n\n You're welcome to send 1–2 slides in advance if you'd like to briefly show something. Just reach out!\n **Date:** 5th of May 2025 / 18pm\n **Location:** Klagenfurt – Makerspace\n **Moderated by:** OWASP Klagenfurt Chapter\n\n **Tentative Agenda:**\n\n* Welcome & intro\n* Brief inputs and shared experiences from participants\n* Open discussion: pros, cons, security implications\n* Wrap-up & networking\n\nThis topic is closely tied to OWASP principles: secure software, transparency, and open collaboration. Let’s explore the risks, opportunities, and real-life stories behind digital independence.\n\n Open to everyone – whether you're just curious, a seasoned pro, or somewhere in between.\n\nWe’re looking forward to seeing you there! "
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup at Olympia London",
        "date": "2025-04-23",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-london/events/307180182",
        "timezone": "Europe/London",
        "description": "Register on eventBrite: [https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-at-olympia-london-tickets-1314471281989?aff=mt](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-at-olympia-london-tickets-1314471281989?aff=mt)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Workshop OWASP LA - May 28, 2025",
        "date": "2025-05-13",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091949",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Hands-on Application Security Workshop with Runtime Security IAST Technology and Secure Code Training\nJoin us for an action-packed hands-on workshop event led by **Jeff Williams**, Founder and CTO of **Contrast Security**.\nEarn 2 hours of CPE credit!\\*\n\n**ABSTRACT:**\nTogether, we will...\n\n* Unify around a precise definition of a vulnerability, as well as understand the challenges current application testing methodologies have in detecting vulnerabilities, and how to change the way we interact with them\n* Get hands-on-keyboard experience leveraging Contrast training to find a vulnerability in code, learn how to fix said vulnerability, and proactively go and remediate the vulnerability\n\nWho should attend?\n\n* AppSec professionals\n* Security engineers\n* Software engineers\n* DevOps/DevSecOps professionals\n* Anyone wanting to learn more about identifying and fixing code vulnerabilities, discover the most efficient ways to execute on a DevSecOps program, and become proactively more knowledgeable around secure coding techniques.\n\nPLEASE NOTE - for the lab portion of this event, you must bring a laptop (phones or other personal devices will NOT work for the lab).\n\\*This workshop qualifies for 2 hours of hands-on training for Continuing Professional Credits (CPE). For CISSP holders this would be in the Application Security Discipline and you will receive a certificate of completion after the workshop.\n\n**Thanks to our SPONSOR**: *[Contrast Security](https://www.contrastsecurity.com/)*\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "ZeroTrust [VIRTUAL] Conference Southern California",
        "date": "2025-05-13",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/307229106",
        "timezone": "America/Los_Angeles",
        "description": "Proliferation of SaaS, remote work, and global reliance on digital systems for critical operations have forced organizations to abandon traditional security models in favor of Zero Trust. At this summit, participants will explore official CSA CCZT training modules and gain practical insights from industry experts—gaining the knowledge needed to fortify their infrastructures and stay ahead in an ever-evolving threat landscape.\n\nThe summit is designed for IT and security professionals, managers, and decision-makers who want practical insights and frameworks related to Zero Trust cybersecurity"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Apr 23, 2025",
        "date": "2025-04-23",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091943",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Enhancing Open Source Tools Using AI: A \"No Code\" Journey to Build an Automated DefectDojo Parser Generator\nJoin us for great networking, dinner and drinks, and see a presentation by **Tracy Walker,** Principal Solution Architect, **DefectDojo**\n\n**ABSTRACT**: See a live demonstration of using an AI LLM to accelerate the ability to adopt new, custom or unsupported security tools into DefectDojo, an open-source vulnerability management platform.\n\nThrough live examples, attendees will see a data transformation problem deconstructed into a series of repeatable prompts using an AI LLM to automatically generate 100% of parsing code, detailed documentation, and unit tests while maintaining code quality and existing best practices.\nThe demonstration:\n1) Highlights OWASP feature project DefectDojo,\n2) Is *applicable* to any open source tool or community, and\n3) Is *accessible* to security practitioners or engineers of all technical levels.\n\n**Thanks to our SPONSOR**: *[DefectDojo](https://defectdojo.com/)*\n*DevSecOps, ASPM, Vuln Management - All on one platform!*\n*DefectDojo is the platform and product that enables scalable security through DevSecOps, integrates with 180+ security tools and counting, with a vibrant and active open source community. We also have a Pro Edition for those who are looking to achieve security automation and actionable insights with the smallest lift possible.*\n\n**Thanks to our HOST**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The Attacker’s Distributed Supercomputer: Your Browser",
        "date": "2025-04-24",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/306872817",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, April 21st, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Abstract**\nAs the browser transforms into the primary computing platform, new vulnerabilities are surfacing that existing security architectures are not prepared to tackle. This gap leaves enterprises exposed to risks like client-side exploits, unmonitored communication channels, and last-mile reassembly tactics, which exploit the browser's complexity beyond the reach of traditional tools.\n\nThis talk explores how the shift to browser-centric workflows has uncovered a critical weak spot at the very heart of organizations around the world, currently unprotected by conventional security measures, allowing both internal and external threat actors to bypass controls\n\n**Thanks to Our Sponsor Black Duck**\nBlack Duck® offers the most comprehensive, powerful, and trusted portfolio of application security solutions in the industry. We have an unmatched track record of helping organizations around the world secure their software quickly, integrate security efficiently in their development environments, and safely innovate with new technologies. As the recognized leaders, experts, and innovators in software security, Black Duck has everything you need to build trust in your software. Learn more at [www.blackduck.com](https://www.blackduck.com./ \"https://www.blackduck.com.\")"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-05-08",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181950",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Get into Cyber Security",
        "date": "2025-04-30",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/306591606",
        "timezone": "Europe/London",
        "description": "\\*ATTENTION - DATE CHANGE & VENUE UPDATE \\*\n\nOWASP Peterborough & Cyber Peterborough presents *Get Into Cyber Security*! An evening of focused discussion, interactive sessions and presentations on how to get into the field of cyber security. Technical or non-technical, this event will help you break down how to get into the cyber security field. Join us and meet other people interested in Cyber.\n**Where?**\n\n* University Centre Peterborough PE1 4DZ\n\n**When?**\n\n* Wednesday 30th April\n\n**Agenda**\n\n* **5:30pm:** Welcome\n* **5:40pm:** Cyber Myth Busting\n* **6:10pm:** Steven Trippier, Anglian Water CISO\n* **6:40pm:** Cyber Career Paths\n* **7:15pm:** Ask **your** questions - Panel\n* **7:45pm:** UCP Educational Opportunities\n* **8:00pm:** Networking Drinks @ the Pub!\n\nPlease respond to this event to confirm numbers for the event ensuring each attendee is catered for.\nThank you,\nRyan"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "May 2025 Meeting",
        "date": "2025-05-06",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/306633472",
        "timezone": "America/Phoenix",
        "description": "**Beyond LLMs: Securing the AI/ML Pipeline and Analyzing CVEs in Modern AI Tools**\n\n* Security challenges across the ML lifecycle (data collection, model training, deployment, inference).\n* Evolving threats beyond LLMs, including traditional ML models and autonomous agents.\n* Insights from CVE analysis of real-world AI/ML tools."
    },
    {
        "group": "Riyadh",
        "repo": "www-chapter-riyadh",
        "name": "Three Major Threats to Mobile SIM Cards: Swapping, Cloning and Jacking",
        "date": "2025-04-24",
        "time": "19:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/307129131",
        "timezone": "Asia/Riyadh",
        "description": "**Three Major Threats to Mobile SIM Cards: Swapping, Cloning and Jacking**\n\n**Topic Details:**\n\nThis session explores the world of SIM security, the cornerstone of mobile communication, exploring three critical threats that can compromise Subscriber Identity Module (SIM): SIM Swap, SIM Cloning, and Simjacker. These attacks have significant implications for individuals, organizations, and governments, as they can lead to unauthorized access, financial losses, and reputational damage."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Virtual Meetup for April: Moving from a Technical Role to a Management Role",
        "date": "2025-04-23",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/307093194",
        "timezone": "America/Denver",
        "description": "Our April meetup will be virtual! Details below:\n\n* Topic: Moving from a Technical Role to a Management Role\n* Date: Wednesday, April 23\n* Discussion Leader: Dan Hamilton\n* Zoom Link: Coming Soon!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-05-14",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306142417",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": " OWASP Seoul Chapter : Non-Human Identity &   ",
        "date": "2025-04-29",
        "time": "19:30+09:00",
        "link": "https://www.meetup.com/owasp-seoul/events/307060143",
        "timezone": "Asia/Seoul",
        "description": " OWASP Seoul Chapter 2025  1   !\n\n      **Non-Human Identity **,     **   ** , OWASP      . ,   **OWASP Top 10 for LLM Applications 2025  **  .\n\n   ( 1 40)\n**19:30 \\~ 19:45 (15)**\n *   *\n\n* OWASP Seoul Chapter \n* OWASP Seoul Chapter   \n* OWASP Top 10 for LLM Applications 2025   \n‍  Leader (OWASP Seoul Chapter)\n\n**19:45 \\~ 20:25 (40)**\n #1: **Non Human Identity Top 10 **\n\n* OWASP NHI Top 10     \n* API Key,     \n‍   (Cremit)\n\n**20:25 \\~ 21:05 (40)**\n #2: **    101**\n\n*    \n*     \n‍  Staff Security Engineer ()\n\n**21:05 \\~ 21:10 (5)**\n Q&A  \n\n  \n\n*  : 2025 4 29() 19:30 \\~ 21:10 (KST)\n*  :  (Zoom    )\n*  :  , , DevOps ,    \n*  : \n\n , AI     !\n [OWASP  ](https://owasp.org/www-chapter-seoul/)  .\n#OWASP #OWASP_Seoul #Top10 #NonHumanIdentity #BugBounty #LLM #DevSecOps #Cremit #Sendbird"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - CI/CD Security and Securing AI models",
        "date": "2025-04-24",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/307273324",
        "timezone": "Europe/Stockholm",
        "description": "**Join us** for a packed OWASP event, where we'll explore CI/CD Security and take a look at OWASP top Ten for LLMs and how we can secure AI models! You will have the possibility to join either in person or remote (please specify your preference during registration as seats are limited!)\n\n **When**: 24th of April, 17:30 - 21:00\n **Where**: Hemvärnsgatan 9, 171 54 Solna, Akamai Technologies (T-Solna Strand)\n\n **Agenda**:\n17:30 - 18:00 Gathering and light food will be provided\n18:00 - 18:05 Intro\n18:05 - 18:50 First topic (Nicklas, Daniella, Trolle - Securing the CI in CI/CD)\n18:50 - 19:10 Break and mingling\n19:10 - 19:55 Second topic (Anders, Jens - Guarding the Prompt)\n19:55 - 20:00 Closing words\n20:00 - 20:55 Mingle\n\n**More about the talks**:\n**Securing the CI in CI/CD: From Developer's Machine to Artifact Promotion**\nIn this presentation, we will explore the security aspects of Continuous Integration (CI) within the CI/CD pipeline, focusing on protecting the entire process from the developer's machine to artifact promotion and repository. We will go through the various stages of CI, identify potential security threats, and discuss effective mitigations to ensure a secure and robust CI environment.\n\n**Guarding the Prompt: Building a Firewall for LLMs Aligned with the OWASP Top 10**\nThis session explores how AI firewalls can effectively mitigate the OWASP Top 10 threats for large language models (LLMs). We'll break down each risk, showcase practical defense strategies, and present a live demo of an AI firewall in action. Attendees will gain insights into securing LLM applications, understanding real-world attack scenarios, and adopting proactive measures to future-proof AI systems. Whether you're building with or securing AI, this talk offers valuable takeaways to strengthen your generative AI security posture.\n\n**About the speakers**\n**Nicklas Sigurdh** is an IT-security specialist with a focus on DevOps and close to 30 years development experience.\nhttps://www.linkedin.com/in/nicklas-sigurdh-9b65313/\n\n**Daniella Eklund** is an IT-security specialist with a background as a former teacher. She’s working with DevOps related issues at Handelsbanken and has a passion spreading IT-Security knowledge enabling coworkers to grow within the area.\nhttps://www.linkedin.com/in/daniella-eklund-501737112/\n\n**Trolle Geuna** is an IT-security specialist with a focus on DevOps, working at Handelsbanken.\nhttps://www.linkedin.com/in/trolle-geuna-5148aa1a2/\n\n**Anders Näsman** is a Principal Solutions Engineer at Akamai, and a seasoned technology expert with over 25 years of experience across media, cloud, and cybersecurity. He has worked with leading Nordic media brands, driving innovation in OTT, anti-piracy, cloud development, and AI/LLM security. His background spans R&D, product management, and engineering. Anders is an active contributor to industry standards and a frequent speaker at events like Demuxed, Streaming Tech Sweden, and Akamai Techdays, sharing insights on cutting-edge tech solutions. https://www.linkedin.com/in/andersn1/\n\n**Jens Holmberg** is a Solution Engineer at Akamai Technologies, where he works with customers to design and implement solutions around delivery, security, and compute. His role blends technical consulting with hands-on problem solving. In his spare time, Jens builds AI agents that occasionally do what they’re told, writes tools no one asked for, and has an impressive track record of breaking things in the name of “learning”. https://www.linkedin.com/in/jens-holmberg-40882833/"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-May Lunch and Learn",
        "date": "2025-05-16",
        "time": "11:15-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/307289782",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-May Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\n* 11:15am - Registration and Lunch\n* 12:00pm - Speaker - Jason Mueller - Crowdsourced Security in Practice: Lessons from the Frontlines\n* 1:15pm - Depart\n\n**Speaker**:\nJason Mueller is a cybersecurity professional and former U.S. Navy cryptologist with over 20yrs of hands-on experience in cyber operations. Having worked across government, defense, and commercial sectors, Jason brings a unique perspective on the evolving threat landscape and how organizations can stay ahead of it. At Bugcrowd, he helps security teams harness the power of crowdsourced security to identify and remediate risk at scale. With a background rooted in operational security and a deep appreciation for the hacker mindset, Jason is passionate about helping organizations adopt modern, proactive approaches to cybersecurity that are both practical and impactful.\n\n**Abstract**:\nAs threats evolve faster than ever, traditional security models struggle to keep pace. Enter crowdsourced security—a model that taps into the global hacker community to uncover vulnerabilities before adversaries do. In this session, we’ll explore how Bugcrowd is helping organizations—from startups to the federal government—scale their security programs through managed bug bounty, vulnerability disclosure, and penetration testing. We’ll walk through real-world lessons learned, common pitfalls, and how aligning with frameworks like OWASP Top 10 enhances outcomes. Whether you’re an AppSec professional, pentester, or just curious about the power of ethical hacking at scale, this session will provide insights you can take back to your own environment.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W\nSTE 600\nTampa, FL 33607\n\n**Sponsors**:\nBugcrowd - [https://www.bugcrowd.com/](https://www.bugcrowd.com/)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "The Dark Side of AI: Developing unsecure applications in minutes!",
        "date": "2025-05-08",
        "time": "17:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/307305805",
        "timezone": "America/Toronto",
        "description": "**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n**Note for IN-PERSON attendance:**\n\nYou **MUST** register using the [Microsoft Reactor event page](https://aka.ms/May8OWASPxMicrosoftReactor). At doors open time, registered attendees will receive a personalized QR code allowing them to enter. Sorry, **NO walk-ins** for this event.\n\nThe registration will close Tuesday **May 6 at 4:00 PM**.\n\n**Note for ONLINE livestream:**\n\nIf you cannot attend in-person, please join us virtually via the livestream! Details to be announced shortly.\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\n**Schedule:**\n\n* 5:30 PM: Doors Open\n* 6:00 PM Talk Begins\n* 7:00 PM Q/A & Networking\n\n**Talk Description:**\n\nAI is the ultimate accelerant for application development—its power unmatched—but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session by playing with fire – Using GPT-driven prompts, we’ll build a fully functional application, and in real time, we’ll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\nThrough hands-on exploration, we’ll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code reviews.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "The State of Secure Coding & Secure Coding Tournament",
        "date": "2025-04-23",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/306889573",
        "timezone": "America/Toronto",
        "description": "**Note about In-Person Attendance**\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\nWe will be capping the in-person attendance to **40 people**, on a **first-come, first-serve** basis. This will allow us to effectively facilitate the Secure Coding Tournament at the venue.\n\nDoors will open at **6:00 PM**, with the event will start at **6:30 PM** (EDT).\n\nFor those who cannot attend in person, no worries! Please join us virtually via the Zoom call!\n\n**Event Description**\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\nThe presentation delves into the current state of secure coding practices, focusing on technical aspects and the challenges faced by developers and security professionals. We will highlight prevalent issues such as the increasing complexity of software systems, the evolving nature of cyber threats, and the persistent gap between development and security teams. Emphasizing the importance of integrating security into the software development lifecycle, the discussion covers best practices, common vulnerabilities, and the need for continuous education and collaboration to build a robust approach to secure coding across the industry.\n\nThe presentation will be followed by a Secure Coding Tournament for any interested members. **Bring your laptop to participate!**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-05-15",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510286",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call (Europe-Asia)",
        "date": "2025-05-16",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/305752944",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "May community call - OWASP SAMM",
        "date": "2025-05-14",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/306053400",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    },
    {
        "group": "Security Integration System",
        "repo": "www-project-security-integration-system",
        "name": "Three Major Threats to Mobile SIM Cards: Swapping, Cloning and Jacking",
        "date": "2025-04-24",
        "time": "19:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/307129131",
        "timezone": "Asia/Riyadh",
        "description": "**Three Major Threats to Mobile SIM Cards: Swapping, Cloning and Jacking**\n\n**Topic Details:**\n\nThis session explores the world of SIM security, the cornerstone of mobile communication, exploring three critical threats that can compromise Subscriber Identity Module (SIM): SIM Swap, SIM Cloning, and Simjacker. These attacks have significant implications for individuals, organizations, and governments, as they can lead to unauthorized access, financial losses, and reputational damage."
    }
]