[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - May",
        "date": "2025-05-27",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/303407314",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with the Systematic Software Engineering. By signing up, you consent to us sharing your name and email with Systematic Software Engineering solely for the purpose of visitor pass registration.\n\n**Agenda:**\n**19:00 – 19:10** Welcome by Systematic Software Engineering and OWASP Aarhus\n\n**19:15 – 19:45** \"A04:2021 – Insecure Design ved Systematic\" af Michael Ustrup, Software Security Architect, Systematic Software Engineering\n\nOm præsentationen:\nMichael løfter sløret for sit hjertebarn og giver et indblik i, hvordan Systematic håndterer A04:2021 \"Insecure Design\".\n\n**19:45 – 20:30** Networking break including tapas and drinks\n\n**20:30 – 21:25** \"How (not) to Engage Developers in AppSec\" by Mads Schaarup Andersen, Lead IT Security Consultant, Cyber Strategy & Security Test, BankData\n\nabout the presentation:\nMany appsec programs struggle to make developers engage with security. This ranges from mitigating pentest and security scanning results to simply following the security policy. This often leads to the conclusion that developers don't care about security. However, developers exist in a context where managers, company policies, customer demands all influence how they prioritize tasks and given the right circumstances, most developers do indeed want to do secure software. In this talk, based on experience, research, and methods from human computer interaction, Mads will present the dos and don'ts of how to engage developers and successfully implement appsec.\n\nabout Mads:\nMads is currently working as a lead application security architect and has worked in security and privacy for more than 15 years. He has previously worked as a security and privacy consultant, worked in academic research, and has experience as a software engineer. His approach to application security and privacy is based on developer enablement and involvement through security champions programs - a mainly bottom-up approach where developers’ main tasks and concerns are taken seriously. Furthermore, Mads’s approach has a strong methodological foundation in human computer interaction with methods such as participatory design, design thinking, interviews, focus groups, workshops, etc."
    },
    {
        "group": "Aguascalientes",
        "repo": "www-chapter-aguascalientes",
        "name": "1er Seminario de Ciberseguridad (Redes Seguras y Confianza Digital).",
        "date": "2025-06-07",
        "time": "09:00-06:00",
        "link": "https://www.meetup.com/owasp-aguascalientes-meetup-group/events/306332862",
        "timezone": "America/Mexico_City",
        "description": "En un mundo cada vez más conectado, la ciberseguridad es fundamental para proteger la información personal, corporativa y gubernamental. Por ello **OWASP Aguascalientes** organizan este seminario con el objetivo de concientizar y formar a la comunidad en las mejores prácticas de seguridad digital.\n **¿Qué aprenderás?**\n\n* Cómo proteger tus redes y dispositivos en un entorno digital en constante evolución.\n* Estrategias para fortalecer la confianza digital y mitigar riesgos cibernéticos.\n* Experiencias y conocimientos de expertos en ciberseguridad.\n\n **Agenda del evento:**\n **Conferencia 1:** *Redes seguras: Cómo defender tu información en un entorno digital vulnerable*\n **Conferencia 2:** *La ciberseguridad como pilar de la confianza digital*\n **Coloquio interactivo:** Espacio de preguntas y respuestas con especialistas.\n **Networking:** Conéctate con profesionales y entusiastas de la ciberseguridad.\n **¿A quién va dirigido?**\nEste evento es ideal para estudiantes, profesionales de TI, emprendedores y cualquier persona interesada en mejorar su conocimiento sobre ciberseguridad y protección digital.\n **Regístrate y aparta tu lugar** para ser parte de esta experiencia única. ¡Nos vemos el 7 de junio! "
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Hacking AWS IAM: Live Walkthrough",
        "date": "2025-05-29",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/307356952",
        "timezone": "America/New_York",
        "description": "Identity and access management in the cloud remains the most fertile ground for high-value exploitations. So why is it still the least understood part of AWS? For starters, the way RBAC was implemented in the public cloud created a series of unintended consequences (role proliferation, etc) that confound security. Add to that how confusing the interconnecting IAM policy logic tree is. Then consider most are trying to understand ‘identity’ in the cloud as something akin to human credentials… when it’s far from that. Add it all together, and you have the beautiful mess we’re trying to manage today.\n\nJeff Moncrief’s been puzzling through the how and why of cloud IAM for the past few years. He found the best way to learn IAM is to just break it. Join Jeff as he deploys his ‘IAM walker’ script and shows the holes in a typical AWS environment, moves laterally from a typically ec2 exploit, abuses privilege escalation, steals data, and exfiltrates successfully without detection. Along the way, he’ll discuss:\n\n* Why we misunderstand the purpose of IAM in AWS\n* Rethinking IAM responsibilities of devs vs. security without breaking workloads\n* Different control points in AWS, like implementing service-level security and designating ‘sensitive permissions’"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2025 (Online)",
        "date": "2025-05-27",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489299",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nWe are meeting at Emerson/NI! The chapter would like for folks to attend personally if possible! **Please do not pull an in-person ticket if you are only attending online, we order food for every in-person ticket the Friday before the meeting and we do not want to waste food by over ordering and wasting donated money.**\nIf you would like to register for in-person attendance, please see [Eventbrite](https://owasp-austin-2025-may.eventbrite.com)\n\nPlease be aware that we open the meeting 30 minutes prior to the beginning of presentations. So 30 minutes of meet-and-greet and free discussion, then onto OWASP and Chapter information, then ..\n\nPresentation: **Why Your Security Metrics Suck, And How to Fix This**\n\nBack in 2014, Rafal gave a talk about metrics, specifically on enterprise software security ( [https://www.youtube.com/watch?v=Kl7ZAR9U0xs](https://www.youtube.com/watch?v=Kl7ZAR9U0xs \"https://www.youtube.com/watch?v=Kl7ZAR9U0xs\") ) and it's been haunting him ever since. He regularly gets emails and DMs from people asking him to help them with their security program metrics and given that it's been 10 years since he last presented this, it's time to revisit.\n\nThis talk focuses on metrics for security organizations in general, and AppSec related metrics in specific. In other words, how do security organizations measure their impact, and whether they're doing a \"good job\" or not? What do you measure, how do you measure it, and why does anyone care? Let's dive deep into a boring topic that nobody wants to talk about, but you all know you need to master.\n\n**Speaker:**\nRafal Los"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "May OWASP Bay Area Meetup",
        "date": "2025-05-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/307730758",
        "timezone": "America/Los_Angeles",
        "description": "We’re excited to announce that our **May OWASP Meetup** will be **hosted by Adobe**!\nJoin us for an evening of great conversations, community networking, and insightful security discussions — all in an awesome venue provided by Adobe. And yes, there will be **delicious food and drinks** generously provided by our hosts!\n\n5:30 PM : Doors open, Networking, food and drinks\n5.45 PM :- Chapter introductions\n6-6.45 PM :- Proactive Defense: Preventing Account Takeovers Before They Begin\n6.45-7.30 :- Implementing Secure guardrails\n\n**Talk #1 Proactive Defense: Preventing Account Takeovers Before They Begin**\nAccount Takeovers (ATOs) have become the silent enablers of modern breaches—where attackers don’t break in, they log in. Whether sourced from phishing campaigns, infostealer logs, or vast combolists circulating on the dark web, leaked credentials continue to fuel unauthorized access across both enterprise and customer-facing environments.\nThis session will explore practical strategies for preventing ATOs, with a focus on:\n\n* Proactively detecting and remediating leaked credentials across employees and customers.\n* Leveraging phishing visibility to detect early signs of compromise.\n* Introducing AI-driven analysis using the Model Context Protocol (MCP): an experimental approach within Cursor that enhances AI’s ability to search, contextualize, and support on-demand investigation of leaked credentials\n\nAttendees will learn how to integrate these methods to build a strong defense against account takeovers, strengthening security and resilience against cyber threats. By adopting proactive credential defense and tools like MCP, organizations can develop an adaptive response to account takeover threats.\n**Speakers: Barath Subramaniam**, Senior Product Security Engineer at Adobe, has over 16 years of experience. He manages security data exchange programs between security and product teams, focusing on security automation, AI, data engineering, identity monitoring for stolen credentials, brand abuse detection, and phishing.\n\n**Alessio Iacovone** is a Product Security Engineer at Adobe with three years of experience on the Data and AI Engineering team, specializing in applying AI to enhance security efforts.\n\n**Talk#2** Implementing Secure guardrails\nSpeaker: Srajan Gupta, Dave, Senior Security Engineer. An avid threat modeling practitioner and advocate of secure design practices"
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém na Jornada acadêmica. ",
        "date": "2025-05-16",
        "time": "19:00-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/307692388",
        "timezone": "America/Boa_Vista",
        "description": "A **OWASP Belém** que é um dos capítulos brasileiros entre os mais de 200 capítulos ativos em todo o mundo.\nNo dia 16 de maio, realizara seu próximo meetup em conjunto com a jornada acadêmica da Estácio FAP , onde o tema será Segurança da Informação eo mercado de trabalho, onde exploraremos insights, desafios e inovações no mundo da tecnologia. Será uma oportunidade incrível para conhecer os desafios e oportunidades com muita troca de conhecimento, conexões e networking.\nNosso objetivo é disseminar a missão da OWASP, tornando a segurança das aplicações visível, para que as pessoas e organizações possam tomar decisões conscientes sobre os verdadeiros riscos de segurança das aplicações.\n\n**TEMA:** Segurança da Informação e o mercado de trabalho. Mitos e Verdades. O que esperar de cibersegurança e como é a realidade das organizações sobre o tema.\n\n**Palestrante:** Lauro Pinheiro (TRE-CE)\nCISO do TRE-CE, com mais de 12 anos de experiência em segurança da informação na Justiça Eleitoral, gerenciando e implementando SGSI e indicadores estratégicos. Possui certificações internacionais como CISSP (ISC)², ISO 27001:2022 Lead Auditor, CC (ISC)², Google Cybersecurity Certificate V2, LPI-1 e Foundations of Cybersecurity for Managers - U.S. Government. Pós-graduado em Gestão de Segurança da Informação, lidera programas de LGPD, BCDR, gestão de riscos e auditoria de TI ponta a ponta. Especialista em ciberdefesa hands-on, com domínio de Zero-Trust, MITRE ATT&CK, perícia digital e hardening Linux/Windows, além de expertise em firewalls, redes e automação. Atua na capacitação de equipes, conduz treinamentos e fomenta uma cultura de segurança baseada em métricas, além de ser palestrante. Autor em SBSeg (Artigo Segurança em Cloud), speaker em seminários de cibersegurança e mentor de profissionais rumo a certificações, promovendo a entrada de novos talentos na área de Cibersegurança.\n\n**Data:** 16/05/2025\n\n* **Horário:** 19h30m.\n* **Local:** Estácio FAP\n* **Endereço**: R. Municipalidade, 839, Belém, PA."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": " OWASP Bhopal CTF: Hack, Learn, Secure! ",
        "date": "2025-05-11",
        "time": "12:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/306875181",
        "timezone": "Asia/Kolkata",
        "description": "Get ready for an exhilarating **Capture The Flag (CTF)** competition hosted by **OWASP Bhopal**! Whether you're a **cybersecurity enthusiast, ethical hacker, or a beginner**, this event is designed to **test your skills, enhance your knowledge, and challenge your problem-solving abilities**.\nExpect **real-world security challenges** covering **web exploitation, cryptography, forensics, reverse engineering, and more**. Compete with some of the best minds in security, **solve exciting puzzles, and climb the leaderboard** to prove your expertise.\n\n **Who Can Participate?** – Open to all security enthusiasts, students, professionals, and CTF lovers!\n **What’s in it for You?** – Hands-on experience, recognition, and bragging rights as a top ethical hacker!\nStay tuned for more details on **registration, format, and prizes!** Are you ready to **Hack, Learn, and Secure**? "
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "Ask a Developer",
        "date": "2025-05-21",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/307444258",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [WWT](https://www.wwt.com/)**\n\nCome join us for an insightful session where you can learn more about security from the perspective of your developers.\n\nSecurity professionals have different priorities than developers, and this can lead to friction between the two groups. In this session, we will discuss how to see things from a developer's perspective, which can help you communicate more effectively and even empathize with them, leading to a more productive (and maybe even enjoyable) relationship.\n\nBring your questions and be ready to share your own experiences!\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments!\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Vectors: The building block of ML/AI",
        "date": "2025-05-15",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/307357762",
        "timezone": "America/New_York",
        "description": "Vectors are the lego brick of the current ML/AI hype cycle. The problem is, MANY people misunderstand what vectors are, and without this foundational footing everything crumbles. AI projects have an astonishing 80% failure rate and many vendor products might not function properly. If they wish, attendees of this talk can play along with Mick with interactive demos\\*. You can take these demos after the talk with you too.\n\n\\* if you want to do the demos live you will need a tablet or laptop computer and a Google account."
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "MetaCTF May 2025 Flash CTF",
        "date": "2025-05-22",
        "time": "17:00-04:00",
        "link": "https://www.meetup.com/owasp-delaware-chapter/events/307573765",
        "timezone": "America/New_York",
        "description": "This free capture the flag (CTF) event is hosted by MetaCTF.com, and will cover challenges in Web Exploitation, Forensics, and more.\n\nThere will be 5 challenges, and you will have 2 hours to solve as many as you can.\n\nParticipation is individual and free to enter. Although participation is individual, OWASP Delaware will have a **private scoreboard.** #fancy\n\nStep 0) To join the private scoreboard **RSVP at Meetup** (a.k.a. \"Attend\") this event. You will see the scoreboard key upon RSVP.\nStep 1) Then **register for the CTF** at [https://mctf.io/may2025](https://mctf.io/may2025)\nStep 2) From the MetaCTF Dashboard, click \"**Compete**\" next to the May 2025 event to access the CTF site.\nStep 3) Go to the \"Scoreboard\" page and click \"**+ Join a Scoreboard**\". You will be able to enter the private scoreboard key (from Step 0).\nStep 4) During the event join the **OWASP Delaware Discord** (below) to boast of p0wnage, or to ask for help.\n\nFor practice, check out the challenges **and solutions** from a previous Flash CTF at [https://mctf.io/practice](https://mctf.io/practice). #TheMoreYouKnow\n\nBTW - I was told the private scoreboard key will also work for the (past) April Flash CTF.\n\nDuring the event we can chat on the **OWASP Delaware Discord**. Don't know where that is? DM me or another OWASP Delaware chapter co-lead for details.\n\nDisclaimer I saw on the MetaCTF practice CTF: \"*By signing up for this CTF, you consent to be contacted by MetaCTF or sponsors about their services.*\" ¯\\\\_()_/¯\n\nPS: This event **might** get an **optional physical location** for those that want to collab IRL. Standby for emails via Meetup for more details (sent to those that RSVP here at Meetup for this event)."
    },
    {
        "group": "Fortaleza",
        "repo": "www-chapter-fortaleza",
        "name": "OWASP Fortaleza - Chapter Meetup 2025.1",
        "date": "2025-05-10",
        "time": "09:00-03:00",
        "link": "https://www.meetup.com/owasp-fortaleza/events/307083615",
        "timezone": "America/Fortaleza",
        "description": "Anunciamos oficialmente nosso primeiro encontro em 2025 da comunidade OWASP Fortaleza.\n\nGaranta sua vaga.\n\n**Teremos:**\nPalestras,\nSorteios\n\nEm breve mais informações."
    },
    {
        "group": "Harrisburg",
        "repo": "www-chapter-harrisburg",
        "name": "OWASP Harrisburg - Hello, World!",
        "date": "2025-05-28",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-harrisburg/events/306908330",
        "timezone": "America/New_York",
        "description": "*print(\"Hello, World!\")*\n\nJoin us for our inaugural OWASP Harrisburg chapter meetup as we connect, outline our goals, and brainstorm upcoming topics and activities. Help shape the direction of this new community from day one and be part of building a stronger, more secure future!\n\n*Our events are free and open to everyone. You don't have to be an OWASP member or hold a cybersecurity or software development role to* *attend!*"
    },
    {
        "group": "Hong Kong",
        "repo": "www-chapter-hong-kong",
        "name": "Backdooring Windows PE and Linux ELF practice lab",
        "date": "2025-05-23",
        "time": "18:00+08:00",
        "link": "https://www.meetup.com/owasp-hong-kong-chapter/events/307689582",
        "timezone": "Asia/Shanghai",
        "description": "Hands-on keyboard session to practise executable file parsing and binary patching using a dumb hex editor and debugger.\n\nPrerequisites:\nBring your own laptop with x64 Intel/AMD Windows and Linux OS/VM or any comparable cloud compute instance."
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "AppSec IL 2025 - June 5 2025 - Placeholder",
        "date": "2025-06-05",
        "time": "09:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/306811626",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is excited to announce our AppSec IL 2025!\n\n**This is a placeholder event make sure to register**\n\n Registration is Open – Secure Your Spot!\nWhether you’re a security researcher, developer, or IT professional, OWASP Israel 2025 is the place to be. Don’t miss out on expert talks, hands-on workshops, and top-tier networking opportunities!\n\n **Register now**: https://appsecil2025.forms-wizard.biz\n\nJoin us for an incredible day of learning, networking, and live tech discussions. Follow us on LinkedIn for updates!\nLooking forward to seeing you there!\n\nOWASP Israel 2025 – Keynotes & Live Podcast Announced! Register Now!\n OWASP Israel 2025 is Almost Here – Don’t Miss Out! \nJoin us on June 5, 2025, for Israel’s largest application security conference! This year, we’re bringing together top cybersecurity experts, industry leaders, and innovators for a day packed with cutting-edge talks, hands-on workshops, and networking opportunities.\n Location: Expo Tel-Aviv\n Date: June 5, 2025\n Website: https://appsecil.org\n LinkedIn: OWASP Israel\n\n Keynote Speakers & Live Podcast!\nRan Bar-Zik – Keynote Speaker\nWe’re excited to announce Ran Bar-Zik, renowned security researcher and journalist, as our keynote speaker! His deep expertise in cybersecurity, software development, and online privacy ensures a thought-provoking and insightful talk.\nLive Podcast: Weekly Sync with Tor Tsuk & Navot Volk\nFor the first time at OWASP Israel, Weekly Sync, the popular tech podcast hosted by Tor Tsuk & Navot Volk, will be recording a live episode on stage! Expect deep dives into the latest in tech, security, and industry trends—this is one session you won’t want to miss.\n Check out their podcast: https://linktr.ee/weeklysync"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "APIs & The Undocumented Attack Surface",
        "date": "2025-05-19",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/306968954",
        "timezone": "America/New_York",
        "description": "With 84% of all internet traffic being API driven, with 64% of APIs being a breach vector, with only 4% of organizations really securing those APIs, how much of the attack surface is going undocumented & unsecured. Zombies, ghost, shadow or orphan APIs, what is getting by? Now, introduce AI generated code, AI generated code review where and how do you address it at the enterprise level?"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup",
        "date": "2025-05-19",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/307603231",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted by Civo Tech Junction and sponsored by Endor Labs . There is limited seating available for in-person attendees. Registration required.**\n**This event will be live-streamed on YouTube.**\n**Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Civo Tech Junction, First Floor, 32-37 Cowper Street, London, EC2A 4AW\n**Nearest Tube:** Old Street (Northern Line), Cowper Street exit - 1 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n\n\"**Attacks on Open Source Supply Chains: How Hackers Poison the Well**\" - **Henrik Plate**\n\nThe ubiquitous use of open source during software development makes it an interesting and valuable target for software supply chain attacks, where\nattackers inject malicious code in upstream open source projects such that it is executed by software developers or end users down the line. This talk provides an overview about common attack vectors, illustrated by real-world examples, and sheds some light on countermeasures.\n\n**\"Introducing the OWASP SocialOSINTLM Project\" - Brenden Miller**\n\n**SocialOSINTLM** is a powerful Python-based tool designed for Open Source Intelligence (OSINT) gathering and analysis. It aggregates and analyzes user activity across multiple social media platforms, including Twitter / X, Reddit, Hacker News (via Algolia), Mastodon and Bluesky. Leveraging AI through the OpenRouter API, it provides comprehensive insights into user engagement, content themes, behavioral patterns, and media content analysis.\n\n**\"Using LLMs To Accelerate Threat Detection\" - Richard Finlay Tweed**\n\nInventing good detections is hard, using them with your SIEM (Security information and event management system) is even harder. That's where Large Language Models (LLMs) come in. This talk will describe how to use your existing runbooks, and experience, to improve your threat detection coverage\n\n**RAFFLE - win a prize kindly donated by our sponsors!**\n\n**SPEAKERS**\n\n**Henrik Plate**\n\nHenrik Plate is the principal security researcher at Endor Labs. He formerly worked for SAP Security Research, where he established and led the focus topic “Open Source Security” starting 2014. He co-authored academic papers on this topic, presented at academic and industry conferences like the RSA, and started several open source projects in this space. He earned his PhD in 2024 from the University of Rennes, France, with a thesis titled “On the Security Risks of Open Source Consumption”, and holds a CISSP certification\n\n**Brenden Miller**\n\nBrenden Miller is a Cyber Security Consultant at Accenture UK & Ireland. He brings over 20 years of technical experience working internationally, evolving through roles in systems administration, SRE, and cloud engineering. His interest in data and AI applications led to the creation of SocialOSINTLM, a tool applying AI and NLP to social media open-source intelligence.\n\n**Richard Finlay Tweed**\n\nRichard Tweed is a Kubernetes specialist at Tessl. Over the last five years he has been ensuring security, scalability and compliance across all major Kubernetes cloud platforms. He's also the lead maintainer of kube-audit-rest.\n\n**TICKETS:**\n\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security.\n\n**CODE OF CONDUCT:**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - May 28, 2025",
        "date": "2025-05-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306589704",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Adversarial Intelligence: Redefining Application\nJoin us for great networking, dinner and drinks, and see a presentation by **Roy Talyosef,** Founding Engineer, **Kodem Security**\n\n**ABSTRACT:**\nThis presentation explores Adversarial Intelligence - an approach that views application security from an attacker’s perspective. Drawing from vulnerability research experience at the NSO Group and building Pegasus, the speaker will highlight how overlooked low and medium vulnerabilities can be combined to execute successful attacks. By examining attack chains and application runtime behavior, attendees will see how gaps often missed by traditional methods are exposed. Attendees will learn about effective tools and techniques for detecting and mitigating these threats, especially in cloud-native and distributed systems. Designed for security practitioners and academics, this session provides a deeper understanding of defending against sophisticated attackers by adopting their mindset.\n\n**Thanks to our SPONSOR**: *[Kodem Security](https://www.kodemsecurity.com/)*\n*The AppSec chase is over.*\n*Swap endless alerts with focused action. Simplify the remediation of your most exploitable issues through runtime security.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "LayerOne Security Conference - Pasadena, CA",
        "date": "2025-05-24",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306677485",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** will be hosting a table at the **LayerOne 2025** Security Conference coming up in a little over two weeks, Memorial Day weekend, May 24-25, 2025 at the Pasadena Hilton Hotel!\n\nBe sure to stop by and say hi! See you there.\n\nHead over to the [registration page](https://www.universe.com/events/layerone-2025-information-security-conference-tickets-DXK36S?unii-trigger-open=DXK36S&unii-discount-code=L12025OWASPLA10) and secure your tickets now! Use promo code **L12025OWASPLA10** for 10% off registration courtesy of OWASP Los Angeles.\n\nPre-registration gets you full access to the event, all presentations, contests, villages, and the Saturday Night party.\n\nInterested in **sponsoring** this year’s event, hosting a vendor booth in the main hall, or contributing an awesome contest or event to this year’s conference? Reach out to L1 team at contact@layerone.org and tell them what you’re interested in!\n\nJoin the **Discord** and come hang out with us! Make some new friends and catch up at [https://discord.gg/layeroneconference](https://discord.gg/layeroneconference)."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "ZeroTrust [VIRTUAL] Conference Southern California",
        "date": "2025-05-13",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/307229106",
        "timezone": "America/Los_Angeles",
        "description": "Proliferation of SaaS, remote work, and global reliance on digital systems for critical operations have forced organizations to abandon traditional security models in favor of Zero Trust.\n\n**Register now** at https://summit25.ztjourney.com/\n\nAt this summit, participants will explore official CSA CCZT training modules and gain practical insights from industry experts—gaining the knowledge needed to fortify their infrastructures and stay ahead in an ever-evolving threat landscape.\n\nThe summit is designed for IT and security professionals, managers, and decision-makers who want practical insights and frameworks related to Zero Trust cybersecurity"
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "APIDays New York: API Management for Surfing the Next Innovation Waves",
        "date": "2025-05-14",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/307731470",
        "timezone": "America/New_York",
        "description": "OWASP NYC Chapter has been invited to attend a wonderful event, the APIDays NYC and Hack API NYC CON, focusing on API Security. Dive deep into best practices and methodologies for API Development. Network with industry professionals, share insights, and learn about the latest trends in software security. Whether you are an experienced cybersecurity professional or a newbie in the field, this event offers a great opportunity to enhance your knowledge and skills in the realm of application security. Don't miss this chance to be a part of a dynamic community passionate about cybersecurity and software security.\n\nPlease register at https://tinyurl.com/APIDays-OWASP-VIP\nuse \"OWASPVIP\" for a complimentary entrance. Tickets are limited to the first 100 OWASP Members so register ASAP. See you there..."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Scaling AppSec Through Runtime Threat Modeling",
        "date": "2025-05-22",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/307730889",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE1: NEW LOCATION. TAKE NOTE!!!!!**\n\n**NOTE2: The following will be in effect and mandatory for this meeting venue. Same procedure from our other location.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, May 19th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Microsoft Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Abstract**\nApplication security teams are drowning in findings from a sprawl of disconnected tools. As development accelerates—with AI-driven tooling, microservices, and cloud-native architectures—the ratio of code to developer is exploding. But the ratio of AppSec engineers to developers isn’t keeping pace, leaving security teams overwhelmed and reactive.\n\nIt’s time to flip the model: instead of starting with findings, we must start with the application. Vulnerabilities are just one signal—without deep application context, they're noise. Real-time application modeling enables teams to understand how applications actually behave in production: what code is reachable, which services talk to each other, what data is exposed, and where trust boundaries are violated.\n\nIn this talk, we’ll demonstrate how runtime-aware application modeling can surface critical risks that traditional approaches miss, eliminate false positives, and bridge the gap between AppSec and engineering. We'll walk through real-world examples of how modeling helps prioritize what truly matters—and why this shift is essential for scaling security in modern software development."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Bowling! ",
        "date": "2025-05-29",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916111",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Bowling @ Peterborough Bowl!\n\n**When?**\n\n* \\- Thursday 29th May\n\nEverybody welcome! For this event, please respond on Whatsapp and update your MeetUp attendance as pre-payment may be required.\n\nThank you,\nRyan & Mark"
    },
    {
        "group": "Pittsburgh",
        "repo": "www-chapter-pittsburgh",
        "name": "OWASP Pittsburgh Q2 Meetup:\n\nThe Dark side of AI - Speaker Chris Lindsey",
        "date": "2025-05-29",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-pittsburgh-chapter/events/307703419",
        "timezone": "America/New_York",
        "description": "**The Dark side of AI: Developing unsecure applications in minutes!**\n\nAI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deepunderstanding of how to:\nRecognize and assess the risks AI introduces in your code.\nImplement secure coding practices and enforce security policies.\nIntegrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security.\n\nChris Lindsey: https://www.linkedin.com/in/chris-lindsey-39b3915/"
    },
    {
        "group": "Sofia",
        "repo": "www-chapter-sofia",
        "name": "OWASP Sofia - May 2025 Meetup",
        "date": "2025-05-28",
        "time": "19:00+03:00",
        "link": "https://www.meetup.com/owasp-sofia-chapter/events/307509140",
        "timezone": "Europe/Sofia",
        "description": "Добре дошли в месечната ни сбирка на OWASP Sofia!\n\nС пролетно настроение влизаме в майското събитие на OWASP Sofia Chapter. Отново сме подготвили страхотни теми, свързани с threat modeling, CVSS и .NET Reflection.\n\nЛюбезен домакини на събитието ще бъде [Progress](https://www.progress.com/) ‍.\n\n**Програма за 28 май 2025:**\n\n* 19:00 ч. - Начало и въведение - [Тодор Тодоров](https://todorov.bg) @ [Payhawk](payhawk.com)\n* 19:15 ч. - Иван Иванов @ [Progress](https://www.progress.com/) - **\"How to fail with .NET reflection 101\"**\n* 20:00 ч. - [Йордан Попов (Dan Ny)](https://www.linkedin.com/in/dan-ny/) @ [Scalefocus](https://www.scalefocus.com/) - **\"Effective Threat Modelling\"**\n* 20:45 ч. - [Мартин Георгиев](https://www.linkedin.com/in/martin-georgiev/) @ [VMWare Carbon Black](https://www.broadcom.com/products/carbon-black) - **\"Scoring Vulnerabilities using CVSS\"**\n* 21:30 ч. - Q&A / Networking\n* 22:00 ч. - Закриване\n\nСъбитието ще се проведе на живо в офиса на [Progress](https://maps.app.goo.gl/unHVZspnrL83gLq79). Ако желаете да споделите нещо интересно, свързано с уеб сигурността, моля, изпратете ни вашата сесия на [https://sessionize.com/owasp-sofia/](https://sessionize.com/owasp-sofia/)\n\nОчакваме ви!"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "6th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-06-03",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584778",
        "timezone": "Europe/Berlin",
        "description": "**TBD**\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "Ctrl+Alt+Delusion: AI Development Disasters and How to (Mostly) Avoid Them ",
        "date": "2025-05-15",
        "time": "19:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/307683966",
        "timezone": "Europe/London",
        "description": "**Ctrl+Alt+Delusion: AI Development Disasters and How to (Mostly) Avoid Them**\n\nJoin our new OWASP Chapter Leader, Matt, for an engaging session where he'll walk us through common pitfalls in AI programming.\n\nThrough live prompts and a security review, Matt will explore practical strategies to prevent these issues and share established frameworks, including guidelines for self-hosting, the OWASP LLM Top 10 and other LLM security approaches.\n\nAfter the talk, enjoy the opportunity for insightful networking, accompanied by Thai food snacks prepared by resident chef Sonia of Bangkok Heightz restaurant and bar. There will be a bar, This session aims to equip you with actionable ideas and a deeper understanding of AI development challenges.\n\n**Agenda;**\nGreetings and updates - WTC\nShort talk CTRL ALT Delusion - Matt\nProfessional networking over food and beer (food provided).\n\nThis talk will be hybrid, however we will be testing a new setup which may allow us to stream future talks. You may join online but we cannot guarantee the quality - in person would be preferred. The video may be recorded and posted online at a later date."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-May Lunch and Learn",
        "date": "2025-05-16",
        "time": "11:15-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/307289782",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-May Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\n* 11:15am - Registration and Lunch\n* 12:00pm - Speaker - Kent Wilson - Crowdsourced Security in Practice: Lessons from the Frontlines\n* 1:15pm - Depart\n\n**Speaker**:\nKent Wilson is Vice President of Global Public Sector at Bugcrowd, where he leads efforts to bring crowdsourced security to government agencies and critical infrastructure worldwide. With over 20 years in cybersecurity as both a practitioner and executive leader, Kent has helped organizations of all sizes—from federal agencies to private-sector innovators—strengthen their security through vulnerability disclosure, bug bounty, and offensive security testing. He’s passionate about the power of ethical hacking and often speaks on topics like public-private collaboration, AI security, and how to build security programs that keep pace with today’s threats. Before Bugcrowd, Kent held leadership roles at several top cybersecurity firms and served in the U.S. Army.\n\n**Abstract**:\nAs threats evolve faster than ever, traditional security models struggle to keep pace. Enter crowdsourced security—a model that taps into the global hacker community to uncover vulnerabilities before adversaries do. In this session, we’ll explore how Bugcrowd is helping organizations—from startups to the federal government—scale their security programs through managed bug bounty, vulnerability disclosure, and penetration testing. We’ll walk through real-world lessons learned, common pitfalls, and how aligning with frameworks like OWASP Top 10 enhances outcomes. Whether you’re an AppSec professional, pentester, or just curious about the power of ethical hacking at scale, this session will provide insights you can take back to your own environment.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W\nSTE 600\nTampa, FL 33607\n\n**Sponsors**:\nBugcrowd - [https://www.bugcrowd.com/](https://www.bugcrowd.com/)"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Blocking with Confidence & The Future Application Security Engineer",
        "date": "2025-05-15",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510286",
        "timezone": "America/Vancouver",
        "description": "**Blocking with Confidence** with **Raphael Theberge**\n\nWe know that security can be cumbersome for parts of an organization. How can we lower the existing friction white maintaining our high standards?\n\nLearn how Relativity approached this question and reduced developer burden without sacrificing our security posture.\n\n**Raphael** is Director of Security Enablement at Relativity, where he owns all of Application Security, Vulnerability Management, AI Security and secure M&As. Previously spent time at Salesforce, Demonware, Booking.com and otherwise travelling the world.\n\n**The Future Application Security Engineer** with **Jeevan Singh**\n\n**Jeevan Singh** is the Director of Security Engineering at Rippling, where he is embedding security into all aspects of the software development process. Jeevan enjoys building security culture within organizations and educating staff on security best practices. Jeevan is responsible for a wide variety of tasks including architecting security solutions, working with development teams to resolve security vulnerabilities and building out security features. Before life in the security space, Jeevan had a wide variety of development and leadership roles over the past 20 years.\n\n**This event is sponsored by [EndorLabs](https://www.endorlabs.com/) and [Forward Security](https://forwardsecurity.com/).**"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "Codename Singapore -- Adopting the Three Ways of Effective AppSec",
        "date": "2025-05-21",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/307219856",
        "timezone": "America/New_York",
        "description": "Four teammates walked into a bar—a developer, an AppSec engineer, a SecOps lead, and a compliance officer. It sounds like the start of a terrible joke, but no one was laughing. They were too busy drowning in alerts, blaming each other, and wondering if their security program had secretly been designed by their worst enemies. Sound painfully familiar?\n\nIn this talk, I'll share the surprisingly entertaining story of how these burned-out heroes discovered The Three Ways of Effective AppSec. Using the metaphor of a modern city (complete with bank robberies, construction projects, and government bureaucracy), they unlocked the power of context, collaboration, and culture—transforming a chaotic security circus into a highly cost-effective (and even enjoyable) program that keeps their software safe from vulnerabilities and attacks.\n\nIf you’ve ever felt trapped in AppSec Groundhog Day, facing endless firefighting, alert fatigue, and compliance busywork, come laugh (and maybe cry) your way toward a practical blueprint for building an AppSec program that actually works."
    },
    {
        "group": "Warwick",
        "repo": "www-chapter-warwick",
        "name": "OWASP Warwick Chapter - Capture The Flag ",
        "date": "2025-05-14",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-warwick/events/306642042",
        "timezone": "Europe/London",
        "description": "OWASP Warwick is hosting a capture the flag. At Warwick iniversity. Thanks to our sponsor SecureFlag, who will be running the excercise on their platform.\n\nPlease come and join this should be an exciting event"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call (Europe-Asia)",
        "date": "2025-05-16",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/305752944",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "May community call - OWASP SAMM",
        "date": "2025-05-14",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/306053400",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    }
]