[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - August",
        "date": "2025-08-19",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/303407308",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with Stibo. By signing up, you consent to us sharing your name with Stibo solely for the purpose of visitor pass registration.\n\n**Agenda:**\n19:00 – 19:10 Welcome by Stibo and OWASP Aarhus\n\n19:15 – 19:45 “From Code to Compliance: Secure Development in Practice at Stibo Systems” by Jesper Thuun-Petersen, Director, Dev Ops & Security, Stibo Systems\n\nAt Stibo Systems, secure development is not just a principle—it's a structured, ISO 27001-aligned practice embedded across the entire software lifecycle. This presentation will walk attendees through how the R&D organization ensures security from design to deployment, highlighting key elements of the Secure Development Policy and how they align with OWASP principles.\n\n19:45 – 20:30 Networking break including light food and soft drinks\n\n20:30 – 21:25 \"Rejsen i OS2-fællesskabet (os2.eu) fra leverandørstyret og tillidsbaserede leverancemønstre, til ønsket om en øget ensartet og datadrevet transparens og automatisering på produkternes sikkerhed\" af Enterprise Arkitekt i OS2-fællesskabet Jan Maack Kjerbye og Sekretariatschef Rasmus Frey\n\nPlease, note that this presentation is in Danish."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Contributing to Open Source Security",
        "date": "2025-08-28",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/310515087",
        "timezone": "America/New_York",
        "description": "Need experience to get a job, but need a job to get experience?\n\nConsider contributing to open source security.\n\nWant to be a part of something impactful in your free time?\n\nConsider contributing to open source security.\n\nIf you want to gain real-world experience with modern technologies without submitting a single resume, expand your knowledge of security domains in collaboration with subject matter experts without paying tuition, and see the impact of your work in security projects used all over the world without a commute...then I'd say that's pretty reasonable, and perhaps more accessible than you think. From writing code, to improving documentation, to quality assurance, to organizing and volunteering at events - both in-person and virtual - there are many ways to get involved.\n\nIn this talk we will discuss several open source security projects, opportunities to contribute to open source security, and how to get started."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2025 (Online)",
        "date": "2025-08-26",
        "time": "11:50-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489310",
        "timezone": "America/Chicago",
        "description": "A few minutes of meet-and-greet and Chapter information, then the Presentation!\n\n### **Presentation:** \"Advanced Account Security with Identity Threat Detection & Response\"\n\nIdentity-related security challenges are more relevant than ever. As enterprises and consumers increasingly interact with a vast array of digital services, safeguarding accounts from compromise becomes a daunting task. Weak security measures not only expose businesses to financial loss and brand damage but also lead to unhappy customers. Identity Threat Detection and Response (ITDR) solutions offer a powerful way to reduce the risk of account fraud. In this insightful talk, we will explore typical account-related attacks illustrated with real-world examples. We will also discuss the critical non-functional requirements that make ITDR solutions truly effective.\n**Speaker:** **Bertold Kolics**\nBertold Kolics is a Software Testing Lead at Verosint (verosint.com), where he focuses on enhancing identity security through innovative solutions. His previous experience includes engineering identity provisioning and directory products at Sun Microsystems and UnboundID.\n\n\\-\\-\\-\\-\nIf you would prefer to attend in person, please see [Eventbrite](https://owasp-austin-2025-august.eventbrite.com)."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "August Meetup",
        "date": "2025-08-28",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/310531688",
        "timezone": "America/Los_Angeles",
        "description": "We’re excited to announce that our **August OWASP Meetup** will be Sponsored by **Miggo** **Security**\nJoin us for an evening of great conversations, community networking, and insightful security discussions — all in an awesome venue provided by **Miggo Security**. And yes, there will be **delicious food and drinks** generously provided by our sponsors!\n\n5:00 PM : Doors open, Networking, food and drinks\n5.30PM :- Chapter introductions\n5.45-6.15 PM :- Android app security - with a dash of LLM\n6.15-7.00 PM :- Defending AI-Native Applications: A Strategic Framework for Systems That Think\n7.0-7.45 PM :- Talk: Red-Teaming Agentic Workflows: Runtime Security for the Age of Autonomous AI\n\n**Talk #1**\n**Talk#2** Android app security - with a dash of LLM.\n**Abstract -** Over 3 billion android devices in use worldwide. The threat landscape increases as more and more devices use the Android platform and it becomes crucial to learn Android app security.\nIn this talk, we will start with some Android basics and key security concepts. After that, we will discuss a hybrid approach where we combine Classic Static analysis with LLMs contextual understanding of the code semantics to go beyond just discovering exported components in Android apps.\nWe will also demonstrate an open source LLM tool that assists in the deobfuscation of Android bytecode and may help in finding vulnerabilities.\n**Speaker :-** Vaibhav Agrawal Security Engineer at Google\nA cybersecurity professional with over a decade of experience in safeguarding digital assets, with core expertise in **Application Security**, **Mobile Security**, and **LLM Security**. His skill set spans a broad range of security and privacy domains, developed through both academic and industry experience, including **Infrastructure Security**, **Cloud Security**, and **Windows Active Directory Security**.\nVaibav is **IEEE Senior Member**, a **security conference speaker**, and an active **contributor to open-source projects**. Some of their work can be found on their GitHub repository: [https://github.com/In3tinct](https://github.com/In3tinct).\nResearch and blog contributions include:\n\n* [IEEE Research Paper](https://ieeexplore.ieee.org/document/8405724)\n* [Medium Blog](https://medium.com/@in3tinct)\n\n**Talk# 2** **Defending AI-Native Applications: A Strategic Framework for Systems That Think**\nThe rapid adoption of AI-native applications, powered by agents, assistants, and embedded LLMs, has transformed modern application behavior. These systems make decisions at runtime, invoke tools, and handle sensitive data in ways that are unpredictable and constantly evolving. For security teams, this marks a fundamental shift in accountability: defending logic that didn’t exist at deployment and changes continuously in production.\nIn this talk, co-delivered by Daniel Shechter, CEO and Co-Founder of Miggo Security, and Pritam Mungse, Director of Product Security at SoFi, will explore the emerging security challenges posed by AI-native applications and introduce a new model: Execution-Aware Defense. They’ll walk through how this approach reframes traditional code,and edge defenses to provide real-time visibility, prioritization, and enforcement against dynamic, AI-driven threats.\nDrawing conversations with 40+ security leaders over the past few months, the session will cover:\nThe unique risks AI introduces to application behavior and attack surface\nHow to apply a layered defense strategy to adapt at runtime\nPractical steps for operationalizing AI native defense in production environment\nAttendees will leave with a clear blueprint for evolving their security stack to meet the demands of software that thinks for itself, without slowing down innovation.\n**Talk#3 Talk: Red-Teaming Agentic Workflows: Runtime Security for the Age of Autonomous AI**\n\\*Description:\\* As organizations increasingly deploy autonomous AI agents and agentic workflows, traditional security approaches are failing to address the unique attack surface these systems create. Unlike static AI models, agentic workflows dynamically interact with external systems, make autonomous decisions, and adapt their behavior in real-time - creating unprecedented security challenges that require a new approach.\nWe'll explore the emerging threat landscape of agentic AI systems and demonstrate how red-teaming techniques specifically designed for autonomous workflows can identify vulnerabilities before they're exploited in production. You'll learn:\n• How agentic workflows create new attack vectors beyond traditional prompt injection and jailbreaking\n• Real-world attack scenarios including agent hijacking, tool manipulation, and autonomous privilege escalation\n• Runtime security strategies that evolve with your AI agents' behavior\n• Practical red-teaming methodologies for testing multi-agent systems and workflow orchestration\n• Building continuous security monitoring for autonomous AI deployments\nTraditional pentesting falls short when AI agents can rewrite their own objectives and interact with your infrastructure autonomously. Join us to discover how to secure the next generation of AI systems before adversaries do.\n\n**Speaker:** Aryaman is the Co-Founder and CEO of Repello AI - a leader in AI Runtime Security and AI red teaming products. Previously, he was the captain of top Indian CTF team InfoSecIITR, and undergrad from IIT Roorkee. Repello AI helps Fortune 500 companies and AI unicorns secure their GenAI applications through continuous red-teaming and adaptive security guardrails."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Patch Management 101: The Basics",
        "date": "2025-08-21",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/308650622",
        "timezone": "America/New_York",
        "description": "End of summer is the best time to get your systems updated before the busy season! Even better if use this time to organize the process of Patch Management for continuous improvement. This August, we discuss:\n\n\\- How to organize Patch Management\n\\- The Risk/Reward ratio of Patch Management\n\\- How hackers exploit issues related to Patch Management\n\\- How to effectively gather data for Patch Management using AI\n\nJoin us at OWASP Columbus to realistically discuss the methods to decrease the technical debt of Patch Management that most of us are responsible for."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP August In-Person Meet - Vibe Coding Meets AppSec",
        "date": "2025-08-28",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/310414265",
        "timezone": "America/Chicago",
        "description": "With the era of “vibe coding” taking off, where speed and fluidity drive software delivery, Static Application Security Testing (SAST) faces a rising challenge: managing false positives without slowing the pace. Striking the right balance between catching real vulnerabilities and avoiding wasted time on non-issues is key.\n\nIn this session, we’ll explore why false positives occur, the trade-offs that cause them, and how context shapes what’s truly risky—especially when rapid, iterative coding styles are in play.\n\nThrough practical, real-world scenarios, we’ll cover:\n\n\\- The FP/FN trade\\-off and why chasing zero false positives can introduce other risks\\.\n\\- The three core drivers of false positives: algorithms\\, rules\\, and context\\.\n\\- How risk appetite and environmental context change the definition of a vulnerability\\.\n\\- Strategies for prioritizing\\, triaging\\, and reducing noise without slowing momentum\\.\n\nBy the end of the session, you’ll have a clearer perspective on why fully eliminating false positives is rarely practical - and how to manage them so SAST remains a trusted safeguard in fast-moving development workflows."
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "OWASP Meeting",
        "date": "2025-09-09",
        "time": "19:00-04:00",
        "link": "https://www.meetup.com/indyowasp/events/310486026",
        "timezone": "America/New_York",
        "description": "Topic 1\n**Secure Vibe Coding: 5 Key Lessons**\nAI coding assistants like Cursor, Copilot, and Windsurf significantly increase productivity and assist with mundane coding tasks. But while powerful, these tools carry risks: trained on vast public datasets, they inherit bad patterns without necessarily ensuring secure application development. In this talk, we'll share five key lessons for security engineers and developers to improve code security:\n\n1. Implement guardrails\n2. Get real-time security signal\n3. Watch your dependency blast radius\n4. Compensate for non-determinism\n5. Invest in prompt engineering\n\nBio:\n**Nate Michalov** is a seasoned application security professional with over 12 years of diverse experience. Throughout his career, Nate has contributed to organizations such as Endor Labs, Apiiro, Snyk, Veracode, and Annkissam, where he has focused on securing digital ecosystems while aligning technological strategies with business objectives. In various roles including customer success architect, senior sales engineer, and senior SAST specialist, Nate has consistently tackled complex challenges at the intersection of business and technology. Known for his collaborative approach and dedication to staying informed about emerging trends, Nate is recognized as a trusted advisor in promoting innovation and resilience in application security.\n\nTopic 2\n**Title: Past, Present and Future of Automatic Code Remediation**\n\nAbstract: Academic projects, linters, and IDE helpers provided a foundation for simple automatic code refactoring, but lacked the depth to address complex code issues found by tools. Recently, the landscape of tools used to change code saw explosive growth. Several open source code mutation frameworks have emerged, allowing expressive and impactful code transformations. LLMs have also jumped into the picture, promising power and delivering “cool” – but also towing chaos. We’ll explore the capabilities of these tools, including synergistic strategies – all towards answering the question: “are we ready to automatically fix code issues?” Finally, we’ll look at the horizon and make the case that the era of self-healing software is approaching quickly, even if it looks a little different than what you might expect.\n\nBio:\nLeading tech innovator **David Hafley**, Head of Engineering at Pixee, blends leadership with tech expertise. Known for shaping global engineering teams, he champions large language models at Pixee, driving content and vulnerability solutions. Prior roles include Chief Product Officer at Dyknow, VP of Engineering at Contrast Security, and varied leadership roles from AWS environments to DevOps culture building. A seasoned speaker, David Hafley brings a wealth of knowledge to the Python conference stage, connecting tech, leadership, and the Python community."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Jax Monthly Meetup",
        "date": "2025-09-15",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/310150420",
        "timezone": "America/New_York",
        "description": "This is a placeholder event while we confirm this month's speaker. Stay tuned for updates, we'll share details as soon as they're locked in!\n\nInterested in presenting or know someone who might be? Reach out, we're always looking for speakers!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "Incident Response in Action: A Hands-On Security Simulation",
        "date": "2025-08-18",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/309788238",
        "timezone": "America/New_York",
        "description": "Experience the dynamics of a live incident in this interactive tabletop exercise powered by *Backdoors & Breaches*. You’ll collaborate with peers to investigate a simulated security breach, make critical decisions, and apply practical strategies for containment and recovery. This session emphasizes active participation over passive learning, no slides, no lectures, just a realistic, guided scenario that brings incident response principles into focus while introducing you to one of the most engaging security games in the industry."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Aug 27, 2025",
        "date": "2025-08-27",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091958",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Conquering Castle Envy – The Flawed Mindset That’s Holding Application Security Back\nJoin us for great networking, dinner and drinks, and see a presentation by **Jeff Willams,** Co-Founder and CTO, **Contrast Security**\n\n**ABSTRACT:** Application security has spent 25 years stuck in the wrong mindset — treating software like a castle that can be fortified, inspected, and declared secure. That mental model leads to confident failure: endless scanning, training, and compliance rituals that rarely stop real threats. In this talk, we’ll re-examine AppSec’s go-to tools — threat modeling, scanning, pentesting, firewalling — through a new lens, so you can see why they keep falling short. The problem isn’t effort. It’s context. You’re trying to secure a living, breathing software city using a blueprint for a castle.\n\nWe’ll introduce a new model: Runtime Security. This isn’t theory — it’s about observing real production environments, with real users, data, connections, and threats. We’re not trying to secure a castle. Your application ecosystem is a massive, dynamic city — alive, interconnected, and always under construction. It needs monitoring, coordination, fast response, and resilience — not moats and silos. We’ll show how teams are using runtime visibility and feedback loops to focus on what matters, adapt quickly, and prove they’re making a difference. The most serious AppSec threat isn’t in your code — it’s in your head. Shift your thinking, and everything else starts to fall into place.\n\n**Thanks to our SPONSOR**: *[Contrast Security](https://www.contrastsecurity.com/)*\n*You can't stop what you can't see*\n*Application Detection and Response for Modern Enterprises*\n*Stop attacks in your applications and APIs from development to production*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "It Doesn't Have to Be That Hard: Battle of the Hardware Hacking ",
        "date": "2025-09-04",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/310249355",
        "timezone": "Europe/London",
        "description": "This September, OWASP Manchester welcomes you to two talks that smell faintly of solder, tofu, and the quiet hum of rebellion. You’re about to hear from two giants in the world of hardware hacking, people who void warranties not by accident, but as an art form: Jay Harris and Andrew Tierney.\n\nPresenting @JayHarris_Sec (aka Jahmel Harris), former ringmaster of the Manchester Grey Hats, returning to his old stomping grounds with circuits to fry and stories to tell. Alongside him, the inimitable @Cybergibbons (aka Andrew Tierney), a name whispered in reverence across teardown forums and embedded firmware Slack channels.\n\nAway from the crumbling ruins of Twitter, old legends rise again: Heroes of Hardware, Titans of Tinkering, Overlords of the Open-port. Join us as we plug in, pry open, and peer deep into the guts of the machines around us… or, you know, just learn how the masters break them?\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name when signing up to the event **AND** show photo ID when checking in to the event on the night.\n\n**As we're still dealing with a large number of no-shows, if you don't attend without releasing your ticket, we may remove you from future events.**\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**Agenda:**\n**6:00 - Open doors & networking & drinks**\n**6:30 - Talk 1**\n**7:15 - Refreshments (Food & Drinks & Networking)**\n**8:00 - Talk 2**\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBooking.com\n6 Goods Yard Street Manchester\nM3 3BG\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Jay Harris & Andrew Tierney**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Booking.com** \\- Venue Sponsor AND Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "The Dark Side of AI: Developing insecure applications in minutes!",
        "date": "2025-08-20",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/306404720",
        "timezone": "America/Chicago",
        "description": "AI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand Day",
        "date": "2025-09-02",
        "time": "08:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/304552659",
        "timezone": "Pacific/Auckland",
        "description": "In 2025, in place of our usual OWASP New Zealand Day conference event, OWASP New Zealand will be hosting the world AppSec community at **OWASP Global AppSec-New Zealand**.\n\nThis event includes a two-day conference on Thursday and Friday, preceded by a mix of half-, one-, and two--day training classes Tuesday - Wednesday.\n\nRegistration for the main conference opens on 1st April and is just $25 per person. Student registration is, as always, FREE. Training registration fees have not increased from last year, and registration will open by 1st May.\n\nThe conference's **Call for Training (CFT),** **Call for Presenters (CFP),** and **Call for Sponsors** are now open.\n\n* Call for Training: https://www.papercall.io/owaspnz25-training\n* Call for Presenters: https://www.papercall.io/owaspnz2025\n* Call for Sponsors: https://appsec.org.nz/conference/sponsorship.html"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Why you should hack your own APIs",
        "date": "2025-08-28",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/310385035",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: We will email attendees the address.**\n\n**The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, August 25th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Abstract**\nAPIs power virtually every web and mobile application, accounting for over 80% of all Internet traffic. And APIs are under attack. Gartner states APIs have become the “most frequent attack vector,\" resulting in hundreds of highly successful, high profile breaches. This API security presentation covers 1) why attackers love APIs, 2) real-world breaches (and how they map to the OWASP API Security Top 10), and 3) best practices to keep APIs secure.\n\n**Bio**\nDan brings over 20 years of cybersecurity experience with executive leadership roles at APIsec, Qualys, Anomali, ArcSight and others. He’s led Product Development, Sales teams, and Marketing at startups and publicly traded companies. Dan is the co-founder of APIsec University - a site that offers high quality, no cost courses on API security risks and best practices. APIsec University now has over 120,000 students, covering over 80% of the Fortune 100. Dan has earned engineering degrees from Rensselaer Polytechnic and Cornell University, and an MBA from University of Michigan."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa August 20th 2025: Fraud Detection & Security for AI Integrations",
        "date": "2025-08-20",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/310273515",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in-Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **\"Doing More with Less: An Adaptive, Label-Efficient Approach to Fraud Detection from Day One\" with Bahar Afshar**\n3. \"**Beyond APIs: MCP Security for AI Integrations\" with Harsh Makwana**\n\n**Abstracts:**\n\n***Doing More with Less: An Adaptive, Label-Efficient Approach to Fraud Detection from Day One with Bahar Afshar.***\nDetecting fraud in financial systems is like finding a needle in a haystack; fraudulent transactions are rare, labeling them is expensive, and sometimes, we don’t have any labels at all. In this talk, I’ll present a new approach that tackles these challenges by combining different learning strategies in an adaptive way. We’ll explore how to start detecting fraud even when labeled examples are extremely limited and how we can prioritize the most suspicious cases using smart, explainable tools. The goal is to make fraud detection not just more accurate but also more efficient and easier to understand for human experts. Whether you're working in cybersecurity, finance, or just curious about the future of AI-powered decision-making, this talk will offer insights into how we can do more with less when fighting financial crime.\n\n***Beyond APIs: MCP Security for AI Integrations with Harsh Makwana****.*\nThe Model Context Protocol (MCP) is rapidly becoming the standard for LLM integration with external tools and data. However, this accelerated adoption has often sidelined crucial security hardening. This talk will directly address the inherent security challenges within MCP implementations, providing essential strategies to build robust, secure AI agents.\n\n**Speakers:**\n**Bahar Emami Afshar** is in the process of completing their Master’s in Computer Science at the University of Ottawa, specializing in AI. During this time they worked under the supervision of Dr. Paula Branco and completed a research internship at H3M Analytics Inc. Their research focuses on explainable AI, anomaly detection, and label-efficient learning, with a particular emphasis on fraud detection and financial crime. Over the past year, Bahar has published several first-author papers exploring adaptive and efficient strategies for detecting fraud in low-label and imbalanced scenarios. Bahar is passionate about building intelligent systems that are more transparent, trustworthy, and impactful in real-world settings.\n\n**Harsh Makwana**, M.Eng, is an Application Security Consultant at Software Secured with over 3 years of experience in penetration testing. An alumnus of the University of Ottawa, Harsh is a general technologist with a strong interest in the advancements of both cybersecurity and industrial robotics. Outside of work, he enjoys exploring photography and illustration as creative pursuits."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Peterborough Beer Festival! ",
        "date": "2025-08-21",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916307",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Social Drinks @ The Peterborough Beer Festival!\n\n**When?**\n\n* \\- Thursday 21st August\n\nEverybody welcome! You will be required to buy your own ticket for entry. See https://pborobeerfest.camra.org.uk/.\n\nThank you,\nRyan & Mark"
    },
    {
        "group": "Ruhrpott",
        "repo": "www-chapter-ruhrpott",
        "name": "OWASP Ruhrpott Chapter Meeting - Save The Date",
        "date": "2025-09-04",
        "time": "18:30+02:00",
        "link": "https://www.meetup.com/owasp-ruhrpott-chapter/events/308971811",
        "timezone": "Europe/Berlin",
        "description": "OWASP Ruhrpott Chapter Meeting - Save The Date"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-09-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/307093545",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Vibe Coding for Security",
        "date": "2025-08-21",
        "time": "15:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/310283671",
        "timezone": "America/Los_Angeles",
        "description": "Please register on the event website:\nSpace is limited!\n\nhttps://seattlesecuritymeetup.com/"
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": " OWASP Seoul Chapter 8 :   ",
        "date": "2025-08-26",
        "time": "19:00+09:00",
        "link": "https://www.meetup.com/owasp-seoul/events/310480522",
        "timezone": "Asia/Seoul",
        "description": " OWASP Seoul Chapter 2025 8   !\n\n OWASP   8   ** **.               .\n           ,     .\n\n**    7 ,          7 30 .**\n\n       !\n\n  \n\n**      (5)**\n\n* OWASP Foundation  Seoul Chapter \n* OWASP   \n\n** #1:   (Open Source Gardening) (40)**\n‍ HAHWUL()\n      .          . ()  () , OWASP Noir       .     ?    ?\n\n** #2: ,   (30)**\n‍ \nOWASP Application Security Verification Standard(ASVS)   5.0 .      ,          .\n\n  \n\n*  : 2025 8 26() 19:00 \\~ 21:00 (KST)\n*  :   6(   551 ) [https://naver.me/502MT5HC](https://naver.me/502MT5HC) (     )\n*  : \n* Meetup     .      meetup    .     .\n\n OWASP Seoul Chapter   \n        OWASP Slack   .\n\n*     : [https://open.kakao.com/o/gS5IxXxh](https://open.kakao.com/o/gS5IxXxh)\n* OWASP Slack    ([https://owasp.org/slack/invite](https://owasp.org/slack/invite))   ,   (#chapter-Seoul) .\n\n    \n\n* OWASP         .     seoul-leaders@owasp.org        .\n*    - https://forms.gle/xvEJCjDMEmYr1rKN7"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Reducing Application Security Risk with ASPM: Future-Proofing for 2025 & Beyond",
        "date": "2025-08-21",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/310318996",
        "timezone": "America/Toronto",
        "description": "**Format**:\nHybrid (in-person and online) event\n\n**In-person location**:\n**BDO Canada LLP**\n20 Wellington Street East, 5th Floor\nToronto, ON\nM5E 1C5\n\n**Note:** In-person attendance is limited to **70 people**, in a **first-come, first-serve basis**.\nDoors will open at **6:00 PM**, with the event will start at **6:30 PM** (EDT).\nFor those who cannot attend in person, please join us virtually via the livestream!\n\n**Presentation Title: Reducing Application Security Risk with ASPM: Future-Proofing for 2025 & Beyond**\nIn an era of increasingly sophisticated threat actors, application security has become a critical concern for most organizations. This talk, \"Reducing Application Security Risk with ASPM (Application Security Posture Management),\" will explore the emerging role of ASPM in fortifying application security and accelerating DevSecOps and cloud native adoption by focusing on how to future-proof your approach for 2025 and beyond.\nSoftware development has undergone seismic shifts over the last 20 years: the Agile movement, the rise of DevOps and cloud native practices, and now the AI and generative development era. With AI code assistants and “vibe coding” on the rise, we’re seeing faster delivery, along with new and complex risks. Over the last 10 years of the DevSecOps journey, shift-left has also achieved little success. Application Security needs a fundamental reset for the future. In this talk, we will discuss how modern approaches and technology innovations that are built to solve three of the biggest challenges in application security that must evolve for the AI Era – Speed, Coverage & Scale, and Context. We will explore three common scenarios:\n\n1\\. Inventory and Secure net new applications\n2\\. Reduce risk and volume of existing security backlog by prioritizing and fixing what matters\n3\\. Expand coverage to address emerging blind spots in AI\\-assisted application development\\."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "ISACA + OWASP Vancouver Social",
        "date": "2025-08-27",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510822",
        "timezone": "America/Vancouver",
        "description": "We are pleased to announce ISACA + OWASP Vancouver joint social event.\n\n**Registration here: [https://lu.ma/CyberBBQ](https://lu.ma/CyberBBQ)**\n\nOWASP members get a discounted rate. If you are an OWASP member, use your @owasp.org email address when registering. If you are not an OWASP member, consider joining: [https://owasp.glueup.com/organization/6727/memberships/](https://owasp.glueup.com/organization/6727/memberships/)"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "From Reinforcement Learning to LLMs to Reinforce",
        "date": "2025-08-20",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/309892428",
        "timezone": "America/New_York",
        "description": "**From Reinforcement Learning to LLMs to Reinforcement Fine Tuning: A Pragmatist’s Guide to AI in Application Security**\n\nAI is everywhere in marketing decks and company OKRs, but which flavors of AI actually move the needle in application security? This talk dissects how modern AI paradigms—transformers (LLMs), agents, reinforcement learning (RL), RLHF (Reinforcement Learning with Human Feedback), and the emerging RFT (Reinforcement Fine-Tuning)—map to real AppSec problems. We’ll explore which areas benefit from transformer-based reasoning, why RL has failed to disrupt AppSec, and how newer approaches may be able to improve human workflows without sacrificing explainability or trust. Leaders will walk away with a sharper mental model of which AI tools are production-ready for AppSec use cases."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call",
        "date": "2025-09-12",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309730245",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "September community call - OWASP SAMM",
        "date": "2025-09-10",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309874101",
        "timezone": "America/New_York",
        "description": "**Join us for the SAMM Monthly Community Call,** a regular space to hear what’s new with the project, share experiences, and talk about all things SAMM.\n\nWhat to expect:\n\n* Project updates and what’s coming next\n* Occasional podcast-style chats with community guests\n* Open discussion + Q&A: bring your thoughts, questions, or challenges\n\nWhether you’re just starting with SAMM or are already involved, your voice matters. Everyone’s welcome!"
    }
]