[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "You don't have to patch!",
        "date": "2023-07-19",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/294663607",
        "timezone": "America/New_York",
        "description": "A standing premise in engineering and security is that in order to be secure you have to have all security patches applied and your software be up to date. This advice seems obviously correct but can also be the source of a lot of frustration, cost and fragility in production systems. Security patches often have to be rushed out, can be poorly tested, sometimes subtly change behavior and can cause performance, availability and even security problems to get introduced. Not only that, when vulnerabilities occur in third party systems, your ability to patch or upgrade can be dependent on a vendor or a party you don’t control.\n\nInfrastructure as Code (IaC) and the use of containers and orchestration complicated matters by forcing patching to any part of the application or infrastructure cause a full application build. For smaller sized apps, this isn’t really relevant, but it’s a real problem for apps that take hours to build and even more to test before being able to deploy again. This can highly discourage people from patching as fast as they can. Automated patching isn’t the answer as well, as the risk of breaking the application is too high. So, certainly, there must be another way.\n\nWhat alternatives are there then? In this talk, we will argue that an alternative is to use sandboxing and isolation to limit the blast radius of exploits. We will also look at three different examples in networking, in server side rendering and a web client on how you can architecture a system using sandboxing and isolation so that while patching remains necessary, the need to rush a patch out can be mitigated.\n\nHopefully, this talk can help security professionals better strategize how they spend their efforts to find a balance between finding and fixing vulnerabilities and patching them - and deploying mitigation or attenuation mechanisms assuming that no one can ever aspire to be 100% secure.\n\n----\nPedro Fortuna Bio\nCTO and Co-Founder at Jscrambler\n\nOnce on a trajectory to a full academic career, where he taught security and computer science courses for about 5 years - ended up falling in love with the fast-paced world of entrepreneurship. He Started Jscrambler where he leads all security research and drives the company's product innovation on application security. Has more than 15 years of experience researching and working on web security. OWASP contributor. A regular speaker at several international security conferences. Main research interests lie in the fields of Application Security, Web Security, Reverse Engineering, Malware, and Software Engineering. Builder of solutions that require code rewriting, sandboxing, or both. Author of several patents in application security."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - July 2023",
        "date": "2023-07-25",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705755",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- https://owasp\\-austin\\-2023\\-july\\.eventbrite\\.com\\.\\!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n# Every Risk is Not a CVE: Bolster up Against Software Supply Chain Attacks\n\n3rd party and open-source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- API Security Workshop with OWASP crAPI (hands-on)",
        "date": "2023-07-27",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/294625016",
        "timezone": "America/Los_Angeles",
        "description": "We are happy to announce a Hacker days on API security on 27th July.\nFood and awesome courtesy of our host Traceable.\n\n**Abstract**:\nIn today's rapidly digitalizing world, Application Programming Interfaces (APIs) are the backbone\nof communication in the vast landscape of web services, cloud applications, and microservices.\nWith this increased usage comes the inevitable rise of security threats targeting APIs. This\nworkshop aims to arm participants with practical knowledge and hands-on experience to secure\nAPIs effectively.\nIn this workshop, we will be using OWASP crAPI (completely ridiculous API), a purposely\ninsecure API, to demonstrate common API vulnerabilities and their mitigations. We will discuss\nthe 'Shift Left' approach in API security, emphasizing the importance of integrating security\nmeasures early in the development lifecycle. Participants will learn to identify, exploit, and\nsecure API vulnerabilities, equipping them with the necessary skills to build more secure\napplications\n\n**Presenter Bio:**\n1\\. Jayesh Ahire is the Product Manager at TraceableAI where he works on the Company’s\nAPI Security initiative. He is the maintainer of OWASP crAPI, Hypertrace, and many\nother notable OSS Projects. He is AWS ML Hero, Twilio champion, and runs API\nSecurity Global Community. He also runs AWS UG, Elastic UG, TensorFlow UG, and\nmany other communities in US and India. His research interest involved Distributed\nneural computers and Defi. In his free time, he likes to read and these days he is\nlearning to play the piano.\nLinkedin: https://www.linkedin.com/in/jayesh-ahire/\n\n**Requirements**:\n1\\. Active Participation: The workshop will be highly interactive\\. Questions\\, comments\\, and\nsharing of experiences are strongly encouraged.\n2\\. Laptop: As this is an in\\-person workshop\\, please bring along your laptop with any API\ntesting tool installed.\n3\\. Pre\\-workshop Material: On confirmation of your attendance\\, you will receive some\npre-workshop reading materials. We recommend reviewing these before the event to\nmaximize your learning experience."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "July Meetup",
        "date": "2023-07-19",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/294624958",
        "timezone": "America/Los_Angeles",
        "description": "We are happy to announce our July meetup. Thanks to our hosts FOSSA Inc. Please come and attend some awesome talks with some great food and drinks.\n\n**Talk #1 Quantifying Application Security**\nAbstract:\nWhy are application security concerns important? The security industry is increasingly using cyber risk quantification to express risks in business language. We will cover the tools, techniques, and methods used to measure risk and make informed decisions within security and the business at large. This includes an overview of Monte Carlo, Metalog Distributions, OPEN FAIR analysis, causal models, and other techniques/ tools.\n\nSpeaker:- Daniel ONeil, CEO Privacy labs\n\n**Talk#2: AppSec 2.0: Reimagine AppSec With Runtime Analysis**\nAbstract:\nSCA tools (container and dependency scans) generate too much noise. Runtime security tools don’t understand SCA findings, and don’t come in until production. What if you could marry SCA with runtime analysis during dev, test, and prod?\n\nIn this session, Kiran Kamity, CEO and Founder of Deepfactor, will discuss how the next generation of AppSec needs to go beyond just integrating static SCA into your CI pipeline, to analyzing insecure behaviors inside running apps and correlating that back to SCA to understand which vulnerable components are actually loaded into memory and used by your application. This new approach to AppSec will detect both known vulnerabilities/CVEs with SCA scans and unknown vulnerabilities with runtime analysis. It will then prioritize known vulnerabilities with runtime correlation of SCA findings. End result: you catch most of the key risks in your app, prioritize the key items your devs need to work on without flooding them with alerts, and remove unused components from your containers to burn down your CVE debt rapidly….and achieve the true mission of AppSec…to empower engineering and security teams to create secure applications.\n\nSpeaker:- Kiran Kamity is the Founder & CEO of Deepfactor. He is a serial Silicon Valley entrepreneur with a passion for building products that meet a need and make a business impact—with Deepfactor that’s empowering engineering teams to create secure cloud native applications. Prior to Deepfactor, Kiran was the Head of Product at Cisco Cloud BU, Founder/CEO at ContainerX (acquired by Cisco), and the Founder/VP at RingCube (acquired by Citrix). Kiran is a TEDx speaker and loves nature, travel, and food."
    },
    {
        "group": "Bhubaneswar",
        "repo": "www-chapter-bhubaneswar",
        "name": "OWASP Bhubaneswar Monthly Online Meetup",
        "date": "2023-07-22",
        "time": "1:00+05:30",
        "link": "https://www.meetup.com/owasp-bhubaneswar/events/294840495",
        "timezone": "Asia/Kolkata",
        "description": "Hey, [#infosec](https://www.instagram.com/explore/tags/infosec/?next=%2F) enthusiasts. we are going to have an online monthly meetup on 22nd July 2023. If you want to learn about Information Security with absolute zero expense, please register and be a part of the fastest open infosec community.\n\nPlease register on the below-mentioned link as well as RSVP here and grab your seat.\n\nRegistration: [https://docs.google.com/forms/d/e/1FAIpQLSehnFF9gPXTTGe5pEg0dYM7vMtzVPKHkJIvW8U53LjbMssdYQ/viewform](https://docs.google.com/forms/d/e/1FAIpQLSehnFF9gPXTTGe5pEg0dYM7vMtzVPKHkJIvW8U53LjbMssdYQ/viewform)\n\nOur Awesome Speakers: Shakti Ranjan Mohanty  and Sai Swarup Das\n\nCC: OWASP Bhubaneswar, Amiya Behera, Janmejaya Swain, Sai Swarup Das\n\n[#informationsecurity](https://www.instagram.com/explore/tags/informationsecurity/?next=%2F) [#offensivesecurity](https://www.instagram.com/explore/tags/offensivesecurity/?next=%2F) [#securityawareness](https://www.instagram.com/explore/tags/securityawareness/?next=%2F) [#computersecurity](https://www.instagram.com/explore/tags/computersecurity/?next=%2F) [#security](https://www.instagram.com/explore/tags/security/?next=%2F)"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Every action on every device tells a story",
        "date": "2023-07-25",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/294588372",
        "timezone": "Australia/Brisbane",
        "description": "Let's talk about leveraging the power of device and behavioural user data to create trust and maintain ease of access at the same time. This is becoming more and more common with giants like Google and Microsoft who are taking the lead to add it into their services while smaller players are falling behind due to a lack of resources to invest in it. In this presentation, I mainly focus on modern methods of fake account detection and account takeover protection as key areas that almost every service is dealing with these days.\n\nEvent location to be confirmed. (soon)"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "And we're back!",
        "date": "2023-07-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/294216909",
        "timezone": "America/New_York",
        "description": "We are BACK folks. Been .. a minute. But we have a great meeting coming together. Jeff Williams is our speaker, and Black Hills Security will be providing the snac. Here's what Jeff will be covering:\n\nAfter over 20 years, achieving app and API security still requires Herculean effort by smart and dedicated people. Fortunately, we can look to history and see a path forward. In the mid-2000s we changed the curve on kernel exploits by adding ASLR and DEP to operating systems. Imagine hardening your web app and web API stacks against all the major classes of vulnerability. You could instantly notify developers if they introduce a vulnerability and you could stop vulnerable software from being exploited. How would it change your appsec program if you could dramatically reduce the risk of all the common classes of vulnerability? In this talk, we’ll explain how runtime protection works and how you can streamline vulnerability management and ensure your software doesn’t get exploited… at the same time."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP July Meet - In person",
        "date": "2023-07-20",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/294141225",
        "timezone": "America/Chicago",
        "description": "OWASP Dallas is ready to host in-person meets.\n\n\"The Monsters in Your Software Supply Chain that SCA Can't Find\"\n\nThere are excellent SCA tools and excellent SSDLs out there, so why did the 3cx breach feel so much like GroundHog Day? This talk will discuss root cause, attack vectors, adversaries, and countermeasures for Software Supply Chain Security attacks.\n\nNote: Food and refreshments for the event will be provided. We thank Reversinglabs for sponsoring this event."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP JULY Meetup - Join Us!",
        "date": "2023-07-26",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/294482375",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us July 26 for food, drinks, networking and an exciting and timely presentation on \"Introduction to the OWASP API Security Top 10 2023\" from one of the best and brightest in the industry: Alan Shen. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to our Denver OWASP sponsor [SpyderSec](https://spydersec.com)**\n\n**Presentation Title:** Introduction to the OWASP API Security Top 10 2023\n\n**Presentation Details:** Application Programming Interfaces (APIs) are the glue that allows independently evolving systems to communicate with each other, and are an important focus for security investment due to their privileged access to sensitive data and functionality. Recently, the OWASP API Top 10 has been updated for 2023, so join us as we introduce the OWASP API Security Project. We'll cover what's new in the 2023 API Top 10, as well as compare the differences with the previous 2019 version. For those interested in hands-on practice, we'll also briefly introduce the OWASP crAPI (completely ridiculous API) Project which demonstrates common API vulnerabilities."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "From Manual to Machine: Evolution of Security Automation (SOAR) in SOC",
        "date": "2023-07-20",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/294576663",
        "timezone": "Asia/Dubai",
        "description": "**The focus of a security automation strategy is on implementing automated tools and processes to enhance the effectiveness and efficiency of an organization's security operations.**\n**The strategy covers several key steps, including identifying security risks and vulnerabilities, evaluating current security operations, setting clear automation goals, selecting the appropriate tools, implementing and testing them, continuously monitoring and improving, training the team, and ensuring compliance with regulations. With security automation, organizations have seen benefits such as improved efficiency and scalability, faster threat detection and response, cost savings, and better decision-making**"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #61  - Red Teaming & AD Security Quick Wins!",
        "date": "2023-07-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291813603",
        "timezone": "Europe/Berlin",
        "description": "Hi all, after the [German OWASP Day 2023](https://god.owasp.de/2023/) we want to dive into our regular OWASP Frankfurt Chapter meetings again. We are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within AppSec & Cyber Security. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **NVISO.**\n\n_What are we going to talk about?\n**1\\. This Is Fine – Red Team Edition**\n*Firat Acar & Moritz Thomas*\nLife as a Red Teamer is full of surprises and things do not always go according to plan. This means keeping a cool head even if everything is on fire. In this talk, two experienced Red Teamers share stories from the trenches – about misunderstandings, double agents, the thrill of getting caught as well as other good and bad surprises.\n\n**2\\. Does security always have to be expensive? Security Quick Wins in the Microsoft Windows environment**\n*Vanessa Barnekow*\nMost companies are built upon Microsoft Windows environments. At the heart of these environments is the Active Directory – which is therefore also an attractive target for attackers. When it comes to security, especially small and medium-sized enterprises (SMEs) often hesitate to take further steps – because they (wrongfully) assume that they are not be an interesting target and that security measures would cost them a fortune. This talk will present affordable and easily implementable measures that help harden Windows environments.\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **NVISO**.\n\n_When?\nOur Meetup takes place on the last Wednesday before the summer break in July, namely on 19.07.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nNVISO GmbH, Holzgraben 5, 60313 Frankfurt\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Lima",
        "repo": "www-chapter-lima",
        "name": "OWASP Meeting Julio 2023",
        "date": "2023-07-25",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/owasp-lima-meetup-group/events/294711775",
        "timezone": "America/Lima",
        "description": "**OWASP Meeting Julio 2023**\nReunión Mensual de Seguridad de Aplicaciones (VIA ZOOM)\n\n**PRESENTACIONES:**\n\n***Conceptos, estándares y problemática desde el frente de seguridad en la adopción del Open Banking en Perú- Jean Lau* (PE) & Luis Huapaya (PE)**\n\n***Vulnerabilidades sobre NFC: 4 millones de saldo en el metro - Fernando Flores (PE)***"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Limassol Meetup 2.0",
        "date": "2023-07-28",
        "time": "8:30+03:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/294232592",
        "timezone": "Asia/Nicosia",
        "description": "**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the second meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/)! We cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19:00 — 19:30 Maksim Gall, Exness:\n**How are Apples cracked?**\n19:30 — 20:00 Vlad Bychenkov, Semrush:\n**Malware in the life of SOC analyst: how to improve detection?**\n20:00 — 20:30 Dmitry Vershinin, InDrive:\n**SMS flood prevention**\n20:30 — 21:00 **TBA**\n21:00 — 22:00 — PvP Battles!\n22:00 — 23:00 — Eat, drink, networking!\n\nWe are also currently looking for people to present at the meetup. If you have a great idea or research or would like to share your experience with the rest of the information security community, please submit a [Call for Papers (CFP)](https://forms.gle/FchXL2THqUFWHhhu9).\n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2023-08-03",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/294874131",
        "timezone": "Europe/London",
        "description": "**DO NOT RSVP on Meetup: PLEASE REGISTER FOR THIS EVENT USING [EventBrite](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu) here: [https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu)**\nThis meetup will take place at Licel Corporation London offices in Stratford Olympic Park (in-person) and will also be live-streamed on the OWASP London YouTube Channel: [https://youtube.com/OWASPLondon](https://YouTube.com/OWASPLondon)\n\n\\-\\-\\-\\-\n**TALKS:**\n\n**OWASP Introduction, Welcome and News - Sam Stepanyan**\nWelcome and a brief update on OWASP Projects & Conferences\n\n**Talk 1: \"DevSecOps Maturity Model (DSOMM): From Theory to Enforcement \"** - **Raz Probstein**\nThe OWASP DevSecOps Maturity Model provides an excellent framework for companies looking to truly apply security in a cloud native and fast-paced engineering world. However, like all things Dev+Ops related, whatever isn't automated is much more difficult to apply to our systems. We'll show you how.\n\n**Talk 2: \"Doing More with Less: Practical Applications for Generative AI in Cybersecurity\" - Matt Adams**\nThis talk will demonstrate how generative AI can act as a productivity multiplier for cybersecurity teams, enabling them to do more high-value work with the same resources. Through live demos, attendees will see AI-powered tools that can automatically generate threat models, create security awareness materials, and automate security scanning and reporting - saving security teams valuable time. Attendees will come away with an understanding of how generative AI can be applied to help cybersecurity teams “do more with less” and elevate their capabilities.\n\n**SPEAKERS:**\n**Raz Probstein (@RazProbstein), Solution Engineer, Jit.io**\nRaz Probstein comes with years of experience is both leadership and technology, having served not only as Young Ambassador to the state of Israel, as well as headhunted and selected as Young Researcher at the prestigious Weizmann Institute for multi-disciplinary scientific research. Today she serves as a Fullstack Engineer at Jit, coming to the role with years of experience in a diversity of programming languages from Python, to Javascript and C/C#, from the elite Israel Defense Forces(IDF) Unit 81 - where she was not only one of a handful of women serving in a cybersecurity role, she also mentored women to help drive more gender diversity in the unit. Today she is studying Biotechnology at the Open University, and is passionate about building cloud native security tooling developers will love.\n\n**Matt Adams (@mattrwa), Security Architect, Santander UK**\nMatt is a highly experienced Security Architect with nearly 20 years of professional experience in the field of cybersecurity. He has worked with renowned organisations such as Costa Coffee and Santander UK, where he has led security architecture and engineering teams, and played a crucial role in defining global information security strategies. By drawing on his extensive knowledge in areas such as Security Architecture, Cloud Security, and Generative AI, Matt brings insightful perspectives on emerging technologies and their potential to reshape the cybersecurity landscape.\n\n**TICKETS:**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST [book your place on EventBrite](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-679671735457?aff=mu) to be admitted to the event by the building security - your name will be checked against the guest list. Please bring a Photo ID as this is the Amazon's building security requirement.\n\n**CODE OF CONDICT:**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\nOWASP aims to provide a harassment-free experience for everyone, regardless of gender, sexual orientation, disability, physical appearance, body size, race, age, or religion. We do not tolerate harassment of event participants in any form.\nAdditionally, participating in OWASP events means you shall also adhere to the OWASP Code of Conduct which you can find here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUL 26, 2023",
        "date": "2023-07-26",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/293419781",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Anatomy of a Breach: Dissecting Cloud Security\n\nJoin us for great networking, dinner and drinks, and see a presentation by John Heenan, Cloud Security Solutions Architect, Palo Alto Networks.\n\n**ABSTRACT**: Cloud security presents unique challenges. As enterprises continue to move to the cloud, security practitioners face new threats and paradigms. In this session, we’ll forensically reconstruct major cloud-centric breaches and step through them, building an understanding of what happened, how it happened, and developing key takeaways to help secure our own infrastructure, especially in AWS, Azure, and GCP.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Madison",
        "repo": "www-chapter-madison",
        "name": "July Meeting",
        "date": "2023-07-25",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-madison/events/294646940",
        "timezone": "America/Chicago",
        "description": "https://guidedconversations.org/\n\nTopics\n\n1. Soft / hard gates in pipelines\n2. jira ticket creation\n3. Automated Dependency Updates\n4. Automated SAST fixes…\n5. Enterprise scaling (scan by default ideas)"
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai Online Meetup - 22nd July 2023",
        "date": "2023-07-22",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/294661574",
        "timezone": "Asia/Kolkata",
        "description": "Introduction to OWASP Mumbai\n\n**Talk:** Introduction to SASE and the use cases.\nCloud-based Secure Access Service Edge and how it is changing the way we address the network and security challenges\n\n**Speaker:** Prashanth \\| Senior Security Consultant at Palo Alto Networks\n\nQnA, Feedback and Discussions"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Mobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-07-20",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/294045639",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in mobile AppSec vs. web AppSec and how to put OWASP MAS project, tools, and resources to work. In this session, we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources, and how to build your own toolkit. Along the way, we will hit the latest privacy and security updates with iOS and Android. The Web Rocks… but Mobile Rules - Come join us!"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Disinformation: malware of a free society / How Volunteer Work Can Work for You",
        "date": "2023-07-27",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/294627454",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Speaker 1:** Brandon Soroudi, Visiting fellow at National Security Institute\n[https://nationalsecurity.gmu.edu/](https://nationalsecurity.gmu.edu/)\n\n**Topic1 :** Disinformation is the malware of a free society - Part 2\n**Abstract:**\nThe future of information security is not protecting networks or endpoints. A new and unique security condition has emerged that has no IOC’s or TTP’s. However, it is arguably the most dangerous of all emerging threats. If exploited, it can alter elections, destabilize governments, and bring a swift end to truth and the institutions that rely on truth. The future of information security is detecting and preventing the spread of “disinformation”.\n\nPart 1 of this series focused on the origins of “active measures” in the Cold War and the events leading up to January 6th 2021. Part 2 of this series, will focus on a new framework to map disinformation tactics and techniques, and the impact AI based chatbots and “deepfake” technology will have on the future of democracy.\n\nWithout trust, democracy has no future. Can the security community help to restore trust in information and save democracy for posterity?\n\n**Bio:**\nBrandon has over 12 years of IT/InfoSec experience working as a server admin, network engineer, and security engineer. Brandon currently serves as Senior Threat Detection Engineer for BlackBerry Cybersecurity unit. Brandon is also a visiting fellow at *The National Security Institute (NSI) at George Mason University's Antonin Scalia Law School.* Brandon received his B.A. in Business Economics from the University of California, Irvine. Outside of InfoSec, Brandon is an avid hunter, backpacker, and “beach bum”.\n\n**Speaker 2:** Lori Barfield, ShellCon RaiseMe / US Coast Guard Auxiliary\n**Topic 2:** How Volunteer Work Can Work for You\n\n**Abstract:**\nThere’s a crushing Catch-22 in the technology world that keeps people from realizing their career dreams. Career consultants often hear this exasperated plea for help: “How do I get experience doing something new, when the companies I am talking to only want to hire people who already have experience?” Lori is a former computer engineer and technology executive who will explain how candidates can gain key engineering work experience by volunteering. Volunteers participate in a very wide range of opportunities: from meetups to open source projects to service to the country. This talk will explain how to leverage a volunteer accomplishment with strategic integration into resumes and job interviews.\n\n**Bio:**\nLori Barfield joined her first Internet startup during the original .com boom as a Senior System Administrator, at a company that eventually went public. After moving into leadership there, she started an international executive consulting practice.\nLori’s volunteer career began as a Chair for the Southern California Linux Expo. She has been a conference organizer and speaker in the Open Source world for 15 years. She also co-founded the cyber security conference ShellCon in 2017, and RaiseMe IT along with that. Through RaiseMe she has spoken and taught about career development at dozens of technical events across the country. Five years ago, Lori answered the call to duty and joined the Coast Guard Auxiliary. She is a Division Vice Commander and serves on the National Cybersecurity Penetration Testing team.\n\n**Schedule:**\n6:00pm - 6:30pm Networking, Food & Drink\n6:30pm - 7:30pm First Presentation\n7:30pm - 8:15pm Second Presentation\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-07-27",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/294627572",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Pittsburgh",
        "repo": "www-chapter-pittsburgh",
        "name": "2023 - Q3 OWASP Meetup: IaC Security w/ Jon Zeolla",
        "date": "2023-07-25",
        "time": "9:00-04:00",
        "link": "https://www.meetup.com/owasp-pittsburgh-chapter/events/294769152",
        "timezone": "America/New_York",
        "description": "**IaC Security**\n\nJon Zeolla\n\nLet's talk through the progression of Infrastructure as Code (IaC) in a company that has embraced cloud native practices, and how you can quickly get to the point of having many modular repos, all independently versioned and maintained, while being leveraged by other IaC. Then I will discuss how you can add security into these in a way that respects your development/SRE teams. Allowing teams to manage and configure their tools independently and in a distributed manner, while still having centralized visibility (through logs and metrics extracted from their pipelines, with associated dashboards and SLA/O/Is) and the ability to quickly deploy new IaC-specific security policies. We will also discuss a reasonable onramp – ensuring that teams don't need to triage piles of findings only to discover that most of them are false positives or low-priority noise. This will include a discussion of a real world roll-out, and a method that was developed to add passive security scans into existing IaC pipelines with no changes other than running the existing commands (terraform, ansible, etc.) inside of a new docker container."
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro 012 [ONLINE]",
        "date": "2023-08-17",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/294883770",
        "timezone": "America/Sao_Paulo",
        "description": "Em agosto teremos o nosso próximo encontro, será no dia 20/07 (quinta-feira), a partir das 19h30, online em nosso canal do YouTube.\n\n*Link para a transmissão:* *[https://www.youtube.com/watch?v=DaSarcPUym4](https://www.youtube.com/watch?v=DaSarcPUym4)*[ ](https://www.youtube.com/watch?v=DaSarcPUym4)\n\n**Confira a agenda:**\n\n**19h30-20h30**\n***\"Como fazer um secure code review na sua empresa\"***\n*O Secure Code Review é uma prática essencial para evitar que as vulnerabilidades cheguem em produção. A revisão de código antes do seu commit traz muitos beneficios. Na apresentação será mostrado algumas dicas de como realizar de forma eficiente um secure code review e como começar a fazer isso na sua empresa.*\n***Francisco Silva*** *(AppSec Engineer na Amazon)*\n*AppSec Engineer na Amazon, trabalha com segurança de aplicações e segurança de cloud. Com foco em ajudar desenvolvedores a descomplicar a segurança no código.*"
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro 011 [ONLINE]",
        "date": "2023-07-20",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/294421971",
        "timezone": "America/Sao_Paulo",
        "description": "Em julho teremos o nosso próximo encontro, será no dia 20/07 (quinta-feira), a partir das 19h30, online em nosso canal do YouTube.\n\n*Link para a transmissão:* [https://www.youtube.com/watch?v=-5EE217FhAk](https://www.youtube.com/watch?v=-5EE217FhAk)\n\n**Confira a agenda:**\n\n**19h30-20h30**\n***\"Shift-Left no SSDLC\"***\n*Desloque sua mente para a esquerda com a gente, serão abordadas iniciativas Shift-Left para detecção e correção de vulnerabilidades de forma antecipada, gerando uma maior eficiência na batalha contra as vulnerabilidades e uma redução de custos para sua empresa!*\n***Rodolfo Mariano*** *(Application Security Leader na Compass.UOL)*\n*Formado em Análise e Desenvolvimento de Sistemas\\, Pós\\-graduado em Inteligência Cibernética e Segurança Ofensiva OSCP \\| CEH \\| eWPTX \\| CRTP \\| eJPT \\| DCPT \\| SYCP \\| CWHI\\.*"
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "July Meetup: Vuln Hunting at Scale, A swagger UI Story",
        "date": "2023-07-19",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/294763270",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of each month. We will announce topics 2-3 weeks in advanced of our meetups.\n\n7PM-9PM\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Community Topics\n* Vuln Hunting at Scale: A Swagger UI Story"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-08-09",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/294771597",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - July 2023",
        "date": "2023-07-25",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/294745775",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Unpacking the Present State of Application Security",
        "date": "2023-07-27",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/294671576",
        "timezone": "America/New_York",
        "description": "Enjoy an industry practitioner's view of the state-of-the-art in AppSec today and over the next few years. Explore the state of the industry, from attackers, threats, and vulns to tools and tech. Learn successful strategies and roadmaps to build a solid foundation and future-proof AppSec programs, including ten future-looking areas for examination."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "Introducción a la seguridad de aplicaciones - Edición Julio 2023",
        "date": "2023-07-27",
        "time": "8:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/294654645",
        "timezone": "America/Montevideo",
        "description": "Esta será la reunión de julio de una serie de reuniones **presenciales**, enfocadas en lo **práctico** y en inspirar a nuevas generaciones y a personas que no están involucradas aún con la comunidad. Se llevará a cabo en [Technisys Uruguay](https://goo.gl/maps/coqZwLRqsrevrs976) (Dionisio Oribe 3071).\n\nEs importante destacar que **no se requieren** conocimientos previos en seguridad de aplicaciones para participar. Si bien tener conocimientos de web/frontend/backend ayuda, la idea es aprender en la marcha, así que sin timidez :)\n\nLa dinámica de *esta jornada* será la siguiente:\n\n* Pueden armarse grupos para compartir ideas y ayudarse en los ejercicios.\n* Los grupos tendrán desafíos/objetivos comunes basados en el proyecto [OWASP Juice Shop](https://owasp.org/www-project-juice-shop/).\n* Cada grupo tendrá **al menos un** **referente/facilitador** disponible, colaborador de la comunidad con experiencia para apoyar en cualquier duda y generar conocimiento, mano a mano.\n\nEl requerimiento para poder participar es **traer tu notebook**, cada asistente tendrá su ambiente de trabajo. Se proporciona a los asistentes una imagen virtual de Kali Linux preconfigurada con las herramientas necesarias para realizar el taller. Se necesita Virtualbox o VMWare para ejecutarla. Si tus recursos no son suficientes tendrás que seguir tutoriales para instalar un proxy de ataque (Burp Suite Community u OWASP ZAP) y Juice Shop (servidor local o con Docker).\n\nLa imagen se puede descargar de acá: [https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/](https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/)\n\nPara aprovechar mejor el tiempo y el ancho de banda se recomienda asistir con todo pronto. Para verificar la estabilidad y acceso al ambiente local se compartirá una presentación (que se mostrará el día del evento) con algunas instrucciones.\n\nA registrarse, **los cupos son limitados** (se pedirá confirmación para dar lugar a quienes estén en lista de espera). ¡Los esperamos!\n\n***NOTA***: *Para quienes hayan asistido a jornadas anteriores, pueden seguir con desafíos más complejos.*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Rating API Business Risks based on OWASP Top-10 API Security Vulnerabilities",
        "date": "2023-08-17",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248511",
        "timezone": "America/Vancouver",
        "description": "Web APIs are a common glue that connect people and processes with digital systems all across the globe. Not surprisingly, Web APIs contribute more than 80% of the Internet traffic today. Given the importance of APIs, OWASP has recommended top-10 API specific security vulnerabilities (such as Broken Authentication/Authorization and Excessive Data Exposure problems) that organizations must address to strengthen their security posture. Albeit useful, these API specific vulnerabilities do not necessarily translate to the same business risks. For instance, two APIs from an organization with Broken Object Level Authorization (BOLA) may pose very different business risks to that organization.\n\nIn this session, we'll talk about API Risk Rating System (ARRS) that maps API specific vulnerabilities to business risks such as Legal/Contractual, Operational, Financial, Reputational and Regulatory. Similar in-principle yet different than Common Vulnerability Scoring System (CVSS), the main objective of ARRS is to prioritize API specific vulnerabilities based on their business risks. We'll describe the methodology behind the system developed using thousands of APIs that are being tracked at a global scale. We’ll also share some hands-on practical scenarios.\n\nThe work presented was done by Samantha Sanchez, Jun Hee Lee, Alberto Ciconi and Baljeet Malhotra. Samantha, Jun Hee and Alberto are MSc Cybersecurity students at NYIT. Baljeet is an Adjunct Professor at NYIT, UBC, UVic, UNBC, and CEO of TeejLab Inc.\n\n**Location TBD**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Bridging the Security Gaps: Proposing and Implementing New ASVS Checks",
        "date": "2023-07-20",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248508",
        "timezone": "America/Vancouver",
        "description": "**Bridging the Security Gaps: Proposing and Implementing New ASVS Checks** with Iman Sharafaldin and Farshad Abasi\n\nIn the continuously evolving landscape of application security, staying abreast of potential vulnerabilities is paramount. This talk provides an in-depth exploration of recently identified security concerns, their implications, and their incorporation into the Application Security Verification Standard (ASVS). We will delve into the specifics of ten novel additions to the ASVS that were proposed and subsequently accepted.\n\nThe security vulnerabilities we will discuss include Zip Slip, arbitrary file read via malicious Symlink, flaws in escaping special characters in regular expressions, Type Juggling, Latex Injection, JNDI Injection, Prototype Pollution, and Cache Deception. Each of these vulnerabilities poses unique threats and requires distinct mitigation strategies.\n\nWe will shed light on each vulnerability, explore real-world implications, discuss best practices in addressing these security gaps, and detail how they have been integrated into the ASVS. This talk aims to arm developers, security professionals, and decision-makers with vital knowledge to enhance their application security, aligning it with the latest standards in the industry. Attendees will gain comprehensive insights that will enable them to fortify their applications, networks, and systems against these cutting-edge security challenges.\n\n**Iman Sharafaldin**\nPassionate about all things code, Iman has more than 8 years of cybersecurity and software related experience. He is also a PhD candidate in computer science with more than 1000 citations on his cybersecurity related publications. Iman enjoys hiking in his spare time. Designations & Certifications: PhD Candidate Comp. Sci., AWS Solutions Architect, OSWE, AWS Certified Security – Specialty\n\n**Farshad Abasi**\nAn innovative technologist with over twenty years of experience in security, software design and development, network and system architecture and management. Farshad spent a decade as a senior member of HSBC’s IT security team and currently leads OWASP’s Vancouver chapter. Designations & Certifications: CISSP, AWS Security Professional, Azure Security Engineer\n\nThis event wouldn't be possible without our sponsors - **Microsoft** and **Forward Security**."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #61  - Red Teaming & AD Security Quick Wins!",
        "date": "2023-07-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291813603",
        "timezone": "Europe/Berlin",
        "description": "Hi all, after the [German OWASP Day 2023](https://god.owasp.de/2023/) we want to dive into our regular OWASP Frankfurt Chapter meetings again. We are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within AppSec & Cyber Security. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **NVISO.**\n\n_What are we going to talk about?\n**1\\. This Is Fine – Red Team Edition**\n*Firat Acar & Moritz Thomas*\nLife as a Red Teamer is full of surprises and things do not always go according to plan. This means keeping a cool head even if everything is on fire. In this talk, two experienced Red Teamers share stories from the trenches – about misunderstandings, double agents, the thrill of getting caught as well as other good and bad surprises.\n\n**2\\. Does security always have to be expensive? Security Quick Wins in the Microsoft Windows environment**\n*Vanessa Barnekow*\nMost companies are built upon Microsoft Windows environments. At the heart of these environments is the Active Directory – which is therefore also an attractive target for attackers. When it comes to security, especially small and medium-sized enterprises (SMEs) often hesitate to take further steps – because they (wrongfully) assume that they are not be an interesting target and that security measures would cost them a fortune. This talk will present affordable and easily implementable measures that help harden Windows environments.\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **NVISO**.\n\n_When?\nOur Meetup takes place on the last Wednesday before the summer break in July, namely on 19.07.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nNVISO GmbH, Holzgraben 5, 60313 Frankfurt\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]