[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Attacking IACS: Strategic Industrial Exploitation",
        "date": "2025-04-24",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/306049408",
        "timezone": "America/New_York",
        "description": "**Overview:**\nOperational technology (OT) perimeters are rapidly emerging as a new frontier for attackers, mirroring the adversarial challenges seen in traditional IT boundaries. This talk explores crucial vulnerability classes and real-world exploitation tacticsaffecting common OT perimeter technologies. We will highlight significant risks and potential impacts of perimeter compromise on industrial environments. Attendees will gain a deeper understanding of the emerging threats at the OT boundary and the exploitation techniques adversaries may leverage.\n\n**Abstract:**\nAttacking IACS: Strategic Industrial Exploitation Industrial Automation and Control Systems (IACS) underpin critical infrastructure worldwide but often rely on outdated security paradigms, which may leave them vulnerable to modern attacks. This presentation explores technical attack methodologies targeting IACS, contrasting them with traditional enterprise network exploitation techniques. Drawing on extensive experience in vulnerability research, exploit development, and red teaming, I will highlight the unique challenges and attacker opportunities presented by IACS environments—such as reliance on legacy technologies, proprietary protocols, and stringent operational constraints.\n\nStructured around the IEC/TR 62443-3-1 standard, this presentation addresses critical gaps in modern security guidance for IACS environments. I will use examples to demonstrate strategic attack opportunities and illustrate how vulnerabilities are exploited differently within industrial settings compared to enterprise environments. Attendees will gain technical insights into the challenges of securing IACS against sophisticated attacks and leave with actionable defense strategies that address current IACS security gaps."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2025 (Online)",
        "date": "2025-04-29",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489295",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n(To Be updated)"
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE chapter meeting (24/04/2025, Antwerp)",
        "date": "2025-04-24",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/306971354",
        "timezone": "Europe/Brussels",
        "description": "On April 24th, we organize our next OWASP Belgium chapter meeting at Karel de Grote Hogeschool (Antwerp).\n\nWe'll have two talks centered around ethical hacking and bug bounty hunting, stay tuned for more details on the speakers and their topics.\n\n**Agenda**:\n\n* 17:30-18:00: Welcome with snacks & drinks\n* 18:00-18:10: **OWASP update**\n* 18:10-19:00: TALK 1\n* 19:10-20:00: TALK 2\n* 20:30: End of the meetup\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "AI Day Bhopal",
        "date": "2025-04-06",
        "time": "13:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/306875181",
        "timezone": "Asia/Kolkata",
        "description": "AI Day Bhopal is a full-day event designed to empower developers with Generative AI skills while emphasizing the critical role of **security in AI-driven applications**. Whether you’re a backend developer, an Android or Flutter enthusiast, a security researcher, or simply passionate about AI, this event provides a unique platform to **learn, share, and network with industry experts.**\n **Why Should You Attend?**\n **Expert-Led Talks & Keynotes** – Gain insights from AI pioneers, security professionals, and industry leaders on **AI/ML security, web security, and software security challenges in AI applications.**\n **Hands-on Workshops** – Explore cutting-edge AI & ML techniques along with **best practices for securing AI models, APIs, and software infrastructure.**\n‍ **AI-Thon (Hackathon)** – Tackle real-world challenges while integrating **AI-powered security mechanisms** into your solutions.\n **Startup & Product Showcase** – Discover innovative AI products and learn about **security considerations in AI-based platforms.**\n **Web & Software Security in AI** – Understand **threats like adversarial attacks, model poisoning, and API vulnerabilities** in AI applications, with insights from **OWASP Bhopal & ML Bhopal.**\n **Networking & Community Building** – Meet AI & security enthusiasts, **engage with the OWASP and ML community**, and build valuable connections.\n **Swags, Giveaways & Career Opportunities** – Exclusive goodies, internship/job opportunities & more!\n **Join us for an AI-powered, security-focused experience!**"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "AI and Cybersecurity: Navigating the Future",
        "date": "2025-04-12",
        "time": "10:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/307006092",
        "timezone": "Africa/Cairo",
        "description": "Join us for an insightful event where we delve into the intersection of artificial intelligence and cybersecurity. This event will feature two expert-led sessions that explore the impact of agentic AI on cybersecurity and provide a beginner's guide to vulnerability research. Whether you're a seasoned professional or just starting out, this event offers valuable knowledge and networking opportunities.\n\n### Session 1: Agentic AI and the Impact on Cybersecurity\n\n**Speaker: Ahmed Shosha**\n**Brief:** In this session, Ahmed Shosha will explore the concept of agentic AI and its implications for cybersecurity. Attendees will learn about the potential risks and benefits of AI-driven systems, how they can be leveraged for both offensive and defensive cybersecurity strategies, and the ethical considerations that come with deploying such technologies.\n\n### Session 2: Intro to Vulnerability Research: How to Start\n\n**Speaker: Fady Othman**\n**Brief:** Fady Othman will provide a comprehensive introduction to vulnerability research. This session is designed for those new to the field and will cover the basics of identifying, analyzing, and mitigating vulnerabilities in software and systems. Attendees will gain practical insights and tips on how to embark on a career in vulnerability research.\n\n### Additional Information:\n\n* **Date and Time:** Saturday, April 12th, 2025, from 10:00 AM to 12:00 PM"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Why you need to care about the EU's Cyber Resilience Act",
        "date": "2025-04-17",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/306918529",
        "timezone": "America/New_York",
        "description": "The EU's Cyber Resilience Act is a groundbreaking regulation designed to enhance cybersecurity standards for products with digital components. It aims to address widespread vulnerabilities and ensure manufacturers take responsibility for the security of their products throughout their lifecycle.\n\nThis act introduces mandatory cybersecurity requirements for manufacturers and retailers, covering the planning, design, development, and maintenance of digital products. It also emphasizes transparency, enabling consumers and businesses to make informed decisions about the cybersecurity of the products they purchase. CRob will explain why all of that still really, really matters to us here in the US."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP April Meetup - Join Us!   (Later start time this month)",
        "date": "2025-04-16",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/306866067",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on April 16th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 6:00 pm - the presentation starts at 6:30pm .\n\n***Note***: This time is a little later than usual as someone else has our usual room until 5:00 pm and D&B will need time to turn over the room.\n\nThis month's presentation is brought to you by SquareX!\n\n**Presentation:**\nThe Attacker’s Distributed Supercomputer: Your Browser\n\n**Abstract**:\nAs the browser transforms into the primary computing platform, new vulnerabilities are surfacing that existing security architectures are not prepared to tackle. This gap leaves enterprises exposed to risks like client-side exploits, unmonitored communication channels, and last-mile reassembly tactics, which exploit the browser's complexity beyond the reach of traditional tools.\n\nThis talk explores how the shift to browser-centric workflows has uncovered a critical weak spot at the very heart of organizations around the world, currently unprotected by conventional security measures, allowing both internal and external threat actors to bypass controls"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Avril 2025",
        "date": "2025-04-03",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/306825976",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **[Theodo](https://www.theodo.fr/)** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gotheburg: Open-Source X Foss-North & WirelessCar",
        "date": "2025-04-13",
        "time": "13:00+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/306904159",
        "timezone": "Europe/Stockholm",
        "description": "We’re excited to invite you to an evening of insightful cybersecurity talks with an open source twist! Join us for a community-day where we jump the gun for the upcoming FOSS-North conference. WirelessCar is proud to host this event, where we’ll dive into open-source security, red team operations, psychological safety, and more. Whether you’re a seasoned pro or just starting your journey in cybersecurity and open-source, this is a perfect opportunity to learn, share, and connect with like-minded professionals.\n\n**Agenda Highlights:**\n**13:00 - 13:30 OWASP Dependency-Track: Commercial Implementations**\nTake a closer look at OWASP’s Dependency-Track, a powerful platform for tracking and managing software components. We’ll see how organizations use it in real-world, commercial environments to improve visibility, mitigate risks, and maintain continuous security.\n\n**13:45 - 14:30 CodeQL and SAST: Practical Application in Secure Development**\nLearn how CodeQL and Static Application Security Testing (SAST) can be integrated into your development process. Gain insights into how these tools streamline vulnerability detection and help teams ship more secure code.\n\n**15:00 - 15:45 When Trust Becomes a Threat – Psychological Safety as a Defense Against Compliance & Manipulation**\nSometimes, silence can be the biggest vulnerability. Learn about the real-world consequences when no one challenges assumptions, and discover practical ways to foster a culture of psychological safety. This talk will highlight how trust without open dialogue can lead to catastrophic outcomes—and how to protect against it.\n\n**16:00 - 17:00 Open-Source Red Team Operations: Borrowed Tools, Real Risks**\nThis talk explores the high-speed world of red teaming with free, community-built tools. You’ll hear how readily available open-source software empowers small teams on tight budgets, but also introduces hidden pitfalls. Understand where open-source solutions can be a huge advantage—and where they can become a dangerous liability.\n\n**Event Speakers:**\n\n* **Daniel Wester** is an experienced change facilitator and team developer, and co-founder of Both&More AB. He supports organizations in driving value-focused transformation, enabling effective collaboration, and creating psychologically safe environments in complex, global settings.\n\n* **Martin Berg** is an experienced organizational consultant and leadership coach, and co-founder of Both&More AB. He helps teams and leaders navigate complexity, strengthen collaboration, and build cultures grounded in psychological safety and continuous improvement.\n\n* **Nima Statius** is a security expert with nearly two decades of experience in the field. With a broad technical skill set spanning offensive security and incident response, combined with a background in behavioral science and criminology, he brings a unique perspective on adversarial behavior and threat actor tactics. As an internationally recognized instructor in defense tactics, Nima blends deep technical expertise with an understanding of human behavior, helping organizations strengthen their defenses against both digital and physical attacks.\n\n* **Mikael Carneholm** is a Computer and Data Scientist with a passion for Machine Learning, Automation, Cloud and Container Technology. He possesses a technical depth like few others. He is thorough and sets the bar high in regard to quality and maintainability of the code he writes. Mikael is one of the contributors to the OWASP Dependency tracker and during the event sheds light on how it is used and developed.\n\n* **Viktor Lindström** is a Security Architect at WirelessCar, adept at crafting and communicating security frameworks to ensure solutions are robust and compliant. With a strong background in IT security, agile development, and cloud technologies, he expertly navigates the landscape of security standards and risk management, guiding teams towards achieving WirelessCar’s security objectives."
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Security and Compliance by design",
        "date": "2025-04-10",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/306823951",
        "timezone": "Europe/Stockholm",
        "description": "Welcome to a unique event where Agnes Hammarstrand (Partner and Lawyer at Delphi Law Firm), Rikard Bodforss (CEO of Bodforss Consulting), and Tobias Ahnoff (Head of Cybersecurity at Omegapoint) clarify how new and upcoming regulations such as NIS2, CRA or DORA affect those of us who build, develop, and maintain applications:\n\n* **What do these new regulations mean in practical terms for DevOps teams and organizations at large?**\n* **How do we create secure, “compliant by design” applications and systems?**\n* **What changes, risks, and opportunities lie ahead as regulations continue to multiply?**\n\nDuring this session, you will gain insights into how these directives are designed to strengthen security and what concrete measures are required of organizations. We will discuss everything from the distribution of responsibilities and practical implications to how you can prepare to effectively meet today’s and tomorrow’s regulatory demands.\nThrough presentations and a panel discussion, you will get an:\n\n* **Expert analyses of the legal landscape for IT and cybersecurity.**\n* **Hands-on advice on how to design robust processes and technical solutions that meet requirements.**\n* **Tips on how DevOps organizations can integrate compliance into their daily work without compromising on innovation and efficiency.**\n\nBy understanding the fundamentals of these new regulations and learning from the experts’ experiences, you will gain a better understanding of security and compliance by design. Don’t miss the chance to get your questions answered and network with others in the industry!\n\n**Agenda:**\n**17:30 - 18:00:** Doors open to Omegapoint, grab a sandwich and beverage\n\n**18:00 - 18:30** Agnes Hammarstrand will introduce NIS2 from a legal perspective.\n\n**18:30 - 19:00** Tobias Ahnoff will speak about Security and Compliance: How do we create applications that are both secure and compliant by design?\n\n**19:00 - 19:10** Short break\n\n**19:10 - 19:40** Panel Discussion with Agnes, Tobias and Rikard\n\n**19:40 - 22:00** Mingle and snacks\n\n**Agnes Hammarstrand** is one of Sweden’s leading experts in IT/tech and cyber law. Her specialist expertise includes data protection/GDPR, commercial tech and IT agreement, cloud services, Cyber and information security law. Agnes has extensive experience assisting companies with drafting and negotiating contracts and giving advice within the tech sector. Together with her leading team here in Göteborg, she helps businesses navigate legal matters. Two years in a row Agnes was voted \"Lawyer of the Lawyers,\" meaning the attorney that the most lawyers and associate lawyers in Sweden would choose to hire for a business law matter (in all categories).\n\n**Tobias Ahnoff** is an experienced developer and architect with focus on application security. He specializes in implementing authentication flows and authorization for web applications and APIs that manage sensitive data in the bank, finance, and health sectors. Tobias performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security. He is also member of the OWASP ASVS working group and co-author of[ securityblog.omegapoint.se](http://securityblog.omegapoint.se/)\n\n**Rikard Bodfoss** is a founding partner and CEO of Bodforss Consulting, a company focusing on cyber and information security for national critical infrastructure. He is highly experienced in security governance, with a strong background in technical security and infrastructure. He has led the IT forensic practice within the Volvo Group and has extensive experience in building and managing international teams. Additionally, he has overseen IT and security operations in public critical infrastructure environments and has been the CIO for the city of Gothenburg Sustainable waste and water. He possesses deep expertise in crisis management and security incident response, ranging from cyber intrusions to dawn raid scenarios. Furthermore, he has a strong understanding of international laws related to cyber security, digital forensics, eDiscovery, and data protection."
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "From Adversaries to Allies: Developers and AppSec, a Love-Hate-Love Relationship",
        "date": "2025-04-17",
        "time": "17:30-04:00",
        "link": "https://www.meetup.com/indyowasp/events/306650124",
        "timezone": "America/New_York",
        "description": "We are excited to partner with **Central Indiana ISSA** for our April meeting. We have two great presentations scheduled for this upcoming meeting.\n\n***Please register at their link, for our hosts to get an accurate count:*** [https://www.eventbrite.com/e/central-indiana-issa-chapter-meeting-april-2025-tickets-1292924625359](https://www.eventbrite.com/e/central-indiana-issa-chapter-meeting-april-2025-tickets-1292924625359?aff=oddtdtcreator)\n\n####\n\n#### **Presentation One**:\n\n#### Title: Insights from a Chief Security and Trust Officer\n\n#### **Speaker: Mike Towers, Chief Security and Trust Officer at Veza**\n\n####\n\nTopics will include:\n\n* Transforming Identity Security with Intelligent Access\n* The Identity Security challenge\n* The need for a new approach\n* Enabling important business initiatives\n* Vision for Identity Security\n* Finally achieving least privilege\n\nAs the founder of Digital Trust Group LLC and a distinguished executive, Mike specializes in digital security, trust, and business resiliency. Prior to joining Veza, he served as Takeda’s Chief Digital Trust Officer and held leadership roles at Allergan and GSK, where he developed robust security frameworks. Mike has been influential in over 50 M&A deals and has been honored by the CSO Hall of Fame. A respected speaker, author, and board advisor to multiple companies, Mike is dedicated to responsible innovation, data protection, and industry knowledge sharing. Based in Boston, he continues to make significant contributions to the field of digital trust and security.\n\n#### **Presentation Two**:\n\n#### Title: **From Adversaries to Allies:Developers and AppSec, a Love-Hate-Love Relationship**\n\n#### **Speaker: Peter Chestna, CISO at Checkmarx**\n\nAppSec is hard. Great AppSec is really hard.\nOver almost 2 decades, Peter Chestna has consulted on and observed hundreds of AppSec programs. He's even built a few of my own. The similarities are striking and the impact and outcomes in these programs are stymied by common misconceptions about the goal of AppSec and the results we should be seeking.\n\nIn general, we find too much, fix too little, and do almost nothing to prevent new vulnerabilities. We have built a world where we attempt to report and goal our way to victory. How's that working for us? We need to rebalance our efforts across these three pillars and put the emphasis where it belongs. The accumulation of security debt is burying us all under a mountain of exception processing and annual recertification. Stop the madness!\n\nWhether you are a security leader or a development leader, Peter has practical guidance for you. In this presentation, Peter hopes to convince you that by shifting your current focus, you can drastically improve the results you get from your efforts.\n\nIn this talk, Peter will describe how to:\n1\\. Turn developers from adversaries to allies\\.\n2\\. Modify your controls to reflect reality and make compliance feel better\n3\\. Put the effort of your finite resources to places that will have the greatest impact\n4\\. Elevate your AppSec program to a level of excellence through effective developer engagement\n\n**Dinner Sponsorship: Brooksource**\n\n**Parking Information:** See picture below for parking and entrance information.\n\n**Evening Agenda:**\n5:30 – 6:00 pm > Networking and Food (**in-person only**)\n6:00 – 6:15 pm > Central Indiana ISSA Introduction and Chapter Business\n6:15 – 7:30 pm > Meeting Speaker(s)\n7:30 – 8:00 pm > Brooksource Social (Rooftop Bar) / Cleanup\n\n**Please note that the location for our chapter meetings is at Brooksource located at 6215 College Avenue, Indianapolis, IN 46220.**\n\n**PLEASE ARRIVE as close to 6:00 pm. as you can**\n\n![](https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F988552403%2F53386386960%2F1%2Foriginal.20250320-145032?h=740&w=1200&auto=format%2Ccompress&q=75&sharp=10&s=f5f6e341efbde307a59f5189215f5551)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "AppSec in Action: Navigating SAST, SCA & DAST with Threat-Driven Remediation",
        "date": "2025-04-21",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/306773578",
        "timezone": "America/New_York",
        "description": "In this session, we will walk through the fundamentals of modern application security, focusing on three key types of scanning: Static Application Security Testing (SAST), Software Composition Analysis (SCA), and Dynamic Application Security Testing (DAST). We’ll look at common tools for each type of scan, what kinds of issues they’re designed to catch, and how to prioritize and address those issues based on real-world risk. This is a high-level overview designed for anyone looking to get a clearer picture of how these tools work together to improve code and application security.\n\nPresented by J.P. Pesare."
    },
    {
        "group": "Leiria",
        "repo": "www-chapter-leiria",
        "name": "OWASP Leiria Meetup #2 - \"Leiria Pine Forest\"",
        "date": "2025-04-10",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-leiria-chapter/events/306935853",
        "timezone": "Europe/Lisbon",
        "description": "**OWASP Leiria** is excited to invite you to an engaging evening filled with technology insights, networking opportunities, and inspiring discussions. We are **collaborating with Leiria Tech Talks, OutSystems, StartUp Leiria,** and **the Ministry of Testing Leiria** to bring together the tech community for another enlightening event.\n\nA **special thanks** to our fantastic **sponsors**, **Synvert xgeeks, StartUp Leiria,** and **Fnac Leiria**, for making this event possible!\n\n **Date:** April 10th, 2025\n **Time:** 18:00 - 22:00\n **Location:** Auditório FNAC, LeiriaShopping\n\n**Agenda:**\n\n**18:00 – Check-in & Networking**\nKick off the evening in a relaxed setting, perfect for connecting with fellow professionals before the talks commence.\n\n**18:30 – Event Opening**\n Hosted by Francisco (StartUp Leiria) & Fábio (Leiria Tech Talks)\n\n**18:45 – Talk 1: Vibe Coding: Fad or Future?**\n‍ David Alecrim & Luís Oliveira (Staff Engineers @ xgeeks)\n*Abstract:* Discover how AI is reshaping software development through vibe coding—where intuition meets engineering. From indie projects to enterprise systems, learn when to adopt this paradigm shift and its implications for the future of development.\n\n**19:15 – Talk 2: HTML Smuggling to EDR Bypass**\n‍ Milton Araújo (Security Researcher)\n*Abstract:* Delve into how cybercriminals utilize HTML Smuggling to circumvent traditional security measures like Antivirus (AV) and Endpoint Detection and Response (EDR) solutions. This session will explore the nuances of this stealthy attack method, showcasing how malicious payloads can be discreetly delivered to target devices via browsers while evading standard security protocols.\n\n**19:45 - 20:00 – Break / Networking**\nTake a moment to grab a snack, stretch, and connect with other attendees.\n\n**20:00 – Talk 3: Modernizing the DBA: Embracing DBaaS for Efficiency and Automation**\n‍ Diogo Passadouro (Senior Engineering Manager @ La Redoute)\n*Abstract:* Investigate the transition to Database-as-a-Service (DBaaS) and its impact on modern database management. Learn how adopting DBaaS solutions can enhance efficiency, automation, and seamless integration across various tech platforms.\n\n**20:30 – Talk 4: Faster Laps in the Software Development Life Cycle**\n‍ Nuno Reis (MVP @ OutSystems)\n*Abstract:* Explore how OutSystems is speeding up the Software Development Lifecycle (SDLC) by optimizing application delivery through a low-code approach. Discover how AI and visual development work together to enhance efficiency while ensuring security and high-quality standards.\n\n**21:00 - 22:00 – Pizzas, Networking & Event Closing** \n\n **Reserve Your Spot:** Don’t miss this incredible opportunity!\n\n All our partners will be promoting the event, and you can RSVP through any of them—your entry will be validated! Remember, spots are limited, so be sure to secure yours today!\n\nWe can’t wait to see you there! "
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#09 The Truth",
        "date": "2025-04-02",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/306589128",
        "timezone": "Europe/Lisbon",
        "description": "We continue on track to meet our goal of doing at least one event per quarter so without further ado, it's time for our second OWASP Lisboa event of 2025 \n\nThe meetup takes place on April 2nd, 2025, at 18:00, and is sponsored by INSCALE and AP2SI.\n\nThe venue is the INSCALE Office at [Av. da Liberdade 36](https://maps.app.goo.gl/DkSqfPSvRb7XKjrN9), 8th floor.\n\n Enter the building and take the elevators on the left to the 7th floor. Go through the black door on the left and go up one flight of stairs to the 8th floor. You will have arrived at your destination.\n\nThe schedule is the following:\n18:00 - **Quick intro** by the OWASP Lisboa chapter leadership team\n18:15 - **Can APIs Be the Silent Players in the Social Engineering Game?** by Teresa Pereira\n19:00 - **\\~Jedi\\~GenAI Mind Tricks - Are these the secure chatbots you’re looking for?** by Bruno Morisson\n20:00 - **Drinks & Dinner** by INSCALE\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks:**\n\nTitle: **Can APIs Be the Silent Players in the Social Engineering Game?**\nSpeaker: **Teresa Pereira**\nAbstract:\nThis talk delves into the pervasive yet often overlooked role of APIs in the realm of social engineering. Through a comprehensive exploration of case studies, security vulnerabilities and ethical considerations, this talk uncovers the hidden risks associated with APIs and gives you proactive measures to mitigate the potential for social engineering attacks facilitated by these silent weapons.\n\nBio:\nTeresa Pereira, also known as starmtp, is a Cyber Threat Hunter at Siemens Energy with expertise in penetration testing, red teaming, API security, and threat hunting. Previously at KPMG Portugal, she specialized in vulnerability exploitation, OSINT, social engineering, and API pentesting.\n\nA dynamic and engaging speaker, Teresa has shared her expertise at prominent events, including apidays Paris 2023, apidays London 2024, the Geek Girls Portugal Conference 2024, apidays Paris 2024 and OWASP Porto Meetup. Her professional credentials include API Security Certified Professional (ASCP) and Certified in Cybersecurity (CC).\nRanked among the top 4% on TryHackMe, Teresa is a Women in Security and Privacy (WISP) Volunteer, an APIsec University Ambassador, and also co-leads the OWASP Leiria Chapter, where she actively supports the cybersecurity community. She developed the course \"Getting Started in API Pen-Testing\" for APIsec University and authored the insightful article \"How Can HTTP Status Codes Tip Off a Hacker?\".\n\nIn 2024, Teresa was named API Security Person of the Year (ASPY) by the APIsec University board. In 2025, she created a room on TryHackMe entitled \"Vulnerability Chaining\".\n\nWith a degree in Computer Engineering and a strong passion for mentoring, Teresa is dedicated to advancing cybersecurity awareness and resilience across diverse industries.\n\n[https://pt.linkedin.com/in/maria-teresa-pereira](https://pt.linkedin.com/in/maria-teresa-pereira)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **\\~Jedi\\~GenAI Mind Tricks - Are these the secure chatbots you’re looking for?**\nSpeaker: **Bruno Morisson**\nAbstract:\nAfter experimenting with various public challenges on LLM chatbots—like Gandalf, PromptAirlines, and more—I decided to build my own. Not just to understand how LLMs work, but to see how easily I could break them.\n\nIn this talk, I’ll dive into the security risks of Generative AI, particularly LLM chatbots, and explore vulnerabilities that are often overlooked. From sensitive information disclosure to prompt injections and jailbreaking, I’ll walk through real-world examples showing just how these systems can be manipulated.\n\nNo tinfoil hat required.\n\nBio:\nBruno Morisson is a seasoned cybersecurity expert with over two decades of experience in offensive security, penetration testing, and red teaming. As the Partner and Offensive Security Services Director at Devoteam Cyber Trust, he leads world-class security testing across web and mobile applications, IoT, OT/SCADA, and threat-led penetration testing frameworks like TIBER-EU and DORA.\n\nBeyond his professional work, Bruno is a driving force in the cybersecurity community. He is the founder and organizer of BSidesLisbon, Portugal’s top security conference, and serves as a CREST Europe Council member, helping shape industry standards. His research contributions include multiple CVE disclosures, Metasploit modules, and publications on SAP security, honeypots, and Linux audit systems.\n\nBruno holds an MSc in Information Security from Royal Holloway, University of London, alongside an impressive list of certifications, including OSCP, CISSP, CISA, and GIAC GPEN.\n\nAnd in case you were wondering—yes, this entire bio was generated by GenAI.\n\n[https://www.linkedin.com/in/morisson/](https://www.linkedin.com/in/morisson/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Apr 23, 2025",
        "date": "2025-04-23",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091943",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Enhancing Open Source Tools Using AI: A \"No Code\" Journey to Build an Automated DefectDojo Parser Generator\nJoin us for great networking, dinner and drinks, and see a presentation by **Tracy Walker,** Principal Solution Architect, **DefectDojo**\n\n**ABSTRACT**: See a live demonstration of using an AI LLM to accelerate the ability to adopt new, custom or unsupported security tools into DefectDojo, an open-source vulnerability management platform.\n\nThrough live examples, attendees will see a data transformation problem deconstructed into a series of repeatable prompts using an AI LLM to automatically generate 100% of parsing code, detailed documentation, and unit tests while maintaining code quality and existing best practices.\nThe demonstration:\n1) Highlights OWASP feature project DefectDojo,\n2) Is *applicable* to any open source tool or community, and\n3) Is *accessible* to security practitioners or engineers of all technical levels.\n\n**Thanks to our SPONSOR**: *[DefectDojo](https://defectdojo.com/)*\n*DevSecOps, ASPM, Vuln Management - All on one platform!*\n*DefectDojo is the platform and product that enables scalable security through DevSecOps, integrates with 180+ security tools and counting, with a vibrant and active open source community. We also have a Pro Edition for those who are looking to achieve security automation and actionable insights with the smallest lift possible.*\n\n**Thanks to our HOST**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - April 2025 Meetup",
        "date": "2025-04-02",
        "time": "18:00+11:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/306491717",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nHappy new year! We're back into the swing of things. We found the \"Lean Coffee-style\" format worked well in 2024, so we're back with it once again as a place for AppSec practitioners to share their knowledge. We're looking forward to the AppSec discussions we had once again.\n\nWe're starting the year again at [YOI Indonesian Fusion](https://yoirestaurant.com.au/) as our location for April. On Wed, 2nd April 2025 6PM, there we shall meet. We aim to meet the 1st Wednesday every month from April to October.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic. )*\n\n**Please remember to update your RSVP if you can no longer attend.** Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get. We will take note of no-shows, and to make sure we've got space for those that do actually attend, your RSVP may be deprioritised for future events.\n\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is[ inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics. *You are expected to participate in the AppSec/ProdSec conversations constructively if you attend*. This isn't the place for BizDev focused conversations.\n\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Our Favorite OWASP Projects",
        "date": "2025-04-16",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/306282619",
        "timezone": "America/Chicago",
        "description": "Join our chapter leaders to discuss with us our favorite OWASP projects and how we use them for our work! This can be a great opportunity to get exposure to the work that OWASP does and learn a bit more about what your membership fees (if a paid member) help support the development of."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "April 2025 OWASP Chapter Netherlands Meetup",
        "date": "2025-04-17",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/306515069",
        "timezone": "Europe/Amsterdam",
        "description": "This is an online meeting and will be streamed on [YouTube](https://www.youtube.com/watch?v=JyHZtpOlmJs). The meeting will start at 19:00.\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n19:00 - 19:10 - **Welcome and OWASP updates**\n19:10 - 19:55 - **OWASP Top 10 for LLM Apps and Gen.AI Security** by **John Sotiropoulos**\n19:55 - 20:05 - **Questions and Break**\n20:05 - 20:50 - **Building a Robust AppSec Program: SAMM’s Roadmap to SSDLC Maturity** by **Nariman Aga-Tagiyev**\n\n**OWASP Top 10 for LLM Apps and Gen.AI Security**\n*Abstract:*\nThe OWASP 10 for LLM Apps has been a highly successfully project creating the foundation for many other project initiatives including Agentic AI, Red Teaming, and LLM Exploit Generation. This session will provide a project update with an overview of the latest 2025 Top 10 for LLM apps and the new project initiatives\n*Bio:*\nJohn Sotiropoulos is the head of AI Security at Kainos where he is responsible for AI security and securing national-scale systems in government, regulators, and healthcare. A co-lead of the OWASP Top 10 for Large Language Model (LLM) Applications John leads Agentic Security Initiative and alignment with other standards organizations and national cybersecurity agencies including NIST, MITRE, CSA, the NCSC, and the US AISIC, where he is the OWASP lead. He is the author of the bestselling book on Adversarial AI, Attacks, Mitigations, and Defense Strategies and more recently he authored the UK Government’s Implementation Guide for the UK Code of Practice for the Cybersecurity of AI, both submitted to ETSI for international standardization.\n\n**Building a Robust AppSec Program: SAMM’s Roadmap to SSDLC Maturity**\n*Abstract:*\nIn this talk, we will explore how the OWASP Software Assurance Maturity Model (SAMM) provides a structured approach to building and improving an organization’s Secure Software Development Lifecycle (SSDLC). From assessing current AppSec practices to defining a practical roadmap for maturity, this talk will guide you through SAMM’s core pillars and actionable best practices. Whether you’re just starting or looking to refine your AppSec program, this session offers insights into fostering sustainable change and aligning security with business objectives.\n*Bio:*\nNariman Aga-Tagiyev is an Application Security Architect with over two decades of experience in software development. Over the course of his career, Nariman has worn multiple hats, serving as a full stack web application developer, backend developer, DevOps engineer, and cloud developer. However, since 2016, his focus has been exclusively dedicated to the realm of Application Security and advancing Software Security Development Life Cycle (SSDLC) maturity."
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "OWASP NYC Chapter: Application Security Cocktail Party \"Its for Fun\"",
        "date": "2025-04-03",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-new-york-city-chapter/events/306821525",
        "timezone": "America/New_York",
        "description": "Dive into the world of Application Security with the OWASP NYC Chapter!\n\n# AppSec Cocktail Party sponsored by Saran Toure of Invicti\n\nThis isn’t just a happy hour—it’s an AppSec celebration!\nJoin us at The Liberty NYC for an exclusive, invite-only gathering of top application security minds. Connect with fellow experts, enjoy great food and drinks, and dive into conversations that spark innovation. Yes, it's a bring in the \"Spring-Time\" Jubilee!!! Yes, you can bring along a Security Minded Friend.\n\n**Where:**\nThe Liberty NYC\n29 W 35th St, New York, NY 10001\n(Between 5th & 6th Avenue)\n**Date**:\nApril 3, 2025 from 6-9 PM\n\nDon't miss this opportunity to network with like-minded individuals, share experiences, and stay updated on the latest trends in Information Security. Whether you are new to OWASP or a long-time member, this workshop is designed to provide valuable insights into how to effectively secure your applications in today's threat landscape. Mark your calendars and join us for an engaging Happy Hour on Application Security!"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "The Dark side of AI: Developing insecure applications in minutes!",
        "date": "2025-04-17",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/306941861",
        "timezone": "America/New_York",
        "description": "AI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The Attacker’s Distributed Supercomputer: Your Browser",
        "date": "2025-04-24",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/306872817",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, April 21st, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Abstract**\nAs the browser transforms into the primary computing platform, new vulnerabilities are surfacing that existing security architectures are not prepared to tackle. This gap leaves enterprises exposed to risks like client-side exploits, unmonitored communication channels, and last-mile reassembly tactics, which exploit the browser's complexity beyond the reach of traditional tools.\n\nThis talk explores how the shift to browser-centric workflows has uncovered a critical weak spot at the very heart of organizations around the world, currently unprotected by conventional security measures, allowing both internal and external threat actors to bypass controls"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Get into Cyber Security",
        "date": "2025-04-30",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/306591606",
        "timezone": "Europe/London",
        "description": "\\*ATTENTION - DATE CHANGE & VENUE UPDATE \\*\n\nCyber Peterborough presents *Get Into Cyber Security*! An evening of focused discussion, interactive sessions and presentations on how to get into the field of cyber security. Technical or non-technical, this event will help you break down how to get into the cyber security field. Join us and meet other people interested in Cyber.\n**Where?**\n\n* University Centre Peterborough PE1 4DZ\n\n**When?**\n\n* Wednesday 30th April\n\n**Agenda**\n\n* **5:30pm:** Welcome\n* **5:40pm:** Cyber Myth Busting\n* **6:10pm:** Steven Trippier, Anglian Water CISO\n* **6:40pm:** Cyber Career Paths\n* **7:15pm:** Ask **your** questions - Panel\n* **7:45pm:** UCP Educational Opportunities\n* **8:00pm:** Networking Drinks @ the Pub!\n\nPlease respond to this event to confirm numbers for the event ensuring each attendee is catered for.\nThank you,\nRyan"
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "The Dark side of AI: Developing unsecure applications in minutes!",
        "date": "2025-04-15",
        "time": "19:00-04:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/307055825",
        "timezone": "America/New_York",
        "description": "Hey Friends! How great is it that we have such a space to gather, relax, and talk shop? Well - it's about to get better!\n\nChris Lindsey, the Field CTO of OX Security, will be joining us on April 15th to bring some extremely relevant and exciting knowledge concerning AI-induced application weaknesses, and the means to prevent and mitigate them. I really hope to see you all because you know - this is a can't miss. Once you read the abstract, I imagine you'll join us :)\n\n**The Dark side of AI: Developing unsecure applications in minutes!**\n\nAI is the ultimate accelerant for application development - it's power unmatched - but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session buy playing with fire - Using GPT-driven prompts, we'll build a fully functional application, and in real time, we'll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\n\nThrough hands-on exploration, we'll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code review.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Cryptography ",
        "date": "2025-04-15",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/306971109",
        "timezone": "Europe/Warsaw",
        "description": "**Important note first:** Unfortunately our previous venue - Techies' is temporarily closed, so this time we are creating this meeting with [Zendesk KRK](https://www.meetup.com/zendesk-krk/) at **[Zendesk Connect](https://www.linkedin.com/company/zendesk/) office**.\n***Use this  [sign-up link](https://docs.google.com/forms/d/e/1FAIpQLSdvj6iOdA_dD5tO9sYfRgD2Ko1jKaUiPSUndh4Fxr-YgFXOpg/viewform)  to streamline your walk-in to the Zendesk office and secure your spot at this inspiring event.***\n\nJoin us for a deep dive into cryptographic failures with[ ](https://www.linkedin.com/in/iwona-polak/)**[Iwona Polak (IGNIS)](https://www.linkedin.com/in/iwona-polak/)**! Expect a mix of math, live demos, and real-world security mishaps, followed by an open discussion on challenges, common mistakes, and best practices. Don't miss out—RSVP now and spread the word!\n\nAgenda:\n\n1. **When cryptography let us down - or maybe we let the cryptography down?**\n*[Iwona Polak (IGNIS)](https://www.linkedin.com/in/iwona-polak/)*\nCryptography is meant to serve and protect us, but sometimes it brings us to tears. During the presentation, I will show how we can hurt ourselves with cryptography. There'll be a little bit of math, and a lot of demos.\n2. After the break, we will be hosting a **discussion about cryptography in use**. Any examples of real-world cryptography failures? What are the challenges in reliably implementing cryptographic security? What are the most common cryptography programming errors that lead to security breaches? Is there a risk that legal regulations may hinder the implementation of modern cryptographic solutions? How to train development teams on the proper use of cryptography? Why people still roll their own cryptography in production environments, after decades of saying not to do that?\n\n**Please RSVP and save the date!**\n***Use this  [sign-up link](https://docs.google.com/forms/d/e/1FAIpQLSdvj6iOdA_dD5tO9sYfRgD2Ko1jKaUiPSUndh4Fxr-YgFXOpg/viewform)  to streamline your walk-in to the Zendesk office and secure your spot at this inspiring event.***\n\nIf you have a minute, **please share this invitation** with friends and in your social media.\n\n**Who is our host?**\n**[Zendesk](https://www.linkedin.com/company/zendesk/)** is a global tech company that creates customer service software and products help more than 145,000 global brands (AirBnb, Uber, JetBrains, Slack, among others) making their customers happy, every day.\n\nThe Polish hub with main office in Krakow is one of Zendesk's key European centers with software developers and security specialists, with 300+ members and continuing to grow.\n\n* Headquarters: SF\n* Global offices: 15\n* Employees: 5,700+\n* Customers: 145K+d"
    },
    {
        "group": "Rewa",
        "repo": "www-chapter-rewa",
        "name": "Cloud Security Best Practices: Securing Your Data in the Cloud",
        "date": "2025-04-12",
        "time": "16:00+05:30",
        "link": "https://www.meetup.com/owasp-rewa-chapter/events/306860418",
        "timezone": "Asia/Kolkata",
        "description": "Join OWASP Rewa Chapter for an in-depth discussion on Cloud Security Best Practices, focusing specifically on securing online payments. Our expert speakers will delve into the importance of implementing strong security measures in cloud computing to safeguard online transactions and protect sensitive financial information. Learn about the latest trends, technologies, and strategies in cloud security to mitigate risks and strengthen your payment systems.\n\nThis event is perfect for professionals in the fields of Data Science, Information Security, and Cybersecurity, as well as anyone interested in learning how to enhance the security of online payments. Don't miss this opportunity to network with like-minded individuals, expand your knowledge on cloud security, and stay ahead in the ever-evolving landscape of digital banking and online transactions."
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "AI for AppSec  - A discussion of AppSec Best Practices",
        "date": "2025-04-11",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/306664000",
        "timezone": "America/Chicago",
        "description": "**AI Use Cases for AppSec - A discussion of AppSec Best Practices**\n11am-2:30pm for session\n2:30pm-3:30pm for happy hour\n\n**Details**\nTopics- See abstracts below\n\n* **Host Intro-Potential AI use cases for Application Security**\n* **Leveraging AI for Vulnerability Identification-NowSecure**\n* **AI coding agents -Risks and Benefits-Endor Lab**\n* **AppSec for AI AND NHI (Non Human Identity**) **-GrayLog**\n* **Shadow AI and AppSec: What You Don’t Know Will Get You!**-**ByteWhisper**\n\n**Lunch Provided**\nScuzzi’s Italian Restaurant - 4035 N Loop 1604 W #102, San Antonio, TX 78257\n\nHAPPY HOUR & DEMO LAB networking after session!!\nSnyk\nRapid 7\n\n**ZOOM** link provided below for remote attendees\nJoin Zoom Meeting\n**https://ftsc.zoom.us/j/87354552283?pwd=riuQYJOQfGAjjEkAoY2eb5YORAvU7D.1**\n\nMeeting ID: 873 5455 2283\nPasscode: 994707\n\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\n\nPlease reply **“ONSITE”** if you plan on attending in person so we can finalize headcount for food and room attendance \n\n**Presentations will include:**\n**Host Intro**-Potential AI use cases for Application Security\n\n***I.* Leveraging AI for Vulnerability Identification-NowSecure**\nArtificial intelligence (AI) language models are emerging as valuable tools for mobile security analysts and developers, offering significant benefits such as aiding in structured vulnerability assessments or [generating code](https://urldefense.com/v3/__https:/www.nowsecure.com/blog/2023/08/23/key-security-considerations-for-ai-coding-assistants-in-mobile-devsecops/__;!!CiF3mHgEawk!GssNkv5CwozvfTaxygbQLi1ioHIc19CE3CvGKAs_O0ele9J9xXF2cotd_ExIbn2DT0uSktJ44pJhX1KU8Mtiq6eRnRD80zjvVg$ \"https://urldefense.com/v3/__https://www.nowsecure.com/blog/2023/08/23/key-security-considerations-for-ai-coding-assistants-in-mobile-devsecops/__;!!CiF3mHgEawk!GssNkv5CwozvfTaxygbQLi1ioHIc19CE3CvGKAs_O0ele9J9xXF2cotd_ExIbn2DT0uSktJ44pJhX1KU8Mtiq6eRnRD80zj\"). However, limitations such as “hallucinations” in which the model generates inaccurate or misleading outputs highlight the importance of human oversight in managing [risk posed by AI.](https://urldefense.com/v3/__https:/www.nowsecure.com/blog/2024/11/13/the-ai-expansion-of-the-mobile-app-attack-surface-2/__;!!CiF3mHgEawk!GssNkv5CwozvfTaxygbQLi1ioHIc19CE3CvGKAs_O0ele9J9xXF2cotd_ExIbn2DT0uSktJ44pJhX1KU8Mtiq6eRnRAODGYNig$ \"https://urldefense.com/v3/__https://www.nowsecure.com/blog/2024/11/13/the-ai-expansion-of-the-mobile-app-attack-surface-2/__;!!CiF3mHgEawk!GssNkv5CwozvfTaxygbQLi1ioHIc19CE3CvGKAs_O0ele9J9xXF2cotd_ExIbn2DT0uSktJ44pJhX1KU8Mtiq6eRnRAODGYNig$\")\nThis talk covers a novel approach for recovering application source code, leveraging AI language models to transform pseudo-disassembly into high-level source code. This method is able to handle complex abstractions introduced in high-level languages SwiftUI or Dart and generates output in popular programming languages like Swift, C#, Kotlin, Java, Python or even Bash.\n\n***II.* AI coding agents -Risks and Benefits-Endor Lab**\nThe proliferation of AI coding agents will accelerate the production of code, but what are the risks associated with this acceleration? In many ways the core challenge to securing these outputs will be the familiar fundamental challenges that appsec has always faced: maintaining an understanding of your inventory and risk-posture, conducting security assessments at scale, and managing processes for risk acceptance and remediation. Good appsec fundamentals will be critical in the new era of AI generated code. But coding agents also introduce novel concerns born from the inherent differences between these agents and human developers, as well the additional layers of abstraction which will become intrinsic to AI development: understanding how to vet and validate non-human agents, identifying the operational risks posed by agents trained on open-source, and the complexity of managing code developed through natural language will all require the development of new practices in appsec. This talk will look at some of the new risks that will arise in the era of large scale AI code development, and discuss possible paths forward for deploying such agents in a secure way.\n\n***III.*** **AppSec for AI AND NHI -GrayLog**\nAPPSEC FOR AI AND NHI - As we're empowering NHIs (**Non Human Identity**) to take on greater responsibilities, it's smart to wonder how we'll keep these good bots in bounds. This isn't possible to answer without acknowledging a dirty little secret -- while modern software is already driven by bots, modern security tools fall short in observing and regulating interactions between bots and APIs, whether those bots are trusted NHIs or malicious attackers. This session dispels a few myths about bots and bot detection and shows a few practical considerations and techniques to identify and block high-risk activities.\n\n***IV.*** **The Shadow AI and AppSec: What You Don’t Know Will Get You!-ByteWhisper**\nThe over-the-top headlines about artificial intelligence (AI) have only been outstripped by the breakneck speed by which many are adopting AI to transform their organizations. Shadow AI creates significant security exposures, like development teams processing sensitive customer data through unauthorized AI tools for creating mission-critical solutions using unvetted open-source AI models. This session will focus on where Shadow AI and appsec intersect – the coding co-pilots, the platforms, and the risks that they represent to your organization. This session will provide an overview of Shadow AI, how application development might unknowingly create Shadow AI, and tools to identify and mitigate Shadow AI."
    },
    {
        "group": "Sao Paulo",
        "repo": "www-chapter-sao-paulo",
        "name": "[Meetup Presencial] OWASP Chapter SP - Apoio:Oracle",
        "date": "2025-04-08",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-sao-paulo-chapter/events/306897539",
        "timezone": "America/Sao_Paulo",
        "description": "Neste Meetup presencial do OWASP São Paulo, vamos mergulhar nos desafios reais da segurança da informação com dois especialistas que vivem o dia a dia da cibersegurança em alto nível.\n\nMichel Roitman conduzirá a palestra **“Banco de Dados Sob Ataque”**, apresentando os principais vetores de ataque que comprometem a segurança dos dados nas organizações. De injeções SQL a falhas de configuração e criptografia, ele mostrará como identificar vulnerabilidades, entender o nível de exposição e aplicar controles eficazes.\n\nNa sequência, Marcelo Marcon traz a palestra **“Segurança da Informação e Ameaças no Cenário Global”**, oferecendo uma visão ampla sobre o ambiente internacional de ameaças cibernéticas. A partir de sua experiência no setor público e privado, ele compartilha insights sobre ataques cada vez mais sofisticados e coordenados, destacando a importância da antecipação e resposta ágil. Uma conversa essencial para entender a segurança da informação como um pilar crítico para a continuidade dos negócios.\n\n **Quer aprender com especialistas, trocar experiências e fortalecer sua rede na área de cybersecurity?**\n\nGaranta sua presença e venha se conectar com a comunidade!\n\nLink: [https://4soci.al/owaspsp](https://4soci.al/owaspsp)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-04-09",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/306142415",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - GitHub Runners Takeover @ Kivra",
        "date": "2025-04-08",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/306683614",
        "timezone": "Europe/Stockholm",
        "description": "**Join us** for the second OWASP Stockholm event of the year. This time Kivra is hosting and Dr. Pedro Merino will present about GitHub runners and vulnerabilities that you should be aware of.\n\n **When:** 8th of April, 17:30 - 21:00\n **Where:** Klara Norra kyrkogata 33, Kivra AB\n\n **Agenda:**\n17:30 - 18:00 Gathering and mingling\n18:00 - 18:05 Doors close and intro\n18:05 - 18:50 First speaker\n18:50 - 20:30 Mingle, food will be provided\n\n**More about the talk:**\n\nGitHub Actions self-hosted runners offer faster deployment and greater control for CI/CD, but they also bring security risks when misconfigured.\n\nThis presentation shows how an attacker with limited access to a GitHub organization may craft a malicious workflow to execute arbitrary commands and take over a GCP instance.\n\n**‍About the speaker:**\n\n**Dr. Pedro Merino**\nPedro Merino is a Security Engineer at Kivra, specializing in CI/CD security and threat modeling.\n\nWith a Ph.D. in International Private Law, Pedro transitioned from finding loopholes in legal texts to uncovering security vulnerabilities in software. If there's a way in, he'll find it. Outside of cybersecurity, he’s either training for a triathlon or diving into ancient history books."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "The State of Secure Coding & Secure Coding Tournament",
        "date": "2025-04-23",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/306889573",
        "timezone": "America/Toronto",
        "description": "**Note about In-Person Attendance**\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\nWe will be capping the in-person attendance to **40 people**, on a **first-come, first-serve** basis. This will allow us to effectively facilitate the Secure Coding Tournament at the venue.\n\nDoors will open at **6:00 PM**, with the event will start at **6:30 PM** (EDT).\n\nFor those who cannot attend in person, no worries! Please join us virtually via the Zoom call!\n\n**Event Description**\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\nThe presentation delves into the current state of secure coding practices, focusing on technical aspects and the challenges faced by developers and security professionals. We will highlight prevalent issues such as the increasing complexity of software systems, the evolving nature of cyber threats, and the persistent gap between development and security teams. Emphasizing the importance of integrating security into the software development lifecycle, the discussion covers best practices, common vulnerabilities, and the need for continuous education and collaboration to build a robust approach to secure coding across the industry.\n\nThe presentation will be followed by a Secure Coding Tournament for any interested members. **Bring your laptop to participate!**"
    },
    {
        "group": "Yaounde",
        "repo": "www-chapter-yaounde",
        "name": "OWASP Yaounde First Chapter Meeting",
        "date": "2025-04-19",
        "time": "14:00+01:00",
        "link": "https://www.meetup.com/owasp-yaounde-chapter/events/306891855",
        "timezone": "Africa/Douala",
        "description": "[English]\nFirst OWASP Yaounde chapter meeting.\n\nSchedule:\n\n* Introduction and Welcome by Ernest Mougoue and Valery Melou\n* Talk: \"What to expect From the OWASP Yaounde Chapter\" by Ernest Mougoue\n* Networking\n\nSpeakers:\nErnest Mougoue\nErnest is a Chapter Lead for OWASP Yaounde. He has 12+ years of experience in the software security field, having worked as a consultant or cybersecurity team leader for some of the largest companies in the United States. More recently, he is the co-CEO of MBOA DIGITAL, building the Cybersecurity practice.\n\nValéry Melou\nValéry is a Chapter Lead for OWASP Yaounde. Coming from a self-taught background, he is an exceptional and atypical full-stack web developer. He honed his skills developing for various clients as a freelancer on online platforms before joining MBOA DIGITAL over 5 years ago. Today he is the CTO of MBOA DIGITAL focusing on AI research with some interest in Cybersecurity.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n[French]\nPremière réunion du chapitre OWASP Yaoundé.\n\nProgramme :\n\n* Introduction et bienvenue par Ernest Mougoue et Valéry Melou\n* Conférence : \"Ce qu'il faut attendre du chapitre OWASP Yaoundé\" par Ernest Mougoue\n* Réseautage\n\nIntervenants:\nErnest Mougoue\nErnest est un chapter lead pour OWASP Yaoundé. Il a plus de 12 ans d'expérience dans le domaine de la sécurité informatique, ayant travaillé comme consultant ou chef d'équipe de cybersécurité pour certaines des plus grandes entreprises aux États-Unis. Plus récemment, il est le co-CEO de MBOA DIGITAL, où il développe le pôle cybersécurité.\n\nValéry Melou\nValéry est un chapter lead pour OWASP Yaoundé. Issu d'un parcours autodidacte, il est un développeur web full-stack exceptionnel et atypique. Il a perfectionné ses compétences en développant pour divers clients en tant que freelance sur des plateformes en ligne avant de rejoindre MBOA DIGITAL il y a plus de 5 ans. Aujourd'hui, il est le directeur technique de MBOA DIGITAL, se concentrant sur la recherche en intelligence artificielle avec un intérêt pour la cybersécurité."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call (Europe-Asia)",
        "date": "2025-04-11",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/305752927",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "April community call - OWASP SAMM",
        "date": "2025-04-09",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/306053395",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    }
]