[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "From Noise to Insight: Transforming Vulnerability Data",
        "date": "2024-09-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/302943013",
        "timezone": "America/New_York",
        "description": "Security and engineering teams everywhere are often overwhelmed by the tens of thousands of new vulnerabilities that are reported each year. But while there are several commonly used prioritization inputs that can help manage CVE noise — like CVSS, EPSS, and KEV — there are additional factors organizations would be wise to consider beyond these frameworks.\nThis talk will provide guidance for using inputs like asset business context, remediation efficiency, and exploitability analysis alongside traditional vulnerability metrics. Additionally, it will cover important outputs (like VEX and VDR statements) that efficient vulnerability management programs can use to communicate outcomes and posture to internal and external audiences.\n\nEvent sponsored by FOSSA: https://fossa.com/\nDinner provided\nPlease arrive on-time as we begin promptly at 5:30."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "5. OWASP Augsburg Stammtisch",
        "date": "2024-09-25",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/302854068",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda tbd**\nDu hast einen Vortrag? Melde dich! Wir sind immer auf der Suche nach interessanten Inhalten!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2024 (Online)",
        "date": "2024-09-24",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207023",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nPresentation: **The Secure Development Lifecycle in Action: The Point, Purpose, and Rationale**\n\nThe Secure Development Lifecycle (SDL) is a powerful construct that can advance security for both organizations with established security practices by shifting left, and immature organizations seeking a framework to implement security best practices in agile development. NI has been on a journey over the last several years to improve the security of its products driven by customer requirements, their expectations, and increasingly, regulations that require software to be developed with secure methodologies. Security is as much about a mindset and development culture as it is about tools, vulnerabilities, and security technologies. Learn how NI’s adoption of the Secure Development Lifecycle has created a framework for addressing various security challenges in web applications, microservices, and infrastructure."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "September 2024 OWASP Austin Security Professionals Happy Hour--sponsor Checkmarx",
        "date": "2024-09-12",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302000326",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, September 12th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Checkmarx](https://checkmarx.com)\n*Checkmarx is constantly pushing the boundaries of Application Security Testing to make security seamless and simple for the world’s developers and security teams. As the AppSec testing leader, we deliver the unparalleled accuracy, coverage, visibility, and guidance our customers need to build tomorrow’s software securely and at speed.*"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - September 2024",
        "date": "2024-09-11",
        "time": "19:00-04:00",
        "link": "https://www.meetup.com/owaspboston/events/303050135",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Daniel Shugrue, security product marketing from Digital.ai, to our meetup.\n\nDaniel will be speaking to us about the 2024 Application Threat Report, and will illuminate and quantify threats to apps in 2024 by categorizing threats according to the OWASP MASVS, and will end with some advice on specific actions security teams can take to stay a step ahead of threat actors. The advice Daniel will share is based on aggregated and anonymized threat data from some of the largest game makers and financial services, and media companies.\n\nDaniel Shugrue has over 20 years of experience working in security and communications. Prior to working at Digital.ai, Daniel worked in Confidential Computing at Microsoft, IoT Security at CyberX, Web App Firewall security at Akamai, and authentication at RSA. Daniel is a father of 2 boys, enjoys bicycling and playing guitar, and holds a degree in Mandarin Chinese from Washington University in St. Louis and an MBA from Babson College."
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "API Security Blunders: Tales from the Cyber Trenches",
        "date": "2024-09-05",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/302687611",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nIn this session, we dive into API Security by dissecting real-world API vulnerabilities that have caused security breaches. We'll guide you through the process of hunting for such vulnerabilities, and provide insights to effectively defend against such attacks.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "All Day All Night API Security Endpoint Analytics",
        "date": "2024-09-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301083996",
        "timezone": "America/New_York",
        "description": "APIs are the pipelines to the data within our environments. Attackers want this data. So how can you use the APIs to understand when you are being attacked? How can endpoint analytics help? In this discussion I will break down several attacks that have occurred over the trillions of transactions that have been monitored over time."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP September Meetup - Join Us!",
        "date": "2024-09-18",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/302950884",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on September 18th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:00 - food is served at 5:30 and the presentation starts at 6:00.\n\nThis month's meeting is brought to you by SnowFROC! This month's speaker will be Jason Haddix! Jason taught two workshops for us at SnowFROC this year and this was one of them. If you missed them, now's your chance!\n\n**Presentation:**\nRecon Like an Adversary: Uncovering Modern Techniques in Attack Surface Management\n\n**Abstract**:\nJoin our expert, Jason, in a talk designed to demystify the advanced techniques adversaries employ to infiltrate organizations. This session is a deep dive into the world of attack surface management using open-source tools, tailored to emulate both adversaries and professional bug hunters.\n\n* Introduction to Reconnaissance Techniques: Gain insights into the methodologies used by adversaries in their initial approach to an organization.\n* Tool Mastery: Explore a range of common tools and techniques for targeting organizations. This includes:\n* Email Acquisition: Methods and tools for gathering email data.\n* Technology Profiling: Techniques for identifying the technology stack of an organization.\n* External Attack Surface Analysis: A focus on cloud and mobile environments, among others.\n* Historical Data Mining: Strategies for uncovering valuable historical endpoint data.\n* Live Demonstrations: Experience real-time use of each tool in the toolchain. Jason will share personal tips and tricks, enhancing your learning experience.\n* Practical Application: The workshop features live targets, offering a real-world scenario for participants to engage with and learn from.\n* Interactive Learning Experience: Participants are encouraged to actively engage, ask questions, and share experiences throughout the session."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Septembre 2024",
        "date": "2024-09-09",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/303049860",
        "timezone": "Europe/Paris",
        "description": "\\-\\-\\-\nPour des raisons de sécurité d'accès aux locaux de notre sponsor, il est nécessaire de fournir votre nom et prénom pour ce meetup. **Une pièce d'identité sera demandée** pour l'obtention d'un badge d'accès. Nous vous remercions de votre compréhension.\n\\-\\-\\-\nCe meetup se deroulera chez **TotalEnergies** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #67 - CISO Roundtable ",
        "date": "2024-09-26",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/302364452",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #67!\nOur Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\nFor this meetup, we’re introducing a new format: a **CISO roundtable**. We are excited to welcome panelists from diverse industries to discuss software and cloud security.\n\n* **Sheetal Joseph** \\- Director\\, Cybersecurity at Isar Aerospace\n* **Dr. Tim Sattler** \\- CISO at Jungheinrich AG\n* **Prof. Dr. Igor Podebrad** \\- Director\\, Office of the CISO\\, Google Cloud\n* **Scott T. Nichols** \\- Global Product Security Leader Danaher Corporation\n* TBC\n\nWe aim to provide fresh perspectives and gain CISO-level insights, starting with a set of questions and then opening the floor for a lively audience discussion. Participants can submit questions in advance or ask them during the event.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 26.09.2024 from 18.00 to 22.00 o'clock CEST.\n\n_Where?\nIBM Tower One is located at Brüsseler Straße 1-3 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on [LinkedIn](https://www.linkedin.com/company/owasp-frankfurt/) and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg Maritime and OT Cybersecurity",
        "date": "2024-09-19",
        "time": "17:15+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/302944829",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Stena's Danmarksterminalen for an interesting evening with food and drinks, and talks about maritime and OT cybersecurity!**\n\n**Where:** Stena Line Danmarksterminalen, 413 28 Gothenburg\n\n**Agenda:**\n\n**17:15 - 17:30** Doors open\n\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n\n**17:45 - 18:30:** Maritime cybersecurity governance, *Fredrik Pihl*\n\n**Talk outline:** Maritime industry is being regulated since a few years back and is on journey towards a risk-based management approach. Learn about threat landscape, incidents, governance and similarities between industries.\n\n**Speaker’s bio:** Manager Cybersecurity, Risk and Compliance at Stena Group IT and OT Security Officer at Stena Group IT working with vessels, ports and terminals, wind turbines, property and waste management. Fredrik has 15+ years of experience from industrial IT projects and physical security industry working as IT / OT security architect including manufacturing, rail, defense industry, telecom and logistics.\n\n**18:30 - 19:00:** Food & Drinks\n\n**19:00 - 19:45:** Bridging the gap between IT and OT, *Jonathan Björnsson*\n\n**Talk outline:** In his presentation, Jonathan will, in a light-hearted and engaging manner, demonstrate how to bridge the gap between IT and OT. The goal is to build connections between these two areas and show how collaboration can lead to both innovation and stronger security.\n\n**Speaker’s bio:** Jonathan Björnsson is a cybersecurity expert with over 25 years of experience in both IT and OT. With his deep understanding of how these two worlds intersect and are secured, he has helped organizations protect their critical infrastructures. Jonathan is certified in Generative AI and works on AI-based cybersecurity solutions within the EU. He is also known for making complex security issues easy to understand for everyone.\n\n**19:45 - 20:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Houston Security Professionals Happy Hour - Sponsored by Salvador Technologies",
        "date": "2024-09-25",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/303064569",
        "timezone": "America/Chicago",
        "description": "Please join us at Monkey's Tail for a Happy Hour sponsored by Salvador Technologies.\n\nInformation from our sponsor:\nhttps://www.salvador-tech.com/\nSalvador addresses a crucial problem concerning operational continuity and cyber attack recovery for mission critical systems, eliminating costly, inconvenient, or even dangerous downtime. Our Security Failover technology is redefining the essence of ICS & OT Resilience, with our 30-second Recovery."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-09-16",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/302940703",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Os 10 principais riscos de segurança de CI/CD da OWASP",
        "date": "2024-09-07",
        "time": "10:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/303150504",
        "timezone": "America/Fortaleza",
        "description": "**MEETUP ONLINE**\nO Pipeline é o coração pulsante de muitas organizações modernas. Hoje estas novas tecnologias, permitem uma entrega de software mais rápida, flexível e diversa. No entanto, elas também remodelaram a superfície de ataque com uma infinidade de novas avenidas e oportunidades para os invasores e o professor Cleyber Silva, abordará os 10 riscos de segurança a se observar, quando implementamos estes processos."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Workshop Utilize DSOMM App to Define and Deliver Your Own Program",
        "date": "2024-10-02",
        "time": "19:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/302731833",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Utilize DSOMM App to Define and Deliver Your Own Program\nStep into the world of DSOMM in an immersive hands-on training event offered by **Timo Pagel**, [OWASP DSOMM](https://owasp.org/www-project-devsecops-maturity-model/) Project lead.\n\n**Abstract:** Discover how to elevate your DevOps security strategy with the OWASP DevSecOps Maturity Model (DSOMM). This comprehensive framework offers a structured approach to prioritizing and implementing security measures within DevOps practices.\n\nIn this workshop, Timo will introduce DSOMM and its practical application, demonstrating how to leverage DevOps strategies to enhance security. He'll showcase the DSOMM application and its features, guiding you through the process of customizing and scaling your AppSec program. Specifically, how you can customize the activities your team(s) should implement with level, title, descriptions/requirements, and evidence to deliver it to your teams including the current implementation status.\nYou'll learn about the \"inheritance\" concept in DSOMM activities and its time-saving benefits, including automatic mapping to frameworks like SAMM and ISO 27001. Through an interactive exercise, you'll create a small application security testing program based on DSOMM, gaining hands-on experience in prioritizing AppSec activities.\n\nThis talk offers tools and techniques for all skill levels, whether you're new to AppSec/DevSecOps or looking to refine your existing strategies.\nJoin us to learn how DSOMM can transform your approach to security and sharpen your skills in prioritizing AppSec/DevSecOps activities for enhancing impact.\n\n*Requirements*:\n\\- Docker\n\\- Linux is recommended\\.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - SEP 25, 2024",
        "date": "2024-09-25",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300687523",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: AI Services Security Test Guideline at Zoom\nJoin us for great networking, dinner and drinks, and see a presentation by **Raina Chen**, Senior Security Engineer at Zoom.\n\n**ABSTRACT**: As the adoption of AI technology proliferates across industries, an increasing number of companies are leveraging AI to power myriad products. This widespread integration necessitates a robust approach to ensuring the security of AI-driven solutions. This discussion explores an overview of Zoom’s security testing guidelines tailored for AI services, encompassing essential facets such as data privacy, model security, system security, open-source software (OSS) security, security of AI downstream services, and Automation Tools.\nThis presentation will provide a framework for navigating these challenges, offering practical insights and strategies for enhancing the security posture of AI services within Zoom and beyond.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "Sept. meetup: A Zero Trust Journey for Data Security and Enterprise AI",
        "date": "2024-09-12",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/302905456",
        "timezone": "America/Chicago",
        "description": "**A Zero Trust Journey for Data Security and Enterprise AI**\n**Wes Kennedy, LightBeam**\n\nAbstract: As organizations deal with the proliferation of sensitive data, they must be cognizant of the type, classification, and location of sensitive data within their environments, and remediate risks of data exposure in near-real time. In this session, we will review a comprehensive approach to strengthening enterprise data protection posture encompassing security, privacy, and governance. Proactive discovery, classification, access controls, and life-cycle management is the critical first step toward your zero-trust journey.\n\nAudience level: Intermediate (no AI knowledge needed)\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nPlease remember to register and keep your registration up-to-date so we know how many to expect."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-09-17",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297786503",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for September will be **A04:2021 - Insecure Design**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand Day - 2024",
        "date": "2024-09-05",
        "time": "08:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/300323362",
        "timezone": "Pacific/Auckland",
        "description": "We are proud to present the 14th OWASP New Zealand Day conference, to be held at the Auckland University of Technology (AUT) City Campus on Thursday and Friday, September 5th and 6th, 2024. OWASP New Zealand Day is a two-day conference dedicated to web and application security, with an emphasis on secure architecture and development techniques to help Kiwi developers build more secure applications. The conference is presented by the [OWASP New Zealand Chapter](https://owasp.org/www-chapter-new-zealand/) and organised by [AppSec New Zealand Incorporated](https://appsec.org.nz/).\n\nThere will be two presentation streams throughout the conference. The first stream will include introductory talks on application and information security topics, as well as on policy, compliance, and risk management. The second stream will primarily address deeper technical topics. Talks featuring OWASP projects and tools are particularly encouraged, as are talks by members of under-represented communities.\n\nIn addition to these principal streams, there will be a third, smaller “stream,” supporting sponsor presentations, demos of OWASP tools, and interest/user group meetings. Diamond, Platinum, and Gold Sponsors will be given priority for time slots in this “stream.” Further details will be published closer to the date, regarding opportunities for other groups to present.\n\nWho is the Conference for?\n\n* Web Developers\n* Security Professionals and Enthusiasts\n* Program and Project Managers\n* Business Analysts\n* Requirements Analysts\n* Software Testers\n\n## Conference Live Stream\n\nAll three streams of the conference (Track 1, Track 2, and the Sponsor Demos) will be live streamed on the day. Access information for the conference live-stream will be provided to registered delegates, as details are finalised.\n\n## Conference Structure\n\n**Date:** Thursday and Friday, 5-6 September 2024\n**Time:** 9:15 a.m. - 5:00 p.m., Thursday; 10:00 a.m. - 5:00 p.m., Friday\nThe main conference on Thursday and Friday will have two streams throughout both days:\n**Stream One:**\n\n* Introductory Topics\n* Program Management, Policy, Compliance, Risk Management\n\n**Stream Two:**\n\n* Technical Topics\n\nThroughout the conference, an exhibition area will be open in the main atrium. Representatives from many of our Premier Sponsors will be on hand throughout the event, to answer your questions about their products and services, or to discuss employment opportunities they may have available. There will be door prize drawings at the Closing Session on Friday. To qualify for the drawings, you will need to visit with each exhibiting sponsor during the conference, and have them stamp your entry card.\n\n## Registration\n\nRegistration is now open on Humanitix: [https://events.humanitix.com/owaspnz2024](https://events.humanitix.com/owaspnz2024)\n\nEarly registration (on or before 15 August):\n\n* $30, standard registration\n* **FREE**, for students and unwaged attendees\n* From 16 August, a late registration surcharge applies to all registrations ($20 Regular, $15 Student/Unwaged)"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa September 18th 2024: How Vulnerability Assessment is Done ",
        "date": "2024-09-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/303182934",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **How Vulnerability Assessment is Done in Common Criteria Evaluations**\n\n**Abstract:**\nThis presentation will discuss the methods currently used for vulnerability analysis in the internationally-recognized IT security evaluation standard, Common Criteria. Besides describing what is currently done in Canada and the United States, this presentation will briefly describe other vulnerability methodologies that have been outlined in the standard. The presentation will start with a brief discussion of what Common Criteria is, and why it is such a consequential standard for IT security.\n\n**Speakers:**\n**Carol Cantlon**, CISSP, has been involved with Common Criteria since its beginnings. She has done Common Criteria evaluations as a Canadian scheme Approved Evaluator in EWA-Canada's Common Criteria Laboratory and as part of the DOMUS IT Security Laboratory. She is currently the Quality Manager of Lightship Security's Canadian and US Common Criteria Laboratories with her responsibilities including the review of vulnerability assessment reports."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-09-26",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/302453493",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - OAuth secrets + Bug bounty",
        "date": "2024-10-01",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/303209619",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\nWe are Polish chapter of [OWASP](https://owasp.org/) \\- worldwide\\, non\\-profit organisation focused on application security issues\\.\nThis time we have invited Grzegorz Niedziela, \"Bug Bounty Reports Explained\" Youtube channel host. He will have a talk about OAuth security and then we will discuss bright and dark sides of bug bounty.\n\nAgenda:\n\n1. **OAuth Secrets (Grzegorz Niedziela)**\nThese days, Oauth is a key protocol, allowing us to log in with one click to many websites. As anything, this convenience doesn’t come without a cost. The cost here is the risk of an account takeover bug. And that’s not only changing the redirect_uri to an attacker-controlled host which, for many hackers, is the only attack they know. That attack won't work too well in 2024. This talk will be about exploiting smaller misconfigurations. For example, what do to if you only control the path of the redirect_uri or how to exfiltrate the code when your open doesn't preserve parameters. It will also focus on particular auth providers and how they don't make it hard for us by being way more relaxed than the standard defines.\n2. After the break, we will be hosting a **discussion about bug boutnty**. We want to discuss both sides - bug bounters and companies which have bug bounty programs.\nHow to report vulnerabilities? Where to seek? What should be your goal - easy bugs occuring en masse or sophisticated kill-chains? What to expect? Bug bounty myths and reality.\nHow bug bounty might help your organisation? What are the real costs of having bb program? What can go wrong? How to manage good bb program? Bug bounty or penetration testing?\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this invitation** with friends and in your social media."
    },
    {
        "group": "Rewa",
        "repo": "www-chapter-rewa",
        "name": "Introduction to Cyber and Web Security",
        "date": "2024-09-08",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-rewa-chapter/events/303020985",
        "timezone": "Asia/Kolkata",
        "description": "In today's digital age, where our lives are increasingly online, understanding the basics of cyber and web security is more important than ever. This session will provide you with an essential overview of the core principles and practices that safeguard our digital world. From common vulnerabilities to best practices in protecting web applications, we will explore the fundamental concepts that every developer, security enthusiast, and tech professional should know.\n\nJoin us as we delve into the world of cyber and web security, equipping you with the knowledge to navigate and protect the digital landscape confidently."
    },
    {
        "group": "Sastra University",
        "repo": "www-chapter-sastra-university",
        "name": "Docker Security 101: Anchoring Security with a Deep Dive into Containers",
        "date": "2024-09-11",
        "time": "19:00+05:30",
        "link": "https://www.meetup.com/owasp-sastra-university-meetup-group/events/303169491",
        "timezone": "Asia/Kolkata",
        "description": "Curious about Docker? Join our webinar to learn the basics of **Docker security** and how containers are changing the way we build and deploy applications. Perfect for beginners looking to get started with container security. Don't miss out!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-09-11",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539098",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "OWASP AppSec Days Singapore (paid event)",
        "date": "2024-10-01",
        "time": "09:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/302520187",
        "timezone": "Asia/Singapore",
        "description": "Join us for the 2024 OWASP AppSec Days Singapore at Marina Bay Sands hotel. Designed for private and public sector infosec professionals, OWASP conference equips developers, defenders, and advocates to build a more secure web. We are offering three educational \\*\\*1-day training courses on 01-October that requires a separate ticket purchase followed by the conference and exhibition on 02-October. Join us for leading application security technologies, speakers, prospects, and community, in a unique event that will build on everything you already know to expect from an OWASP Conference. With amazing speakers and networking opportunities, this is an event you will not want to miss.\n\nREGISTER AND LEARN MORE [HERE](https://singapore.appsecdays.org/?utm_source=owasp-web&utm_medium=event-page&utm_campaign=none)"
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "September 2024 SFOWASP Monthly Meeting - Joint Meeting with SFISSA",
        "date": "2024-09-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/302943630",
        "timezone": "America/New_York",
        "description": "Each September, the OWASP South Florida Chapter (SFOWASP) and South Florida ISSA (SFISSA) come together for a joint meeting. This year, please join us on **September 19, 2024**, at **Palm Beach State College**, **4200 S Congress Ave, Lake Worth, FL**. The meeting will take place in **Room CE119** in the CE building.\n\n**Location: Palm Beach State College - CE building, room 119**\n\n**Agenda**:\n\n* Chapter updates/announcements, upcoming events - SFISSA\n* Chapter updates/announcement, upcoming events - SFOWASP\n* Talk1 - TBA\n* Talk2 - TBA\n* Networking\n\nWe will update this notice for speaker(s) and topic(s)."
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "2nd OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-09-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/301313714",
        "timezone": "Europe/Berlin",
        "description": "**An Introduction to OWASP SAMM (Software Assurance Maturity Model)**\n\nSAMM is an open framework that helps organizations assess, build, and improve their software security practices. It provides a structured model to guide organizations in integrating security into their SDLC, addressing Vulnerabilities, and promoting a culture of software assurance. SAMM offers a maturity model that enables organizations to measure their software security maturity and identify areas for improvement.\n\n**Speaker**:\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Container and Kubernetes Security (Free Half-Day Training)",
        "date": "2024-09-25",
        "time": "13:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/302684671",
        "timezone": "Europe/Zurich",
        "description": "In this **free, half-day training session**, we will provide you with a condensed overview of essential container and Kubernetes security concepts. You will learn the basics on how to harden your Kubernetes cluster and secure your containerized applications.\n\n* **Cloud-native security fundamentals:** Understanding the layered approach to securing cloud, cluster, container, and code.\n* **Hardening containers:** Best practices for reducing the attack surface.\n* **Kubernetes security architecture:** Grasp the key components and potential attack vectors within a Kubernetes cluster.\n* **Segregation in Kubernetes:** Strategies for isolating resources and maintaining security boundaries.\n* **Kubernetes security features:** Learn about RBAC, Network Policies and Admission Controllers (e.g. PSA/PSS) to enforce security requirements.\n\nThis training is designed to provide a solid foundation on the best practices and tips for securing your Kubernetes cluster and containerized applications. Unfortunately, due to time constraints, we won’t be able to have hands-on labs, but you can expect live demos of the concepts covered.\n\nWhether you’re a DevOps engineer, security professional, or just starting out with containers and Kubernetes, this half-day session will give you the knowledge and skills to harden your cloud-native environment.\n\n**Event Timeline:**\n\n* 13:00: Door opening\n* 13:15: Start of training\n* 17:30 (approximately): End of training\n* 17:30-19:00: Possibility to network with some snacks and drinks"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2024Q3 Lunch and Learn",
        "date": "2024-09-11",
        "time": "11:00-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/303088588",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2024Q3 Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\\- 11:00am \\- Registration and Lunch\n\\- 12:00pm \\- Speaker \\- Nate Michalov \\- SCA in the world of AI\n\\- 1:00pm \\- Depart\n\n**Speaker**:\nNate Michalov is a seasoned application security professional with over 12 years of diverse experience. Throughout his career, Nate has contributed to organizations such as Endor Labs, Apiiro, Snyk, Veracode, and Annkissam, where he has focused on securing digital ecosystems while aligning technological strategies with business objectives. In various roles including customer success architect, senior sales engineer, and senior SAST specialist, Nate has consistently tackled complex challenges at the intersection of business and technology. Known for his collaborative approach and dedication to staying informed about emerging trends, Nate is recognized as a trusted advisor in promoting innovation and resilience in application security.\n\n**Abstract**:\n{coming soon}\n\n**Location**:\nThe Neon Temple\n5406 Hoover Blvd,\nTampa, FL\n33634\n\n**Sponsors**:\n[Endor Labs | Software Supply Chain Security Solutions](https://www.endorlabs.com/)"
    },
    {
        "group": "Tunisia",
        "repo": "www-chapter-tunisia",
        "name": "GraphQL Vulnerabilities in the Wild: A Hands-On Workshop with OWASP TOP 10 Insig",
        "date": "2024-09-05",
        "time": "15:00+01:00",
        "link": "https://www.meetup.com/owasp-tunis-meetup-group/events/303124793",
        "timezone": "Africa/Tunis",
        "description": "Welcome to OWASP Tunisia Chapter !\n\nA new Youtube live ! We invite you to subscribe to our YouTube channel and follow us https://www.youtube.com/@owasptunisiachapter4108/streams\n\nOur dear guest speaker: Antoine Carossio\n\nAbout our speaker\nAntoine is the co-founder of Escape, backed by Y Combinator, the prestigious startup accelerator, and celebrated on the Forbes 30 Under 30 list for revolutionizing Application Security. From hacking computers for fun in his early days to co-founding Escape as CTO, Antoine graduated from top-notch schools: Ecole Polytechnique (Paris) and UC Berkeley (California), before working at Apple as a Machine Learning Engineer. Antoine is also a recognized figure in the tech industry, sharing his knowledge by speaking at major international conferences such as the InCyber Forum, bSides, APIdays, and the GraphQL Conference.\n\nTopic: “GraphQL Vulnerabilities in the Wild: A Hands-On Workshop with OWASP TOP 10 Insights”\n\nABSTRACT:\n\nJoin Antoine Carossio, Co-founder & CTO of Escape, the leading Application Security Testing startup, for an immersive, hands-on workshop focused on the OWASP TOP 10 and GraphQL vulnerabilities. This session provides a rare opportunity to engage directly with the cutting-edge challenges and solutions in the ever-evolving world of GraphQL security.\n\nDrawing on extensive research into real-world production GraphQL endpoints, Antoine will guide you through the complex security landscape of GraphQL. With his deep expertise in offensive security, Antoine will share valuable insights and proactive strategies to tackle today’s most critical vulnerabilities.\n\nAntoine and his team have invested over 500 hours in chaos engineering across more than 1500 GraphQL endpoints, uncovering over 46,000 security flaws, including critical vulnerabilities that expose sensitive data without authentication. In this hands-on workshop, you’ll dive deep into these findings and learn the tools and methodologies needed to secure your own GraphQL implementations.\n\nThe session will explore the OWASP TOP 10 vulnerabilities and how they intersect with GraphQL’s unique security challenges. From complexity issues and schema leaks to traditional API security flaws like injections and internal server errors, you’ll gain a comprehensive understanding of potential threats. Real-world case studies will illustrate the severe impact of data leaks, including personal information, secrets, and tokens.\n\nYou’ll leave the workshop equipped with practical skills and tools, including GraphQL Armor and a detailed security checklist, to help you proactively safeguard your GraphQL applications. This session is crucial for developers, security professionals, and SREs who want to confidently navigate the intricate waters of GraphQL security."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup - Septiembre",
        "date": "2024-09-10",
        "time": "18:30-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/303204126",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY te invita a su próximo Meetup!**\n\n**Pablo Alzuri**: *Modelado de Amenazas: Aplicando STRIDE con Threat Dragon de OWASP*\nExploraremos cómo aplicar el modelo STRIDE en el desarrollo de software usando Threat Dragon de OWASP. A través de un juego práctico, los participantes aprenderán a modelar amenazas y un enfoque práctico para llevarlo a sus proyectos.\n\n**Sebastián Passaro:** *Historias de malware: Lo que le pasó a una amiga y a mi hermano*\nEl malware es eso que te cuentan y ves por la tele hasta que le pasa a uno de los tuyos, a vos. Te cuento cómo tuve un encuentro cercano con malware de muchas piezas y qué cosas pasaron cuando lo miré con lupa y lo toqué con un palo.\n\n**¿Cuándo?** Martes 10/9, 18:30.\n**¿Dónde?** ISACA, Cerrito 420 oficina 505.\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver Monthly Meetup",
        "date": "2024-09-19",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516377",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "September community call - OWASP SAMM",
        "date": "2024-09-11",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/302806897",
        "timezone": "America/New_York",
        "description": "During our next community call we will cover:\n\n1. Welcome new community members\n2. SAMM project updates\n3. Q&A"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #67 - CISO Roundtable ",
        "date": "2024-09-26",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/302364452",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #67!\nOur Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\nFor this meetup, we’re introducing a new format: a **CISO roundtable**. We are excited to welcome panelists from diverse industries to discuss software and cloud security.\n\n* **Sheetal Joseph** \\- Director\\, Cybersecurity at Isar Aerospace\n* **Dr. Tim Sattler** \\- CISO at Jungheinrich AG\n* **Prof. Dr. Igor Podebrad** \\- Director\\, Office of the CISO\\, Google Cloud\n* **Scott T. Nichols** \\- Global Product Security Leader Danaher Corporation\n* TBC\n\nWe aim to provide fresh perspectives and gain CISO-level insights, starting with a set of questions and then opening the floor for a lively audience discussion. Participants can submit questions in advance or ask them during the event.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 26.09.2024 from 18.00 to 22.00 o'clock CEST.\n\n_Where?\nIBM Tower One is located at Brüsseler Straße 1-3 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on [LinkedIn](https://www.linkedin.com/company/owasp-frankfurt/) and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\nWe're looking forward to seeing you at our event!"
    }
]