[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - May/June",
        "date": "2023-06-01",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/293431733",
        "timezone": "Europe/Copenhagen",
        "description": "Hi All,\n\nPlease note, that this is a physical event hosted by Beumer Group A/S and OWASP Aarhus may share a list of participants with Beumer Group A/S for the sole purpose of hosting the event.\n\nNote that the doors open at 18:30 for snacks and network.\n\nOWASP Aarhus would like to invite you to an OWASP Aarhus meetup on June 1st in collaboration with ICS Range and BEUMER Group A/S, and this time, it will be a bit different as we will have OT security as a theme.\n\nMikael Vingaard from ICS Range will present “IT/OT, more than a letter of differences! – Only a foul does not fear it-security people in their OT network”, and Jens Nielsen (Senior Security Researcher) also from ICS Range will present “In my defence, I was left unsupervised\".\n\nThe event will occur at BEUMER Group A/S, P.O. Pedersens Vej 10, 8200 Aarhus N (Thanks to BeumerGroup and Claus Riber for hosting us).\n\nWe will start at 19:00 but the doors open for network, snacks at 18:30 and we plan to end at 21:00.\n\nPlease remember to sign up!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2023 (Online)",
        "date": "2023-05-30",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705737",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- https://owasp\\-austin\\-2023\\-may\\.eventbrite\\.com\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nPresentation:\nHow Zero Trust can improve your web application security\nIn this presentation, we will review some of the Zero Trust concepts and roadmapping some adoption schemes. We will dive into some examples of using these concepts to improve and provide better controls around:\n\\* Setup and configuration of Zero Trust Services\n\\* Developer access and code security gains\n\\* Exposing internal web sites securely with MFA (even if not designed with MFA) with user and group driven policies without a VPN\n\\* Gain a WAF with exposing internal web sites through browser-based Zero Trust Network Access.\n\\* Dealing with 3rd party access to internal web sites"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Browser Extension Security, and Scripting for Web Application Testers",
        "date": "2023-06-15",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/290892060",
        "timezone": "Europe/London",
        "description": "In-person event, kindly **hosted by Immersive Labs**, 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ.\n\n**Agenda:**\n\n* OWASP Updates\n* Talk 1: Browser extension security, with Billy Sheppard from Immersive Labs\n* Break\n* Talk 2: Intro to Scripting for Web Application Testers with Alex Archondakis\n* Networking\n\n**Venue:**\nPhoto shows the main entrance, which is visible when walking down the right hand side of the Tesco Express on Wine Street (Google Street View sometimes shows the back entrance, which is only accessible via keycard).\n\nAddress: 6th Floor, The Programme, All Saints' St, Bristol BS1 2LZ\n\n\\-\\-\\-\n\nTalk 1: **A look into browser extension security**, the risks involved with allowing users to install browser extensions and browser security/attack vectors, presented by **Billy Sheppard**.\n\n**Abstract**: As web technologies are becoming more and more popular, you need to be more careful about what you put in your browsers. While extensions can be very useful, they come with hidden dangers – users often prioritise functionality over safety. In this talk, you'll uncover the real risks of using extensions, explore common attacks, and learn about pitfalls. You'll also take a look at some real-life security incidents and what went wrong. You'll leave with a deeper understanding of the need for browser extension security and how to safeguard your browser.\n\n**Bio:** Billy Sheppard is a Bristol-based Senior Application Security Engineer working at Immersive Labs where he creates Secure Code content and challenges for their product.\n\nIn his career thus far, he has earned several achievements including VDP submissions for Fortune 500 companies, Bug bounties, and created and released his own niche CTF/Hacking challenge specifically aimed at increasing security awareness for ServiceNow developers. He has also created a Web Security YouTube Channel to demonstrate security concepts and educate developers and reported multiple real security issues to VDPs/Bug Bounty Programs for large companies such as BBC, RedHat and Accenture. He is a keen learner and spends a lot of his personal time continuously learning and is passionate about education around secure code.\n\n\\-\\-\\-\n\nTalk 2: **An Introduction to scripting for Application Testers,** presented by **Alex Archondakis**.\n\n**Abstract**: Scripting, or the ability to write code that allows you to perform actions or automate repetitive tasks is a crucial tool in any application security testers belt, however, it doesn’t seem to be a common one.\n\nThe purpose of this talk is to introduce scripting to application security testers, this will be achieved by looking at case studies to determine where scripting may be appropriate and how to solve the problem. We will discuss multiple languages and their advantages whilst focussing on interacting with the HTTP protocol.\n\nThe key learning points from this talk are as follows:\n\n* To gain an understanding of the importance of scripting for application security testers\n* What programming languages are used, and their advantages/disadvantages.\n* Typical scenarios where scripting is required because tooling is not comprehensive enough\n\n**Bio**: Alex is head of professional services & a senior consultant at Pentest People. He has a wealth of experience in penetration testing, people management and training hackers. He believes that all application security professionals should be able to write basic scripts to solve common problems."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP June Meet ",
        "date": "2023-06-20",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/293404993",
        "timezone": "America/Chicago",
        "description": "\"Common Security Considerations for Web 3.0”\n\nJoin this virtual event to discuss:\n\n* an overview of decentralization\n* digital identities in 3.0 and typical threats\n* examples of Web 3.0 attacks and mitigations\n* security concerns and some actions to consider to protect organizations."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Join us LIVE and IN-PERSON for Denver OWASP's June Meetup",
        "date": "2023-06-21",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/293553304",
        "timezone": "America/Denver",
        "description": "**As always, everyone is welcome! You do NOT have to be an OWASP member to attend.**\n\nJoin us June 21st for food, drinks, networking and a super informative presentation on \"The Joys of Mobile Application Testing\" from one of the best and brightest in the industry: Greg Leonard. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to our Denver OWASP sponsor [SpyderSec](https://spydersec.com)**\n\n**Presentation Title:** The Joys of Mobile Application Testing\n\n**Presentation Details:** In this talk, I will walk through the major challenges of testing mobile applications. This will include reliably capturing HTTPS traffic between the app and it's backend APIs, reviewing data stored by the app on the mobile device, working around defenses built into many apps, and discussing some obstacles that need to be worked around with modern mobile operating systems."
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "Introduction to OWASP ModSecurity CRS",
        "date": "2023-06-01",
        "time": "8:30+01:00",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/293556100",
        "timezone": "Europe/London",
        "description": "OWASP Dorset are proud to bring out latest in-person event, hosted with Hays Recruitment Bournemouth.\n\n**Talks**\nAndrew Howe is a locally based technical author, architect and Linux load balancer engineer. He is an advocate of open source software and a fellow member of OWASP. Andrew is a developer for the OWASP ModSecurity Core Rule Set (CRS) project.\n\nThe OWASP ModSecurity Core Rule Set (CRS) is a set of generic attack detection rules for use with ModSecurity or compatible web application firewalls. The CRS aims to protect web applications from a wide range of attacks, including the OWASP Top Ten, with a minimum of false alerts. The CRS provides protection against many common attack categories, including SQL Injection, Cross Site Scripting, Local File Inclusion, etc.\n\nWe will also have a talk from James Walsh of Hays Recruitment. James will present the findings from the recent Hays Global Cyber Survey, where over 1000 Senior Leaders from 29 countries have given their insight.\n\n**Event and Venue**\nWe will be joining Hays Recruitment in Bournemouth for this event, there is a limit on numbers, so signup is essential. Names will be required upon arrival to enter the building.\n\nThere will be food and drink provided for this event, so please let us know of any dietary requirements or allergies."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "Adopting DevSecOps for faster and more secure SDLC",
        "date": "2023-06-15",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/293758240",
        "timezone": "Asia/Dubai",
        "description": "Accelerate your software delivery with DevSecOps culture!\n\nJoin our free webinar led by Ahmed Abdallah, a Senior Solutions Architect and Cyber Security Consultant, and learn about all things DevSecOps.\n\nIn this session, participants will gain further knowledge on the importance of the concept and discover how integrating security throughout the software development process can enhance speed, quality, and overall success."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Securing Docker to Protect the Host",
        "date": "2023-05-31",
        "time": "7:00-06:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/293321647",
        "timezone": "America/Edmonton",
        "description": "## About The Event\n\n \n**RSVP For Pizza + DOOR PRIZES**\n\nhttps://www.meetup.com/meetup-group-opbybwve/\n\n**Location:**\n10215 108 St NW, Edmonton, AB T5J 1L6\nSCFL 3-110 (Singmar Center For Learning, 3rd floor, Room 110)\n\nJoin us for our monthly OWASP event where we will dive deep into **Docker Security** and the **OWASP Top Ten for Docker**. This month's event will focus on privilege escalation attacks from the HOST, a critical issue that every Docker user must be aware of.\n\nOur event sponsor is **iON United,** a trusted cybersecurity solution provider for IT, OT, and cloud environments within Canada.\nThey be providing **delicious pizza** for all attendees, so come hungry and ready to learn!\n\nOur guest speaker for this event is John, an experienced security professional who has worked for Fortune 500 companies. With his extensive knowledge and expertise in Docker security, John will provide valuable insights and practical tips to help you secure your Docker environment.\n\n**As Socrates once said**, \"The only true wisdom is in knowing you know nothing.\" Don't miss this opportunity to expand your knowledge and learn how to protect your Docker environment from privilege escalation attacks.\n\nWe look forward to seeing you there!"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "German OWASP Day 2023 in Frankfurt: Ebbelwoi meets AppSec!",
        "date": "2023-05-30",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/293534722",
        "timezone": "Europe/Berlin",
        "description": "Hi all,\nWe're thrilled to announce the return of the German OWASP Day 2023! This leading independent and non-commercial conference on application security in Germany will take place on the 30th and 31st of May, 2023 at the Frankfurt School of Finance and Management.\n\n_What's happening? We look forward to welcoming you to our German OWASP Day 2023, offering a plethora of exciting technical and non-technical talks, various seminars, and an evening event for networking.\n\n_What's on the agenda? Our main program has been released, featuring a range of talks from esteemed experts like Björn Kimminich, Claudia Ully, Clemens Hübner, Diana Waithanji, and many more.\n\n_When? Our event takes place on the 30th and 31st of May, 2023.\n\n_Where? Frankfurt School of Finance and Management, Adickesallee 32-34, 60322 Frankfurt am Main\n\n_Tickets? Limited tickets are available at [https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477](https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477)\n\n_Additional Information? More information about the German OWASP Day, training sessions, and the conference program can be found at god.owasp.de/2023/\n\n_And now? Save the date, spread the word, and bring your friends and colleagues to our event.\n\n_Follow Us! Also, follow us on Twitter #owasp_de and #owasp_frankfurt and refer to our German OWASP Day site for information including slides and recordings of previous presentations.\n\nWe're looking forward to seeing you at this exciting event of the year!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-06-12",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/293371130",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#03 is a charm",
        "date": "2023-05-30",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/292893619",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on May 30th, 2023, at 18:00, **supported by [Snyk](https://snyk.io/) and [AP2SI](https://ap2si.org/)**.\n\nThe schedule is the following:\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n**18:15** \\- Open projects you can use today to improve your AppSec posture\n**19:00** \\- One\\-Time Quantum\\-Resistant Fully\\-Homomorphic Padding Oracle cryptography trends\\, buzzwords\\, and snake oil for 2023\n**20:00** \\- Snacks & Drinks sponsored by Snyk\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Open projects you can use today to improve your AppSec posture**\n\nSpeaker:\nLucas Ferreira\n\nAbstract:\nIn this talk, we go through the most important OWASP projects (both documentation/standards and tools) to show how companies can improve their security posture and mature their AppSec program. It is meant as an overview of the main OWASP projects.\n\nBio:\nLucas is a long-time OWASP member, having worked in OWASP as a project leader and chapter leader on two continents. He was a member of the OWASP Global Conferences committee and lead the organization of 3 OWASP AppSec conferences in Brazil.\n\nLinkedIn: [https://www.linkedin.com/in/ferreira/](https://www.linkedin.com/in/ferreira/)\nTwitter: @lucassapao\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **One-Time Quantum-Resistant Fully-Homomorphic Padding Oracle cryptography trends, buzzwords, and snake oil for 2023**\n\nSpeaker:\nDiogo Sousa\n\nAbstract:\nIn our modern times, cryptography is all around us, even if we don't notice it. We use it when checking our bank statements, buying pig plushies online, or sending stickers to each other on instant messengers. Given its ubiquity, it is, for the most part, taken for granted by developers: import HTTP/crypto/TLS, throw in a certificate from Let's Encrypt, and don't think much about it while relying on (hopefully) safe defaults.\nWhile sticking with well-vetted libraries should work out of the box for most cases, in certain areas, you need to be a bit more knowledgeable, if only to make good decisions about what libraries to use and how to wrangle all the moving parts into a cohesive and secure system.\nCryptography tends to be full of obscure notation that isn't that dissimilar to magic spells, and \"Don't Roll Your Own Crypto\" is an often repeated mantra (many times because of the previous statement). Search results for \"crypto\" have been getting progressively more complicated to navigate, with BTC, XRP, and others taking up all the prime SEO result space.\nThis talk targets a beginner to an intermediate audience and, starting from a brief overview of core tenets (Kerckhoffs's principle, Schneier's Law, the economy of mechanism, theoretical vs. practical security), will expand upon the current challenges and trends in modern cryptography, from FHE to PQC (including explaining what those are), and also highlight common design pitfalls (and their consequences) and how to reduce your snake oil intake.\n\nBio:\nAn opinionated individual with interest in cryptography and its intersection with secure software development.\n\nLinkedIn: [https://www.linkedin.com/in/0xdsousa/](https://www.linkedin.com/in/0xdsousa/)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2023-05-30",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/293486002",
        "timezone": "Europe/London",
        "description": "**DO NOT RSVP on Meetup: PLEASE REGISTER FOR THIS EVENT USING EventBrite here: [https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-634995969037?aff=mu](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-634995969037?aff=mu)**\n\nThis meetup will take place at Amazon London offices (in-person) and will also be live-streamed on OWASP London YouTube Channel.\n\\-\\-\\-\\-\n**TALKS:**\n\n**OWASP Introduction, Welcome and News - Sam Stepanyan**\nWelcome and a brief update on OWASP Projects & Conferences\n\n**Talk 1: \"Security Chaos Engineering: When and How You Should Break Your System\"** - **Anais Urlichs**\n\nThe real cost of misconfiguration for businesses has been set to several trillion over the past years. These costs are the result of misconfiguration in infrastructure and workloads. One way to proactively identify misconfiguration is through security scanning. The scan results provide us with insights into the security posture of our services over time. However, these scanners treat our resources as static and evaluate misconfiguration only in single instances. To assess the potential impact of misconfiguration in our production environment, we need additional tools. In this talk, we will look at ways Chaos Engineering and Security Experimentation can help us minimise the potential damage of misconfiguration. Chaos Engineering is the process of intentionally introducing fault into a system to test its resilience to failure. Anais will walk you through the principles of Security Chaos Engineering and how it can be used to proactively identify misconfiguration and make our deployment pipeline and services more robust.\n\n**Talk 2: \"It’s Not a Bug It’s Emergent Behaviour - Generative AI, Its Cybersecurity Risks and Benefits\" - Sherif Mansour**\n\nA curated talk on generative AI, where Sherif will present his research findings beginning with an overview of the technology, then discuss its current technical risks, and explore its promising security use cases without making grand claims. Additionally, this talk dive into design considerations when developing web applications utilising generative AI. To conclude, Sherif will introduce open-source software announced during the talk, encouraging attendees to use and investigate them at their own discretion.\n\n**SPEAKERS:**\n\n**Anaïs Urlichs (@urlichsanais)**\n\nAnaïs Urlichs is a Developer Advocate at Aqua Security, where she contributes to Aqua’s cloud native open source projects. When she is not advocating DevOps best practices, she runs her own YouTube Channel centered around cloud native technologies. Before joining Aqua, Anais worked as SRE at Civo, a cloud native service provider, where she worked on infrastructure for hundreds of tenant clusters. As OpenUK ambassador, her passion lies in making tools and platforms more accessible to developers and community members.\n\n**Sherif Mansour (@kerberosmansour)**\n\nSherif Mansour is the global director of information security at JustEat Takeaway.com and has been working in the field of information security for 19 years. He was the OWASP chairman and sat on of the OWASP foundations' board for four years. He was also one of the founding governing board members for the OpenSSF Foundation which he represented the OWASP Foundation. Sherif contributed to several OWASP projects and was one the main authors of the CIS Benchmark for Tomcat 7/8. As a security researcher he has disclosed vulnerabilities in Microsoft, Oracle, SAP and SiteSpect products.\n\n**TICKETS:**\n\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you **[MUST book your place on EventBrite](https://www.eventbrite.co.uk/e/owasp-london-chapter-meetup-in-person-tickets-634995969037?aff=mu)** to be admitted to the event by the building security - your name will be checked against the guest list. Please have bring some form of ID to help the building security to check you in quicker.\n\n**CODE OF CONDUCT**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\n\nOWASP aims to provide a harassment-free experience for everyone, regardless of gender, sexual orientation, disability, physical appearance, body size, race, age, or religion. We do not tolerate harassment of event participants in any form.\n\nAdditionally, participating in OWASP events means you shall also adhere to the OWASP Code of Conduct which you can find here: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Madison",
        "repo": "www-chapter-madison",
        "name": "June Meeting",
        "date": "2023-06-13",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-madison/events/293553420",
        "timezone": "America/Chicago",
        "description": "Requested Topics:\n\n* Discuss the Open Letter to OWASP and the Response/Updates\n\nhttps://owasp.org/blog/2023/03/10/strategic-plan-open-letter-update.html\nhttps://owasp.org/blog/2023/03/31/owasp-strategy-2023-1.html\n\n* Industry Roundtable: initiatives, struggles, successes from the Madison Metro AppSec Space\n* Jazzer Demo https://github.com/CodeIntelligenceTesting/jazzer"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/293695815",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS), the OWASP Mobile Application Security Verification Standard (MASVS), and OWASP Mobile Application Security Testing Guide (MASTG) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. Come join us!\n\n\\*Food and drinks will be provided by NowSecure\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Security Tools - Proving your applications are as secure as possible",
        "date": "2023-06-07",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/293760210",
        "timezone": "Europe/London",
        "description": "Hello & Welcome\n\nIn this session we'll be discussing various Tools used within Security.\nBy using these tools, your teams will be able to truly show that your products are as secure as they can be.\n\nPlease note this event will be recorded so we can put these talks on our YouTube channel afterwards. We will also be trying out our live streaming capabilities.\n\n**6:00 - Open doors**\n**6:30 - Simon Bennetts: An Introduction to OWASP ZAP**\nIn this talk Simon (the ZAP founder and project lead) will give you an overview of the worlds most popular web security scanner. He will also talk about the most recent changes and whats coming next\n**7:15 - Refreshments**\n**8:00 - Anthony Harrison - SBOMs and why they can help make your software more secure**\nThis talk will explain what a SBOM (Software Bill of Material) is, how and when they should be produced / some of the challenges that need to be overcome, and demonstrate how they should form part of a DevSecOPs lifecycle. I will try and supplement the talk with some demonstrations using a number of open source applications.\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Simon Bennetts**\nThe OWASP Zed Attack Proxy (ZAP) Founder and Project Leader, and a Distinguished Engineer at Jit.\nHe has talked about and demonstrated ZAP at conferences all over the world, including Blackhat, JavaOne, FOSDEM and OWASP AppSec EU, USA & AsiaPac.\nPrior to making the move into security he was a developer for 25 years and strongly believes that you cannot build secure web applications without knowing how to attack them.\n\n**Anthony Harrison**\nAn independent systems/software/cyber consultant. I am part of the SPDX community developing the forthcoming security profile, and a member of the OpenSSF SBOM Everywhere working group and SBOM Forum. I have presented on SBOMs at FOSDEM (2002 and 2023), EuroPython 2022 and will be presenting at PyCascades (Vancouver) in March.\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBruntwood - Venue Sponsor\nCytix - Food & Drink Sponsor\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "OWASP, ISACA, and ISC2: Web Application Firewalls webinar",
        "date": "2023-06-07",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/293379819",
        "timezone": "Europe/Amsterdam",
        "description": "**Want to learn more about Web Application Firewalls?**\n\n**Join the Dutch Chapters of OWASP, ISACA, and ISC2 for their first-ever combined online webinar on Wednesday, June 7th, from 19:00 to 21:00 CET.**\n\nProgram:\n19:00 - 19:10 - **Welcome**\n19:10 - 19:30 - **Web Application Firewalls** by **Aatif Khan**\n19:30 - 20:55 – **Panel Discussion on Web Application Firewalls** by **Aatif Khan**, **Menno Swam** and **Nico van Rooyen** moderated by **Ramzy Elmasry**\n20:55 - 21:00 – **Closing** and **Next Steps**\n\n*To receive the LIVE stream details, register via:*\n\n[https://isaca.nl/events/isaca-owasp-and-isc2-web-application-firewalls-webinar/](https://isaca.nl/events/isaca-owasp-and-isc2-web-application-firewalls-webinar/)\n\n***Here is a summary of the event:***\n\nWith an expert presentation and a panel discussion, you will have the opportunity to learn about best practices and get your questions answered by professionals in the field.\n\nBy combining the focus areas and driving forces of each Chapter, this event ensures that this topic will be addressed from different perspectives, such as risk, compliance, audit, cybersecurity, and technical.\n\nAatif Khan, a data-driven AI and cybersecurity expert, will kick off the webinar with a compact presentation on Web Application Firewalls (WAFs). After which, we will open the panel discussion and answer questions from the audience. Our panel members are Aatif Khan, Menno Swam and Nico van Rooyen.\n\nSee below for more information on our panel members and the topic.\n\nRegister today for this unique opportunity!\n\n**BIO Aatif Khan**\nAatif Khan is a data-driven, seasoned AI & cyber security expert who is passionate about creating Aatif Khan is a data-driven, seasoned AI & cyber security expert who is passionate about creating customer-focused products. His focus centers around developing cyber defense strategies, establishing security operations centers for large enterprises, developing data protection strategies, implementing data privacy in day-to-day operations, and developing AI strategy, governance, and risk management programs for enterprises. He specializes in building and scaling security programmes from startups to Fortune 500 organizations.\n\nWith 15+ years of experience in information security, Aatif has spoken at numerous conferences such as BlackHat, SANS & UK NCSC CyberThreat London, Security BSides London, Cyber Security Asia Malaysia, @Hack, etc., amongst other conferences across the EMEA region. He has been interviewed by the Associated Press, Voice of America, Hakin9, and numerous other media channels for his expertise on emerging cybersecurity threats. Aatif holds a Master of Science in Artificial Intelligence from LJMU, UK, and is currently working on AI-driven advanced threat detection and response with modern security analytics.\n\n**BIO Menno Swam**\nMenno is a Senior Specialist at KPMG IT Advisory The Netherlands, and part of the Cyber Assessment (CA) team. The CA team consists of cyber security specialists executing technical IT Advisory engagements, IT Auditing and management of IT infrastructure, IT processes and IT organizations.\n\nMenno has experience in the field of Information Security and Risk Management for companies in the Financial services sector, due to his experience as an Information Security Officer and Internal Auditor. Moreover, he has specific knowledge of security frameworks (such as PCI-DSS and ISO27001) as well as the technical execution of financial law (such as WWFT and PSD2). While working in complex IT environments, Menno has been able to get accustomed with all facets of information security, both technical and non-technical. As such, he is able to translate technical findings and risks to business impact and opportunities.\n\n**BIO Nico van Rooyen**\nNico is currently the CISO at CPro, a cyber security consulting firm and the one-stop shop for specialized cyber security services. They offer complete solutions that enable organizations of all sizes to protect their systems, networks, and data from digital threats. He is also a proud Executive Board Member of the ISACA NL chapter and has been an active member for many years.\n\nHe started his career as an IT auditor specializing in information security, at KPMG in South Africa and for the past decade, he has deepened his experience in information security while obtaining various certifications such as CISA, CISM, CEH, and COBIT.\nDuring this time, Nico worked across various countries including Australia, Denmark, Israel, Sweden, Europe, the UK, and the USA.\n\nIn 2017, he moved to the Netherlands with his wife, who is expecting their second baby boy in September of this year."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Chapter Meeting",
        "date": "2023-05-31",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/292726402",
        "timezone": "America/New_York",
        "description": "This is an In-Person Event\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nSpeaker 1: **Kevin Johnson**\n\nKevin Johnson is the Chief Executive Officer of Secure Ideas. Kevin has a long history in the IT field including system administration, network architecture and application development. He has been involved in building incident response and forensic teams, architecting security solutions for large enterprises and penetration testing everything from government agencies to Fortune 100 companies. In addition, Kevin is a faculty member at IANS and was an instructor and author for the SANS Institute.\n\nTopic: **Replacements: What Malcolm Gladwell and Keanu Reeves can teach AppSec**. A reflection of how appsec is focused in the wrong place and how we can improve it. The talk includes stories and tangents based on Kevin's work and consulting.\n\nSpeaker 2: **Jennifer Shannon**\n\nJennifer Shannon is a Senior Security Consultant with Secure Ideas with a background in malware analysis, penetration testing, and teaching. She graduated with honors from Florida State College at Jacksonville’s networking program. An avid computer geek for most of her life, she began her journey in cybersecurity as a SOC Analyst where she showed an aptitude for both penetration testing and malware analysis. She was quickly promoted into a role that capitalized on her abilities. She has experience performing penetration tests against web applications, mobile software and platforms, and social engineering. She is the co-leader for the TOOOL chapter in Jacksonville, FL, and continues to be passionate about teaching and is eager to share her knowledge with anyone who will listen.\n\nTopic 2: **Real-world API Pentesting Case Studies**\nAPIs (Application Programming Interfaces) have become the backbone of modern software systems, enabling seamless communication and integration between various applications and services. However, they also present a significant security challenge, with potential vulnerabilities that can lead to data breaches, unauthorized access, and other security incidents. In this talk, we delve into the world of API pentesting through a collection of real-world case studies, providing valuable insights and lessons learned from our experiences."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "AppSecDays PNW ",
        "date": "2023-06-10",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/292707041",
        "timezone": "America/Los_Angeles",
        "description": "Joins us for a conference in person in Portland Oregon June 10th (tickets required)\n\n[https://www.appsecpnw.org/](https://www.appsecpnw.org/)\n\nTickets [https://www.eventbrite.com/e/3rd-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-558186820807](https://www.eventbrite.com/e/3rd-annual-owasp-appsec-days-pacific-northwest-conference-in-person-tickets-558186820807)"
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-06-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/293695815",
        "timezone": "America/New_York",
        "description": "Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS), the OWASP Mobile Application Security Verification Standard (MASVS), and OWASP Mobile Application Security Testing Guide (MASTG) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. Come join us!\n\n\\*Food and drinks will be provided by NowSecure\n\\*This will be an in person meet up event but we will be offering a remote attendee option for folks who are not local to Maine or Northern New England but still want to attend. A zoom link will be posted/provided as the event nears."
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "June Meetup",
        "date": "2023-06-21",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/293615825",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of each month. We will announce topics 2-3 weeks in advanced of our meetups.\n\n7PM-9PM\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Community Topics\n* Presentation TBD"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838145",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-06-14",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292838144",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "OWASP AppSec Days PNW 2023",
        "date": "2023-06-10",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292199099",
        "timezone": "America/Los_Angeles",
        "description": "A collaboration between the **Vancouver, Portland, Victoria, and Seattle** chapters taking place **June 10, 2023** at **Portland Center Stage.**\n\nThe CFP for AppSec PNW is OPEN and you have until April 3rd to submit a presentation. You don't want to miss on this opportunity to speak, submit your CFPs soon!\nhttps://bit.ly/AppSecPNW2023CFP\n\nGet your tickets now for the event, there are only a few available spots in the Early Bird registration:\nhttps://bit.ly/AppSecPNW2023Tickets"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - June 2023",
        "date": "2023-06-13",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/293587091",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Surabaya",
        "repo": "www-chapter-surabaya",
        "name": "Pentingnya Keamanan Siber bagi Mahasiswa di Era Serba Digital",
        "date": "2023-05-26",
        "time": "9:00+07:00",
        "link": "https://www.meetup.com/owasp-surabaya-chapter/events/293730438",
        "timezone": "Asia/Jakarta",
        "description": "**[KHUSUS MAHASISWA ITTELKOM SURABAYA]**\n\nPentingnya Keamanan Siber bagi Mahasiswa di Era Serba Digital\n\nDi era digital yang semakin maju ini, mahasiswa menjadi salah satu kelompok yang paling rentan terhadap ancaman keamanan siber. Dalam kegiatan sehari-hari, mahasiswa sering menggunakan perangkat teknologi seperti laptop, smartphone, dan tablet untuk mengakses informasi, berkomunikasi, dan menjalankan tugas kuliah. Oleh karena itu, penting bagi mahasiswa untuk memahami betapa krusialnya menjaga keamanan siber. Dalam tulisan ini, akan dijelaskan secara persuasif mengapa keamanan siber menjadi hal yang sangat penting bagi mahasiswa.\nPertama-tama, mahasiswa sering kali memiliki akses ke berbagai macam data pribadi. Informasi seperti email, nomor telepon, alamat rumah, dan bahkan informasi keuangan dapat tersimpan dalam perangkat digital mereka. Jika keamanan siber tidak dijaga dengan baik, data pribadi tersebut bisa jatuh ke tangan yang salah dan digunakan untuk tujuan yang tidak bertanggung jawab. Identitas mahasiswa dapat dicuri, dan itu bisa berdampak buruk pada kehidupan mereka baik secara pribadi maupun akademik. Keamanan siber yang kuat akan melindungi privasi mahasiswa dan mencegah kerugian yang tidak diinginkan.\nSelanjutnya, keamanan siber yang baik juga penting untuk melindungi informasi akademik. Mahasiswa sering kali memiliki akses ke sistem informasi universitas, database perpustakaan, dan platform pembelajaran online. Melalui serangan siber, informasi ini dapat dicuri atau diubah oleh pihak yang tidak berwenang. Jika karya tulis, proyek penelitian, atau tugas kuliah mahasiswa dimanipulasi atau diakses oleh pihak lain, itu akan merusak reputasi akademik mereka. Dengan menjaga keamanan siber, mahasiswa dapat melindungi integritas karya akademik mereka dan memastikan bahwa prestasi mereka diakui dengan adil.\nSelain itu, keamanan siber juga berkaitan erat dengan keamanan finansial mahasiswa. Banyak mahasiswa yang menggunakan kartu kredit atau sistem pembayaran online untuk membayar biaya kuliah, membeli bahan bacaan, atau bahkan berbelanja secara online. Jika keamanan siber tidak dijaga dengan baik, informasi keuangan mereka dapat dicuri dan disalahgunakan oleh penjahat siber. Hal ini dapat menyebabkan kerugian finansial yang signifikan bagi mahasiswa, serta mempengaruhi kemampuan mereka untuk melanjutkan pendidikan mereka. Dengan memperhatikan keamanan siber, mahasiswa dapat melindungi diri mereka dari ancaman ini dan menjaga kestabilan finansial mereka.\nTerakhir, penting bagi mahasiswa untuk menyadari bahwa mereka bukan hanya individu yang terisolasi dalam lingkungan digital. Mahasiswa sering berkomunikasi dengan teman, dosen, dan rekan sejawat melalui email, media sosial, atau platform kolaborasi online. Jika keamanan siber mereka tercompromi, ini juga dapat membahayakan orang lain dalam jaringan mereka."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter Q2 CTF/Lunch Event 2023",
        "date": "2023-06-02",
        "time": "1:30-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/293320858",
        "timezone": "America/New_York",
        "description": "CMD+CTRL Web Application Cyber Range by Security Innovation (https://www.securityinnovation.com/)\n\nREGISTER TODAY:\nhttps://www.eventbrite.com/e/owasp-tampa-chapter-q2-ctflunch-event-2023-tickets-628632184787\n\nWant to test your skills in identifying web app vulnerabilities? Join OWASP Tampa and Security Innovation as members compete in CMD+CTRL, a web application cyber range where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense is all about thinking on your feet.\n\nFor each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard for a chance to win fantastic prizes! CMD+CTRL is ideal for development teams to train and develop skills, but anyone involved in keeping your organization’s data secure can play - from developers and managers and even CISOs.\n\nLunch and \"afternoon snacks while you hack\" sponsored by Bayside Solutions, Inc. (BSI) (https://bsius.com/)\n\nVenue location is sponsored by Deepwatch (https://www.deepwatch.com/)"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #22: Cloud Security & CyberSec Ecosystem [IN-PERSON]",
        "date": "2023-06-08",
        "time": "8:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/293548265",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\nTheme sessions - Theme: CyberSec Ecosystem & Cloud Security\n\n`Schedule` **`Time:`**` 18:00 to 21:00`\n\nIntroduction, OWASP News & Updates - Catalin Curelaru\nCyberSecurity Ecosystem - Octavian STANCU (Eviden/an Atos business)\nSecurity Log Management - Adrian PAUL (Visma)\nImproving security in AWS Cognito - Lucian Patian (Haufe)\n\nLocation of the event: UBC3, et 10, Sediu VISMA, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by VISMA\n\nMore about the speakers and topics:\n**Octavian STANCU** is an experienced Unit Lead and IT Instructor with a demonstrated history of working in the Information Technology industry, specifically in the fields of Cybersecurity, Networking and Telecommunications. As the Head of Cybersecurity Services, Octavian brings within Global Delivery Center Romania extensive expertise and a strong track record in managing and delivering Cybersecurity services and solutions.\n\n**Adrian PAUL.** I love information technology, passionate to learn about it, and always looking to put the pieces together. Currently, in the conspicuous role of managing the Cyber Security Engineering team that is in charge of implementation, maintenance and development of multiple security services at Visma. When time permits, I enjoy running and volunteering.\n\n***\\~Security Log Management\\~***\nEnsuring the confidentiality, integrity, and availability of the modern digital enterprise is not an easy task. It involves many parallel and related efforts, from systems engineering to effective cybersecurity policy and comprehensive workforce training. The essential elements in cybersecurity operations are monitoring, analyzing, responding to, and recovering from cyber attacks. Behind the scenes, programs and policies must be put into place to support cybersecurity operations.\n\nOrganizations are starting to use cloud computing to take advantage of its many benefits, including cost savings, quick time-to-market, and on-demand scaling of the environment. To improve security visibility in the cloud, security operations teams will want to develop a continuous monitoring strategy that uses a combination of cloud-native services and third-party options for the Security Log Management solution. The strategy needs to provide the most complete range of coverage for both proactively assessing the environment and detecting unusual events or anomalous behaviour rapidly. Additionally, a Security Log Management focused on automation and machine learning, alongside new and updated types of monitoring, will evolve into a Next-generation Security Information and Event Management (NG-SIEM) solution.\nLogging is a vital part of cybersecurity, as it enables you to detect breaches and identify their source. With a robust Security Log Management solution, you can monitor your environments for unusual activity and take action to stop it before it develops into a full-blown attack. By taking the time to develop a comprehensive logging strategy, you can not only mitigate the potential damage of a cyber attack, but also learn important lessons about how to improve your solution for the future\n\n**Lucian Pătian** is a Cloud Solutions Architect at Haufe Group Timisoara. With a SysAdmin background, for the past four years, he has earned a reputation for finding creative solutions to problems in Cloud.\n\n***\\~ Improving security in AWS Cognito. \\~***\nAbstract: we will discuss about why using the standard configurations in Cognito can make your application a security honeypot. How can you use AWS WAF to add an extra layer of protection and why using verified token attributes should be a must."
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP x Project Calico x Okta | Container and Kubernetes security policy design",
        "date": "2023-06-15",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/293475436",
        "timezone": "America/Toronto",
        "description": "\\*\\*\\* THIS TALK IS BOTH ONLINE (https://www.youtube.com/watch?v=eMSnga3arIA) and OFFLINE @ the Okta offices \\*\\*\\*\n\n**TALK**\n\n**Container and Kubernetes security policy design: 10 critical best practices**\n\n**Summary:**\n\nCompanies are constantly seeking new and innovative ways to stay ahead in a highly competitive and rapidly changing business landscape. One strategy that has proven to be highly effective is application modernization. This is not just a mere upgrade; it is a complete transformation of how businesses operate. By embracing this approach, companies can accelerate innovation, optimize costs, and improve their overall security posture.\n\nHowever, embarking on the journey of application modernization is not an easy task. It requires a significant investment in people, processes, and technology to achieve the desired business outcomes. The right foundation must be established from the beginning to avoid the high cost of re-architecture, which can be a major roadblock in achieving success. One crucial aspect is developing a standard and scalable security design for their Kubernetes environment. This will establish the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\nIn conclusion, application modernization is a strategic initiative that can transform businesses. Developing a standard and scalable security design for the Kubernetes environment is critical to establishing the framework for implementing the necessary checks, enforcement, and visibility to enable strategic business objectives.\n\n**Presenter:**\n\n**Regis Martins**\n\nRegis Martins is a passionate problem solver and technologist with a deep-rooted love for finding innovative solutions. With a background in Electrical Engineering and a Master's Degree in Computer Science, he has honed his expertise in areas such as deep packet inspection technologies, traffic management, network analytics, and Kubernetes. His journey has led him to excel as a Sales Engineer, where he architects solutions, educates clients, and thrives in helping organizations overcome challenges. With a diverse skill set encompassing Python, Linux, virtualization, cloud computing, and more, Regis is committed to making a positive impact in the world of technology through continuous innovation and knowledge sharing."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "German OWASP Day 2023 in Frankfurt: Ebbelwoi meets AppSec!",
        "date": "2023-05-30",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/293534722",
        "timezone": "Europe/Berlin",
        "description": "Hi all,\nWe're thrilled to announce the return of the German OWASP Day 2023! This leading independent and non-commercial conference on application security in Germany will take place on the 30th and 31st of May, 2023 at the Frankfurt School of Finance and Management.\n\n_What's happening? We look forward to welcoming you to our German OWASP Day 2023, offering a plethora of exciting technical and non-technical talks, various seminars, and an evening event for networking.\n\n_What's on the agenda? Our main program has been released, featuring a range of talks from esteemed experts like Björn Kimminich, Claudia Ully, Clemens Hübner, Diana Waithanji, and many more.\n\n_When? Our event takes place on the 30th and 31st of May, 2023.\n\n_Where? Frankfurt School of Finance and Management, Adickesallee 32-34, 60322 Frankfurt am Main\n\n_Tickets? Limited tickets are available at [https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477](https://www.eventbrite.com/e/2023-german-owasp-day-god-tickets-515112875477)\n\n_Additional Information? More information about the German OWASP Day, training sessions, and the conference program can be found at god.owasp.de/2023/\n\n_And now? Save the date, spread the word, and bring your friends and colleagues to our event.\n\n_Follow Us! Also, follow us on Twitter #owasp_de and #owasp_frankfurt and refer to our German OWASP Day site for information including slides and recordings of previous presentations.\n\nWe're looking forward to seeing you at this exciting event of the year!"
    }
]