[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - August",
        "date": "2024-08-27",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460613",
        "timezone": "Europe/Copenhagen",
        "description": "Join the August OWASP Aarhus meet with Cryptomathic!\n\nAgenda:\n\n19:00 – 19:10 Welcome by Cryptomathic and OWASP Aarhus\n\n19:10 – 20:00 Using fuzzing to detect program errors by Jan and Anna.Jan and Anna: Software engineers; working with C, C++, and Java on a daily basis while attempting to avoid introducing new critical bugs. We will talk about how fuzzing can be used to detect program errors unrelated to project requirements. The main focus will be fuzzing functions, with known source code, that receive input from untrusted sources.\n\n20:00 – 20:30 Networking break\n\n20:30 – 21:25 \"Secure SDLC with a DevOps Flavor!\" by Jim Manico\n\nJoin Jim Manico for an enlightening session on \"Secure SDLC with a DevOps Flavor!\" where he merges cutting-edge DevOps practices with robust security measures. In this talk, Jim will delve into automating security within the CI/CD pipeline to ensure continuous security integration, advocate for a shift-left approach to catch vulnerabilities early, and discuss implementing Security as Code to maintain consistent security configurations. He will also emphasize the importance of fostering a DevSecOps culture where security is a shared responsibility across all teams. Additionally, Jim will outline essential tools and technologies that enhance security in DevOps environments, and stress the significance of monitoring security metrics for continuous improvement. This session is a must-attend for professionals seeking to integrate effective security practices into their development cycles without sacrificing speed or efficiency."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Hack-Proof Your Code:  Exploring Mobile App Weaknesses with OWASP MAS",
        "date": "2024-08-22",
        "time": "11:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/302022462",
        "timezone": "America/New_York",
        "description": "In this talk, we will take a hands-on look at some of the latest OWASP MAS developments, in particular the new MASWE (Mobile Application Security Weakness Enumeration). This talk will introduce the concepts of \"weaknesses\", \"atomic tests\" and \"demos\" that are the basis of the upcoming MASTG v2. Attendees will gain practical knowledge through detailed examples that show the journey from definition to implementation using both static and dynamic analysis techniques available in MASTG. In addition, discover the newly developed MAS test apps designed to streamline research and improve the development of robust MAS tests.\n\nDon't miss this opportunity to improve your mobile app security skills and make your apps hack-proof. Whether you're looking to bolster your defenses or learn how to uncover vulnerabilities, this session will provide you with the cutting-edge resources you need to stay ahead in mobile security!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2024 (Online)",
        "date": "2024-08-27",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207020",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-22",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302598785",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-15",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302459888",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "August 2024 OWASP Austin Security Professionals Happy Hour--sponsor Trellix",
        "date": "2024-08-08",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302124371",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, August 8th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Trellix](https://www.trellix.com)\n*Trellix is a global company redefining the future of cybersecurity. The company’s open and native extended detection and response (XDR) platform helps organizations confronted by today’s most advanced threats to gain confidence in the protection and resilience of their security operations. Trellix, along with an extensive partner ecosystem, accelerates technology innovation through machine learning, automation, and actionable real-time intelligence to empower over 40,000 customers with living security. Trellix is committed to accelerating the inclusion of all communities in the industry, bringing together talented professionals with diverse backgrounds and experiences to have a meaningful impact on the evolution of cybersecurity.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-08",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302335657",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém UEPA 2024",
        "date": "2024-08-03",
        "time": "08:30-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/301800873",
        "timezone": "America/Boa_Vista",
        "description": "No dia 03 de agosto, a **OWASP Belém** é um dos capítulos brasileiros entre os mais de 200 capítulos ativos em todo o mundo. Nosso objetivo é disseminar a missão da OWASP, tornando a segurança das aplicações visível, para que as pessoas e organizações possam tomar decisões conscientes sobre os verdadeiros riscos de segurança das aplicações.\nAlém disso, estamos empenhados em promover práticas de computação forense, ajudando a identificar, preservar, analisar e apresentar evidências digitais de forma adequada. A computação forense é essencial para a investigação de incidentes de segurança, permitindo que as organizações compreendam as origens e impactos de ataques, além de reforçar suas defesas contra futuras ameaças.\n\n**Data:** 03/08/2024\n\n* **Horário:** 8h30m.\n* **Local:** UEPA\n* **Endereço**: Tv. Dr. Enéas Pinheiro, 2626 - Marco - UEPA\n* Inscrição: https://bit.ly/owaspuepa\n\nConfira a programação:\n**08h30m:** Abertura\n**09h00:** Apresentação OWASP\n**09h15 - 09h45:** Em breve.\n\n**10h - 10h45:** Em breve**.**\n\n**10h45 - 11h00:** Intervalo / Networking\n**11h15 - 11h45:** Em breve."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - August 2024",
        "date": "2024-08-14",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/302570037",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Dick Brooks, co-founder and lead software engineer at Business Cyber Guardian.\n\nDick will describe and demonstrate the CISA RSAA portal that is used by the US Federal Government to collect secure software attestations, SBOM's and other relevant artifacts that government SCRM teams will use during software risk assessments, now required under Executive Order 14028 and OMB M-22-18.\n\nDick Brooks is a contributor to the CISA ICT_SCRM Task Force responsible for developing the CISA Secure Software Acquisition Buyers Guide this is used by both software producers and federal procurement teams working to approve software products as \"Secure by Design\". Dick also serves on the CISA Sector Risk Management Agency (SRMA) Coordinating Councils for the Critical Manufacturing (CMSCC) and Healthcare (HSCC) Sectors as a C-SCRM subject matter expert."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "OWASP Juice Shop – hands on pen testing!",
        "date": "2024-08-06",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/302342937",
        "timezone": "Australia/Brisbane",
        "description": "Hello hackers, security enthusiasts, and the like.\nFor this upcoming OWASP meetup we are going to do things a little different. Over the past few years, we have presented on numerous web /API vulnerabilities, this time we are going to exploit some of these weaknesses!!\nYes, that’s right, less talking more hacking!\nAs we have a mixed group of attendees, including executives, students, developers, security experts and enthusiasts, and to stay on brand :D, let’s focus on exploiting vulnerabilities present within Try Hack Me’s OWASP Juice Shop.\nListed below are the things you will need to participate:\n· Laptop (one that can be used for exploiting weaknesses (Try Hack Me’s OWASP Juice Shop), perhaps not a corporate laptop :D)\n· Internet (Mobile hotspot in case the venue’s Wi-Fi cannot be used for any reason)\n· Try Hack Me account (Can be a free version)\n· Optional – Linux based VM + Try Hack Me VPN if you prefer to test from a local machine. Otherwise, you can spin up a cloud based Try Hack Me Linux based VM to conduct testing from.\nFor those that have already completed this room well done!! Feel free to attend and perhaps pick another room or HTB to focus on, attend for the vibes/social aspect \nFor those who have never performed pen testing of any kind, no stress, we can provide support/answer any questions that you may have. This is a judgement free zone, there are no dumb questions!!\nHope to see you all there\n\nVenue will be announced soon (Brisbane CBD)"
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Papá, tengo un romance con la IA",
        "date": "2024-08-27",
        "time": "20:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/302317399",
        "timezone": "America/Santiago",
        "description": "En esta era de revolución tecnológica, las interacciones entre humanos e inteligencias artificiales están alcanzando niveles de complejidad sin precedentes.\n\nEste podcast abordará un fenómeno emergente:\n\n* Individualismo y soledad en el mundo real.\n* El desarrollo de vínculos emocionales profundos con entidades de IA.\n* Implicaciones Éticas y Psicológicas en niños, niñas y adolescentes."
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "¿ITIL 4.0: ¿Innovación o Distracción?",
        "date": "2024-08-13",
        "time": "20:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/302553895",
        "timezone": "America/Santiago",
        "description": "**¿ITIL 4.0: ¿Innovación o Distracción?**\n\nDespués de más de una década impartiendo charlas y clases sobre ITIL, he llegado a una conclusión controversial: ITIL 4.0 podría no ser la mejor inversión de su tiempo y recursos.\n\n¿Quiere saber por qué? Los invito a mi próxima charla donde profundizaré en esta afirmación basada en mi experiencia en el campo.\n\nÚnase a nosotros para un debate relevante y práctico sobre la utilidad de este framework. No se lo pierda."
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "OWASP Cheat Sheet Series Bug Bash!",
        "date": "2024-08-07",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/302142287",
        "timezone": "America/New_York",
        "description": "Interested in application security? Or have you been wanting to get into open source but aren't sure where to start? Come to our Bug Bash! We'll provide an overview of the [OWASP Cheat Sheet Series](https://cheatsheetseries.owasp.org/) project, a collection of articles on specific application security topics. Then we'll dive into the project's GitHub repository and start hacking away at issues. We'll have mentors on hand to help you get started and answer any questions you have. All skill levels are welcome!\n\nNever submitted a pull request before? No problem! We'll walk you through the process and help you get your first open source contribution under your belt.\nAre you an expert in one specific area of application security? Come contribute to the project by writing a new cheat sheet or improving an existing one.\nJust getting started? Come and learn from experts, and contribute by fixing typos, improving formatting, or adding examples to existing cheat sheets. You don't need to be a technical expert to participate in open source!\nHave tons of experience? Come help mentor others and review their pull requests.\n\nWe'll unleash the group on the project and see how much we can accomplish in a couple hours. There will be food for all attendees, and we'll have special **awards** for the top contributors in various categories.\n\n**Bring your laptop! Make sure you're set up with a GitHub account, and ideally have Git installed on your laptop.**\n\n**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required. Include your first and last name with your RSVP.**\n**Sponsored by [Traceable](https://www.traceable.ai/)**"
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP Cleveland: Join the Conversation on Application Security",
        "date": "2024-08-13",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/302440241",
        "timezone": "America/New_York",
        "description": "Thank you to everyone who joined us last month. We’ll be meeting again on Tuesday, 8/13 at Market Avenue Wine Bar to discuss and share knowledge on information/application security topics. There won’t be any dedicated speakers this time—just come ready meet others and join the conversation!"
    },
    {
        "group": "Gla University Mathura",
        "repo": "www-chapter-gla-university-mathura",
        "name": "OWASP Chapter GLA University CyberTalk #1",
        "date": "2024-08-03",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-gla-university-mathura-student-chapter/events/302512041",
        "timezone": "Asia/Kolkata",
        "description": "Join us every first Saturday of the month for OWASP GLA University Cybertalk, where we dive into the latest in cybersecurity! From dissecting recent breaches to exploring cutting-edge technical insights, this session is your go-to for staying ahead in the cyber world. Don’t miss out on engaging discussions and expert perspectives that keep you informed and secure. Secure your spot and be part of the conversation!\n\nZoom Meet Link : [https://us06web.zoom.us/meeting/register/tZYsdemspjMtG9KL3YF7Rc8FYW_gbCi6C54a](https://us06web.zoom.us/meeting/register/tZYsdemspjMtG9KL3YF7Rc8FYW_gbCi6C54a)\n\n**RSVP is mandatory.**"
    },
    {
        "group": "Hungary",
        "repo": "www-chapter-hungary",
        "name": "LLM AppSec in 3 takes: local-first, SDLC, psychology [en, upd2]",
        "date": "2024-08-08",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-hu/events/302470528",
        "timezone": "Europe/Budapest",
        "description": "In collaboration with CyEx we treat LLMs security in three different takes: A practicioner's insights into hardening security of local-first business solutions; SDLC related practical examples from a cybersec management veteran; Psychology vs LLMs/GenAI vs safety/security as seen by an academic psychology researcher. Attend the event in person in Budapest or follow it live online!\n\n Sidenote1: Do not forget to hop over to 'OWASP Top 10 for LLM apps': [https://genai.owasp.org/llm-top-10/](https://genai.owasp.org/llm-top-10/)\n\n1⃣ 18:10 CET\\* **Applied LLM security: How to harden the local ones (plus tips for API users)**\n** Irina Nikolaeva**, Head of Data Science at Raft Digital Solutions, Russia\nWith her master's degree and academic papers in applied mathematics and statistics, Irina is literally a scientist in the field where notions of science and artificial intelligence are exaggerated. Her many years of practical experience with ML in general, and DL, NLP, LLMs and others before the Coming of ChatGPT makes her approach chill and dehyped. Irina will give tips on how to protect your solution from LLM leaking data/PII, treating users inadequately or giving bad advice. Our expert's good advice will be focusing on local-first solutions, which she has accumulated experience in, as it is the choice of implementation which is reasonably favorable in a sanctioned country. However, folks implementing business solutions using the popular LLM APIs are expected to get their valuable share of advice too. [30 mins talk, 10 mins Q/A, break]\n\n2⃣ 19:00 CET **LLM Sprinkles for your SDLC Sundae**\n** Craig Balding**, Independent Cyber Security Consultant, UK\nOne of the fathers of cybersec red teaming, today Craig's top interest is AI security research and education, and his technical and non-technical consulting has also turned primarily to that direction. The current session applies his many years of cybersec leadership and navigating secure development in large financial institutions to the new situation created by the emerging omnipresence of LLMs -- how SDLC, secure software development methodologies and practices change. The session will be showing small, practical examples of using LLMs and hopefully give attendees food for thought to run their own experiments (and share back to OWASP anything useful!) [20 mins talk, 10 mins Q/A, break]\n\n3⃣ 19:45 CET **Utilizing the psychology of generative language models to get better and safer behavior**\n** Kekecs Zoltán**, PhD, Researcher, Assistant Professor, ELTE Faculty of Education and Psychology, HU\n\"We commonly point out flaws in anthropomorphizing generative language models, but we rarely talk about the benefits. This talk will describe the similarities and differences in the functioning of LLMs compared to human psychology, touching on topics of memory, thinking/reasoning, cognitive biases and stereotypes, goals and motivation, emotions, and consciousness. We will discuss how we can utilize the advances in human behavioral science and neuroscience to better understand the behavior of generative models, and to achieve better and safer results with these systems.\" [20 mins talk, 10 mins Q/A]\n\n4⃣ **Networking**, free beer, refreshments or tea-like drinks. \n\n**Host**: [CyEx](https://cyex.hu/), a Budapest-based cyber security service provider, whose founders are prominent figures in Hungarian pentesters' education\n **Doors open at 17:45**\nBudapest, Elnök u. 1, 1089 [Nagyvárad tér metro]\n[https://maps.app.goo.gl/oKrqHMfhpyxnnpFs9](https://maps.app.goo.gl/oKrqHMfhpyxnnpFs9)\n **Online**:\nTelegram (live stream, panel, questions)\n[https://t.me/owasphu?livestream](https://t.me/owasphu?livestream)\nYoutube (broadcast, questions)\n[https://www.youtube.com/watch?v=BHSpvzgk05g](https://www.youtube.com/watch?v=BHSpvzgk05g)\n[https://youtube.com/@owasphu](https://youtube.com/@owasphu)\n\\* Times are given in CE[S]T / Berlin / Budapest time = **UTC + 2**\n\nProduced by: Timur Khrotko, OWASP HU\n\n Sidenote2: Another OWASP and LLMs related thingy to know about is the below checklist:\n[https://genai.owasp.org/resource/llm-applications-cybersecurity-and-governance-checklist-english/](https://genai.owasp.org/resource/llm-applications-cybersecurity-and-governance-checklist-english/)"
    },
    {
        "group": "Hyderabad",
        "repo": "www-chapter-hyderabad",
        "name": "Owasp Hyderabad Chapter August 2024 Meetup",
        "date": "2024-08-10",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/hyderabad-owasp-meetup-group/events/302589221",
        "timezone": "Asia/Kolkata",
        "description": "## Details\n\nDear OWASPIANS & Cybersecurity Enthusiasts,\nWe are excited to invite you to the upcoming OWASP Hyderabad Local Chapter Meeting in collaboration with OpenText.\nThis event is going to be an on-campus event bringing together cybersecurity enthusiasts, professionals, and experts to discuss the latest trends, best practices, and advancements in Appsec.\nEvent Details: Date: 10th Aug 2024\nTime: Starts at 10:00 am IST\nLocation:\nUnit No. 301, 3rd Floor, Building 14, Mind Space IT Park, HITEC City, Madhapur, Hyderabad, Telanagana 500081\nAgenda Highlights:\n\n* 9:30 AM to 10:00AM -Check-in for the registered persons for the meetup at OpenText Campus\n* 10:00AM to 10:10 AM -Keynote address and welcome by Owasp core team\n* 10:15AM to 10:30AM -Keynote address by OpenText leadership team.\n* 10:30AM to 11:30AM- Session 1\n\n**AI / LLM Pentesting OWASP top 10 risks for AI/LLM by Sai dutt Mekala (Opentext).**\nSai is an Application Security Enthusiast with a diverse skill set and deep interests in various facets of cybersecurity like network, cloud and AI/LLM. His expertise includes Secure Code Review , DAST, Threat Modelling, Penetration Testing, Supply chain security etc. His regular routine is recommending effective remediation's to development teams, conducting thorough research on CVEs, performing architecture reviews, and implementing robust dependency scanning practices.\nAlso, a part time bug bounty hunter on HackerOne with 75+ valid submissions to multiple organizations\n\n* Break/Networking\n* 11:45AM to 12:45PM - Session 2\n\n**Security and Privacy by Design – A practical guide for Healthcare Domain by Bidesh (Innominds)**\n\n* 12:45PM to 13:00PM Q&A and closing notes\nOur guest speakers and facilitators are industry specialists who will share their insights, experiences, and knowledge to help you stay updated on the latest security practices and vulnerabilities.\n\nPlease confirm your attendance via Meetup\nDon't miss out on this valuable opportunity to connect with fellow security enthusiasts and enhance your understanding of web application security. We look forward to your presence at the OWASP Hyderabad Chapter Meeting.\nNOTE:\n\n* Please ensure to carry your government-issued ID so as to register and get into the premises.\n* If you are commuting to event by own Vehicle , please update name and Vehicle number in comments section,as we need to update to security at SEZ location.\n\nBest regards,\nOWASP Hyderabad Chapter"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-08-19",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686443",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Kerala",
        "repo": "www-chapter-kerala",
        "name": "OWASP Kerala Chapter Meet Aug 2024 ",
        "date": "2024-08-10",
        "time": "14:00+05:30",
        "link": "https://www.meetup.com/owasp-kerala-chapter/events/302573439",
        "timezone": "Asia/Kolkata",
        "description": "**OWASP Kerala - Chapter Meet Aug 2024**\n\n**Date and time:** 10th Aug. 2024, 2:00 PM to 5:00PM IST\n\n**Venue :** FAYA, -1 Thejaswini, Technopark Phase 1, Trivandrum\n\n**Sponsor:** FAYA\n\n**Session 1 - Trust No One, Secure Everything: API Security in Zero Trust Supply Chains**\n\n**Speaker : Dhanith Krisha , Senior Manager, Cyber Security Team**\n\nDhanith leads Attack & Red Team services for EY Global Delivery Services, leading a global team of 250+ ethical hackers. He is a hardcore practitioner with rich experience working with the world’s leading financial institutions helping them make their digital presence safer. An active member of OWASP, Dhanith has contributed to several open-source information security projects, including the OWASP WSTG. Dhanith is passionate about educating the community on cybersecurity and consistently seeks opportunities to share his knowledge and expertise with the community.\n\n**Session 2 - Email Forensics: Investigation Techniques**\n\n**Speaker: Midhun Mohan - Supervising Associate, Cyber Triage and forensics Team**\n\nMidhun currently works as Supervising Associate in Cyber Triage & Forensics Team, EY. Has 8 years of experience in Cyber Security & Digital Forensics. Giving back to the community by providing training in his area of expertise is something he is passionate about. Oversaw several training sessions for representatives of the Indian government's agencies, such as the NIA, CBI, Army Security Group, and others. Also contributed in analysis of cyber-crime cases reported by various Law Enforcement Agencies of Government of India and setting up of Digital Forensics Lab."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - AUG 28, 2024",
        "date": "2024-08-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300687355",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Integrating Security Best Practices with Shift-Left and Shift-Right in Agile SDLC\nJoin us for great networking, dinner and drinks, and see a presentation by **Liliya Frye**, Director of QA Engineering\n\n**ABSTRACT**: Comprehensive overview of continuous integration and continuous web application security testing with utilization of Shift-Left and Shift-Right methodologies within Agile SDLC. What are the best DAST/IAST/SAST tools? Explore practical strategies, automated testing and penetration testing within CI/CD pipelines to maintain robust security and quality from inception to deployment. Discover how to address common challenges, mitigate security risks, enhancing both product quality and operational efficiency. Elevate your security measures and ensure continuous quality in software development life cycle.\n\n**Thanks to our Sponsor**: *[Checkmarx](https://checkmarx.com/)*\n*Checkmarx's* mission is to provide the technology, expertise, and intelligence that enable developers and enterprises to secure the world’s applications. We help companies deliver secure software faster, making the world safer for all of us. *Checkmarx is the enterprise application security leader, helping security and development teams build DevSecTrust by securing every phase of development with our cloud-native platform. We proudly serve 1,800 customers, including 60% of Fortune 100.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Capture The Flag Event - SHRED with Security Innovation",
        "date": "2024-08-14",
        "time": "16:30-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300354016",
        "timezone": "America/Chicago",
        "description": "Join us in-person for an exciting day of hacking a cyber range! Thanks to the folks at Security Innovation, we'll host attackers of all skill levels and background to have some fun networking and learning about the mindset, skills and methodologies used in the seemingly growing number of breaches we hear about in the news."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2024-08-08",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181908",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa August 21st 2024: API: Always Prone to Injections",
        "date": "2024-08-21",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/302579838",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBD\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **API: Always Prone to Injections**\n\n**Abstract:**\nWhen pushing left goes past the developer: To the documentation! Simple documentation errors are a big contributor to injection vulnerabilities of all kinds, especially the way many cloud APIs are documented. In this presentation I’ll walk through several examples, and then get hands on with a demo vulnerability (and hopefully some laughs). We’ll highlight how to spot these kinds of problems in documentation as a developer, and avoid making them yourselves when providing an API.\n\n**Speakers:**\n**Chris Shepherd** is a pentesting lead, privacy advocate, and avid homelabber. With over 20 years of experience in roles from systems & network administration to software development to pentesting, he's worked on all facets of application development, deployment, and use. With a lifelong passion for security, Chris turned that jack of all trades experience towards pentesting, with a focus on education. For the past four years he has volunteered as a key challenge developer and overall challenge development co-ordinator for the CyberSCI CTF."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-08-29",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/302438652",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "August 2024 Meeting",
        "date": "2024-08-06",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/302320210",
        "timezone": "America/Phoenix",
        "description": "**Introduction to DevSecOps with GitHub Actions** (45 min)\nGitHub Actions are a powerful way to automate your development pipelines. This talk will give you a foundational understanding of GitHub Actions with enough knowledge to start integrating security scans. We will start with the fundamentals of GitHub Actions and put those into practice with a Hello World test. Then we will look at how to create a dashboard that displays the current state of your repository. Finally, we will resolve one of the failing dashboard metrics by implementing an automated scan. This is intended to be a hands-on talk. Bring your laptop and set up a GitHub account before the meeting begins."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "OWASP Open Forum",
        "date": "2024-08-15",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/302500810",
        "timezone": "America/Los_Angeles",
        "description": "Join us for a new event this month: the OWASP Open Forum. This open discussion format allows you to bring your own questions and experiences in information security to the table. Whether you're solving problems, sharing success stories, or looking for advice, this is the perfect opportunity to engage with a diverse audience, including several long-time OWASP members and other attendees. This forum offers a chance to network, gain insights, and connect with peers who may have similar questions or perspectives. Let's learn from each other and strengthen our community together.\n\nDoors open at 5:30. The forum will run from roughly 6 to 7. We'll need to be out of the space by 7:30.\n\nWe thank NedSpace for hosting us again this month. NedSpace is a co-working space with 15,000 of 11th-floor views, in the heart of downtown Portland, 2 blocks away from Pioneer Square."
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro #16 [PRESENCIAL]",
        "date": "2024-08-15",
        "time": "18:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/302429958",
        "timezone": "America/Sao_Paulo",
        "description": "Em agosto voltaremos com nossos encontros PRESENCIAIS, com apoio da **AZION** cedendo o espaço para nossa a comunidade, teremos um encontro presencial na sede da empresa.\n\n* VAGAS **LIMITADAS**, por favor só confirme se você ter a certeza de sua participação\n* Brindes especiais de empresas que apoiam a comunidade da OWASP POA: **AXUR**, **AZION**, **KINGHOST** e **LOCAWEB**\n* Emissão de certificado de participação\n\n**Confira nossa agenda:**\n 18:30 - Credenciamento e wellcome coffee\n\n 19:00 - \"Hackers a favor: Como Programas de Bug Bounty Protegem Empresas” - Raphael Estima\n[https://www.linkedin.com/in/raphael-e-m/](https://www.linkedin.com/in/raphael-e-m/)\n\n 19:45 - \"Segurança digital no contexto da Indústria 4.0” - Marcos Rodrigues de Carvalho\n[https://www.linkedin.com/in/marcos-rodrigues-de-carvalho-8ab2381b7/](https://www.linkedin.com/in/marcos-rodrigues-de-carvalho-8ab2381b7/)\n\nPara este encontro iremos emitir certificado de participação, esperamos vocês na Praça Dr. Maurício Cardoso, 71 - 4º andar - Porto Alegre - RS."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-08-14",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539097",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver Monthly Meetup",
        "date": "2024-08-15",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516374",
        "timezone": "America/Vancouver",
        "description": "TBD"
    }
]