[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - February",
        "date": "2023-02-28",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/288772226",
        "timezone": "Europe/Copenhagen",
        "description": "Hi All,\n\nPlease note, that this is a physical event hosted by Norlys and OWASP Aarhus may share a list of participants with Norlys for the sole purpose of hosting the event.\n\nThis is a bit different event than normal as we will have FDCA (“Forening af Danske Cyber Alumner”) hosting a special Capture-the-flag (CTF) of their platform and they will bring a couple of special challenges targeted developers.\n\nNote, that we start earlier then normal but feel free to sign up even if you will not be able to participate from the start.\n\nPlease call me at +45 21581410 if you arrive late and I will come and let you in.\n\n17:00 – 17:30 – Registration, setup, networking, food and drinks\n17:30 – 18:00 – Welcome by FDCA, Norlys and OWASP Aarhus\n18:00 – 19:00 – Presentation of the CTF platform as well as getting started by FDCA\n19:00 – 21:30 – Capture-the-flag – Remember to bring laptop, power etc.\n20:00 – 20:45 – Presentation - TBD\n21:30 – 21:45 – Ending the night and goodbyes by FDCA, Norlys and OWASP Aarhus\nLooking forward to it!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - February 2023 (Online)",
        "date": "2023-02-28",
        "time": "1:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705717",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- https://owasp\\-austin\\-2023\\-february\\.eventbrite\\.com\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nAppSecOps - a Scalable Approach to Application Security\nLuis Guzman\n\nToday many unforeseen factors are driving AppSec chaos...We have found about 3-4 TOP challenges every vertical is seeing in today's frugal market. The factors range from simple to hilariously unattainable! I aim to give you a few tips and steps to overcome some if not ALL and create an organization able to ship software fast and secure! All the while addressing current events happening in the market and how to avoid potential \"potholes.\""
    },
    {
        "group": "Bellingham",
        "repo": "www-chapter-bellingham",
        "name": "OWASP Bellingham Chapter March Event (Online) ",
        "date": "2023-03-01",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-bellingham-chapter/events/291414271",
        "timezone": "America/Los_Angeles",
        "description": "Please join us on the evening of March 1st for a social gathering to talk about what we're working on, upcoming events, and hang out with other web security minded folks!"
    },
    {
        "group": "Bergen",
        "repo": "www-chapter-bergen",
        "name": "Purple is the New Black: Modern Approaches to Application Security",
        "date": "2023-02-28",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-bergen-meetup-group/events/291655332",
        "timezone": "Europe/Oslo",
        "description": "**Talk description**\n\nGone are the days when breaches were rare and security could safely be put low on the priority list; product security is now a customer demand and cyber crime has reached epic proportions. Our idolization of hackers, penetration testing and ‘breaking’ has not resulted in secure software for our industry, only egos, stereotypes and unaffordable security models. Modern application security approaches need to address both offensive (red team) and defensive (blue team) approaches, as well as continuous learning and advocacy for developers. This means Purple Team. This talk will explore how to combine defence, offence, automation, empathy and continuous learning, all without the requirement of ever wearing a hoodie. The future of security is PURPLE."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston March 2023 Meetup - Hybrid Attendance",
        "date": "2023-03-01",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owaspboston/events/291465528",
        "timezone": "America/New_York",
        "description": "This month OWASP Boston will be welcoming Pete Morgan, CSO & Co-founder of Phylum, as our presenter. Pete will be presenting to the group on defending the complete attack surface of the software supply chain. The presentation will include research findings from the Phylum team and their insights on how to counteract them. For more details about Pete and the talk please see the details below.\n\nThis month’s meetup with be a hybrid meeting, feel free to join us in person at the Broad Institute in Cambridge or via Zoom (link provided to all registered attendees ahead of the event).\n\n**Title:** Defending the complete attack surface of the software supply chain\n\n**Abstract:** As attacks have shown, soft targets in the software supply chain are now the path of least resistance for attackers. This session will review the TTPs of recent attacks and areas of software supply chain risk to focus on.\n\n**Speaker:** Pete Morgan, CSO & Co-Founder at Phylum (photo attached)\n\n**Bio:** Pete Morgan is a co-founder and CSO of Phylum. He is a recognized security researcher and entrepreneur with more than 20 years of experience in information security, software development and executive leadership. Pete’s background in offensive security drives his passion for creating and sharing the best defenses against the growing number of software supply chain attacks originating in the open-source ecosystem."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "OWASP Brisbane - February **UPDATE**",
        "date": "2023-02-23",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/291301162",
        "timezone": "Australia/Brisbane",
        "description": "Hi All!\n\nWe are excited to confirm our speaker for the next event at Thoughtworks Brisbane!\n\n**Speaker:** Raafey Khan\n\n**Title:** Can AppSec testing really be automated?\n\n**Talk Description:** The capabilities of Application Security Testing (AST) tools are changing rapidly. As vendors continue to acquire and build new features, feature parity is on the horizon. For now, they're doing things in their own unique, sometimes odd way.\n\nOver the last few years, Raafey has used, analysed and compared various AppSec tooling. Running them against benchmarks and multiple applications.\nIn this talk, he will go through what makes an AST tool good, why there are SO many false positives, and when they actually make sense to use compared to a good old-fashioned pentest.\n\n**Bio:** Raafey has been a security consultant for many years and leads the AppSec team for CyberCX. His primary focus is working with organisations to understand how they build software and what they can do to make sure they’re protected.\n\nHaving recently moved over from NZ, he’s looking forward to getting to know the Brisbane security community."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - February 2022",
        "date": "2023-02-28",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/291234834",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC ",
        "date": "2023-02-21",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-bristol/events/288310192",
        "timezone": "Europe/London",
        "description": "tbc\n\nWe publish the recordings of our meetups on @YouTube.\nIf you would like to be notified when a new video is published, please subscribe to our channel at:\nhttps://www.youtube.com/@OWASPBristol"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS February 2023",
        "date": "2023-02-23",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/291207717",
        "timezone": "America/Denver",
        "description": "Speaker: James Smith\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP SNOWFROC Conference",
        "date": "2023-03-02",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/290702464",
        "timezone": "America/Denver",
        "description": "SnowFROC 23 is on Thursday March 2nd - all day long. While billed as, \"Denver's premier application security conference\", SnowFROC's presentations and workshops focus on many facets of cybersecurity and over the years, SnowFROC has come to be known for its exceptional value: Hands-on training, excellent food, spectacular networking, great location/venue and professional orchestration.\n\nThis year, our Keynote will be given by Kevin Johnson!\n\nSnowFROC includes breakfast, lunch, presentations, vendor giveaways, a panel discussion and optional hands on training and workshops.\n\nThe location of this event is The Cable Center on the University of Denver campus near I-25 and University.\n\n**YOU MUST REGISTER AT** [https://www.eventbrite.com/e/owasp-2023-snowfroc-tickets-487925687867](https://www.eventbrite.com/e/owasp-2023-snowfroc-tickets-487925687867)\n\n**Our regular meetups are free, but this one-day only event/conference is not free:** Only $75 for the conference which includes breakfast, lunch, afternoon snacks and happy hour. Additional $30 for the hands-on track if desired.\n\nBY FAR THE BEST VALUE for any conference you will attend this year - Start 2023 off right and invest in yourself and your company!\n\nStay up-to-date with the latest information on speakers, sponsors, workshops and more: [https://snowfroc.com](https://snowfroc.com)"
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Monthly Presentation - C2 Servers What Are They?",
        "date": "2023-02-28",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/291516859",
        "timezone": "America/Edmonton",
        "description": "## Time & Location\n\nFeb 28, 5:00 - 6:30 p.m.\nEdmonton, 10700 104 Ave NW, Edmonton, AB T5J 4S2, Canada\n\n## About The Event\n\nAn in-person event for all members hosted at Grant MacEwan.\nPresentation by Thomas Dang.\n\n1. C2's What are they and how are they used in CTFs\n2. Common C2s/The C2 Matrix\n3. Basic Metasploit demo\n4. Basic Sliver demo\n5. QA"
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "CTF Event - King of the Hill",
        "date": "2023-02-21",
        "time": "8:30-07:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/291515918",
        "timezone": "America/Edmonton",
        "description": "## Time & Location\n\nFeb 21, 6:30 p.m. – 8:00 p.m.\nOnline\n\n## About The Event\n\nAn online event where we will work on Try Hack Me King of the Hill.\n\nGoogle Meet joining info\nCTF Online Event\nTuesday, February 21 · 6:30 – 8:30pm\nGoogle Meet joining info\nVideo call link: https://meet.google.com/uzv-zqcq-rsg\nOr dial: ‪(US) +1 904-580-8855‬ PIN: ‪495 302 301‬#"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "OWASP France - Bordeaux Meetup - Février 2023",
        "date": "2023-02-22",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/291313081",
        "timezone": "Europe/Paris",
        "description": "OWASP France se délocalise à Bordeaux pour le 1er MeetUp de la communauté sécurité hors de Paris !\n\nPour cette première rencontre, nous allons adresser un sujet chaud pour beaucoup d'organisations : le **DevSecOps**.\n\nComment inclure la sécurité dans les process de développement ?\n Quels outils ?\n Quels process ?\n‍ Quelles équipes ?\n Quelles compétences ?\nQue de questions...\n\nNotre premier sponsor Mirakl nous accueille dans le coworking Meetropolitan :\n** Mirakl Bordeaux**\n31 Allées de Chartres\n33000 Bordeaux\n\n** Voici le programme complet**\n 17h00 : Pot d'accueil sucré\n 17h30 : Début du MeetUp - Présentation de la communauté OWASP\n 17h45 : Intervention des speakers :\no Sébastien Gioria (DevSecOps Officer chez Lectra) : Les 4,2 facteurs de succès d'un déploiement DevSecOPS a grande échelle\no Tiana Razafindralambo (eShard) : Pourquoi intégrer les tests de sécurité d'apps mobiles dans votre CI/CD ?\no Alexis Cadoret (Security Operations Team Lead - Mirakl) : Implémentation du programme de Bug Bounty\n 18h45 : Questions réponses\n 19h15 : Fin du MeetUp\n\nAttention, nous ne pourrons accueillir que les **20 premiers d'entre vous** !\n\nLe Meetup sera retransmis sur Zoom [https://mirakl.zoom.us/j/93935655056?pwd=VnBhamlzYzdWWDl2UTRmYnVGN0tRUT09](https://protect-us.mimecast.com/s/0IE7CL9RkKckxkDgIBct0S?domain=google.com)\n\nSi des personnes n'arrivent pas à se connecter voici le plan B avec les identifiants de connexion:\n\\* ID : 93935655056\n\\* Code secret : 587422\n\n Merci à Mirakl de nous permettre d'organiser cette première rencontre."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #59 Virtual Edition 2023 - SBOM in eGovernment & OWASP Mentoring",
        "date": "2023-02-22",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/290496214",
        "timezone": "Europe/Berlin",
        "description": "Hi folks, for our OWASP Frankfurt 2023 winter edition, we are looking forward to welcoming you to our next **virtual event**!\n\n_What's going to happen?\nWe look forward to welcoming you to our first OWASP Frankfurt Meetup in 2023, which is going to take place online via Zoom.\n\n_What are we going to talk about?\n\n* _Talk 1 - \"**IT Grundschutz and SBOM Implementation in Multi-Country eGov/eJustice Projects**\" by **Dr. Steffen Schilke**, Information Technology, Product Manager, Project Manager (eJustice) & Gesellschaft für Informatik Rhein Main. In this talk, Dr. Steffen Schilke will show how to apply IT basic protection and SBOM in multi-country projects focused on e-government and e-justice. He discusses a methodology for assigning components and requirements to stakeholders during the modeling phase and baseline security check. He also covers the importance of generating a Software Bill of Material during software development and maintenance.\n* _Talk 2 - \"**OWASP Mentoring Program**\" by **Silvia Gutierrez Puertas,** Silvia is Senior Software Security Developer and IT Security Consultant. She has a Master's Degree in Cybersecurity and Information Security and multiple security certifications from Microsoft and ISC2. As Diversity Advocate, she collaborates in DEI initiatives such as Mentor in WiCyS (Women in Cybersecurity) and Women4Cyber to inspire, engage and advance women in cybersecurity. Silvia will discuss the recent details of our OWASP Mentoring program and how you can get started as a mentor or mentee at OWASP Frankfurt!\n\n_When and Where?\nOur Meetup takes place via Zoom on 22.02.2022 from 18:00 to 20.30 o'clock CEST (ca. 2.5 hours)\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Leads (Dan Gora or Jonas Becker)\n\n_And now?\nPlease save the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this online event!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-03-13",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/291093616",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "OWASP-KC February Stammtisch",
        "date": "2023-02-21",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-kansas-city/events/291668004",
        "timezone": "America/Chicago",
        "description": "Hey all!\n\nThis session we'll be having our very first Stammtisch! For anyone not familiar with a stammtisch this is largely just an informal group meeting with like minded people to sit around and talk shop. There will be no set topic other than general AppSec. So come on out, meet some new people in the industry and share your ideas around all things AppSec!\n\nWe'll have drinks, snacks, and a great people, so join us and be a part of the conversation about general AppSec topics, or share what topics you might like to see talks or speakers present in the future."
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "OWASP March Event",
        "date": "2023-03-17",
        "time": "9:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/291537674",
        "timezone": "Asia/Karachi",
        "description": "TBD"
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "OWASP Feb Event",
        "date": "2023-02-24",
        "time": "9:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/291537658",
        "timezone": "Asia/Karachi",
        "description": "TBD"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "OWASP Limassol Meetup",
        "date": "2023-02-23",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/291266510",
        "timezone": "Asia/Nicosia",
        "description": "**Calling all tech and security enthusiasts!**\n\nWe are excited to announce our upcoming [OWASP Limassol](https://owasp.org/www-chapter-limassol/) meetup. Join us for an evening of cool new ideas and inspiring presentations from industry experts.\nWe'll discuss the latest trends in web application security, share best practices and explore different approaches to building a secure online environment. So come on out and learn something new!\n\nWe look forward to seeing you there and would be delighted to offer a complimentary gift to each attendee!\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19:00 — 19:30 — [Valeriy Shevchenko](https://krevetk0.medium.com), Semrush:\n***Use information about modern attacks to stay safe.***\n19:30 — 20:00 — [Denis Rybin](https://www.linkedin.com/in/denis-r-b9621496/), InDrive:\n***How modern package managers can help you deal with a supply chain attack***\n20:00 — 20:30 — [Anatoly Makovetsky](www.linkedin.com/in/anatoli-m), Pepperstone\n***Security Engineering or Unpopular AppSec***\n20:30 — 21:00 — Entertainment for all the attenders\n21:00 — 22:00 — Eat, drink, networking!\n\nMore information about the speakers is to come!\n[You can also join us on Telegram.](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#02 Building Up",
        "date": "2023-02-28",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/291153982",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on February 28th, 2023, at 18:00, **supported by INESC-ID and AP2SI**.\n\nThe schedule is the following:\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n**18:15** \\- Surface Security: The experience so far and the road ahead by Gustavo Silva\n**19:00** \\- Is it private\\, is it public? Dependency Confusion by Francisco Santos\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Surface Security: The experience so far and the road ahead**\n\nSpeaker:\nGustavo Silva\n\nAbstract:\nAt Paddy Power Betfair (Blip.pt), throughout the years, we have developed a tool to help us have an inventory of all internal assets, from servers to DNS records to endpoint devices, but to also integrate other tools in it, like open source scanners to help us detect vulnerabilities, understand our exposure, weaknesses, and priorities, as well as leverage built-in notifications, a slack bot, and much more.\nThis talk is to talk about this project, which was open-sourced recently, and what the roadmap is for the future.\n\n[Gustavo Silva](https://www.linkedin.com/in/gsilvapt/) Bio:\nSoftware Developer by day, Security Researcher at night. I’m passionate about software security. The niche I am currently working on is engineering processes, tools, and internal interfaces to help companies secure their development lifecycles, do vulnerability management and increase overall awareness of the product's security risks.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Is it private, is it public? Dependency Confusion**\n\nSpeaker:\nFrancisco Santos\n\nAbstract:\nBy 2021, the number of components in the average application rose 77 % from 298 to more than 500 open-source packages. Those components are hosted on public repositories such as GitHub, NPM, or PyPI, while some organizations choose to operate proprietary packages inside private registries of those repositories. Private or public, the management is done by CLI (like npm). The CLI imports private or public packages via a simple precedence algorithm: If the package resides inside the private registry, import it. If not, import the public component. How can a bad actor play this to his advantage?\nThe \"is it private, is it public? Dependency Confusion\" talk explains what dependency confusion is, and teaches ways of finding dependency confusion vulnerabilities in js files via BurpSuite with an automated tool called jsminer, a real example of a dependency confusion bug I found, and recommendations to mitigate those issues. By the end, breakers and makers should acquire a fresh new perspective on this issue.\n\n[Francisco Santos](https://www.linkedin.com/in/francisco-santos-77917a210/) Bio:\nI'm Francisco Santos, 23 years old. I always liked to think out of the box and find weird solutions to problems. I like logic and solving puzzles. I enjoy being a breaker, and I want to add value to that community.\n\nTwitter: https://twitter.com/andr0idp4r4n0id"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2023-02-28",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-london/events/291658747",
        "timezone": "Europe/London",
        "description": "**PLEASE [REGISTER](https://www.eventbrite.co.uk/e/owasp-london-chapter-in-person-meetup-tickets-550592004507) ON EventBrite: [https://www.eventbrite.co.uk/e/owasp-london-chapter-in-person-meetup-tickets-550592004507](https://www.eventbrite.co.uk/e/owasp-london-chapter-in-person-meetup-tickets-550592004507)**\n\nThis event is kindly sponsored and hosted by Monzo. There is limited seating available for in-person attendees. Registration required. Please note that this event will be live-streamed on YouTube for the online audience. Recordings will be available on the OWASP London YouTube channel.\n\n**Venue Location**: Monzo, 5 Appold St, London, EC2A 2AG\n**Nearest Tube:** Liverpool Street - 4 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Sherif Mansour and Andra Lezza\nWelcome and a brief update on OWASP Projects & Events from the OWASP London Chapter Leaders\n\n**Talk 1:** **What I Found When Modelling Threats In The Open (Source), Dan Conn**\nSecure development is hard. Throughout the entire development of an open source project, security needs to be top of mind due to a potential myriad threats. Some open source orgs are starting to ask for security matrices, and expect some threat modelling to have taken place, so that the threats of a system can be evaluated. This however, can be difficult. Considering the different use cases of a project that may be running in different architectures can be quite a struggle, combined with sometimes working with developers that may not be familiar with threat modelling in general. This talk will explore how to make threat modelling easier for open source developers through using open source tools such as OWASP Threat Dragon and Threagile, and where each is better suited than the other.\n\n**Talk 2: An AppSec Point of View On Synthetic Identities, Timur Yunusov**\nIn the era of neobanks with no branches and broadly adopted eKYC standards, the entry barriers for cybercriminals are extremely low. How could FinTech win in this ongoing cat-and-mouse game? How criminals utilise gaps in workflows of the modern payment ecosystem? After looking at mobile applications and the API workflows of dozens of FinTech companies across Europe, the USA and Asia, I will provide real-world examples from both sides of the battle.\n\n**SPEAKERS**\n\n**Dan Conn (@danjconn)**\nDan Conn likes to sit in the point between cyber security and development and over the past 10 years has worked as a developer in small startups, large corporates and many in between, catering for clients both public and private sector from SME size to enterprise. He has also had a strong interest in cybersecurity for just as long culminating in a postgraduate certificate in Advanced Security and Digital Forensics. Dan is now a Developer Advocate for Sonatype. When not coding, hacking, or talking about these things… you can find Dan running, skateboarding, DJ-ing or making music!\n\n**Timur Yunusov (@a66ot)**\nTimur Yunusov, Payment security researcher, an application security expert with a focus on FinTech, and one of the Payment Village organisers. Some of Timur's research in the field of application security includes \"Bruteforce of PHPSESSID\" and \"XML Out-Of-Band\" shown at the Black Hat EU back in 2013 . Timur has previously spoken at conferences such as Black Hat EU, BlackHat USA, HackInTheBox, Nullcon, NoSuchCon, CanSecWest, Hack In Paris, ZeroNights, Positive Hack Days and at OWASP meetups.\n\n**TICKETS**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST [book your place](https://www.eventbrite.co.uk/e/owasp-london-chapter-in-person-meetup-tickets-550592004507) to be admitted to the event by the building security - your name will be checked against the guest list.\n\n###\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously.\nOWASP aims to provide a harassment-free experience for everyone, regardless of gender, sexual orientation, disability, physical appearance, body size, race, age, or religion. We do not tolerate harassment of event participants in any form.\nAdditionally, participating in OWASP events means you shall also adhere to the OWASP Code of Conduct which you can find here: https://owasp.org/www-policy/operational/code-of-conduct"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAR 22, 2023",
        "date": "2023-03-22",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/291304796",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Mobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project\nJoin us for great networking, dinner and drinks, and see a presentation by Brian Reed, Chief Mobility Officer, NowSecure Mobile\n\n**ABSTRACT**: Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. The Web Rocks… but Mobile Rules - Come join us!\n\n**Thanks to our Sponsor**: NowSecure\n\n*Vendors interested in sponsoring send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - FEB 22, 2023",
        "date": "2023-02-22",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/290935113",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Every Risk is Not a CVE: Bolster up Against Software Supply Chain Attacks\nJoin us for great networking, dinner and drinks, and see a presentation by Jamie Scott - Product Manager\n\n**ABSTRACT**: 3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\nWe will present a comprehensive, comprehensible and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy, available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\nFollowing, we will discuss the types of defenses you can put in place to detect and respond to such modern day attacks.\n\n**Thanks to our Sponsor**: Endor Labs\nEndor Labs’ Dependency Lifecycle Management Platform is designed to address the weakest link in software supply chain security: the ungoverned sprawl of open source software in the enterprise. Endor Labs’ mission is to help developers spend less time dealing with security issues and more time accelerating development through safe code reuse. With this solution, development and security teams are able to maximize software reuse by safely evaluating, maintaining, and updating dependencies at scale.\n\n*Vendors interested in sponsoring send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Proactive Security - How do you prevent vulnerabilities",
        "date": "2023-03-07",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/291657572",
        "timezone": "Europe/London",
        "description": "Hello & Welcome\n\nIn this session we'll be discussing Proactive Security. Meaning, how do you empower and enable engineering teams to own their own security to prevent the release of vulnerable code... what would secure coding practices look like, what is security by design, what security testing can teams do during the test & release process. More importantly, what can we put in place to really make the security teams work for their money\n\n**6:00 - Open doors**\n**6:45 - First talk**\n**7:30 - Refreshments**\n**8:00 - Second talk**\n**8:45 - Networking**\n**9:00 - Vacate venue -> to the pub for more socialising**\n\nWe'd like to say THANK YOU to the companies who helped make this event possible\nBarlcays DiSH - Thank you so much for sponsoring the venue\nBeyondTrust - Thank you so much for sponsoring the food & drink\nCytix - Special thanks for making introductions\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\n\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai Online Meetup | 18th March 2023",
        "date": "2023-03-18",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/291680287",
        "timezone": "Asia/Kolkata",
        "description": "Session Details:\nIntroduction to OWASP Mumbai\n\nHow to build an efficient security automation strategy and teams for your organization? **With Prashasth Baliga**\n\nQnA and FeedBack\n\n**Synopsis:**\nThe focus of a security automation strategy is on implementing automated tools and processes to enhance the effectiveness and efficiency of an organization's security operations. The strategy covers several key steps, including identifying security risks and vulnerabilities, evaluating current security operations, setting clear automation goals, selecting the appropriate tools, implementing and testing them, continuously monitoring and improving, training the team, and ensuring compliance with regulations. With security automation, organizations have seen benefits such as improved efficiency and scalability, faster threat detection and response, cost savings, and better decision-making."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "March 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-03-16",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/291470656",
        "timezone": "Europe/Amsterdam",
        "description": "**Delegates may be asked to provide a valid proof of photo ID (such as a driving licence or passport) to enter the venue.**\n\nThis meetup's sponsor, Adyen - a financial services institution - works within a highly regulated environment, so we kindly ask for your understanding if you are asked to provide ID during your visit.\n\n**Location:** Adyen\n**Address:** Rokin 49, Amsterdam\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Crash course on the OWASP API Security Top 10** by **Colin Domoney**\n20:00 - 20:15- **Break with drinks**\n20:15 - 21:00 - **Managing APIs securely** by **Rob Blaauboer**\n\n**Crash course on the OWASP API Security Top 10**\n*Abstract:*\nWith the recent breaches to Optus, Twitter, and T-Mobile, 2023 is destined to become the year API security becomes the number one concern for organizations, both at the board level and within security and development teams. API security poses unique challenges to builders and defenders, and many of your existing detection and protection measures may prove to be ineffective.\n\nJoin Colin as he draws on his experience from curating the industry's biggest API security resource (APISecurity.io) in exploring the following:\nCrash course on the OWASP API Security Top 10 (and how it differs from the OWASP Top 10)\nA whistle-stop tour of some of the biggest API breaches over the past 18 months, taking a look at what went wrong, the impact, and most importantly, how to prevent such attacks.\nFinally, he will present the top techniques for protecting your APIs from attack, starting with secure development practices through to API protection and threat detection.\n\nThe content will be technical, with demos and code samples, and based on real-world breaches. By the end of the session, you will have an understanding of the API Security Top 10, and have a working knowledge of how to protect your APIs, either at a code level or using runtime protections.\n*Bio:*\nColin has a long and varied career in producing secure, rugged, and trustable software and hardware products covering a range of industries from military, consumer, medical, automotive to financial services. In the last decade, he has become a sought-after evangelist and consultant in building AppSec programs, and the latest developments in DevSecOps. His greatest passion is for teaching and inspiring others to produce software we can trust, either delivering webinars, in-person events or speaking to the C-level.\n\nCurrently, he is the Chief Technology Evangelist with 42Crunch, the curator of the APISecurity.io newsletter, and is writing the industry’s first book on defending APIs.\n\n**Managing APIs securely**\n*Abstract:*\nWhen an organization offers an API, the API needs to become a Managed API. This means that lifecycle management, security, and throttling resources become an important aspect of API Management, as well as the ability of developers to find, explore and subscribe to the API to use them.\n\nDuring the presentation, Rob will zoom into these aspects and how an API Manager can help you with security and throttling (including schema validation and advanced scenarios) while at the same time making the API easily available to your target developers (inside or outside the organization).\n\nIn the second part, he will elaborate on the “shiny frontend / dirty backend”. This is an API frontend that accesses legacy systems, databases, but also the integration of a set of APIs etc., thus enabling services that use older technology or proprietary interfaces to have a modern appearance to the outside world, e.g. exposing a legacy insurance policy administration system as an API.\n\nThirdly, we will look at the way you can implement the Mastodon API. Since Elon Musk acquired Twitter l ast year, alternative platforms like Mastodon have become more popular. It might be that this becomes a viable channel to communicate with clients for some organizations.\n*Bio:*\nRob has 30 years of experience in IT in such roles as developer, analyst, project manager, business consultant, and management consultant. He is currently Head of Training Services and Integration Consultant at Yenlo, responsible for the development and the actual training of Yenlo’s clients and consultants.\n\nNext to these responsibilities, Rob is also an avid blogger with almost 200 blogs on innovation on Frankwatching, more than 150 blogs on WSO2 on Yenlo’s website and many other blogs on various other sites. Rob is also a regular contributor to BNR Zaken Doen radio show on the area of technology and innovation.\n\n**Delegates may be asked to provide a valid proof of photo ID (such as a driving licence or passport) to enter the venue.**"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-03-14",
        "time": "8:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291645592",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for March will be **A06:2021 - Vulnerable and Outdated Components.**\n\n**Technical Topic Speaker:** Ruskin Dantra, AWS\n**Talk Title:** Networking Security for Application Developers\n**Synopsis:**\nMicroservices are an integral part of modern application development. As we increasingly adopt distributed services, securing communication between them is crucial.\nIn this talk, you will discover how to strengthen your application network security at multiple layers and achieve continuous compliance visibility. By implementing these practices, you can mitigate potential security risks and ensure the safety and privacy of your users' data.\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Introducing the OWASP Top Ten",
        "date": "2023-02-23",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/291669658",
        "timezone": "America/New_York",
        "description": "OWASP has long been known for its Top Ten relating to common web application vulnerabilities. As more and more applications have been built or moved to the cloud, OWASP has started a new project to capture the risks facing cloud-based applications. The OWASP Cloud Native Top Ten is an initiative identifying the top risks for cloud-native workloads. Cloud-based applications face the common issues on-prem applications deal with and new risks based on cloud vulnerabilities. This talk will cover the project progression, the current Top Ten list, and how companies can use the list to secure their workloads further. It will be a great introduction to cloud risks for security professionals to start using the OWASP project in their work."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Every Risk is Not a CVE: Bolster up Against Software Supply Chain Attacks",
        "date": "2023-02-23",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/291352900",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\n3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\n\nI will present a comprehensive, comprehensible and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy, available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\n\nFollowing, I will discuss the types of defenses you can put in place to detect and respond to such modern day attacks.\n\n### **Code of Conduct**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)\n\n**Thanks to our Sponsor**: [Endor Labs](https://www.endorlabs.com)\nEndor Labs’ Dependency Lifecycle Management Platform is designed to address the weakest link in software supply chain security: the ungoverned sprawl of open source software in the enterprise. Endor Labs’ mission is to help developers spend less time dealing with security issues and more time accelerating development through safe code reuse. With this solution, development and security teams are able to maximize software reuse by safely evaluating, maintaining, and updating dependencies at scale."
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "Purple is the New Black: Modern Approaches to Application Security",
        "date": "2023-02-28",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-oslo/events/291636535",
        "timezone": "Europe/Oslo",
        "description": "**Talk description**\n\nGone are the days when breaches were rare and security could safely be put low on the priority list; product security is now a customer demand and cyber crime has reached epic proportions. Our idolization of hackers, penetration testing and ‘breaking’ has not resulted in secure software for our industry, only egos, stereotypes and unaffordable security models. Modern application security approaches need to address both offensive (red team) and defensive (blue team) approaches, as well as continuous learning and advocacy for developers. This means Purple Team. This talk will explore how to combine defence, offence, automation, empathy and continuous learning, all without the requirement of ever wearing a hoodie. The future of security is PURPLE."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - 1 Mar 2023",
        "date": "2023-03-01",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/291510346",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\n[OWASP](https://owasp.org/) is a worldwide, non-profit organisation focused on application security issues and we are Polish chapter of this initiative.\n\nStarting from this meeting, we are changing our usual agenda a little bit, to give an opportunity to raise more subjects and to have more diverse discussions.\nWe will have one bigger (30 min) presentation and 3-4 shorter \"lightning talks\" with discussion. **If you want to have lightning talk** please let us know in advance by [filling the form](https://forms.gle/7JFiD3z2tKifogvs5). This will help us to plan the meeting.\n\nAgenda:\n\n1. [OWASP Cheat Sheets Series Project](https://cheatsheetseries.owasp.org/). Kuba Maćkowski - project co-leader will introduce you to the project idea and how security cheat sheets could be useful for your daily work - no mater if you are developer, architect or security tester. (about 30 min + discussion)\n2. After the break we will have series of short lightening talks with discussion (typical format is 5-10 minute talk followed by 5-10 minute discussion). [Please submit your proposals](https://forms.gle/7JFiD3z2tKifogvs5)!\nCurrent queue:\n* TBD\n3. Job announcements. If you are an employer, there will be a chance to present who you are looking for.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this link** with friends and in social media."
    },
    {
        "group": "Recife",
        "repo": "www-chapter-recife",
        "name": "OWASP Tempest Tech Sessions",
        "date": "2023-03-16",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-recife-meetup-group/events/291617162",
        "timezone": "America/Recife",
        "description": "O OWASP Recife em conjunto com a Tempest Security Intelligence tem muita alegria em divulgar o terceiro OWASP Tempest Tech Sessions!\n\nO evento é híbrido (presencial + remoto). Corram porque as vagas presenciais são limitadas. Contudo, quem não puder participar presencialmente haverá a opção de participar na modalidade remota através da plataforma Zoom, as vagas para essa modalidade serão ilimitadas.\n\n**TODAS AS INSCRIÇÕES DEVEM SE REALIZADAS ATRAVÉS DA PLATAFORMA EVENT3:**\n[https://www.even3.com.br/tempest-tech-sessions-pos-exploracao/](https://www.even3.com.br/tempest-tech-sessions-pos-exploracao/)\n\nVocê deverá escolher se sua participação será **presencial** ou **remota**.\n\n**Palestra:** Do Cobalt Strike ao Sliver: um panorama sobre as principais ferramentas de pós-exploração usadas por cibercriminosos\n\n**Resumo:** O que os adversários fazem depois de invadir e explorar um sistema? Nessa palestra vamos discutir sobre as principais ferramentas de pós exploração usadas atualmente, abordando também as fases de um ataque com base em frameworks como Cyber Kill Chain e Mitre ATT&CK, o funcionamento de um servidor de comando e controle e as principais estratégias de defesa e detecção.\n\n**Palestrantes:** Wanessa Souza\n**Shortbio:** Wanessa é Analista de Segurança Senior na Tempest, atuando no time de Cyber Threat Intelligence há 5 anos. Com uma paixão a parte pela escrita criativa, Wanessa também é poetisa, astrônoma amadora e ama trocar uma idéia sobre tecnologia, robótica e viagens no tempo.\n**Formato da palestra:** Híbridro - Presencial (com apenas 30 vagas limitadas) e Online, através da plataforma Zoom. O link de acesso à palestra constará aqui na plataforma Even3 e também será enviado para o seu e-mail cadastrado no momento da inscrição.\n\n**Certificado de Participação:** A palestra confere certificado de 2 horas.\nEnviaremos para o seu e-mail em até 48h úteis após a palestra. Para que o certificado seja aceito como horas complementares em sua Instituição de Ensino, é importante que preencha o seu nome completo no momento da inscrição.\n\nEsperamos você na nossa palestra! Até lá!"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec OWASP-SLC (Virtual Meetup in February)",
        "date": "2023-02-23",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/291680114",
        "timezone": "America/Denver",
        "description": "Hi Everyone! We'll meet virtually this month.\n\nWe'll talk through metrics and engaging with management to show AppSec program value. And then we'll take a look at PortSwigger Academy and favorite lessons there.\n\nTopic for Discussion:\n\n* **Metrics to show AppSec program maturity and progression**\n* **Demonstrating value of AppSec program to management**\n* **Security Testing:** Poll for favorite [PortSwigger Academy](https://portswigger.net/web-security) lessons\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nZoom Information:\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-"
    },
    {
        "group": "San Juan",
        "repo": "www-chapter-san-juan",
        "name": "OWASP-SJ CTF Q&A @ HolbertonPR",
        "date": "2023-02-23",
        "time": "1:00-04:00",
        "link": "https://www.meetup.com/meetup-group-jhcesodi/events/291428981",
        "timezone": "America/Puerto_Rico",
        "description": "Join us for our first event, where we will be doing Q&A on the upcoming Capture-The-Flag (CTF) event in early March!\n\nFor those of you who are new to cybersecurity, or new to tech in general, CTF's are a way for us to make the boring stuff more fun. CTF's usually come in two varieties:\n\n* **Jeopardy**: *is a type of cybersecurity competition. In a CTF, participants work to solve challenges that are often based on real-world scenarios, such as finding vulnerabilities in systems or decoding hidden messages. These challenges are usually organized into categories, such as web security, cryptography, or binary exploitation, and participants earn points for each challenge they successfully solve. CTFs are often used as a way for cybersecurity professionals to learn and improve their skills, and they can also be a lot of fun for people who are interested in this field.*\n\n* **Attack & Defense**: *Attack-Defense CTFs are a type of cybersecurity competition where teams are given a set of resources, such as servers or websites, and must defend them from attacks launched by other teams. At the same time, each team must also try to attack and compromise the resources of the other teams. In this type of CTF, points are usually awarded for successfully launching an attack or successfully defending against an attack.*\n\nWe want to be able to live stream the event, so stay tuned into all of OWASP San Juans social media. If you'd like to help promote, sponsor, donate, develop, or collaborate, please checkout our home page where to go!\n\nTo learn more, reach out to a community member, and we hope to see you there at the event!"
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Proactive vs. Reactive AppSec",
        "date": "2023-03-02",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/santa-barbara-owasp-chapter/events/291688284",
        "timezone": "America/Los_Angeles",
        "description": "OWASP SB and GitHub have joined forces to bring you the first security meetup of the year in beautiful Santa Barbara. Come join the local AppSec/InfoSec community for a great evening of technical talks and mindful networking. Dinner will be provided.\n\n**Event Agenda**\n05.30pm -- Event kickoff, with dinner and networking.\n06.00pm -- Announcements, by W. Martín Villalba (OWASP SB).\n06.15pm -- Intro to GitHub Advanced Security, by Levy Forchheimer (GitHub).\n06.30pm -- Proactive vs. Reactive AppSec, by Ravi Gadhia (GitHub).\n07.30pm -- BYOT / Networking.\n08.30pm -- Event end.\n\n**Proactive vs. Reactive AppSec - Abstract**\nMost security findings are discovered after the code has been committed to your main branch. Meaning they will be part of your security tech debt that often takes months to fix. In this talk, learn how you can shift your security approach from reactive to proactive and prevent security weaknesses from ever making it into your code.\n\n**Ravi Gadhia - Bio**\nRavi Gadhia is a technologist who began his career as a chip designer and found his way to customer-facing roles in the software industry. His primary areas of expertise are in software development, collaboration tools, and cloud native platforms. Ravi is currently Director of a Solutions Engineering at GitHub where he leads a technical sales team in the Western US.\n\n**Levy Forchheimer - Bio**\nLevy Forchheimer is an Enterprise Account Executive at GitHub. He's been in AppSec for nearly a decade and his expertise spans DevOps, SCA and Secret Management.\n\n**BYOT: Bring Your Own Topic**\nThis meeting is a great chance to ask for technical help, career advice, share new ideas, look for feedback, and discuss anything related to AppSec/InfoSec.\n\n**Location**\nKiva Cowork - Funk Zone, 10 E Yanonali St, Santa Barbara, CA. The front door will be kept open for the duration of the event. If you have any trouble getting in, please do not leave, just knock on the front/side doors and/or message us through this platform.\n\nLooking forward to seeing you all!\n\nMartín\nOWASP SB Leader"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-03-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/291660918",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - February 2023",
        "date": "2023-02-28",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291186385",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter | Q1 2023 | Lunch and Speaker Event",
        "date": "2023-02-24",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/290897847",
        "timezone": "America/New_York",
        "description": "Welcome to OWASP Tampa Chapter \\| Q1 2023 \\| Lunch and Speaker Event\n\nTitle: **Build a Roadmap for Your Dream Career in Cybersecurity**\n\nAbstract: Don’t rely on luck or hope; create a strategy to navigate your path to your dream role in cyber. Whether you want to lead the top NSA Red Team, build software to mitigate zero-day attacks, become a CISO, take a startup to IPO, or have a seat in the Boardroom, you need a plan. Beyond core skills getting that dream role requires the right mindset, specific communication skills, and growing your personal brand.\n\nSpeaker: Joy Randels is an Entrepreneur, current CEO of Prowess Group & New Market Partners, she’s named Top 100 Female Speaker, Board Director and so much more in the Cybersecurity community! Joy was recently selected as one of only 54 of Florida’s most influential executives in the Finance & Insurance category and one of five in venture capital.\n\nRegistration Page: https://www.eventbrite.com/e/owasp-tampa-chapter-q1-lunch-and-speaker-event-2023-tickets-510875942697\n\nLocation:\n\n* This is an in-person event only, no streaming available.\n* **8th Floor, John P Lowth Entrepreneur Center, University of Tampa** -**Public (non-student, free) Parking available directly across from the John P Lowth Entrepreneur Center**\n\nAGENDA:\n\n* Announcements\n* Guest Speaker\n* Ajourn"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto x Security Innovation | CMD+CTRL Cyber Range CTF",
        "date": "2023-02-23",
        "time": "8:30-05:00",
        "link": "https://www.meetup.com/owasp-toronto/events/291468476",
        "timezone": "America/Toronto",
        "description": "**EVENT**\n\n**CMD+CTRL Cyber Range CTF**\n\n**Summary:**\n\n**Want to tap into your inner evildoer and test your skills in hunting down web application vulnerabilities?**\nIf so, immerse yourself in the industry’s most authentic environment where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense is all about thinking on your feet. For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard as you vie for the top spot!\nThe CMD+CTRL Cyber Range is ideal for anyone interested in learning how web applications are attacked, furthering their cybersecurity acumen, or honing the skills needed to protect the enterprise. From curious bystanders to active practitioners to Risk and Security Executives, there’s something for everyone.\n\n**Hosts:**\n\n**Geoff Vaughan** is an Application & IT Security expert helping companies secure software and devices throughout all stages of development with Security Innovation. He is passionate about ensuring that software is safe to use for both businesses and end-users alike. Geoff is excited to lead this OWASP chapter through a cyber range and give them the chance to become the attacker.\n\n***Who is Security Innovation? ***\nEveryone wants to solve cybersecurity software challenges and go beyond reactive (but necessary) stopgaps. However, most security providers address symptoms and not the root cause. Security Innovation’s approach is different – by pragmatically transferring our security expertise across all software security stakeholders, from developers to the C-suite, we help teams get smarter about software security so they are prepared for future challenges. We are able to do this because as a SaaS and assessment provider, we face the same threats our clients do. We also understand the challenges of taking a risk-based approach to software development and operations."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Building a Security Program & Preparing for a Breach",
        "date": "2023-02-23",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasptriangle/events/290897948",
        "timezone": "America/New_York",
        "description": "The world of technology is evolving, and so is the threat landscape. This talk will remind us that security initiatives may be seen as overhead for most companies and how we can change the narrative. We will discuss methods that will save the company money in the long run by partnering with Finance, Business Operations, and DevOps (Modern IT Function). This will provide a strategic roadmap curated through real-life experience and some of the best practices to prepare for 2023 and beyond. Let's succeed by understanding what's important to the shot callers!"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Tracing webapp exploitability through code review and taint analysis",
        "date": "2023-03-16",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248491",
        "timezone": "America/Vancouver",
        "description": "**Title**: Tracing webapp exploitability through code review and taint analysis\n**Speaker**: Dana Epp\n\nCome learn how to look at your web apps and APIs more offensively to discover the exploitability of your code before your adversaries do.\n\nThis event is sponsored by **Forward Security** \\- thanks for providing us space and food\\."
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Empathy-led Product Security",
        "date": "2023-02-24",
        "time": "0:00-05:00",
        "link": "https://www.meetup.com/owasp-devslop-project/events/291725376",
        "timezone": "America/Toronto",
        "description": "Is it possible for a hacker to empathetically work with software teams?\nWhat does this even mean? How do you grow from Pentesting or AppSec into Product Security?\n\nChristian has been involved in the security industry for a bit (meaning: he's job hopped a lot), and always comes back around to the importance of people relationships and empathetic collaboration when you're trying to get sh\\*t done, securely."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #59 Virtual Edition 2023 - SBOM in eGovernment & OWASP Mentoring",
        "date": "2023-02-22",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/290496214",
        "timezone": "Europe/Berlin",
        "description": "Hi folks, for our OWASP Frankfurt 2023 winter edition, we are looking forward to welcoming you to our next **virtual event**!\n\n_What's going to happen?\nWe look forward to welcoming you to our first OWASP Frankfurt Meetup in 2023, which is going to take place online via Zoom.\n\n_What are we going to talk about?\n\n* _Talk 1 - \"**IT Grundschutz and SBOM Implementation in Multi-Country eGov/eJustice Projects**\" by **Dr. Steffen Schilke**, Information Technology, Product Manager, Project Manager (eJustice) & Gesellschaft für Informatik Rhein Main. In this talk, Dr. Steffen Schilke will show how to apply IT basic protection and SBOM in multi-country projects focused on e-government and e-justice. He discusses a methodology for assigning components and requirements to stakeholders during the modeling phase and baseline security check. He also covers the importance of generating a Software Bill of Material during software development and maintenance.\n* _Talk 2 - \"**OWASP Mentoring Program**\" by **Silvia Gutierrez Puertas,** Silvia is Senior Software Security Developer and IT Security Consultant. She has a Master's Degree in Cybersecurity and Information Security and multiple security certifications from Microsoft and ISC2. As Diversity Advocate, she collaborates in DEI initiatives such as Mentor in WiCyS (Women in Cybersecurity) and Women4Cyber to inspire, engage and advance women in cybersecurity. Silvia will discuss the recent details of our OWASP Mentoring program and how you can get started as a mentor or mentee at OWASP Frankfurt!\n\n_When and Where?\nOur Meetup takes place via Zoom on 22.02.2022 from 18:00 to 20.30 o'clock CEST (ca. 2.5 hours)\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Leads (Dan Gora or Jonas Becker)\n\n_And now?\nPlease save the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this online event!"
    }
]