[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-04-04",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536935",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-03-28",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536930",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - March 2024 (Online)",
        "date": "2024-03-26",
        "time": "11:45-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298206989",
        "timezone": "America/Chicago",
        "description": "Room opens at 11:30 AM CDT, there will be 30 minutes of meet-and-greet and Chapter information, then the Presentation!\nIf you would like to attend in person, please register here -- [Eventbrite (in-person)](https://www.eventbrite.com/e/owasp-austin-chapter-monthly-meeting-march-2024-tickets-860134073167?aff=oddtdtcreator)\n\nPresentation: **Protecting Sources and Methods – The Magic of Runtime Security**\n\nDescription\nIn this talk, we’re going to dive into “runtime security” – a powerful technology that automatically adds powerful trust boundaries to these dangerous methods without requiring any code or process changes. Runtime security enables all four of these key capabilities:\n\nFinding zero-day vulnerabilities in custom code and libraries in real time\nFinding known vulnerabilities in libraries and understanding their exploitability\nPreventing vulnerabilities from being exploited in production\nCreating a digital blueprint of security to drive threat modeling, penetration testing, and risk management\n\nIn essence, Runtime Security is a comprehensive approach to app/API security that can replace your suite of legacy tools. Runtime security is already in use in hundreds of thousands of critical apps/APIs in some of the biggest companies in the world. During our session, you’ll learn how to use Runtime Security to streamline application security, accelerate innovation, and improve security at the same time.\n\nSpeaker:\nJeff Williams"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-03-21",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299533849",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "March 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-03-14",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299104332",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, March 14th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [IriusRisk](https://www.iriusrisk.com)\n*We make secure design the standard, scalable practice for all digital teams. IriusRisk makes secure design fast, reliable and accessible, even to non-security users, thanks to our automated and intelligent Threat Modeling Solution.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-03-14",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299385052",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "March Meetup",
        "date": "2024-03-19",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/299576398",
        "timezone": "America/Los_Angeles",
        "description": "We're thrilled to announce our March meetup, graciously hosted by the fantastic teams at P0 Security and Endor Labs. Look forward to some outstanding talks, fantastic food/ beverages and meet best brains in the industry.\n\nAgenda:\n5:00 - Check in, grab some food/drinks and network\n5:45 - 6:30 - 10 insecure-by-default IAM configurations in AWS and GCP\n6:30-7:15 - Guardians and Glitches: Navigating the Duality of Gen AI in AppSec\n7:15 - 8:00 - Top 10 Open Source Software (OSS) Risks\n8:00 - Doors close\n\n**Talk #1**: 10 insecure-by-default IAM configurations in AWS and GCP\n**Abstract**: This presentation delves into the ten most prevalent insecure-by-default IAM configurations encountered on AWS and GCP. Notable examples include the default compute service account assuming an Editor role in GCP. We'll identify these vulnerabilities and offer practical strategies for easy mitigation. By addressing these common pitfalls, security teams can enhance security posture by removing the risk inherent in the default configuration.\n\n**Speaker**: Gergely Danyi is co-founder and CTO at P0 Security where he is on a mission to make cloud entitlements more secure. Previously, he worked at Splunk and wore a data scientist hat at multiple start-ups.\n\n\\*\\*Talk2#\\*\\*Guardians and Glitches: Navigating the Duality of Gen AI in AppSec\n**Abstract:** The speaker will present a Tale of Two AIs. First, we'll delve into the intricacies of Gen AI and then discuss the unique security risks posed by Gen AI, including adversarial attacks, unintended biases, and emergent behaviors. We'll then explore how Gen AI can be utilized to strengthen security defenses by automating vulnerability detection, assisting in threat analysis, and even generating secure code. This talk will equip you with the knowledge to navigate the complex landscape of Gen AI security by building an adoption friendly responsible AI program at your organization. Join us as we explore the glitches and the guardians, and discover how to leverage the power of Gen AI to secure your applications in the future.\n\n**Talk #3:** Top 10 Open Source Software (OSS) Risks\n**Abstract:** This talk will feature the Top 10 OSS Risks ([https://www.endorlabs.com/top-10-open-source-risks](https://www.endorlabs.com/top-10-open-source-risks)) and include examples and case studies of notable OSS incidents tied to the risks discussed. It will also provide actionable takeaways for security and technology leaders to equip them to securely consume and utilize OSS in their enterprise environments and software/products while mitigating some of the most relevant risks associated with OSS.\n\\*\\*Speaker:\\*\\*TBD"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "AppSec: Where to Start, and Some Free, Easy Wins",
        "date": "2024-03-14",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/298999635",
        "timezone": "Australia/Brisbane",
        "description": "With a limited supply of potential hires and an already maxed security budget, how do we begin to tackle Application Security (AppSec)?\n\nThis talk will attempt to help provide some direction when it comes to solving this problem. It is aimed at security folks and developers of all skill levels who are interested in getting their feet wet with AppSec.\n\nDuring the talk we will first explore an industry framework that can help guide the first few steps in our journey. Then, we will dive into a demo and highlight some of the fantastic free and open-source tools that we can use to demonstrate value and rack up a few easy and impactful wins."
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "OWASP Chapter Meetup - March",
        "date": "2024-03-24",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/299617107",
        "timezone": "Asia/Kolkata",
        "description": " Delve into the world of cybersecurity with OWASP Chennai Chapter! Our lineup features a diverse range of sessions designed to deepen your understanding and foster collaboration within the community. From enlightening keynote insights to hands-on hacking experiences, this event promises something for everyone. Network with industry professionals, participate in insightful discussions, and expand your knowledge in a supportive environment. Don't miss out on this opportunity to connect, learn, and grow together. Plus, don't forget to grab your chance to win exciting giveaways from HackTheBox! In celebration of Women's Day, we have a special panel discussion highlighting the invaluable contributions of women in information security.\n\nBe sure to register through the provided Google Forms link below\n\n**Registration Form - https://forms.gle/r7cVer2YCPsrgz969**"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS March 2024",
        "date": "2024-03-28",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/299683641",
        "timezone": "America/Denver",
        "description": "Speaker: Jason Haddix: TBD\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "From SBOMs to F-Bombs: Vulnerability Analysis, and False Positives & Negatives",
        "date": "2024-03-21",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295370660",
        "timezone": "America/New_York",
        "description": "Managing vulnerabilities in third party software has become an important application security activity. Vulnerabilities like Log4Shell and various supply chain attacks such as SolarWinds or CodeCov and numerous others have given many of us haunting nightmares resulting us sleeping with one eye open. Fortunately, Software Composition Analysis (SCA) tools coupled with Software Bill of Materials (SBOMs) have done so much to relieve that anxiety. Or not. This talk explores the vulnerability management process through the eyes of a FOSS security library provider and examines what we can do as AppSec engineers and developers to make the whole process a bit less painful."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP March Meet - In person",
        "date": "2024-03-19",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/299474646",
        "timezone": "America/Chicago",
        "description": "\\*\\*\\*\\*Appsec in an AI-powered world\\*\\*\\*\\*\\*\n\nIn this bold new age of artificial intelligence, software is evolving at a blistering pace. From AI-generated code to automated devops to ingenious new AI applications, innovation is accelerating. Businesses across every industry stand to gain enormously in productivity and efficiency. However, with such great power comes great risk. As AI accelerates the pace of software innovation, it also increases the prevalence of vulnerabilities and exploits.\nGiven that application security teams are often under-resourced and equipped with weak technologies... What can they do to manage the inevitable complexity introduced by AI? This interactive talk will lay out the escalating challenges for application security and engineering teams while offering some practical solutions."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "Protecting Our Tech: Fortinet's OT Security Talk at OWASP Edm 5PM mst! ",
        "date": "2024-03-26",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/299499883",
        "timezone": "America/Edmonton",
        "description": "**Time:** 5:00PM - 7:00PM MST\n**Date:** March 26th 2024\n**Location:** Concordia University Robert Tegler Hall\n\n**ISC2 will be offering 1 CPE** credit to all attendees at this event and you must RSVP.\n\n**Event Description:**\n Join us for an exhilarating evening at OWASP Edmonton hosted amidst the picturesque setting of Concordia Universities Robert Tegler Hall!  **Fortinet** is thrilled to bring you an unforgettable experience, complete with insightful discussions, delightful refreshments, and exciting door prizes! \n\n Get ready to delve into the fascinating world of Operational Technology (OT) Security with our distinguished speaker, Jeff Brown! With over two decades of invaluable experience in the field, Jeff serves as the Regional Manager of Operational Technology at Fortinet.  His expertise promises to enlighten and empower attendees with profound insights into the intricacies of OT Security.\n\n**Culinary Note:**\n Prepare your taste buds for a culinary journey as **Fortinet** brings in a top-notch catering company to ensure that every attendee is well-fed and energized throughout the event! \n\n**Final Notes:**\nDon't miss out on this incredible opportunity to expand your knowledge, connect with industry peers, and indulge in delectable treats!  Remember to **RSVP to secure your spot** for catering and to stand a chance to win exciting door prizes! \n\nMark your calendars and join us for an evening of education, networking, and fun at OWASP Edmonton! See you there! "
    },
    {
        "group": "Fortaleza",
        "repo": "www-chapter-fortaleza",
        "name": "OWASP Fortaleza - Chapter Meetup 2024.1",
        "date": "2024-04-06",
        "time": "09:00-03:00",
        "link": "https://www.meetup.com/owasp-fortaleza/events/299259416",
        "timezone": "America/Fortaleza",
        "description": "Anunciamos oficialmente nosso primeiro encontro em 2024 da comunidade OWASP Fortaleza.\n\nGaranta sua vaga.\n\n**Teremos:**\nPalestras,\nCTF,\nSorteios de cursos\n\nEm breve mais informações."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Mars 2024",
        "date": "2024-03-21",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/299650924",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **GitGuardian** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "Software-Supply-Chain Security in Practice",
        "date": "2024-03-19",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/299235247",
        "timezone": "Europe/Berlin",
        "description": "Moin in die Runde,\n\nwe will continue with a talk in German.\n\nIm März haben wir Stephan Kaps zu Gast. Er ist engagiert in der Java User Group Bonn und arbeitet für eine Bundesbehörde. Er hatte einen ähnlichen Vortrag beim letzten German OWASP Day gehalten.\n\nZu Gast sind wir wieder zentral bei Check24, am Anfang der Außenalster (Nähe Hotel Atlantic) In Fußmarschentfernung vom Hauptbahnhof.\n\nAus planungstechnischen Gründen unseres Hosts sag mir bitte per Mail oder hier bei Meetup Bescheid, wenn du dazustoßen möchtest.\n\n# **TL;DR**\n\nTitel: „Software-Supply-Chain Security in Practice“\nSprecher: Stephan Kaps\nLokation: Check24, An der Alster 64, 20099 Hamburg\nStart: 19.3.2024, Einlass ab 18:30 Uhr, Start 19:00 Uhr . *Bitte pünktlich sein!*\nNetworking danach: TBD\n\n# **Abstract**\n\nSchwachstellen in Bibliotheken sorgen spätestens seit Log4J aus Dezember 2021 regelmäßig für Überstunden in IT-Abteilungen. Doch was haben wir daraus gelernt? Haben wir Erkenntnisse gewonnen oder Maßnahmen ergriffen, um bei der nächsten Zero-Day Vulnerability effizienter agieren zu können? Können wir schneller herausfinden, in welchen Produkten eine Bibliothek in einer bestimmten Version verwendet wird (SBOM)?\n\nIn diesem Vortrag zeige ich euch, wie ihr einen Beipackzettel für eure Software erstellen könnt und diese Aktion in euren Build- oder Deploy-Prozess integriert (DevSecOps). Darüber hinaus stelle ich ein Open-Source Werkzeug vor, um diese Infos aus diversen Produkten an einer zentralen Stelle auf Verwundbarkeiten hin zu überprüfen und wie ein solches Tool bei der kontinuierlichen Software Composition Analysis (SCA) unterstützt, um Risiken in der Software Supply Chain frühzeitig zu identifizieren.\n\nZusätzlich werde ich zeigen, welche Maßnahmen noch sinnvoll und notwendig sind, um eine sichere Software-Supply-Chain zu etablieren: vom ersten Commit bis zum Deployment in Produktion.\n\n# **Generelles zum OWASP-Stammtisch**\n\nBei unseren offenen Treffen geht es um Software und deren Sicherheit im Internet und/oder IT-Security allgemein. Hier treffen sich Menschen, die sich beruflich oder privat mit IT-Sicherheit beschäftigen: Entwickler, Manager, „Pentester“ und alle an (Web)sicherheit interessierte. Die Atmosphäre ist offen und locker. Uns geht's um den Erfahrungsaustausch, Technikschnack und um's Netzwerken. Wer Produkte oder Dienstleistungen verkaufen will, ist hier falsch. Ihr seid herzlich willkommen, euren Kollegen oder Bekannten einen Hinweis auf unsere Treffen weiterzuleiten. Alle Treffen sind frei, für jeden offen und kostenlos.\n\nSchönen Gruß, Björn / Dirk"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg PyPI security and TruffleHog Disclosure",
        "date": "2024-03-21",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/299361118",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Omegapoint's office for an intriguing evening with food and drinks, and talks about PyPI security and a disclosure of security issues in TruffleHog!**\n\n**Where:** Omegapoint, Rosenlundsgatan 3, 411 20 Göteborg\n\n**Agenda:**\n**17:00 - 17:30:** Welcome to Omegapoint\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n**17:45 - 18:30:** *PyPI Security: Past, Present & Future*\nThe talk will be about PyPI's security stance, from the point of view of a\nfree software maintainer: 2FA, tokens and authentication.\nThe changes they did, the mistakes along the way, changes that are a work in progress and speculation on changes they will introduce in the future.\n**Salvo Tomaselli** is the sole maintainer of a critical python library.\nAlso small time free software contributor, Debian developer, IRC dweller, GPG holdout. Has worked in Gothenburg for a network security company for the past years.\nEnjoys jamming music, participating in flame wars and talking too loud.\n\n**18:30 - 19:15:** Food & Drinks\n\n**19:15 - 20:00:** *TruffleHog Security Issue Disclosure*\nThis presentation covers a set of security issues in TruffleHog, an open source, automated security tool that scans code repositories and configuration files for active secrets. The session provides a detailed walkthrough with several live demos, showing how the tool can be exploited to remotely harvest credentials from anyone running a default installation of TruffleHog v3. This presentation is part of a coordinated disclosure together with Truffle Security, the team behind TruffleHog.\n**Helena Rosenzweig** is a security researcher and software engineer at Omegapoint, focusing on application security for client projects. She has a keen interest in building secure and scalable software but is equally intrigued by all the things that can go wrong.\n\n**20:00 - 21:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-03-18",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/298995347",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kannur",
        "repo": "www-chapter-kannur",
        "name": "Secure Your Web Applications: OWASP Kannur Meetup",
        "date": "2024-03-23",
        "time": "19:00+05:30",
        "link": "https://www.meetup.com/owasp-kannur/events/299695604",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an insightful session on securing web applications at the upcoming OWASP Kannur meetup. In this event, we will delve into the critical aspects of web security, application security, and software security. Our experienced speakers will share valuable insights on penetration testing and cybersecurity practices, helping you fortify your defenses against cyber threats.\n\nDon't miss this opportunity to learn from industry experts and network with like-minded professionals. Whether you are a seasoned cybersecurity practitioner or someone looking to enhance your knowledge on OWASP best practices, this event is tailored for you. Let's come together to strengthen our understanding of web application security and stay ahead of potential risks. Mark your calendars and join us for an evening dedicated to enhancing your expertise in software security."
    },
    {
        "group": "Kerala",
        "repo": "www-chapter-kerala",
        "name": "OWASP Kerala Chapter Meet  Mar 2024",
        "date": "2024-03-16",
        "time": "14:30+05:30",
        "link": "https://www.meetup.com/owasp-kerala-chapter/events/299725501",
        "timezone": "Asia/Kolkata",
        "description": "**OWASP Kerala Chapter Meet Mar 2024**\n\n**Topic : Threat Hunting in OKTA**\nAnalyzing Okta logs provides vital insights into their structure and event attributes. These insights, coupled with discussions on strategies, can empower Security Operations Centers (SOCs) to effectively address threats within their Identity and Access Management (IAM) environment. Key threats such as account and session hijacking, tenant takeovers, and MFA fatigue can be identified and mitigated through Okta log analysis. It plays a crucial role in detecting and preventing cyber identity threats.\n\n**Speaker : Devpriya T S**\nDevpriya T S , Is a Senior Security Consultant at EY with a background as an engineering lead in SOAR. Her expertise encompasses Splunk SOAR, SIEM, and Cortex XSOAR, offering proactive solutions to counter emerging cybersecurity threats. With a knack for Python programming, she is recognized for significant contributions in automation and application development within the cybersecurity domain. She is dedicated to ensuring the robustness of digital security and staying abreast of emerging threats.\n\n**Topic : Securing AI/ML applications**\n\nAI is being integrated more and more into our technologically driven environment in everything from predictive analytics to advacned use cases such as self-driving cars. But as AI systems become more complicated and powerful, they also become more prospective targets for hackers.The security of AI systems must be ensured because any breach could have serious repercussions. Aim of this session is to highlight the importance of securing AI models, exploring the techniques and best practices involved, and advocating for a holistic approach to AI security\n\n**About: Vivek**\n\nVivek is an experienced professional in the field of cyber security. With a degree in M-Tech in Cyber Forensics and Information Security from CUSAT, as well as professional certifications including CEH, ECSA, and CIPM, Vivekchandran has over 9+ years of expertise in the field. He has worked with numerous MNC clients from a variety of industries, including telecom, media, broadcasting, healthcare, finance, and automotive, providing them with valuable insights and solutions for their cyber security requirements. Currently as a freelance security consultant Vive is focused on the cybersecurity requirements for emerging technologies like artificial intelligence and internet of things."
    },
    {
        "group": "Klagenfurt",
        "repo": "www-chapter-klagenfurt",
        "name": "OWASP Klagenfurt Meet&Greet",
        "date": "2024-04-02",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-klagenfurt-chapter/events/299488785",
        "timezone": "Europe/Vienna",
        "description": "Willkommen zu unserem ersten OWASP-Meetup in Klagenfurt!\n\nBei diesem Treffen steht das Thema Sicherheit im Mittelpunkt, wobei wir einen besonderen Fokus auf App- und Web-Sicherheit legen möchten. Wir sind jedoch nicht nur auf diese Themen beschränkt und freuen uns, auch über andere Bereiche der Sicherheit zu diskutieren, die Euch interessieren.\n\n**Agenda:**\nBegrüßung und Vorstellung (15 Minuten): Wir beginnen mit einer kurzen Vorstellung der OWASP Foundation und ihrer Ziele. Für alle, die neu sind, bietet dies eine hervorragende Gelegenheit, mehr über die Organisation und ihre Bedeutung in der Welt der Sicherheit zu erfahren.\nOffener Austausch: Nach der Vorstellung möchten wir die Gelegenheit nutzen, um in einer gemütlichen Runde zusammenzusitzen. Hier könnt Ihr Eure Wünsche und Interessen für die Themen der nächsten Meetups einbringen. Egal, ob Ihr Fragen habt, über Herausforderungen in Euren Projekten sprechen möchtet oder einfach nur neugierig auf bestimmte Sicherheitsthemen seid – dieser Teil des Meetups ist für Euch.\nPlanung der nächsten Schritte: Basierend auf Eurem Feedback und Euren Interessen planen wir die Inhalte für die kommenden Treffen. Uns ist es wichtig, dass die Meetups für alle Teilnehmenden wertvoll und informativ sind.\n\n**Für wen ist das Meetup?**\nDieses Treffen ist für alle gedacht, die sich für die Sicherheit von Anwendungen und Web interessieren – vom Anfänger bis zum Experten. Egal, ob Ihr Entwickler, IT-Sicherheitsexperten oder einfach nur an Sicherheitsthemen interessiert seid, Ihr seid herzlich willkommen.\nWir freuen uns darauf, eine offene und engagierte Gemeinschaft zu bilden, in der Wissen und Erfahrungen zum Thema Sicherheit geteilt werden.\nBringt Eure Fragen, Euer Wissen und Eure Neugier mit – gemeinsam machen wir das Internet ein Stück sicherer.\n\nWir freuen uns auf Euch!\n\nPS: Let us know if you are an English speaker, as we are open to hosting this event in English too."
    },
    {
        "group": "Ljubljana",
        "repo": "www-chapter-ljubljana",
        "name": "Do WAFs make sense?",
        "date": "2024-03-21",
        "time": "16:30+01:00",
        "link": "https://www.meetup.com/owasp-ljubljana-chapter/events/299194709",
        "timezone": "Europe/Belgrade",
        "description": "You might have heard about 'WAFs' (web application firewalls) from someone cold emailing you a commercial offer, or you might have heard about mod_security. Not sure what they are about and how they “secure” you? Say no more. In this presentation, we will delve into the realm of Web Application Firewalls, sparked by encounters with commercial vendors and open-source solutions like mod_security. Join us as we unravel the intricacies of WAFs, understanding what and how they 'firewall', and some techniques on how to bypass them, all in an effort to demystify their role in today’s security landscape."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Vulnerability Reachability Analysis Using OSS Tools w/ OWASP LA",
        "date": "2024-03-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/299456168",
        "timezone": "America/Los_Angeles",
        "description": "**Hands on Workshop** \"Vulnerability Reachability Analysis Using OSS Tools\"\n\nHello AppSec teams and tech enthusiasts! We're thrilled to roll out an exceptional DevSecOps workshop in collaboration with **OWASP LA** and offered by [deepfactor](https://www.deepfactor.io/). This workshop will walk you through the process of using runtime analysis using OSS (Open Source Software) tools to identify which vulnerable components in an application are actually loaded into memory and, therefore, represent a higher risk to your business. You’ll learn how to be a hero in your organization by helping your dev teams save time and fix a significantly smaller number of high-risk vulnerabilities!.\n\n## **Abstract**\n\nNew vulnerabilities are disclosed every day in dependencies that you or your team may be using. But how do you know if you are actually using the vulnerable code? This workshop will show you how to use two different types of tools to analyze reachability (1) static call graphs and (2) runtime analysis, and help in deciding if the vulnerability needs to be prioritized based on your own code usage.\n\n## **Workshop Overview**\n\nThe workshop will be broken into several modules; introductory modules will cover the workshop organization and administrative matters (installing and configuring the tools used in the workshop). Subsequent modules will give an outline of what vulnerability reachability is and why it is important and compare/contrast the two main ways of understanding reachability (static call graphs and runtime analysis).\n\nNext, the workshop will present two short exercises, intended for the attendees to gain hands-on experience using both types of tools against real applications with real vulnerabilities. Interpreted languages (Java) and compiled languages (C/C++/Go) will be covered. Subsequently, the following module will walk through how to interpret the results obtained from the exercises and draw conclusions. The languages chosen are merely representative; the skills learned in the workshop are equally applicable to other languages.\n\nThe workshop will conclude with two modules which will present a short overview of commercial tools and a conclusion/wrap-up/Q&A session.\n\n## **Outcome/Learnings**\n\n* Understand what vulnerability reachability is and why it is important\n* Compare/contrast the two main ways of understanding reachability (static call graphs and runtime analysis)\n* Via hands-on experience, use both types of tools against real applications with real vulnerabilities. Interpreted languages (Java) and compiled languages (C/C++/Go) will be covered.\n* Learn how to interpret the results obtained from the exercises and draw conclusions\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAR 27, 2024",
        "date": "2024-03-27",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297895073",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Decoding Compliance to Empower Developers\nJoin us for great networking, dinner and drinks, and see a presentation by **Karina Klever**, President and Founder, **Klever Compliance**\n\n**ABSTRACT**: You just got asked to implement controls supporting HIPAA. Or GLBA. Or GDPR. Or SOX. Or ISO27001. Or whatever other acronym soup regulation or framework pertinent at your company. What now?! Most companies have requirements to be compliant, but lots of us working at these companies don’t know where to start or how to show that we are following these guidelines.\nJoin us to understand guideline constructs, their purpose, and how to best appropriate to your company. We’ll go over a high-level lifecycle of the GRC process to understand the significance of specificity and supportive evidence gathering instructions within your own published documents. As a bonus, we’ll quickly review some recent regulations and publications that may impact your role directly – Everyone is talking about the AI related ones!\nThis session will aim to equip you with a compass that will help you navigate GRC regulations, frameworks, conversations, requirements, preparedness and remediations involved with this frequently ethereal topic. Bring your questions for this interactive event!\n\n**Thanks to our Sponsor**: *[Elite Technical Concierge](https://etc.limited/)*\n*As a Keynote Speaker, Coach Mel unifies his Puerto Rican roots, being raised in NY, with his California lifestyle to bring educational, incredibly entertaining, and motivatingly empowering speeches.*\n*With nearly two decades of coaching experience, Coach Mel can lead individuals and teams to new heights while supporting mastermind sessions for targeted verticals.*\n*With a deep understanding of the IT, Cybersecurity, and Startup landscapes, our training empowers executives to forge resilient teams.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "March 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-03-21",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/299257952",
        "timezone": "Europe/Amsterdam",
        "description": "See [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **How to get Dev(Ops) teams to start adopting DevSecOps** by **Sebastiaan Rijnbout**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Cracking the API: Challenges in IoT and Modern Applications** by **Yianna Paris**\n\n**How to get Dev(Ops) teams to start adopting DevSecOps**\n*Abstract:*\nIn many development environments, security has long been seen as an afterthought or even a right-out hindrance. And forcing security onto developers often has an adverse effect. In this talk we will share the journey we have been making at the Dutch Chamber of Commerce (KVK) to get Development teams to adopt DevSecOps in a way that works best for them. Topics that will be discussed include Secure Development training, Security Champions, Threat Modeling and using the right tooling.\n\n*Bio:*\nSebastiaan Rijnbout has a background as .NET developer and has worked in that field for over 12 years, but since 2017 he has started focusing on AppSec and Dev(Sec)Ops.\n\nWhen getting teams and organisations to adopt DevSecOps, Sebastiaan will look at all aspects of DevSecOps (People, Process and Technology) like setting up developer training programs and security champion programs, rolling out company-wide Security tooling and improving working processes. But always keeping a focus on making things easy and efficient for developers.\n\nIn his current role at the Dutch Chamber of Commerce (KVK) Sebastiaan acts as Product Owner for 4 Dev(Sec)Ops support teams. These teams are responsible for enabling all development teams at KVK to deliver secure and high-quality software as efficiently as possible.\n\n**Cracking the API: Challenges in IoT and Modern Applications**\n*Abstract:*\nSecuring API’s is about more than just an endpoint, it’s about the data shared, customer privacy, and the access we give to unauthorised parties. Now as we are connecting more devices than ever, to more third parties than ever, securing APIs needs an offensive mindset from the design phase.\n\nIn this talk I’ll go over some of the techniques I use when testing, common issues I’ve found and their impact, and the state of IoT and modern web applications.\n\nSecurity issues can arise from misconceptions early in the software process, so I’ll also discuss how we might mitigate some of these with thoughtful design, architecture and development.\n\n*Bio:*\nFrom user experience to software engineering, Yianna has a diverse background with one thing in common - exploring the intersection between human interaction and technology. Currently she is an Offensive and Application Security Engineer at Xebia. Working in tech teams and researching new offensive techniques remains a daily drive for her. She’s passionate about giving back to the community, having presented at DEFCON, hosted security meetups, delivered workshops, contributed to OWASP Low Code / No Code, as well as building and contributing to open source tooling."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2024-03-12",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780380",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe'll be restarting our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for March will be **A01:2021 - Broken Access Control**.\n\n**Technical Topic Speaker:** John DiLeo\n**Talk Title:** OWASP SAMM - Overview and Update\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle March 2024",
        "date": "2024-03-13",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/299466332",
        "timezone": "Europe/London",
        "description": "We're back with our first event of 2024! We’ll be doing our usual two talks and pizza format.\n\nLocation: Spence Watson Lecture Theatre 2.98, 2nd Floor Armstrong Building, Newcastle University\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1820 OWASP Newcastle Welcome\n1820 - 1830 CyberNorth Innovation Centre - Andrew Pounder\n1830 - 1915 Talk one\n1915 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nCyberNorth Innovation Centre - The Cyber Security Innovation Centre is an accelerator programme brought to the North East by CyberNorth through funding from the Department for Science, Innovation and Technology (DSIT).\nhttps://cybernorth.biz/2024/03/06/cyber-security-innovation-centre/\n\nTalk one\n**Title:** Subdomain Hijacking & The CISO Simulator\n**Speaker:** Simon Gurney\n**Speaker Bio:** Simon is one of the Punk Security Co-Founders and has over 15 years experience working within IT, primarily focused on automation and InfoSec.\nSimon has a wealth of experience and approaches DevOps from an infrastructure background, but is a keen Python and .NET CORE developer. He has authored two open source projects, pwnSpoof and SMBeagle.\n**Talk Synopsis:** 1\\. Subdomain hijacking \\(great for infosec\\, devs and devops pros\\)\n\\> what is it?\n\\> why was it in the news recently?\n\\> how do you prevent it?\n\\> a sneak peak at some new additions to dnsReaper\\, the tool we built at [Punk Security Limited](https://www.linkedin.com/company/punk-security-limited/) to squash this issue for free!\n\n2\\. The CISO simulator \\(great for everybody\\)\n\\> off the back of an ace call with [Klaus Agnoletti](https://www.linkedin.com/in/ACoAAAADubsBmVslHpggdfSEihyE8ZIdXIu1aPk), I'm hoping to play the CISO simulator game with everyone at the meet. Come join the chaos and learn how to thwart cyber attacks against web applications (hopefully)\n\nTalk two\n**Title:** First 90 days of a CISO, tens of vCISO engagements later.\n**Speaker:** Dr Zibby Kwecka\n**Speaker Bio:** Author and presenter on cyber security topics, holding a PhD in Applied Cryptography and Privacy with seventeen years of experience protecting organisations of all sizes and shapes from digital threats.\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa 2024 Capture the Flag (CTF)",
        "date": "2024-03-30",
        "time": "10:30-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/299697655",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person CTF at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\nOn March 30th #OWASP #Ottawa will hold our all levels Capture The Flag (CTF) at UofO STEM Rm 564.\n\nThis is a free ticketed event due to space restrictions. You must have a ticket to enter. One ticket per person.\n\nJoin us for some learning and some fun.\n\nTickets available at:\nhttps://www.tickettailor.com/events/owaspottawachapter/1134213\n\nPLEASE NOTE: If you cannot attend for whatever reason please release your ticket so someone else can attend. To release your ticket please contact our volunteer organizers using the link on the registration page."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-03-28",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/298926492",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over a drink\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Security in development lifecycle",
        "date": "2024-03-19",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/299504715",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\nWe are Polish chapter of [OWASP](https://owasp.org/) \\- worldwide\\, non\\-profit organisation focused on application security issues\\.\n\nSubject of our upcoming March meeting will be \"Security in development lifecycle\". How to achieve high quality, secure product without scarifying the \"time to market\"? What is more important - visible features or \"transparent\" security? How to convince all the team that they should commit to overall security of the code? What are the best security related initiatives that works in the real life?\nIf you are finding these questions relevant to your work or if you want to share your ideas for achieving secure applications - don't hesitate and join our meeting.\n\nWe have invited Monika Krysiak - QA specialist and product owner, to share her experience and ideas with introducing security into development process. Then we want you to share your ideas - what works and what not. How can we do something more than security testing at later stages of application development?\n\nAgenda:\n\n1. **Smuggling Security Into a Software Project. A Guide for Cunning QAs (Monika Krysiak)**\nAs Quality Assurance specialists, we are often overlooked in security processes. Developers might think of us as whiny negative Nancys but in reality, we have a lot of impact. After all, we won't allow releasing a defective product into production. I believe that QAs should start security testing and simple vulnerability assessment as the first line of defense. During my presentation, I'll show you how I've successfully done that in my past projects.\n2. After the break, we will be hosting a **discussion on strategies and best practices for embedding security into the entire development lifecycle**. In today's fast-paced development environments, ensuring security isn't just about running tests or applying patches at the end of the cycle. It's about integrating security practices seamlessly into every phase of the software development lifecycle. This discussion will explore practical strategies, challenges, and success stories related to incorporating security from the early design stages to deployment and beyond. Let's brainstorm together on how we can foster a culture where security is everyone's responsibility, not just an afterthought.\n3. There will be also a room for **short lightning talks** with discussion (typical format is 5-10 minute talk followed by 5-10 minute discussion). [Please submit your ideas](https://forms.gle/7JFiD3z2tKifogvs5) or just show up.\n4. Job announcements. If you are an employer, there will be a chance to present who you are looking for.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this invitation** with friends and in your social media."
    },
    {
        "group": "Recife",
        "repo": "www-chapter-recife",
        "name": "Detecção de Vulnerabilidades em Código-Fonte com I.A",
        "date": "2024-03-13",
        "time": "20:00-03:00",
        "link": "https://www.meetup.com/owasp-recife-meetup-group/events/298972631",
        "timezone": "America/Recife",
        "description": "**[O que vai rolar?]**\nO próximo meeting do OWASP Recife ocorrerá no dia 13/03/2024 às 20:00 com o título: \"Detecção de Vulnerabilidades em Código-Fonte com I.A\" conduzida por Maria Fernanda Rodrigues, da Tempest Security Intelligence.\n\nA palestrante demonstrará uma forma de detecção de vulnerabilidades em código-fonte, utilizando o modelo não supervisionado de aprendizado de máquina FICS (Functionally-similar yet Inconsistent Code). O primeiro detector de bugs 'machine learning-based' que identifica e aponta inconsistências no código como indicadores de possíveis vulnerabilidades de segurança.\n\n**[Formato do encontro]**\nPalestra online\n\n**[Shortbio de Maria]**\nMaria Fernanda Rodrigues\nEstagiária em Pesquisa e Desenvolvimento\nTempest Security Intelligence\n\n**[Inscrições]**\nTOTALMENTE GRATUITO!\nEm breve iremos disponibilizar um link para o even3 para um credenciamento que será disponibilizado o link para a palestra."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-04-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/298337413",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-03-13",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/298337300",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - March Event @ Kivra",
        "date": "2024-03-20",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/299483018",
        "timezone": "Europe/Stockholm",
        "description": "Spring is quickly aproaching and OWASP Stockholm is hosting a meetup at Kivra featuring Mathias Karlsson, who will delve into the intriguing world of subdomain takeover within the Google Cloud Platform.\n\nThe meetup will start with a mingle with food and drinks at 17:30 and the main presentation will begin at 18:00.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcomming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter ](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\n\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "In a perfect DevSecOps world...",
        "date": "2024-03-21",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516364",
        "timezone": "America/Vancouver",
        "description": "**In a perfect DevSecOps world...** with Aleksandr Krasnov\n\nEmbark on a journey into the heart of DevSecOps with a focus on maturity and practical implementation. This talk unveils the symbiotic relationship between development, security, and operations, illustrating how their harmonious integration fortifies the software development lifecycle. Through real-world examples, attendees will gain a deep understanding of DevSecOps maturity, discovering its transformative impact on organizational resilience.\nThe session provides actionable strategies for attendees to enhance their DevSecOps proficiency, encompassing automated security testing, continuous monitoring, and rapid incident response. This concise exploration equips participants with a roadmap to ascend the DevSecOps maturity ladder, fortifying their software development practices against evolving threats. Join us for an engaging discussion on demystifying DevSecOps, empowering you with the tools to cultivate a secure and high-performing software ecosystem.\n\n**Aleksandr Krasnov** has been a leading industry expert in DevSecOps. He's been working on implementing various DevSecOps initiatives in companies like Palo Alto Networks, Dropbox, and Meta. You can find Aleksandr doing independent security research, advising, writing articles, and giving talks like this one."
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | From Basics to Burp - Part 2: Navigating PortSwigger Academy ",
        "date": "2024-03-28",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/299620460",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter is pleased to partner with UVIC VikeSec to host the second iteration of a hands-on introduction to Burp Suite and the PortSwigger Web Security Academy. Wyatt Harvey and Sebastian Bethell will be presenting a workshop titled \"From Basics to Burp - Part 2: Navigating PortSwigger Academy\".\n\nThe event will be held on March 28, 2024 from 6:00 PM to 9:00 PM (doors open at 5:30 PM) at The University of Victoria in Room 116 of the Engineering and Computer Science building.\n\nThe event will feature the workshop, including optimal video playback control, an introduction to PortSwigger's Web Security Academy, and working through some of the introductory labs using Burp Suite, a comprehensive tool for performing security testing on web applications.\n\nPortSwigger's Web Security Academy is an online platform offering interactive learning materials and labs focused on web application security and instructions on how to identify and exploit a wide range of web application vulnerabilities.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and develop hands-on skills in web application hacking. If you would like to attend, please click the RSVP button to reserve your spot as we have limited seats available.\n\nBring your laptop with Burp Suite installed, your PortSwigger account ready, and join us for a hands-on evening of web application hacking and networking fun!\n\nBurp Suite Community can be installed from the following link:\n\n* [https://portswigger.net/burp/communitydownload](https://portswigger.net/burp/communitydownload)\n\n‎\nYou can register your PortSwigger account at the following link:\n\n* [https://portswigger.net/users/register](https://portswigger.net/users/register)\n\n‎\nOnce you have Burp Suite installed and a PortSwigger account created, browse through Web Security Academy to get an idea of the content offered on the platform in preparation for the event:\n\n* [https://portswigger.net/web-security](https://portswigger.net/web-security)\n\n‎\nAdditionally, feel free to join us after the event, where we will be heading over to Felicita's Pub for more networking!\n‎\nWe would also like to give a special thanks to UVIC VikeSec for helping facilitate this event."
    }
]