[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Introduction to OWASP Threat Dragon",
        "date": "2025-09-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/310876984",
        "timezone": "America/New_York",
        "description": "**Visualizing and Managing Threats Early in Development**\nIncorporating threat modeling into the software development lifecycle is one of the most effective ways to build secure applications from the ground up. OWASP Threat Dragon is a powerful, free, and open-source tool that empowers development and security teams to identify potential threats early—before they become costly vulnerabilities.\n\nIn this introductory session, we’ll explore how Threat Dragon fits into a modern DevSecOps workflow and how it can be used to create clear, actionable threat models through intuitive data flow diagrams. We'll walk through a live demo of creating a threat model, show how Threat Dragon suggests mitigations, and discuss how teams can integrate it into existing Agile or DevOps processes. Whether you're new to threat modeling or looking for a streamlined, accessible tool to enhance your security posture, this talk will provide a solid foundation to get started with OWASP Threat Dragon."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2025 (Online)",
        "date": "2025-09-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489315",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n*Note: if attending in person, sign up at [https://owasp-austin-2025-september.eventbrite.com](https://owasp-austin-2025-september.eventbrite.com))*\n\n**Terraforming Your Way To Better Security**\nby Mark Spears\n\nTerraforming isn’t just for cloud infrastructure. There are security considerations and providers that also are on Terraform. In this presentation, we will look and demo at how to Terraform our security pieces like Web Application Firewall and Zero Trust into our environments along with the cloud infrastructure keeping our OWASP environments safe(r)."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE chapter meeting (30/09/2025, Louvain-La-Neuve)",
        "date": "2025-09-30",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/310746669",
        "timezone": "Europe/Brussels",
        "description": "On September 30th, we organize our next OWASP Belgium chapter meeting at The Gate (Mont-Saint-Guibert).\n\n**Agenda**:\n\n* 17:30 - 18:20 : Welcome (drinks + sandwiches)\n* 18:20 - 18:30: **OWASP update**\n* 18:30 - 19:30: **Learning to Detect Malware: Features, Pitfalls, and Adversarial Threats** (by Charles-Henry Bertrand Van Ouytsel, UCLouvain)\n* 19:30 - 19:45 : break\n* 19:45 - 20:45 : **Integrating Security Without Slowing Development: A Pragmatic DevSecOps Approach** (by Steve Mihy, Approach Cyber)\n* 20:45 - 21:30 : Refreshments\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\n\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "Cloud Security & Red Team Automation",
        "date": "2025-09-13",
        "time": "11:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/310892819",
        "timezone": "Africa/Cairo",
        "description": " Upcoming Event – Cloud Security & Red Team Automation!\nGet ready! Our exciting event is happening Saturday, 13th September. \nJoin us online for two knowledge-packed sessions led by cybersecurity experts.\n\n Agenda:\n OWASP Top 10 Cloud-Native: Walkthrough & Explanation\n 11:00 AM – 12:00 PM\n Speaker: Ahmed Saafan\n\n Hack While Sleeping: Automating Red Team Activities\n 12:00 PM – 1:00 PM\n Speaker: Ayman Hussein\n\n How to Join:\n Zoom Link: https://us06web.zoom.us/j/82297990388?pwd=X4WbQmCQfEkGBbU9foRsbILZ4YriQv.1\n\nDon’t miss this opportunity to strengthen your skills and connect with fellow AppSec and InfoSec professionals.\nLooking forward to seeing you there!"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP Colorado Springs Social Hour - SEP 25th",
        "date": "2025-09-25",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/310944853",
        "timezone": "America/Denver",
        "description": "**OWASP Colorado Springs Social Hour – Save the Date!**\nHere’s your chance to connect with the local security community, share ideas, and find out what's new with OWASP projects.\n\nCome for the community, stay for the conversations.\n\nJoin us **September 25th, 6 to 8 PM** (in person) for a casual evening of networking, conversations, and community.\n\nWe’ll also highlight ongoing **OWASP projects** you can still jump in on, this is a great chance to connect and contribute!\n\n TRiNiTY Brewing at Forge Road Brewery\n\n** September 25th, 6 - 8 PM (in person)**"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Mick Douglas talking about stuff",
        "date": "2025-09-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/310894038",
        "timezone": "America/New_York",
        "description": "Mick is finally headed back, and he promises that he doesn't have any trips planned to Farawayistan this month! He'll be running us through his talk for the US Federal Cyberspace Conference. Should be some good information passed on. We might have to zap everyone Men In Black style after the meeting though."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP September Meetup - Join Us!",
        "date": "2025-09-17",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/310836744",
        "timezone": "America/Denver",
        "description": "***Everyone is welcome! Bring a friend...***\n\n***Seriously...everyone....***\n\nJoin us on September 17th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:30 pm - announcements and presentation starts at 6:00pm .\n\nThis month's presentation is brought to you by API Sec University and SnowFROC!\n\n**Presentation:**\nWhy you should hack your own APIs\n\n**Abstract**:\nAPIs power virtually every web and mobile application, accounting for over 80% of all Internet traffic. And APIs are under attack. Gartner states APIs have become the “most frequent attack vector,\" resulting in hundreds of highly successful, high profile breaches. This API security presentation covers 1) why attackers love APIs, 2) real-world breaches (and how they map to the OWASP API Security Top 10), and 3) best practices to keep APIs secure."
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Dorset - September 2025 meetup",
        "date": "2025-09-18",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/310870192",
        "timezone": "Europe/London",
        "description": "OWASP Dorset are hosting our first Meetup of 2025 and we're in person at the Hays Bournemouth office in Telephone House.\n\nOur guest speakers are:\n\n• James Walsh - Director – Cyber Security, Data, Cloud UK&I at Hays\n• Marissa Fagan – Head of Product @ Katilyst\n• Julianne Reimann – Founder @ FullCyrcle Security\n• Arron Johnson – Cyber Security Architect at London Borough of Tower Hamlets\n\nAgenda\n\n6.00 - Doors open\n6.20 - Welcome, Drinks and food\n6.45 - TALK #1 with James Walsh – Intro and Market update\n7.00 - TALK #2 with Marissa Fagan and Julianne Reimann – Rethinking Security Metrics Through the Lens of Cognitive Load\n7.30 – TALK #3 with Arron Johnson – Smart Security Devices\n\n8.00 – Any Other Business and Close"
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "From Risk to Resilience: Aligning OWASP OT Top 10 with IEC 62443 for Industrial ",
        "date": "2025-09-14",
        "time": "11:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/310838730",
        "timezone": "Asia/Dubai",
        "description": "Industrial environments are increasingly targeted by cyber threats, and protecting operational technology (OT) requires both risk awareness and structured defences. The OWASP OT Top 10 highlights the most critical security risks in OT systems, while the ISA/IEC 62443 standard provides a globally recognized framework for mitigating them.\nIn this session, we will explore how to bridge these two perspectives — mapping the OWASP OT Top 10 risks to relevant IEC 62443 requirements. Attendees will gain practical insights on how to translate real-world vulnerabilities into actionable security controls, accelerating both resilience and compliance.\nKey Takeaways:\nUnderstand the OWASP OT Top 10 and IEC 62443 at a high level\nLearn how common OT risks map to 62443 security requirements.\nDiscover a practical path from identifying risks to implementing controls.\nStrengthen both operational resilience and regulatory alignment"
    },
    {
        "group": "Dublin",
        "repo": "www-chapter-dublin",
        "name": "OWASP Dublin - September Meetup",
        "date": "2025-09-18",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-dublin/events/310746205",
        "timezone": "Europe/Dublin",
        "description": "**OWASP Dublin** are delighted to announce Workday will be sponsoring & hosting the next OWASP Dublin chapter meetup.\n\nWe will have two great talks from industry experts, details can be found below:\n\n**Speaker 1: David Robert**\nfounder of SecurityArchitect.AI. With over two decades of experience in application security, he previously served as Principal Application Security Engineer at Amazon, including work with the Secure AI foundations and payments teams. His work focuses on the core challenge of scaling security reviews without compromising on the security bar.\n\n**Talk Description:\nThe Human Side of Threat Modeling, and How AI Can Help.\n\nIn this talk, we’ll explore the human side of threat modeling: why focusing on attacker goals and business logic is essential, how to capture that in simple, actionable ways, and where automation falls short. We’ll then look at how AI, particularly foundation models, can help bridge the gap, not by replacing instinct, but by scaling it, making those insights more accessible to teams and less experienced practitioners.\n\nWe will also have a second talk on Scaling Security for Non-Human Identities: A Zero Trust Approach.\n\n**Talk Description:\nAt Workday, we've built a comprehensive, proactive security program to address this challenge head-on. In this presentation, we will share how we successfully implemented a scalable security framework that integrates with our diverse ecosystem of SaaS and IaaS platforms. We'll detail our approach, which includes automating alerting to platform owners to ensure accountability and enable rapid response.\n\nSpeaker 1:\nSai Charan Goud Alligeri: “Sai Charan Goud Alligeri is a Senior Cyber Security Engineer at Workday with over 10 years of experience protecting digital environments. Currently focused on Non-Human Identity (NHI) security, he designs and implements scalable frameworks to address the critical risks posed by bots, API keys, and service accounts. His deep background in Application and Cloud Security gives him a unique perspective on a wide range of cyber threats.”\n\nSpeaker 2:\nJacob Kilgore: “Jacob Kilgore is a Senior Cyber Security Engineer at Workday with many years of experience driving enterprise security improvements. Over the past year, his focus has shifted to Non-Human Identity (NHI) security, where he engineers secure, scalable solutions that enforce security controls, enable automation, and proactively mitigate risks. Jacob is also currently pursuing a Master's degree in Cybersecurity and Artificial Intelligence to deepen his understanding of the ever changing technology and cybersecurity landscape.”\n\nThis will be an exciting evening, however please note there is a limited capacity at the venue so please ensure you register early.\n\nRefreshments will be available and plenty of opportunity to speak with others in the Security Community.\n\nA big thanks to our hosts for the evening Workday."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter Meetup #73 - Hands-On OWASP Workshop",
        "date": "2025-09-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/309088867",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to the **OWASP Frankfurt Chapter** Meetup #73!\n\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to do?*\n\n* We’re excited to welcome **Javan Rasokat** for a 2-hour **hands-on OWASP workshop** that tackles the challenges of modern web security – *moving from reactive patching to proactive prevention.*\n\n**IMPORTANT NOTE:** As this is a hands-on workshop, **you'll be expected** to **bring along a laptop with** **a pre-configured environment** (nodeJS or Docker) and a code editor of your choice (see further information below).\n\nIn this interactive session, you’ll explore how to eliminate entire classes of web vulnerabilities using modern browser security features such as:\n\n* Content Security Policy Level 3 (CSPv3)\n* Trusted Types\n* Sec-Fetch Metadata\n\nThrough group-based, hands-on exercises using a pre-secured demo application, you’ll test real-world security features, analyze their effectiveness, and learn how to enforce them at scale across your own environments. This workshop is designed to be language-agnostic and accessible – whether you're a developer, security engineer, or architect.\n\n*What To Bring?*\n\n* A **laptop** capable of running either a **NodeJS-based** web app or a **Docker container**\n* A **code editor** of your choice\n* Note: **No programming knowledge** is needed.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?*\nWe will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?*\nOur Meetup takes place on **24.09.2025** from **18.00 to 21.00** o'clock CEST.\n\n*Where?* The event will be held at usd AG, located at Frankfurter Str. 233/Haus c1, 63263 Neu-Isenburg, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg: Grill in the middle",
        "date": "2025-09-20",
        "time": "12:00+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/310829896",
        "timezone": "Europe/Stockholm",
        "description": "It’s time for the first event of the season! You are all invited to BBQ together with the cybersecurity community. Bring your family, friends and colleagues for burgers, drinks and games.\n\nWe will have prepared and lit BBQs ready together with the usual condiments (ketchup, mustard), so bring your own protein and veggies of choice. The first 50 to arrive will get a free complimentary burger directly from the grill.\n\nWhether you're already 1337 or just started getting interested in cybersecurity, this is a great chance to hang out, swap stories, and meet others with the same interest.\n\n**Where**: Slottskogen, Björngårdsängen Göteborg\nhttps://maps.app.goo.gl/hJMFENVggWDZWtXY8\n*(Approximate location)*\n\n**When:** 20th of September at 12.00. In case of bad weather, the back-up date is one week forward, the 27th of Sep"
    },
    {
        "group": "Gurugram",
        "repo": "www-chapter-gurugram",
        "name": "Protecting Your Web Applications: Best Practices in Web Security",
        "date": "2025-10-05",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/owasp-gurugram-chapter/events/308503571",
        "timezone": "Asia/Kolkata",
        "description": "Join us at the OWASP Gurugram Chapter event where we will dive deep into the best practices for incorporating cybersecurity into software development processes. Our expert speakers will cover topics such as cloud security, computer security, information security, application security, and software security. Learn how to effectively secure your applications, protect your networks, and defend against cyber threats. Whether you're a developer, security professional, or IT enthusiast, this event will provide valuable insights and practical tips to enhance your software security skills. Don't miss this opportunity to network with peers, ask questions, and stay updated on the latest trends in cybersecurity."
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "OWASP Meeting",
        "date": "2025-09-09",
        "time": "19:00-04:00",
        "link": "https://www.meetup.com/indyowasp/events/310486026",
        "timezone": "America/New_York",
        "description": "Topic 1\n**Secure Vibe Coding: 5 Key Lessons**\nAI coding assistants like Cursor, Copilot, and Windsurf significantly increase productivity and assist with mundane coding tasks. But while powerful, these tools carry risks: trained on vast public datasets, they inherit bad patterns without necessarily ensuring secure application development. In this talk, we'll share five key lessons for security engineers and developers to improve code security:\n\n1. Implement guardrails\n2. Get real-time security signal\n3. Watch your dependency blast radius\n4. Compensate for non-determinism\n5. Invest in prompt engineering\n\nBio:\n**Nate Michalov** is a seasoned application security professional with over 12 years of diverse experience. Throughout his career, Nate has contributed to organizations such as Endor Labs, Apiiro, Snyk, Veracode, and Annkissam, where he has focused on securing digital ecosystems while aligning technological strategies with business objectives. In various roles including customer success architect, senior sales engineer, and senior SAST specialist, Nate has consistently tackled complex challenges at the intersection of business and technology. Known for his collaborative approach and dedication to staying informed about emerging trends, Nate is recognized as a trusted advisor in promoting innovation and resilience in application security.\n\nTopic 2\n**Title: From the Engineering Trenches: What Every CISO Needs to Know About AI Development**\n\nAbstract:\nAfter leading our engineering team through the AI development transformation, from the introduction of the first copilot version to today's autonomous agents, I've learned that the most dangerous security risks are the ones created by well-intentioned security policies and practices that don't match AI development realities. This presentation walks through critical milestones where engineering and security are either aligned for success or misaligned for chaos. You'll learn how to spot the warning signs of engineering-security friction, practical approaches for building security that works at AI-enabled development speed, and why the engineering teams that partner best with security are the ones moving fastest with AI.\n\nBio:\nLeading tech innovator **David Hafley**, Head of Engineering at Pixee, blends leadership with tech expertise. Known for shaping global engineering teams, he champions large language models at Pixee, driving content and vulnerability solutions. Prior roles include Chief Product Officer at Dyknow, VP of Engineering at Contrast Security, and varied leadership roles from AWS environments to DevOps culture building. A seasoned speaker, David Hafley brings a wealth of knowledge to the Python conference stage, connecting tech, leadership, and the Python community."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Jax Monthly Meetup",
        "date": "2025-09-15",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/310150420",
        "timezone": "America/New_York",
        "description": "Mark King will be presenting on how to tell are you in the right place. Are you at the right website?"
    },
    {
        "group": "Las Vegas",
        "repo": "www-chapter-las-vegas",
        "name": "Secure Coding Tournament with Security Journey",
        "date": "2025-09-19",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-las-vegas-chapter/events/308588593",
        "timezone": "America/Los_Angeles",
        "description": "I'm excited to announce that **#OWASP** Las Vegas is partnering with **#SecurityJourney** for an amazing event this September!\n\nWe will be co-hosting a multi-day secure code tournament event hosted with support from various local businesses. Come test and hone your coding skills and see how you hold up against some of your local peers when it comes to secure code. With **over $600 in gift cards plus other prizes up for grabs**, you can win a prize without being the top dog.\n\nThis event will be a virtual event, though we will be at the amazing **#CorporateCoworking** offices for the kick-off of the event, as well as for the end where we announce winners and prizes.\n\n**September 19th (6pm-8pm):** Event announcement and kickoff will be streamed via Zoom, and held in person at Corporate Coworking ([https://corporatecowork.com/](https://corporatecowork.com/))\n[https://us06web.zoom.us/j/85892230182?pwd=LJDAHLfFmTvWipDs4Tn6q8KbTqNOcM.1](https://us06web.zoom.us/j/85892230182?pwd=LJDAHLfFmTvWipDs4Tn6q8KbTqNOcM.1)\n\n**September 21st (2pm-4pm):** Prize announcements and event wrap up will be streamed via Zoom, and also held in person at Corporate Coworking\n[https://us06web.zoom.us/j/82494110849?pwd=4nu5nR6rL3ZyWczyFsfjfNKml9UD27.1](https://us06web.zoom.us/j/82494110849?pwd=4nu5nR6rL3ZyWczyFsfjfNKml9UD27.1)\n\nJoin our Discord server to discuss and collaborate on a channel we will have dedicated to the event.\nhttps://discord.gg/fRwFRN49\n\nSignup using the following if you would like to participate in the fun:\n[https://forms.gle/YGWMFKi3opvq7Rqk6](https://forms.gle/YGWMFKi3opvq7Rqk6 \"https://forms.gle/YGWMFKi3opvq7Rqk6\")"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#10 X Marks the Spot",
        "date": "2025-09-10",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/310793573",
        "timezone": "Europe/Lisbon",
        "description": "With our Summer Slumber over, it's time for another OWASP Lisboa event. We are pulling a reverse Green Day and waking up when September starts with a fresh face and visuals ⏰\n\nWe are hitting a milestone with event #10 so X Marks the Spot ‍\n\nThis meetup will take place on September 10th, 2025, at 18:00, and is sponsored by Cloudflare and AP2SI.\n\nThe venue is located in Cloudflare's office at ALLO - Alcântara Lisbon Offices. Try to arrive at the venue by 18:00. The event will start shortly after.\n\n Upon reaching ALLO, head to the reception desk and then take the elevator to the 6th floor. You are here (there)\n\nOur tentative schedule:\n18:15 - Quick intro by the OWASP Lisboa chapter leadership team\n18:25 - \"HTML Smuggling to EDR Bypass\" by Milton Araújo\n19:05 - \"Implementing a custom vulnerability management program that doesn't stop your business\" by Luis Fontes\n20:00 - Dinner & Drinks by Cloudflare\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nTalks:\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nTitle: HTML Smuggling to EDR Bypass\n\nSpeaker: Milton Araújo\n\nAbstract:\nThe aim of this talk is to demonstrate various techniques of HTML Smuggling and how they can be utilized to bypass traditional Antivirus (AV) and Endpoint Detection and Response (EDR) solutions. Despite being an older technique, HTML Smuggling remains relevant and effective against contemporary security measures, making it a compelling topic in the cybersecurity landscape.\n\nHTML Smuggling is a method employed by cybercriminals to covertly deliver malicious payloads directly to a target device through web browsers. This technique exploits the way browsers interpret HTML and JavaScript, allowing attackers to disguise their actions within seemingly benign web pages. Once a user visits a compromised page, the embedded malicious code can dynamically download files without raising red flags. This process often circumvents common security mechanisms that rely on detecting known file types or extensions.\n\nDuring the talk, I will explain the underlying principles of HTML Smuggling, present various attack vectors, and demonstrate real-world applications of this technique. Audience members will gain insights into how attackers leverage this method to bypass security frameworks, as well as important considerations for defending against such tactics.\n\nBio:\nMilton Araújo is a Security Researcher at r19.io specializing in red teaming, malware development, evasion techniques, and reverse engineering. They help organizations improve their defenses by simulating real-world adversaries and exposing the gaps that traditional tools often miss.\n\nTheir work focuses on designing advanced offensive operations that bypass modern detection technologies like EDR, AV, XDR, and sandboxes. They build custom implants, memory-resident payloads, and stealthy execution frameworks to replicate the tactics of sophisticated threat actors. Milton also has broad experience in penetration testing, malware analysis, and offensive infrastructure development.\n\nOutside of research, they contribute to the OWASP community and teach offensive security at the postgraduate level. They also host r19.io, a podcast featuring in-depth conversations with hackers, red teamers, and security researchers from around the world.\n\n https://www.linkedin.com/in/milton-araujo/\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nTitle: Implementing a custom vulnerability management program that doesn't stop your business\n\nSpeaker: Luis Fontes\n\nAbstract:\nVulnerability management today is a tangled web of overlapping tools, scan techniques, and fragmented solutions. While Application Security Posture Management (ASPM) platforms claim to simplify this landscape, they often sacrifice flexibility, leaving teams stuck with false positives, limited customization, and poor integration.\n\nIn this talk, we share how we tackled these challenges by building our own vulnerability management program, leveraging open-source tools and deeply integrating them into our Software Development Life Cycle (SDLC). You’ll learn about the architecture, key design decisions, lessons learned, and the principles we believe are essential for building a successful, developer-friendly, and fully controlled security pipeline.\n\nBio:\nLuis Fontes is a security engineer with over 7 years of experience in cybersecurity and 17 years of hands-on coding. He currently works as a Product Security Engineer at Xapo bank, safeguarding thousands of clients' balance worldwide. Prior to this, he worked with blockchain technologies and conducted in-depth code reviews for Fortune 500 companies, identifying critical vulnerabilities across complex systems.\n\nHis journey in security began early, exploiting SQL injections when it was cool, and he now focuses on building pragmatic, developer-friendly security programs.\n\n https://www.linkedin.com/in/luisfontes19/"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [In-Person]",
        "date": "2025-09-22",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/310823103",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted at Aon by LevelBlue Cyber Solutions and sponsored by SecureFlag. There is limited seating available for in-person attendees. Registration required.**\n**This event will be live-streamed on YouTube.**\n**Recordings will be available on the [OWASP London YouTube channel](https://www.youtube.com/OWASPLondon).**\n\n**Venue Location**: Aon/LevelBlue, The Leadenhall Building, 122 Leadenhall Street, London EC3V 4AN\n**Nearest Tubes:** Bank (6 minute walk), Liverpool Street (7 minute walk), Aldgate (7 minute walk)\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n\n**\"Protecting your Generative AI App from the Five Deadly Risks** **\\- STOIC Security\"** \\- Jeff Watkins\n\nGenerative AI offers incredible opportunities, but comes with significant cybersecurity challenges. As adoption accelerates, so do the risks - data theft, model manipulation, poisoned training data, operational disruptions, and supply chain vulnerabilities.\n\n**\"Scaling Threat Modeling with a Developer-Centric Approach\"** \\- Andrew Hainault & Andrea Scaduto\n\nThis talk introduces Rapid Developer-Driven Threat Modeling (RaD-TM), a lightweight, tool-agnostic approach designed for developers to embed threat modeling into the SDLC without relying on security experts. RaD-TM focuses on targeted assessments of specific functionalities rather than application-wide models, enabling iterative and efficient risk mitigation.\n\n**RAFFLE - win a prize kindly donated by our sponsors!**\n\n**SPEAKERS:**\n\n**Jeff Watkins**\n\nJeff Watkins is Chief Technology Officer at CreateFuture, where he leads AI strategy, engineering, and cloud to deliver secure, human-centred digital products for global brands. A veteran technologist with over 25 years’ experience across financial services, healthcare, and retail, he is a recognised leader in cybersecurity and AI, championing “secure-by-design” practices for generative AI. A sought-after keynote speaker, Jeff has headlined international conferences including Webinale, AppDevCon, and the International JavaScript Conference. He co-hosts the award-winning “Compromising Positions” podcast and contributes regularly to publications such as Wired, Forbes, and Raconteur. His mission is clear: to build technology that elevates people.\n\n**Andrew Hainault**\n\nAndrew has over 25 years’ experience working in Information Security, Information Technology and Software Engineering, for public and private sector organisations in many sectors - including financial services / fintech, energy utilities, media, entertainment and insurance. With extensive application security and software engineering experience, Andrew has delivered secure SDLC programmes and penetration testing projects. He has designed and overseen information security programmes, enterprise-level cyber risk and incident response readiness assessments, as well as delivering board-level training.\nAfter beginning his career at Capgemini, Andrew worked at Cassini Division before running his own consultancy. He joined Gotham Digital Science in 2014 and then Aon in 2016 after its acquisition of Stroz Friedberg. He has led the Security Advisory Practice in UK & EMEA within Aon since 2019(and is now at LevelBlue).\n\n**Andrea Scaduto**\n\nWith a strong foundation in cybersecurity, Andrea holds an MSc in Computer Engineering, multiple IT Security certifications, and more than a decade of industry experience. His expertise spans breaking, building, and securing web, mobile, and cloud applications, with extensive knowledge of secure coding techniques aimed at reducing the cost of fixing vulnerabilities at scale.\n\n**TICKETS:**\n\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security. Your name will be checked against the guest list and a photo ID might be required.\n\n**CODE OF CONDUCT:**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "The 2025 California Technology Summit",
        "date": "2025-10-08",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/308527392",
        "timezone": "America/Los_Angeles",
        "description": "OWASP LA has organized an exceptional offer for our Meetup membership to participate in the **2025 California Technology Summit** on **October 8th in Anaheim, CA**. Join us for a full day of professional development, technical insight, and networking with top minds in IT and cybersecurity.\n\n[Register](https://technologysummit.net/register.html) now using code **CTS25OWASP** for your **complimentary** pass! Check the full schedule at [2025 California Technology Summit Agenda](https://technologysummit.net/register.html)\n\n### Conference Highlights:\n\n* **Opening Keynote**: Fred Donatucci, CTO – San Bernardino County\n* **AI vs AI**: Exploring how artificial intelligence is being used to fight AI-driven cyber threats\n* **CISO & CIO Forums**: Executive roundtable sessions for strategic leadership and resilience planning\n* **Tech & Security Theaters**: Covering deepfake detection, wireless architecture, cyber insurance, observability, compliance, and more\n* **Lunch Sessions**: Including presentations on cybersecurity tactics inspired by Sun Tzu, Layer 2 vulnerabilities, and the evolving threat landscape\n* **Networking & Happy Hour** with live sponsor demos and discussions\n* **Earn CPE Credits** while attending technical and executive sessions\n* **Exhibit Hall** featuring over 30 leading technology sponsors\n* **Sponsor Giveaways** including gift cards, tech swag, and security services\n* **Grand Prize Drawing**: Attend the conference for your chance to **win the dream vacation you always wanted**, plus other exclusive giveaways!\n\nAnd finally don't forget to stop by the **OWASP Los Angeles booth** and connect with our local chapter members."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Sep 24, 2025",
        "date": "2025-09-24",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091964",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** **From input-handling flaws to crashables: Security lessons from LLM-based coding tools**\n\nJoin us for great networking, dinner and drinks, and see a presentation by Mahesh Babu, is a former VP of Information Security turned company builder and now leads growth at Kodem,\n\n**ABSTRACT**: Claude Code illustrates how LLM-based coding tools expand the attack surface. Design choices around approvals, parsing, and error handling can turn into security flaws. We present specific findings Kodem uncovered in Claude Code. Both issues highlight how LLM-based coding tools introduce new misconfiguration and input-handling risks. This talk dissects the issues, their broader implications for AI developer tools, and practical mitigations.\n\n**Thanks to our SPONSOR**: *[Kodem Security](https://www.kodemsecurity.com/)*\n*The AppSec chase is over.*\n*Swap endless alerts with focused action. Simplify the remediation of your most exploitable issues through runtime security.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Modern Security Strategy and Safeguarding the Public Services Sector ",
        "date": "2025-09-24",
        "time": "15:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/310752199",
        "timezone": "America/Los_Angeles",
        "description": "If you plan on joining OWASP LA's event on Sep 24, 2025, consider joining an exclusive event (right before ours) with [Accenture](http://accenture.com/) and [Nozomi Networks](https://www.nozominetworks.com/); bring your expertise to the table and contribute to the discussion from an **AppSec** perspective.\n\nDiscover how a modern security strategy can safeguard the Public Services sector against evolving Operational Technology (**OT**) and **IoT** security threats, as traditional approaches like segmentation and air gapping fall short in the face of human error, physical sabotage, and increasingly complex cyberattacks.\n\n**Wednesday, September 24th**\n3 – 4:15 pm Presentation\n4:15 – 5:30 pm Refreshments, Light Bites, Networking\n**Accenture Los Angeles Office**, 1003 E. 4th Place, 8th Floor, Los Angeles, CA 90013\n**What to expect:**\n\n* Emerging threats and vulnerabilities in OT/ICS/IoT environments\n* How Accenture and Nozomi Networks deliver end-to-end OT security solutions\n* Real-world case studies and deployment insights\n* Gaining full asset visibility and identifying network blind spots\n* Advanced threat detection and vulnerability assessment techniques\n* Predicting and detecting OT process and stability issues to prevent downtime\n* Live Q&A with our OT security experts\n* Wrap up the event with an opportunity to connect with fellow attendees over refreshments and light bites\n\n**Space is limited.** **[Register today](https://web.cvent.com/event/bda8928b-2676-427b-a84b-381d0a76b186/summary?RefId=Home)**. \\*\\* **Make Sure** \\*\\* after you fill out your information, select the registration for **the Los Angeles Office** on the 2nd page.\n\n**Arlene Mordeno**\nSecurity, Public Services - California"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Future-Proofing Your Application Security for 2025 and Beyond",
        "date": "2025-09-24",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/307681800",
        "timezone": "America/Chicago",
        "description": "Software development has undergone seismic shifts over the last 20 years: the Agile movement, the rise of DevOps and cloud native practices, and now the AI and generative development era. With AI code assistants and “vibe coding” on the rise, we’re seeing faster delivery—along with new and complex risks. Over the last 10 years of DevSecOps journey, shift-left also achieved little success. Application Security needs a fundamental reset for the future. In this talk, we will discuss how modern approaches and technology innovations that are built to solve three of the biggest challenges in application security that must evolve for the AI Era – Speed, Coverage & Scale, and Context. We will explore three common scenarios: (1) Inventory and Secure net new applications, (2) Reduce risk and volume of existing security backlog by prioritizing and fixing what matters, and (3) Expand coverage to address emerging blind spots in AI-assisted application development"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "September 2025 OWASP Chapter Netherlands Meetup",
        "date": "2025-09-18",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/310077400",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Trend Micro\n**Address:** Herikerbergweg 92, 1101 CM Amsterdam\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Simple meal**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Beyond the Smoke Screen: Separating Reality from the Rhetoric!!!** by **Deepankar Bhagat**\n20:00 - 20:15 - **Break**\n20:15 - 21:00 - **T.B.D.**\n\n**Beyond the Smoke Screen: Separating Reality from the Rhetoric!!!**\n**Abstract:**\nThis presentation examines AI through a sociotechnical lens, focusing on security implications beyond traditional cybersecurity paradigms. AI systems are embedded within social structures involving hidden “ghost work“ from Global South communities, creating digital colonialism while consuming massive environmental resources. Sociotechnical risk analysis reveals vulnerabilities extending from technical attacks (adversarial examples, data poisoning) to social manipulation through deepfakes and weaponized misinformation. These risks are amplified by model opacity, concentrated capabilities, and the dangerous misalignment between AI’s actual pattern-recognition abilities and social perceptions of intelligence. Security professionals must understand that AI deployment creates new attack surfaces in critical infrastructure while being simultaneously promoted as security solutions. The presentation advocates for security frameworks that account for both technical vulnerabilities and social dimensions of AI risk, challenging hype-driven adoption that ignores fundamental limitations and sociotechnical dependencies\n**Bio:**\nDeepankar Bhagat, Process Expert, Global Identity Access Management. Over 2 decades of experience in financial domain with diverse background in business analysis, IT security, Risk management and process frameworks. Besides Masters in Business Administration (Investment Banking) and Masters in Cybersecurity, I have numerous industry certifications including diploma in emerging technologies like GenAI and Quantum Mechanics and Post quantum Cryptography. I am part time security trainer and also runs a you tube channel spreading knowledge free of cost. I don’t have much free time but whatever i manage to get, i spent on fitness."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2025-09-09",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/310930398",
        "timezone": "Pacific/Auckland",
        "description": "Last minute meetup!\n\nWe've missed several scheduled dates, and this is very late notice. We'll mostly be relaxing to recover from OWASP NZ Day.\n\nI failed to publish the event! I hope to see at least one guest tonight ...\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Review of OWASP NZ Day 2025, Technical Talk\n\nWe present an introductory talk about the OWASP Top 10 (2021 edition) with a new item each meeting.\n\nOur Top 10 topic for March 2025 will be **A07:2021 - Identification and Authentication Failures**.\n\n**Technical Topic Speaker:** Austin Chamberlain\n**Talk Title:** AI and Cybersecurity - A Dual-Edged Sword\n\nAustin will give a short overview of AI for cybersecurity, AI in cybersecurity, and the risks and opportunities presented.\n\n\\-\\-\\-\\-\n\nWe're always looking for presenters and topics for future meetings - contact Austin (austin.chamberlain@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be Austin talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Managing Third-Party and Supply-Chain Risk in Mobile Ecosystems",
        "date": "2025-09-11",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/310720210",
        "timezone": "America/New_York",
        "description": "Every mobile app relies on SDKs, APIs, and third-party components, but those dependencies can introduce critical security and privacy risks. This presentation unpacks common supply-chain threats, from malicious SDKs to insecure open-source libraries. In addition we will address the impact of AI on these ecosystems and the enterprise. Finally, we’ll review best practices for assessing, monitoring, and governing third-party risks, aligned to enterprise mobile app policies and OWASP standards."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Brewery Tap! ",
        "date": "2025-09-25",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916309",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Social Drinks @ The Brewery Tap!\n\n**When?**\n\n* \\- Thursday 25th September\n\nEverybody welcome!\n\nThank you,\nRyan & Mark"
    },
    {
        "group": "Saint Louis",
        "repo": "www-chapter-saint-louis",
        "name": "OWASP Saint Louis In-Person Meetup",
        "date": "2025-09-30",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-saint-louis-chapter/events/310505152",
        "timezone": "America/Chicago",
        "description": "**OWASP Saint Louis Chapter Relaunch – First Meeting**\n\nThe OWASP Saint Louis Chapter is back! Join us for our first meeting as we officially restart the local chapter. Whether you’re a security professional, software developer, technology leader, or simply curious about application security, this is your chance to connect with like-minded peers in the Saint Louis area.\n\n**What to Expect**\n\n* Meet the new chapter co-leaders, **Andre Van Klaveren** and **Nathan Byrd**.\n* Learn about OWASP’s mission and the vision for our local chapter.\n* Help shape the future of OWASP Saint Louis by sharing what topics, speakers, and activities you’d like to see in upcoming meetings.\n* Network with fellow professionals who care about building and securing great software.\n\n**Speakers**\nOur first session will focus on introductions and planning, with featured speakers for future meetings to be announced soon.\n\n**Event Details**\n **Location:** RubinBrown, 7676 Forsyth Blvd., Suite 2100, Saint Louis, MO 63105\n **Date/Time:** September 30, 2025\nℹ Additional information, including parking and directions, will be provided before the event.\n\n**Who Should Attend**\n\n* Application & security professionals\n* Software engineers and developers\n* IT leaders and managers\n* Anyone with an interest in application security\n\n**About OWASP**\nThe Open Worldwide Application Security Project (OWASP) is a nonprofit foundation dedicated to improving the security of software. Local chapters provide opportunities to learn, network, and collaborate with others in the field.\n\nCome be part of the restart - your voice will help shape what OWASP Saint Louis becomes next."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec/OWASP-SLC - Hosting a CTF using OWASP Juice Shop",
        "date": "2025-09-24",
        "time": "12:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/310875546",
        "timezone": "America/Denver",
        "description": "Learn how to set up a CTF using OWASP Juice Shop and use it as a training tool in your organization. We will be reviewing Juice Shop, configuring a Juice Shop CTF, and talking about the logistics for the players.\n\nZoom Link: https://us06web.zoom.us/j/82871949172?pwd=WbhgOa2AzHh1WSStB0ws1UL4Sa3GW0.1\n\nResources:\n[OWASP Juice Shop](https://owasp.org/www-project-juice-shop/)\n[Pwning OWASP Juice Shop CTF-mode](https://pwning.owasp-juice.shop/companion-guide/latest/part4/ctf.html)"
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "AppSec War Stories: A Fun Discussion of In-the-Trenches Warfare",
        "date": "2025-09-19",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/310258159",
        "timezone": "America/Chicago",
        "description": "**AppSec War Stories: A Fun Discussion of In-the-Trenches Warfare**\n**Presentation Session:** 11am-2:30pm\n**Happy Hour:** 2:30pm-4:00pm\n\nThe theme of this meeting is to focus on AppSec War Stories: Lesson’s Learned and Opportunities. Industry experts will talk about key AppSec challenges and how these were overcome by leveraging technology, best practices, innovation and teamwork. There will be multiple presentations highlighting different challenges and lessons learned.\n\n**Featured Presentations**\n\n**Securing Today, Safeguarding Tomorrow: A Guide to App and AI Security - Andrew Gordon, Sr. Sales Engineer, Snyk**\nThis talk challenges the traditional, reactive approach to application security, where developers get stuck fixing issues weeks after they're created. We’ll show how new tools and processes can empower developers to integrate security directly into their workflow, making it an efficient part of the development process.\n\nFinally, we'll look at the emerging security challenges presented by AI. We'll discuss the new \"war stories\" we anticipate seeing, and what developers need to know to secure both today's applications and the AI-powered systems of tomorrow.\n\n**Lessons Learned in Application Security from Log4j: A Wake-Up Call for the Industry - Chris Young, Product Manager, OpenText**\nTo explore key takeaways from the Log4j vulnerability (Log4Shell) and how it reshaped the approach to application security, particularly in open-source and enterprise software environments.\n\n**Agentic AI for Threat Modeling - Joseph Gregorio, VP Application Security, Frost Bank**\nThis session explores how agentic AI systems can be applied to threat modeling, enabling more autonomous, adaptive, and scalable approaches to identifying and analyzing security risks. Attendees will learn how these emerging technologies can complement traditional methods and enhance overall risk management.\n\n**Security Panel: AppSec Futures – Opportunities and Challenges**\nTopics of discussion will cover Agentic AI, defending against AI-powered attacks (deepfakes, phishing, social engineering, etc.), securing the expanded attack surface for APIs and Microservices, emerging threats from Quantum Computing, and preventing Supply Chain attacks.\n\nFeatured panelists:\n\n* Eddie Contreras - CISO - Frost Bank\n* John Dickson - CEO - ByteWhisper\n* Chris Young - Product Manager - OpenText\n* Facilitator: Joseph Gregorio\n\n**Additional Meeting Details**\n\n* Lunch Provided\n* Location: Scuzzi’s Italian Restaurant - 4035 N Loop 1604 W #102, San Antonio, TX 78257\n* HAPPY HOUR & DEMO LAB networking after session!!!\n\n**Happy Hour - Sponsors**\n\n* Opentext\n* Snyk\n* Bytewhisper\n* Wallarm\n\n**Join Zoom Meeting**\nhttps://ftsc.zoom.us/j/86538235312?pwd=bU4nwzuPmmaqrA3o3qREn56bXpL8TZ.1&from=addon\n**Meeting ID**: 865 3823 5312\n**Passcode**: 429796\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\nPlease reply “ONSITE” if you plan on attending in person so we can finalize headcount for food and room attendance \n\n**Future Presentation Topics To Vote On**\n\n* ASPM\n* Bug Bounty Programs: Successes and Failures\n* Pentest\n* Ransomware\n* DevSecOps - Security as Code\n* Security Controls for AI"
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Backdoors & Breaches -- An interactive incident response card game",
        "date": "2025-09-12",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/santa-barbara-owasp-chapter/events/310856682",
        "timezone": "America/Los_Angeles",
        "description": "NOTE: this is an in-person only event.\n\n**Event Agenda**\n05.30pm -- Event kickoff, with dinner and networking.\n06.00pm -- Announcements, by W. Martín Villalba (OWASP SB).\n06.15pm -- Workshop: Backdoors & Breaches -- An interactive incident response card game, by Nikolas Behar (Cybersecurity leader and educator / OWASP San Diego).\n08.15pm -- Workshop end.\n08.30pm -- Event end.\n\n**Workshop: Backdoors & Breaches -- An interactive incident response card game**\nThe Backdoors & Breaches workshop is an interactive incident response card game that teaches players how attackers breach networks and how defenders can respond. Participants learn core concepts of detection, response, and investigation through realistic scenarios that simulate real-world cyberattacks. By playing, teams strengthen collaboration, sharpen critical thinking, and build practical skills for handling security incidents.\n\n**Speaker Bio**\nNikolas Behar is a cybersecurity leader and educator based in San Diego, specializing in offensive security, red and purple team operations, and risk management. He has built and led penetration testing teams, presented at international conferences, and teaches university-level courses to develop the next generation of security professionals.\n\n[https://www.linkedin.com/in/nikobehar/](https://www.linkedin.com/in/nikobehar/)\n[https://x.com/nikobehar](https://x.com/nikobehar)\n\n**Location**\nWorkzones, 351 Paseo Nuevo, Santa Barbara, CA.\nStreet Parking: Plenty of space on Chapala street and/or any side streets.\nParking Garage: Use the Paseo Nuevo Mall Parking Garage address, 730 Chapala Street, SB, CA 93101, in GPS. From the parking garage, go to the ground level towards center court. 75 min free parking. $3/hour thereafter.\nMore info: [https://share.google/9XkWcrC8UK5mqVUvk](https://share.google/9XkWcrC8UK5mqVUvk)\n\nThank you to Workzones for their partnership to host our event at their SB location, with great service and non-profit discounts! To learn more about this space, please visit [https://workzones.com/](https://workzones.com/).\n\nLooking forward to seeing you all!\n\nMartín\nOWASP SB Leader"
    },
    {
        "group": "Scotland",
        "repo": "www-chapter-scotland",
        "name": "OWASP Scotland Chapter Meeting - September",
        "date": "2025-09-11",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-scotland-chapter/events/310636098",
        "timezone": "Europe/London",
        "description": "Join us at the OWASP Scotland Chapter Meeting where we have two talks lined up for our September session - see details below.\n\nPizza and drinks will be provided to the attendees.\n\nThis event is perfect for software developers, ethical hackers, and cybersecurity enthusiasts interested in learning about the latest trends in cyber security.\n\n#### Talk 1 - Everything Wrong with Dependency Track\n\n**Speaker:** Dr. Lionel Saliou\n**Blurb:** A humorous look back on a project I conducted at my current employer that led to the use (or misuse some might say) of the OWASP flagship project: Dependency Track. This talk provides the context to these decisions and extracts nuggets of wisdom that I believe will be valuable to many security professionals.\n**Who am I?** My name is Dr. Lionel Saliou, Ph.D and I have nearly 2 decades of application security experience. In the past I may have written bugs to remain gainfully employed, nowadays, I am a recovering developer supporting development teams write better software.\n\n#### Talk 2- TBA\n\n**Speaker:** TBA"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-10-08",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/307831829",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-09-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/307093545",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": " OWASP Seoul Chapter 9 :    ",
        "date": "2025-09-23",
        "time": "19:00+09:00",
        "link": "https://www.meetup.com/owasp-seoul/events/310919925",
        "timezone": "Asia/Seoul",
        "description": " OWASP Seoul Chapter 2025 9   !\n\n OWASP   9     .           .                 .\n\n**!         .       .**\n\n       !\n\n   (All sessions will be equipped with AI-powered real-time translation.)\n**      (5)**\n\n* OWASP Foundation  Seoul Chapter \n* OWASP   \n\n** #1: ComplOps . (ft. Integration & Automation) (40)**\n‍  -  Security Compliance Analyst\n IT             .      Security Compliance Team             .      'ComplOps'  .\n\n** #2: Security Compliance Engineer:      (30)**\n‍  -  Security Compliance Engineer\n IT      AI    ,      'Security Manager'       .   Security Compliance Engineer   ,  Security Compliance Engineer  3      .\n\n  \n\n*  : 2025 9 23() 19:00 \\~ 21:00 (KST)\n*  :  13 -   https://naver.me/GmbM1R74 (  )\n*  : \n* Meetup     .      meetup    .     .\n\n OWASP Seoul Chapter   \n        OWASP Slack   .\n\n*     : [https://open.kakao.com/o/gS5IxXxh](https://open.kakao.com/o/gS5IxXxh)\n* OWASP Slack    ([https://owasp.org/slack/invite](https://owasp.org/slack/invite))   ,   (#chapter-Seoul) .\n\n    \n\n* OWASP         .     seoul-leaders@owasp.org        .\n*    - https://forms.gle/xvEJCjDMEmYr1rKN7"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "OWASP AppSec Days Singapore 2025 (Conference)",
        "date": "2025-09-13",
        "time": "09:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/310566435",
        "timezone": "Asia/Singapore",
        "description": " **Note: This is a paid event. RSVP on Meetup.com does not confirm your spot. You must complete registration at singapore.appsecdays.org to attend.**\n\n## OWASP AppSec Days Singapore 2025 – Conference Day\n\n **Date:** Saturday, 13 September 2025\n **Venue:** M Hotel Singapore City Centre\n\n###  About the Conference\n\nOWASP AppSec Days Singapore returns in 2025 with a full day of inspiring keynotes, deep-dive technical talks, and networking opportunities. Join security professionals, developers, and researchers from across the region to explore the latest in application security.\n\nThis year’s lineup brings together **global leaders in AppSec**, sharing real-world case studies, research, and practical insights to help you build and secure modern applications.\n\n***\n\n###  Conference Talks – Sept 13\n\nExplore technical insights from global leaders:\n\n* **40,000 CVEs and Counting** – Pedram Hayati\n* **XSS is Dead: Browser Security that Eliminates Bug Classes** – Javan Rasokat\n* **Cybersecurity Through a Creator's Lens** – Rishika Desai\n* **Hacking Planes, Trains, and Ships** – Muhammad Shahmeer\n* **Secret Scanning in Open Source at Scale** – Hassan Khan Yusufzai & Danish Tariq\n* **iOS Reversing on a Budget** – Melvin Lee & Nicholas Lim\n* **Hacking Analytics SDKs** – August Joseph\n* **Pwn, Poison & Prompt-Hack Your AI** – Omkar Joshi & Rahul Bhor\n* **Live MFA Hacking** – Niclas Kjellin\n* **Securing Enterprise AI Agents Against Insider Threats** – Keren Katz\n* **Security for Startups** – Rushikesh Ambuskar\n* **Securing Your AWS Lambda 101** – Ilia Mogilin\n\n***\n\n###  Why Attend?\n\n Learn from international AppSec experts\n Gain actionable insights to strengthen modern applications\n Connect with peers, researchers, and security leaders\n\n***\n\n###  Registration\n\n* Conference Ticket: **S$250**\n* Student Ticket: **S$50** (with valid ID)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "CTF at OWASP AppSec Days Singapore 2025",
        "date": "2025-09-12",
        "time": "09:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/310695141",
        "timezone": "Asia/Singapore",
        "description": " **Note: This is a paid event. RSVP on [Meetup.com](http://meetup.com/) does not confirm your spot. You must complete registration at [singapore.appsecdays.org](http://singapore.appsecdays.org/) to attend.**\n\n** Onsite AppSec CTF @ OWASP AppSec Days Singapore 2025 **\n\nTogether with [Cyber Cohesion](https://www.linkedin.com/company/cyber-cohesion-theunitedfront/) and [WARZONE (One Platform all CYBER)](https://www.linkedin.com/company/warzone-one-platform-all-cyber/), We’re bringing an in-person jeopardy-style CTF to challenge your application security skills! \n\n Date: September 12, 2025\n Venue: Lifelong Learning Institute, Singapore\n\nThe CTF will feature 6 hands-on labs designed to immerse participants in real-world application security challenges. From uncovering vulnerabilities to bypassing tricky defenses, this competition promises both learning and adrenaline! \n\n Tickets: SGD 50 (includes lunch & snacks!)\n\n Prizes:\n 1st Place – SGD 500\n 2nd Place – SGD 300\n 3rd Place – SGD 200\n\nThis is your chance to test your skills, compete with peers, and walk away with not just prizes but also practical AppSec experience.\n\n Don’t miss out – join us onsite and be part of the action at OWASP AppSec Days Singapore 2025!\n\nRegister Here : [https://singapore.appsecdays.org/onsite-ctf.html](https://singapore.appsecdays.org/onsite-ctf.html)\n\nOn-site CTF is sponsored by [Practical DevSecOps](https://www.linkedin.com/company/practical-devsecops/) \\| [SecDim](https://www.linkedin.com/company/secdim/) \\| [CREST](https://www.linkedin.com/company/crest-approved/)"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "7th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-09-25",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584789",
        "timezone": "Europe/Berlin",
        "description": "**All about MCP Security**\n\nImagine giving your AI assistant a universal plug to access all your tools and data - sounds convenient, right? That's what the Model Context Protocol (MCP) offers, acting like a USB-C for AI integrations. However, this convenience comes with significant security risks.​\n\nIn this session, we'll explore how MCP's open connections can be exploited, leading to issues like unauthorized data access and malicious command execution. We'll discuss real-world examples of vulnerabilities, such as command injection flaws and tool poisoning attacks, that have been identified in MCP implementations\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Becoming a Caido Power User: From Recon to Root",
        "date": "2025-09-17",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/310758481",
        "timezone": "America/Toronto",
        "description": "**Format**:\nHybrid (in-person and online) event\n\n**In-person location**:\n**Security Compass**\n325 Front Street West, Unit 103\nToronto, ON\nM5V 2Y1\n\n**Note:** In-person attendance is limited to **70 people**, in a **first-come, first-serve basis**.\nDoors will open at **6:00 PM**, with the event will start at **6:30 PM** (EDT).\nFor those who cannot attend in person, please join us virtually via the livestream!\n\n**Presentation Title: Becoming a Caido Power User: From Recon to Root**\nDive into Caido ([caido.io](https://caido.io/))—a sleek, open web-security toolkit built with efficiency and clarity in mind. Forget clunky tools: Caido offers a clean, intuitive IDE-style interface with powerful features like HTTP proxy, request replay, automations, sitemap visualization, HTTPQL filtering, and easy project management\n\nIn this hands-on session:\n\n* Walk through real-world usage—intercept traffic, replay requests, automate payloads, and map out vulnerable apps.\n* Explore pro tips—use HTTPQL for fast filtering, build workflows and plugins with just HTML/JS, and manage multiple projects effortlessly.\n* Live demo—watch me break a sample vulnerable application using Caido’s workflow engine, match-and-replace rules, and findings interface.\n* Q&A jam—get answers on optimizing Caido for your bug bounty hunts or pentest engagements.\n\nWhether you're starting fresh or looking for a faster, more efficient replacement for tools like Burp Suite, this session will equip you with everything you need to go from zero to Caido hero. Hack smart, stay organized, and own your AppSec game.\n\nWe encourage anyone to bring their laptops!"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Interactive API Security Workshop",
        "date": "2025-09-18",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510889",
        "timezone": "America/Vancouver",
        "description": "Join us for a hands-on **API Security Workshop** hosted by OWASP Vancouver and powered by **Practical DevSecOps**. Whether you’re a seasoned AppSec pro or just getting started, this interactive workshop will be a hands-on opportunity to improve your API Security knowledge and skills.\n\n**Important:**\n\n* Register before 16th September to ensure you get your invitation link to join the workshop on 18th September.\n* In-person participants must bring their own laptop to access the tournament.\n* We will be able to accommodate some remote participants in a hybrid setting, instructions will be sent to all who registered (including people on the waitlist!)\n\nThank you **TELUS** for hosting us and making this event possible!"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "OWASP Virtual Chapter Workshop",
        "date": "2025-10-08",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/310128227",
        "timezone": "America/New_York",
        "description": "Coming soon!"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "Rethinking Security Metrics Through the Lens of Cognitive Load",
        "date": "2025-09-17",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/309892475",
        "timezone": "America/New_York",
        "description": "When we talk about measuring security culture, we describe the **positive impacts that people have** on the security posture of the company. As security leaders, we’re asked to demonstrate that our initiatives like training, Security Champion programs, and SDL have clear benefits. But **are we considering the cognitive cost of our programs**? Every dashboard goal, every “shift left” security integration, and every expectation placed on engineering teams adds to their mental workload, and that load, when unmanaged, silently derails even the most well-intentioned efforts.\n\nThis talk presents practical examples for designing **security culture metrics** that are both impactful and human-aware. At the core is a behavioral science principle often overlooked in security design: **cognitive load theory**—and how this tool can be used to craft realistic metrics that take the human element into account."
    },
    {
        "group": "Yaounde",
        "repo": "www-chapter-yaounde",
        "name": "OWASP Yaounde September 2025 Chapter Meeting",
        "date": "2025-09-13",
        "time": "14:00+01:00",
        "link": "https://www.meetup.com/owasp-yaounde-chapter/events/310693307",
        "timezone": "Africa/Lagos",
        "description": "[English]\nSeptember 2025 OWASP Yaounde chapter meeting.\n\nSchedule:\n\n* Introduction and Chapter Updates\n* Guest Speaker: \"The Blind Spots in Your Code: Making Them Visible with DevSecOps\" by Fabrice Mbachan (aka Nephus)\n* Networking\n* Workshop: \"Understanding the OWASP Top 10 (2021) - Part 3 of 5\" by Ernest Mougoue\n\nSpeakers:\nErnest Mougoue\nErnest is a Chapter Lead for OWASP Yaounde. He has 12+ years of experience in the software security field, having worked as a consultant or cybersecurity team leader for some of the largest companies in the United States. More recently, he is the co-CEO of MBOA DIGITAL, building the Cybersecurity practice.\n\nGuest Speaker\nOur guest speaker for the event is Mr. Fabrice Mbachan, also known as Nephus. He serves as an IT Security Officer at a local financial institution in Cameroon. With extensive experience in cybersecurity, particularly in penetration testing and DevSecOps, gained from his training in Russia, he brings a wealth of knowledge to our event. As a founding member of the RSA Cybersecurity community, he is dedicated to advancing cybersecurity progress in Cameroon.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n[French]\nReunion de Septembre 2025 chapitre OWASP Yaoundé.\n\nProgramme :\n\n* Introduction et mises à jour du chapitre\n* Guest Speaker: \"The Blind Spots in Your Code: Making Them Visible with DevSecOps\" par Fabrice Mbachan (aka Nephus)\n* Réseautage\n* Atelier : \"Comprendre l'OWASP Top 10 (2021) - Partie 2 sur 5\" par Ernest Mougoue\n\nIntervenants:\nErnest Mougoue\nErnest est un chapter lead pour OWASP Yaoundé. Il a plus de 12 ans d'expérience dans le domaine de la sécurité informatique, ayant travaillé comme consultant ou chef d'équipe de cybersécurité pour certaines des plus grandes entreprises aux États-Unis. Plus récemment, il est le co-CEO de MBOA DIGITAL, où il développe le pôle cybersécurité.\n\nGuest Speaker\nNotre invité est M. Fabrice Mbachan, également connu sous le nom de Nephus. Il est responsable de la sécurité des systèmes d'information au sein d'une institution financière locale au Cameroun. Fort d'une solide expérience en cybersécurité, notamment en tests d'intrusion et en DevSecOps, acquise lors de sa formation en Russie, il apporte une expertise précieuse à notre événement. En tant que membre fondateur de la communauté RSA Cybersecurity, il s'engage constamment à faire progresser la cybersécurité au Cameroun."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "October community call - OWASP SAMM",
        "date": "2025-10-08",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309874114",
        "timezone": "America/New_York",
        "description": "**Join us for the SAMM Monthly Community Call,** a regular space to hear what’s new with the project, share experiences, and talk about all things SAMM.\n\nWhat to expect:\n\n* Project updates and what’s coming next\n* Occasional podcast-style chats with community guests\n* Open discussion + Q&A: bring your thoughts, questions, or challenges\n\nWhether you’re just starting with SAMM or are already involved, your voice matters. Everyone’s welcome!"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call",
        "date": "2025-09-12",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309730245",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "September community call - OWASP SAMM",
        "date": "2025-09-10",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309874101",
        "timezone": "America/New_York",
        "description": "**Join us for the SAMM Monthly Community Call,** a regular space to hear what’s new with the project, share experiences, and talk about all things SAMM.\n\nWhat to expect:\n\n* Project updates and what’s coming next\n* Occasional podcast-style chats with community guests\n* Open discussion + Q&A: bring your thoughts, questions, or challenges\n\nWhether you’re just starting with SAMM or are already involved, your voice matters. Everyone’s welcome!"
    },
    {
        "group": "Waf Control",
        "repo": "www-project-waf-control",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2025 (Online)",
        "date": "2025-09-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489315",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n*Note: if attending in person, sign up at [https://owasp-austin-2025-september.eventbrite.com](https://owasp-austin-2025-september.eventbrite.com))*\n\n**Terraforming Your Way To Better Security**\nby Mark Spears\n\nTerraforming isn’t just for cloud infrastructure. There are security considerations and providers that also are on Terraform. In this presentation, we will look and demo at how to Terraform our security pieces like Web Application Firewall and Zero Trust into our environments along with the cloud infrastructure keeping our OWASP environments safe(r)."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter Meetup #73 - Hands-On OWASP Workshop",
        "date": "2025-09-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/309088867",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to the **OWASP Frankfurt Chapter** Meetup #73!\n\nOur OWASP Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to do?*\n\n* We’re excited to welcome **Javan Rasokat** for a 2-hour **hands-on OWASP workshop** that tackles the challenges of modern web security – *moving from reactive patching to proactive prevention.*\n\n**IMPORTANT NOTE:** As this is a hands-on workshop, **you'll be expected** to **bring along a laptop with** **a pre-configured environment** (nodeJS or Docker) and a code editor of your choice (see further information below).\n\nIn this interactive session, you’ll explore how to eliminate entire classes of web vulnerabilities using modern browser security features such as:\n\n* Content Security Policy Level 3 (CSPv3)\n* Trusted Types\n* Sec-Fetch Metadata\n\nThrough group-based, hands-on exercises using a pre-secured demo application, you’ll test real-world security features, analyze their effectiveness, and learn how to enforce them at scale across your own environments. This workshop is designed to be language-agnostic and accessible – whether you're a developer, security engineer, or architect.\n\n*What To Bring?*\n\n* A **laptop** capable of running either a **NodeJS-based** web app or a **Docker container**\n* A **code editor** of your choice\n* Note: **No programming knowledge** is needed.\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?*\nWe will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks.\n\n*When?*\nOur Meetup takes place on **24.09.2025** from **18.00 to 21.00** o'clock CEST.\n\n*Where?* The event will be held at usd AG, located at Frankfurter Str. 233/Haus c1, 63263 Neu-Isenburg, Germany.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    }
]