[
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "4. OWASP Augsburg Stammtisch",
        "date": "2024-07-24",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/302130564",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda tbd**\nDu hast einen Vortrag? Melde dich! Wir sind immer auf der Suche nach interessanten Inhalten!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-01",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302074820",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - July 2024 (Online)",
        "date": "2024-07-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207014",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation! Presentation begins at 12 CDT!\n\nPresentation: **Cyber Resilience - Findings from the 2024 Futures Report**\n\nWe are poised on the precipice of a new era of computing underpinned by new networks, new apps, and a digital-first experience.\nHear the latest findings from AT&T Cybersecurity research and learn about:\n\\- What high\\-priority edge computing use cases are across seven industry markets\n\\- How to secure and work with the edge ecosystem\n\\- How the attack surface is changing\n\\- How endpoints are diversifying\nThe data from this research helps audiences understand challenges and opportunities of the future and examines:\n\\- Balanced investment strategies\n\\- Collaboration and communication needs\n\\- Building with dynamic cyber resilience in mind\nSecurity is now a critical part of business - learn how to move your team to the future!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-25",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302063790",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-18",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301903126",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "July 2024 OWASP Austin Security Professionals Happy Hour - sponsor SecureLayer7",
        "date": "2024-07-11",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302000237",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, July 11th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [SecureLayer7](https://securelayer7.net)\n*SecureLayer7 presents BugDazz: Empowering pentesting excellence for large enterprises and SMEs. Step into the future of cybersecurity with BugDazz and transform your strategy today. Trusted by leading organizations worldwide, elevate your pentesting program to new heights and ensure the security of your organization.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-11",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301781798",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combined Monthly Meet on 20 July 2024",
        "date": "2024-07-20",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/301657456",
        "timezone": "Asia/Kolkata",
        "description": "null/owasp combined meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n* Deepfakes Detection Techniques by **pretti Rajesh**\n* Block chain and Smart contracts by **Meera**\n* There's no honour among phishers: free phishing kits with hidden backdoors by **Anshuman**\n* Building your own threat intel sink by **Pavan Karthick M**\n\n### Session Schedule\n\n| Name | Speaker | Start Time | End Time | Resources |\n| ---- | ------- | ---------- | -------- | --------- |\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM | |\n| [Deepfakes Detection Techniques](https://null.community/event_sessions/4336-deepfakes-detection-techniques) | [pretti Rajesh](https://null.community/profile/48106-pretti-rajesh) | 09:40 AM | 10:10 AM | |\n| **Introduction to beginners** | 10:10 AM | 10:25 AM | |\n| [Block chain and Smart contracts](https://null.community/event_sessions/4338-block-chain-and-smart-contracts) | [Place Holder](https://null.community/profile/2-place-holder) | 10:25 AM | 11:20 AM | |\n| **Networking Session + Break** | 11:20 AM | 11:45 AM | |\n| [There's no honour among phishers: free phishing kits with hidden backdoors](https://null.community/event_sessions/4340-there-s-no-honour-among-phishers-free-phishing-kits-with-hidden-backdoors) | [Place Holder](https://null.community/profile/2-place-holder) | 11:45 AM | 12:40 PM | |\n| [Building your own threat intel sink](https://null.community/event_sessions/4341-building-your-own-threat-intel-sink) | [Pavan Karthick M](https://null.community/profile/37062-pavan-karthick-m) | 12:40 PM | 01:35 PM | |\n| **Feedback + Next Month’s Planning** | 01:35 PM | 01:55 PM |"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "July meetup",
        "date": "2024-07-17",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/302137729",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming July meetup, which will be hosted by the awesome **Oligo Security** team at **Hackerdojo mountainview**. Get ready for insightful discussions and the chance to network with some of the brightest minds in the industry. Along with some nice food and drinks.\n\nThis meetup is Joint Collaboration with Pacific hackers group(https://www.pacifichackers.org)\n\nBrief agenda below:\n\n5:00 – 5:45: Networking/Food and drinks\n5.45-6:00: Introductions\n6:00-6.45: Talk from Oligo Security\n6.45-7:30: Tackling Hallucinations in Enterprise LLM apps\n7:30-8:00: 10 Fundamental Qualities of Modern Application Security Teams\n\nTalk#1: Talk from oligo security. To be published\n\n**Talk# 2:** Tackling Hallucinations in Enterprise LLM apps\n**Description:** Large Language Models can sometimes invent information. These inaccuracies or “Hallucinations” are the most common issue with Enterprise Gen AI applications. This talk delves into the world of LLMs and RAGs extensively exploring different types of Hallucinations, their risks, and various mitigation strategies.\nSpeaker: Puneet Anand Co-founder AIMon. With a decade and a half of expertise crafting and deploying B2B Enterprise software for both startups and Fortune 50 giants, I excel in streamlining and resolving challenges with cutting-edge technology. As a patented inventor and seasoned engineering leader, my commitment lies in empowering exceptional individuals to transform their world through the power of AI.\n\n**Talk#2:** 10 Fundamental Qualities of Modern Application Security Teams\n**Description**: This talk will cover the ten key qualities of successful modern application security teams. These include technical, strategic, and interpersonal skills that ensure strong security and quick responses to new threats. The talk will deep dive into each quality in detail, providing examples and best practices to help attendees build or enhance their own security teams. This will be an interactive and engaging discussion.\nThis session is ideal for security professionals and leaders looking to improve their team's application security capabilities. Attending this talk will provide valuable insights and practical advice on building a robust security team, staying ahead of emerging threats, and fostering a security culture within your organization.\n\nSpeaker: Anita Gupta, Co-founder and CEO at Akto.io. The open source API Security product. Prior to Akto she has experience working in VMware, LinkedIn and JP Morgan. She holds MBA from Dartmouth College and Bachelors in Technology from IIT Roorkee. She is also a speaker at Black Hat and Defcon."
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém UEPA 2024",
        "date": "2024-08-03",
        "time": "08:30-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/301800873",
        "timezone": "America/Boa_Vista",
        "description": "No dia 03 de agosto, a OWASP Belém proporcionará mais um Meetup presencial ( \\m/ ), com apresentações de extrema relevância no contexto de segurança da informação com a computação forense. Todo dia nos deparamos com notícias sobre vazamentos de dados. Sendo assim, a propagação de conhecimento, proporcionará softwares, sistemas e procedimentos mais seguros, assim minimizando esta crise.\n\nData: 03/008/2024 (Sábado)\nLocal: UEPA - Tv. Dr. Enéas Pinheiro, 2626 - Marco\n\nEm breve, mais informações."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - July 2024",
        "date": "2024-07-10",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/301854743",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Thomas Gleason as our presenter. Thomas will be giving his presentation Be a Better Robert Oppenheimer.\n\nIn the tech world, developers, likened to modern Oppenheimers, innovate quickly but may overlook security. This presentation proposes a unified language for AppSec, balancing development and security priorities. It emphasizes understanding open-source usage, risks in tooling practices, and contextualizing vulnerabilities. Join us to align security with development goals, fostering rapid innovation while ensuring security.\n\nThomas Gleason is an AppSec enthusiast who enjoys building teams and tools to enhance security. He has hands-on experience with the pros and cons of DevSecOps. Outside of work, he cherishes his Rhode Island home and has a penchant for a well-cooked risotto. His professional expertise and personal interests make him a well-rounded individual in the field."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Threat modelling software supply chains during a red team assessment.",
        "date": "2024-07-17",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/301741599",
        "timezone": "Australia/Brisbane",
        "description": "The software supply chain is under increasing threat. New attacks and threats have popped up that we couldn't have imagined even two years ago. Total attacks on the software supply chain are increasing by more than 730% year on year since 2019. One way for organizations to combat this growing threat is to empower their red teams to test the software supply chains for that organization. But many red teams are ill-prepared to tackle this new attack surface.\n\nThis talk will have three distinct parts:\n\n1\\. I will describe how security teams\\, red teams\\, or security researchers can quickly identify the multiple components in a particular applications software supply chain\\, and then how to find soft targets to focus on\\.\n2\\. I will describe my VBP framework \\(value\\, behaviour and patterns\\) which is an applied threat modelling framework for software supply chains\\.\n3\\. Finally\\, I will visually describe one of my red team operations on an open\\-source project and the tools that I use \\(or have written\\) to make that possible\\."
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Hacking AWS: Hands-On exploitation of cloud services",
        "date": "2024-07-27",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/302116015",
        "timezone": "Asia/Kolkata",
        "description": "**Note:** **1\\. Participants can attend the event by invitation only\\, as we have limited seating\\. Venue details will be sent to selected participants\\.**\n**2\\. This workshop is intended for peoples who already have basic knowledge in AWS environment only\\, not for newbies/beginners\\.**\n\n**Hacking AWS**\nAn immersive 8-hour workshop designed for Blackbox Pentesters looking to enhance their skills in attacking and exploiting AWS resources.\nThis beginner-friendly session dives deep into AWS security, focusing on identifying and exploiting vulnerabilities in various AWS services.\n\n**What You Will Learn**\nThroughout the workshop, attendees will gain hands-on experience in:\n\\- Enumerating and Reconnaissance: Identifying and mapping AWS resources\\.\n\\- IAM Misconfigurations: Exploiting flaws in IAM roles and policies\\.\n\\- S3 Bucket Exploitation: Accessing and exfiltrating data from misconfigured S3 buckets\\.\n\\- EC2 Instance Attacks: Gaining unauthorized access to EC2 instances\\.\n\\- Other Common Misconfigurations: Identifying and exploiting other prevalent AWS vulnerabilities\\.\n\n**Capture the Flag (CTF) Event**\nThe workshop will conclude with a Capture the Flag (CTF) event, allowing attendees to apply what they've learned in a simulated AWS environment.\nThe CTF event will end on the same day, but the labs will remain accessible for 48 hours post-session for further practice.\n\n**Ideal Audience**\nThis workshop is best suited for individuals aiming to work on breaking into AWS environments, including:\n\\- Offensive Security Engineers\n\\- Pentesters Specializing in Cloud Security\n\\- Security Engineers\n\\- Technical Cloud Security Consultants\n\n**Not Suitable For**\nRed Teamers: This session does not cover advanced attack tactics, defense evasion, C2 hosting, or advanced data exfiltration.\nBlue Teamers & Defenders: Defensive strategies against these attacks are not covered.\nBeginners to AWS: Basic understanding of AWS and cloud computing concepts is required.\nRequirements for Participation\nAWS Account: Each attendee must have their own AWS account with root/admin access. Free tier accounts are sufficient.\nAWS CLI v2: Must be installed on the attendee's system.\nHardware: Attendees must bring their own laptops with internet connectivity.\nKnowledge Base: Basic familiarity with AWS services and concepts like IAM, Lambda, EC2, etc., is needed.\n\n**Kindly Fill this form for registration :** [https://forms.gle/GSTZZmfpEUHiDYHN6](https://forms.gle/GSTZZmfpEUHiDYHN6)"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "Secrets Revealed for Launching a Successful Enterprise DevSecOps Program",
        "date": "2024-07-18",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/301914266",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nThis presentation walks through the patterns of successfully starting of a DevSecOps program from scratch. As such, it focuses on the strategies derived from both the successes and failures and lessons learned along the way on this journey. Lastly, this talk concludes how White House Executive Order (14028) centered around SBOM shapes the next steps of the DevSecOps maturity model and how organizations can leverage this new piece of legislation to bolster their application security defenses.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "NO EVENT IN JULY",
        "date": "2024-07-25",
        "time": "19:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/301939938",
        "timezone": "America/Denver",
        "description": "We're taking July off so you can enjoy some summer vacation time. See you again in August! -Terry"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Lessons from recent breaches",
        "date": "2024-07-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301083987",
        "timezone": "America/New_York",
        "description": "Jay Bobo from CoverMyMeds is speaking! I'll get an abstract up here shortly, but it will be fantastic.\n\nAnd we are at a NEW location! Check it out!"
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "La Sensibilisation à la Sécurité Informatique",
        "date": "2024-07-15",
        "time": "08:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/301698937",
        "timezone": "Africa/Lagos",
        "description": "Le Chapitre Cotonou de la fondation OWASP en partenariat avec l’Agence des Systèmes d’information et du Numérique (ASIN), organise du 15 au 19 Juillet 2024 une formation de 5 jours sur le thème : sensibilisation à la sécurité de l’information. Cette formation est destinée à toute personne qui désire approfondir ses connaissances en sécurité informatique pour ne pas demeurer le maillon faible du système de management de la sécurité de son organisation. N'hésitez pas à vous inscrire très rapidement à partir du lien sur l'affiche ([https://owaspformation.emes.bj](https://owaspformation.emes.bj) /) car le nombre de places est très très limité."
    },
    {
        "group": "Croatia",
        "repo": "www-chapter-croatia",
        "name": "Chapter Croatia Physical Meetup (Varaždin)",
        "date": "2024-07-15",
        "time": "18:30+02:00",
        "link": "https://www.meetup.com/owasp-croatia-meetup-group/events/302121963",
        "timezone": "Europe/Belgrade",
        "description": "Hello everyone, it’s time for our OWASP Croatia meetup. This time, we will meet in person in Varaždin Croatia for some coffee and short informal talks.\n\nOn the last meetup we talked about making a larger meetup with a few conference-length talks, but this is planned for September / October in Zagreb.\n\n**Location:** Inside of Park Boutique Hotel in Varaždin. Monday, 15.7.2023 @ 18:30 (The table is all the way in the back, near the bar)\n\n**We have a few short talks for this meetup:**\n1\\. Vitomir Margetic will talk about the OWASP SCVS \\(Software Component Verification Standard\\) \\- https://scvs\\.owasp\\.org/\n2\\. Tomislav Turek will give two talks\\. First will be about Kubernetes container escape methods and the second will be about SDLC metrics and how to improve the AppSec posture in organizations\\.\n3\\. Dejan Strbad will talk about his experiences of appsec in ICS systems\\.\n4\\. We will discuss future activities for Chapter Croatia \\(Talks\\, Workshops\\, Projects\\)\n\n**Please RSVP to the event because we will have space reserved in the inside terrace and we need to let the venue know the number of chairs needed in the morning.** **If you are not coming, please remove the RSVP so we can plan accordingly.** We need to tell the venue how many chairs / tables to prepare."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP July Meetup - Join Us!",
        "date": "2024-07-17",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/302000550",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on July 17th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:00 - food is served at 5:30 and the presentation starts at 6:00.\n\nThis month's meeting is brought to you by [Synopsys!](www.synopsys.com)\n\n**Presentation:** Managing the Complexity of Software Supply Chains\n\n**Abstract:**Software supply chains are significantly more complex than a traditional materials-based supply chain or B2B software procurement effort. The risk elements in software supply chains are different from those assessed during vendor risk management efforts and are constantly evolving. For example, studies have shown that the average commercial application has hundreds of component suppliers – each with their own release criteria, coding standards, and risk management.\nRegulated industries and global legislative efforts to learn how risk informed software supply chain management can function without disrupting development velocity. SBOMs are a core component of software risk management, but it’s only one element. Attestations, threat models, and continuous threat monitoring transform a simple SBOM into a pillar of a modern cyber risk management program."
    },
    {
        "group": "Dhaka",
        "repo": "www-chapter-dhaka",
        "name": "OWASP Mobile Application Security Risk",
        "date": "2024-07-13",
        "time": "20:00+06:00",
        "link": "https://www.meetup.com/owasp-dhaka-chapter/events/302118862",
        "timezone": "Asia/Dhaka",
        "description": "The OWASP Mobile Application Security (MAS) flagship project provides a security standard for mobile apps (OWASP MASVS) and a comprehensive testing guide (OWASP MASTG) that covers the processes, techniques, and tools used during a mobile app security test, as well as an exhaustive set of test cases that enables testers to deliver consistent and complete results."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #66 - Cloud Security & Vulnerability Disclosure",
        "date": "2024-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/300654912",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #66! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Security at Scale - Mastering Cloud Security in the Cyberwar Era**\n\n*Dominik Sowinski, Cybersecurity Architect & Cybersecurity Community Lead, Siemens*\n\nIn the midst of rapid cloud transformation, industrial organisations face an ever-evolving cyber threat landscape, exacerbated by global events such as the war in Ukraine. This presentation will address the latest APT activities and the significant risks they pose to cloud infrastructures and critical industrial operations. We will explore cutting-edge strategies, technical considerations and essential processes to rapidly adapt and secure cloud environments at scale against these relentless threats. The presentation will help you understand how to fortify cloud applications and infrastructure in this dynamic threat landscape.\n\n**2\\. Talk: Let's talk vulnerabilities**\n\n*Vinit K., Independent security research and threat hunting*\n\nA talk and live demo on cybersecurity threats involving terminal emulators and SSH. We will explore how URL handling in iTerm2 and Hyper can be abused for code execution, as well as delve into the recent CVE-2023-51385 vulnerability, which allows unexpected code execution via SSH ProxyCommand. The session will include interactive segments where the audience can contribute exploit ideas and deepen their understanding of these critical security issues.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 31.07.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "Save the Date: Reihe spannender Kurzvorträge ",
        "date": "2024-07-23",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/302138351",
        "timezone": "Europe/Berlin",
        "description": "Moin in die Runde,\n\nwe'll have a series of short talks in German.\n\n# **Eckpunkte Vorab**\n\nWir präsentieren eine Reihe kurzweiliger Vorträge am Dienstag, den 23.7.2024. Zunächst als Terminblocker vorab die Sprecher und die nur halb knackig ;-) erscheinenden Themen:\n\n\\* Björn Kimminich + Jannik Hollenbach: Saftladen\n\\* Timo Pagel: DSOMM oder MetricCA\n\\* Stefan Bethge: Projekt hamstercage\n\\* Matthias Marx: \"verlorene\" Bio-Scanner der US-Armee\n\nSobald Details feststehen, werden knackige Titel und ein paar Zeilen Abstracht nachgeliefert.\n\nZu Gast sind wir wieder zentral bei Check24, am Anfang der Außenalster (Nähe Hotel Atlantic) In Fußmarschentfernung vom Hauptbahnhof.\nAus planungstechnischen Gründen unseres Hosts (Verpflegung) sag mir bitte per Mail oder hier bei Meetup Bescheid, wenn du dazustoßen möchtest.\n\n# **Generelles zum OWASP-Stammtisch**\n\nBei unseren offenen Treffen geht es um Software und deren Sicherheit im Internet und/oder IT-Security allgemein. Hier treffen sich Menschen, die sich beruflich oder privat mit IT-Sicherheit beschäftigen: Entwickler, Manager, „Pentester“ und alle an (Web)sicherheit interessierte. Die Atmosphäre ist offen und locker. Uns geht's um den Erfahrungsaustausch, Technikschnack und um's Netzwerken. Wer Produkte oder Dienstleistungen verkaufen will, ist hier falsch. Ihr seid herzlich willkommen, euren Kollegen oder Bekannten einen Hinweis auf unsere Treffen weiterzuleiten. Alle Treffen sind frei, für jeden offen und kostenlos.\n\nSchönen Gruß, Björn / Dirk"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL July 2024 - Special Workshop!",
        "date": "2024-07-16",
        "time": "17:30+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/302035464",
        "timezone": "Asia/Jerusalem",
        "description": "This one is different from our usual meetups - **a special, one-time, hands-on workshop!**\n\nThis will be a smaller session, with strict interactivity limits, so please **ONLY SIGN UP IF YOU WILL PARTICIPATE IN THE TRAINING** :-)\n\nIn this workshop, Michal Kamensky from Bounce Security will share a small piece of her upcoming Black Hat training: **\"Accurate and Scalable: Application Bug Hunting\"**.\n\nThe interesting, important, and hard-to-find bugs are not generic. They often stem from the unique business logic of the product, so they require familiarity with it.\n\nYou will learn how to use customizable scanning tools in order to discover those sneaky vulnerabilities, at scale.\nYou will be challenged to complete exercises yourself, using a couple of open-source scanning tools, such as Semgrep and Nuclei.\nYou will see how to customize the rules in these tools so that you can find interesting patterns, while keeping it specific and omitting false positives.\nAnd while you will be using 2 specific tools, the techniques and methodology you will learn are applicable for any customizable scanner, not just these two.\n\nSo make sure to come ready to hack, scan, and most importantly - to learn valuable skills you can start applying tomorrow!\n\n**Since this is a hands-on training, we must keep it much smaller than usual, so only so please ONLY SIGN UP IF YOU WILL PARTICIPATE IN THE TRAINING.** We will be vetting registrations to keep the group small and focused on those that will be actively participating and taking part in the exercises.\n\nMake sure to bring your laptop, and ensure you can install and run the security tools we will be using."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-07-15",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686440",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-07-29",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/301991448",
        "timezone": "America/Los_Angeles",
        "description": "Join us for our 3rd mixer with participating cybersecurity communities in Southern California, enjoy beautiful weather, amazing sunset, great conversations, network with your peers, make new friends!\nYou **don't** have to be a member of any group to participate. Mark your calendars; see you there!!\n\n**VENDOR Opportunities Available**\n*Vendors interested in attending please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUL 24, 2024",
        "date": "2024-07-24",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/299606717",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Breaking Through CVE Noise: Analyzing 5 Key Prioritization Inputs\nJoin us for great networking, dinner and drinks, and see a presentation by **Chelsea Boling**, a Customer Success Architect at **FOSSA**\n\n**ABSTRACT**: Thousands of new Common Vulnerabilities and Exposures (CVEs) are reported each year, which puts a massive burden on security teams to prioritize and address the most critical threats effectively. This is especially true since most vulnerabilities aren’t actually exploitable in their real-world context, and wasting time on non-exploitable issues can get in the way of remediating the most impactful vulnerabilities.\nThis talk will explore strategies to mitigate CVE overload and streamline the vulnerability resolution process. In addition to exploring complexities around CVE noise — such as the difficulty in distinguishing between high-risk, low-risk, and no-risk vulnerabilities and the pressure to maintain business continuity while ensuring robust security — we’ll analyze five specific vulnerability prioritization inputs:\n\n1. CVSS scores\n2. EPSS scores\n3. VEX\n4. The CISA KEV Catalog\n5. Reachability analysis\n\nAdditionally, the talk will cover the role of automation and tooling to prioritize vulnerabilities at scale as well as recommended workflows between IT, security teams, and business units to ensure comprehensive risk management.\n\n**Thanks to our SPONSOR**: *[FOSSA](https://fossa.com/)*\n*FOSSA is a leading application security and compliance platform that specializes in helping engineering teams deliver trusted software. FOSSA enables companies to prioritize real vulnerabilities in their open source dependencies with comprehensive SCA (software composition analysis) capabilities, while also making it possible for organizations to automate compliance reporting and SBOM (software bill of materials) lifecycle management to meet customer and regulatory requirements. Founded in 2015, FOSSA is trusted by thousands of global organizations, has been downloaded nearly two million times, and has conducted nearly 100 million open-source scans.*\n\n**Thanks to our HOST**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Every app risk, everywhere, all at once",
        "date": "2024-07-24",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885911",
        "timezone": "America/Chicago",
        "description": "Security tooling will identify application security risks and multiple tools will deluge security folks and application developers with signal – to the degree that no human or group of humans can hope to tackle these with anything approaching sanity. In this talk, we’ll discuss a better way to operationalize reducing risk, some stories from the trenches and what both bad and good look like."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-07-16",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297786381",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for July will be **A03:2021 - Injection**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-07-25",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/301904100",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Designing an Efficient Penetration Test Suite",
        "date": "2024-07-18",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/301487187",
        "timezone": "America/Los_Angeles",
        "description": "How do you define the scope of penetration testing for a web application project? Is it the OWASP Top Ten, formal guidelines established by organizations such as NIST, security stories developed by the product owner and the security team, or recommendations made by your development team? The answer is all the above depending on the client, your development environment, and your capacity to take the risk.\n\nThis presentation will share experiences gained from penetration testing of a web application hosted by a Government agency providing professional licenses to its prospective clients. The nature of the project touched numerous areas such as CJIS (Criminal Justice Information Service), Personal Identifiable Information (PII), Access Control (Authorization in particular), and adherence to the security standard’s office guidelines. The challenge was to identify and prioritize the test suite that will cover these specific areas in a constrained time period. To enhance the coverage, the test suite had to include DAST (using ZAP) and some specific general scenarios.\n\nThe audience will take away some approaches that when applied can lead to a well balanced (both effective and efficient) penetration testing.\n\nSCHEDULE\nDoors open at 5:30. The talk will begin about 6pm.\n\nENTRY\nThere are doors on Washington and Broadway. Both of them auto-lock at 6pm. From 6 to 6:15pm, only the door on Broadway will be available. Take the elevator to the 11th floor.\n\nNO ENTRY AFTER 6:15 PM\nIt will not be possible to enter the building after 6:15.\n\nACKNOWLEDGEMENTS\nOur host again this month is NedSpace, a co-working space in downtown Portland--a friendly place to work when you don't want to work from home.\n\nFOOD\nWe don't yet have a sponsor for July, so there may not be food this time. Plan accordingly. (If you know a company that might like to sponsor, please put them in touch with us.)"
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro #15 [ONLINE]",
        "date": "2024-07-18",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/301724132",
        "timezone": "America/Sao_Paulo",
        "description": "Em julho teremos o nosso próximo encontro, online e com participação de todos através do **ZOOM**.\n\nVenha aprender e conversar **com um dos principais colaboradores** do OWASP Top 10 For LLM.\n\n**Link para a transmissão:**\nhttps://us06web.zoom.us/j/87962925968\n\n**Confira nossa agenda:**\n\n 19h30 \\~ 20h30\n**\"Segurança de IA na Prática: OWASP Top 10 para LLM Apps\"**\n\nNesta apresentação, exploraremos as melhores práticas de segurança para aplicações que utilizam Modelos de Linguagem de Grande Escala (LLM). Vamos discutir o OWASP Top 10, um guia essencial para identificar e mitigar os principais riscos de segurança nessas aplicações. Através de exemplos práticos e insights detalhados, você aprenderá como proteger suas implementações de IA, garantindo conformidade e segurança robusta. Esta sessão é fundamental para profissionais de segurança, desenvolvedores e líderes de tecnologia que buscam fortalecer suas defesas contra ameaças emergentes no campo da inteligência artificial.\n\n**Palestrante:** Emmanuel Guilherme Junior \\(Cybersecurity Leadership \\| AI & LLM Security \\| Cloud Security \\| OWASP Top 10 for LLM Core Team Member\\)"
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "OWASP San Antonio Chapter Monthly Meeting-July 19th 2024",
        "date": "2024-07-19",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/301446259",
        "timezone": "America/Chicago",
        "description": "Topics- See abstracts below\n\n* Securing API's in the Cloud\n* The top API threats seen in the first quarter of 2024\n* Salesforce Security Pen Testing\n\n**Lunch Provided**\n\nsmall fee for parking est $5-$7.50 Bauerle Road Garage at UTSA Campus\n\nUniversity Room 2.06.04 - Business Building, John Peace Library, 1 UTSA Circle, San Antonio, TX 78249\n\nZOOM link provided for remote attendees\n\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\nPlease reply **“ONSITE”** if you plan on attending in person so we can finalize headcount for food and room attendance \n\n**Presentations will include:**\n***I. Presentation on API Lifecycle-Optiv***\nAPI lifecycle graphic review-provided baseline understanding of API journey-Optiv\n***II. Securing APIs in the Cloud: Insights and Best Practices- Palo Alto***\nThis presentation explores the current state of API security in the cloud, covering industry trends and common challenges organizations face. It delves into effective strategies for API discovery, risk profiling, and real-time protection, providing practical insights and best practices to enhance API security. The discussion will highlight key concerns such as inadequate authentication, lack of visibility, and poor endpoint management, aiming to equip attendees with the knowledge to better secure their API ecosystems.\n***III. API ThreatStats™ Report Q1 2024 Spotlight: Why API Security Is The First Thing For Enterprise AI- Wallarm***\nThe Wallarm Research Team has analyzed billions of data points to identify the top API vulnerabilities and exploits for the 1st quarter of 2024, shining a spotlight on the rising threat of API attacks targeting AI applications. The report explores the top significant threats, identifies key trends, and provides actionable insights that can help you strengthen your API Security program, with an emphasis on identifying and protecting your AI applications from API security issues.\n***IV. Salesforce Pen-testing-Rodney***\nTopic 2-PaaS Cloud Goat is a simulated vulnerable Salesforce\nApplication providing hands-on experience with penetration testing of custom Salesforce applications. The tool is similar to other test tools like AWS CloudGoat, CloudFoxable, AzureGoat, GCPGoat, and Pen-Testing Cloud REST APIs in OpenStack. It is not, however, a tool for attacking [Salesforce.com](http://salesforce.com/) itself. It is novel because it focuses on custom applications deployed using the Salesforce platform and is the first tool to provide lab exercises with a collection of security tests. The main takeaways:\n1\\. Hands\\-on learning opportunity of security tests for a custom Salesforce application\n2\\. Detailed training documentation material about the underlying flaws to look for\n3\\. Single consolidated list of common Salesforce application vulnerabilities"
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "ChainReactor - Automated Privilege Escalation Chain Discovery via AI Planning",
        "date": "2024-07-12",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/santa-barbara-owasp-chapter/events/302066003",
        "timezone": "America/Los_Angeles",
        "description": "NOTE: this is an in-person only event.\n\n**Event Agenda**\n05.30pm -- Event kickoff, with dinner and networking.\n06.00pm -- Announcements, by W. Martín Villalba (OWASP SB).\n06.15pm -- Presentation: ChainReactor - Automated Privilege Escalation Chain Discovery via AI Planning, by Gabriel Pizarro and Ilya Grishchenko (UCSB Security Lab).\n07.00pm -- BYOT / networking.\n08.30pm -- Event end.\n\n**ChainReactor - Automated Privilege Escalation Chain Discovery via AI Planning**\nCurrent academic vulnerability research predominantly focuses on identifying individual bugs and exploits in programs and systems. However, this goes against the growing trend of modern, advanced attacks that rely on a sequence of steps (i.e., a chain of exploits) to achieve their goals, often incorporating individually benign actions.\n\nThis talk introduces a novel approach to the automated discovery of such exploitation chains using AI planning. In particular, we aim to discover privilege escalation chains, some of the most critical and pervasive security threats, which involve exploiting vulnerabilities to gain unauthorized access and control over systems. We implement our approach as a tool, ChainReactor, that models the problem as a sequence of actions to achieve privilege escalation from the initial access to a target system. ChainReactor extracts information about available executables, system configurations, and known vulnerabilities on the target and encodes this data into a Planning Domain Definition Language (PDDL) problem. Using a modern planner, ChainReactor can generate chains incorporating vulnerabilities and benign actions.\n\nWe evaluated ChainReactor on 3 synthetic vulnerable VMs, 504 real-world Amazon EC2 and 177 Digital Ocean instances, demonstrating its capacity to rediscover known privilege escalation exploits and identify new chains previously unreported. Specifically, the evaluation showed that ChainReactor successfully rediscovered the exploit chains in the Capture the Flag (CTF) machines and identified zero-day chains on 16 Amazon EC2 and 4 Digital Ocean VMs.\n\n**Speakers Bio**\nGabriel Pizarro and Ilya Grishchenko are members of the UCSB Security Lab. More info: https://seclab.cs.ucsb.edu/\n\n**BYOT: Bring Your Own Topic**\nThis meeting is a great chance to ask for technical help, career advice, share new ideas, look for feedback, and discuss anything related to CyberSecurity / InfoSec.\n\n**Location**\nKiva Cowork - Funk Zone, 10 E Yanonali St, Santa Barbara, CA. The front door will be kept open for the duration of the event. If you have any trouble getting in, please do not leave, just knock on the front or side doors and/or message us through this platform.\n\nThank you to Kiva Cowork for their partnership to host our events at their SB locations! To learn more about this space, please visit [https://kivacowork.com](https://kivacowork.com).\n\nLooking forward to seeing you all!\n\nMartín\nOWASP SB Leader"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-07-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539096",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Improving the SOC with SOC-CMM",
        "date": "2024-07-17",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/301854096",
        "timezone": "America/Toronto",
        "description": "\\*\\* The talk is hosted on the 3rd floor of 171 John Street \\*\\*\n\n**TALK**\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\n\n**SOC Capability Maturity Model (SOC-CMM)**\n\n**Summary:**\n\nIn today's ever-evolving threat landscape, a robust Security Operations Center (SOC) is no longer a luxury, but a necessity. However, building a SOC from the ground up can be a daunting task. This presentation introduces attendees to the SOC Capability Maturity Model (SOC-CMM), a powerful framework designed to guide organizations in establishing and maturing their SOC capabilities.\n\nThrough practical examples and real-world scenarios, attendees will learn how to leverage the SOC-CMM to:\n\n* Define clear business objectives for their SOC.\n* Develop a comprehensive staffing strategy with the right skill sets.\n* Establish efficient and repeatable security processes.\n* Select and implement the most suitable security technologies.\n* Integrate seamlessly with existing IT infrastructure and security services.\n\n**Presenters**\n\nIvan Salles ([https://www.linkedin.com/in/ivansalles/](https://www.linkedin.com/in/ivansalles/))\n\nA SecOps professional with extensive global consulting experience, specializing in strategic guidance for topics including SOC, MDR, EDR, XDR, SIEM, and Vulnerability Management. Ivan collaborates as an Advisory Board member at Mente Binaria and a staff at SOC Brazil; he currently serves as the Director of Strategic Initiatives - SOC at Trend Micro Canada. Additionally, he shares his expertise as a Professor for Networking & Security at Fanshawe College. Based in London, Ontario, he enjoys spending time with his family."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup - Julio",
        "date": "2024-07-16",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/302007575",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY te invita a su próximo Meetup!**\n\nLas exposiciones serán las siguientes:\n\n**Maximiliano Alonzo: Security by design**\n*El objetivo de esta charla es concientizar sobre la importancia de integrar la seguridad en todas las etapas del desarrollo de software. Se explorarán los desafíos que enfrentan los equipos de desarrollo al considerar aspectos de seguridad, las consecuencias de no implementar diseños seguros, y los principios fundamentales de seguridad. Además, se presentará el modelado de amenazas como una herramienta crucial para identificar riesgos y establecer requisitos de seguridad. Esta exposición proporcionará estrategias prácticas para construir software robusto y seguro desde sus bases.*\n\n**Sebastián Passaro: Bug bounty 101**\n*Vamos a tocar diversos aspectos del bug bounty hunting:*\n\n* *¿Qué es?*\n* *¿Cómo y dónde se hace?*\n* *¿$$$?*\n* *Programas privados, programas públicos y eventos especiales.*\n* *¿Cómo aporta a la industria?*\n* *Aportes de los presentes sobre experiencias propias.*\n\n**¿Cuándo?** Martes 16/7, 19:00.\n**¿Dónde?** Howdy House, Francisco García Cortinas 2357, piso 3.\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Webauthn - WTF or FTW?",
        "date": "2024-07-18",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516371",
        "timezone": "America/Vancouver",
        "description": "**Webauthn - WTF or FTW?** with Don Burks\n\nWhile it has been around for a few years, the Web Authentication Standard (or Webauthn) is just starting to become mainstream. This talk will explore some of the real-world applications of this technology, in particular discussing adoption strategies, observability practices, and evaluating Webauthn against other strategies such as OAuth and 2FA.\n\n**Don Burks** is a technical leader who has been working in the industry for over 25 years. Former Head Instructor of Lighthouse Labs and with experience both in startups and FAANG companies, Don's background in software development and technical leadership has provided a wealth of experience which he shares in books, talks, and the great teams with which he gets to work. Currently, Don is the Director of Engineering for Bulletproof Studio Tools, based in Vancouver, BC."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #66 - Cloud Security & Vulnerability Disclosure",
        "date": "2024-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/300654912",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #66! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Security at Scale - Mastering Cloud Security in the Cyberwar Era**\n\n*Dominik Sowinski, Cybersecurity Architect & Cybersecurity Community Lead, Siemens*\n\nIn the midst of rapid cloud transformation, industrial organisations face an ever-evolving cyber threat landscape, exacerbated by global events such as the war in Ukraine. This presentation will address the latest APT activities and the significant risks they pose to cloud infrastructures and critical industrial operations. We will explore cutting-edge strategies, technical considerations and essential processes to rapidly adapt and secure cloud environments at scale against these relentless threats. The presentation will help you understand how to fortify cloud applications and infrastructure in this dynamic threat landscape.\n\n**2\\. Talk: Let's talk vulnerabilities**\n\n*Vinit K., Independent security research and threat hunting*\n\nA talk and live demo on cybersecurity threats involving terminal emulators and SSH. We will explore how URL handling in iTerm2 and Hyper can be abused for code execution, as well as delve into the recent CVE-2023-51385 vulnerability, which allows unexpected code execution via SSH ProxyCommand. The session will include interactive segments where the audience can contribute exploit ideas and deepen their understanding of these critical security issues.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 31.07.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    }
]