[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - September",
        "date": "2023-09-26",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/295755057",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus og DEIF holder vores næste meetup tirsdag d. 26. september i Aalborg fra 19.00 - 21:30.\n\nVi vil meget gerne, hvis I hjælper hinanden ved at arrangere fælleskørsel. Skriv meget gerne her!\n\nDetaljerne er ikke helt på plads, men Jens Myrup Pedersen kommer og fortæller om hans erfaring med Cyberlandsholdet og Robert Nedergaard Nielsen fortæller om Haaukins-platformen.\n\nOm Jens:\n\nJens Myrup Pedersen er professor på Aalborg Universitet, hvor han primært forsker i netværkssikkerhed og tidlig detektion af skadelig aktivitet, og hvor han er ansvarlig for kandidatuddannelsen i Cybersikkerhed. Jens er også involveret i en række projekter der skal øge viden om og interesse for cybersikkerhed blandt unge, herunder Cyberskills - og så har han siden 2021 været landstræner for Cyberlandsholdet.\n\nTitel: Cyberlandsholdet For The Win\n\nKort beskrivelse:\n\nKom med på rejsen bag Det Danske Cyberlandshold, der i 2022 - som det mindste land nogensinde - vandt de Europæiske Mesterskaber i tæt konkurrence med store lande som Tyskland og Frankrig. Hvert år dyster hundredevis af unge danskere om en plads på Cyberlandsholdet. En konkurrence, der starter med åbne online trænings-sessions der er tilgængelige for alle og ingen særlige forudsætninger kræver, og som går gennem Kvalifikationsrunde, Regionale Mesterskaber og Nationale Mesterskaber til den eftertragtede Bootcamp med kun 25 pladser, hvoraf 10 ender på landsholdet. Men det er ikke kun en konkurrence: Det er også et vigtigt projekt for at øge interessen for cybersikkerhed blandt unge, og derfor er det så vigtigt også at skabe noget fedt for det store flertal der ikke kommer på Landsholdet. “Cyberlandsholdet For The Win” handler om landsholdets sejr, om arbejdet med at øge interessen for cybersikkerhed blandt unge, og om hvorfor de to dele hænger så tæt sammen.\n\n\\- Robert Nedergaard Nielsen er videnskabelig assistent på Aalborg Universitet\\, hvor han spiller en hovedrolle i projekter som Cyberskills og De Danske Cybermesterskaber\\. Han har mere end 5 års erfaring med udvikling\\, drift og anvendelse af træningsplatformen Haaukins\\, der kombinerer CTF\\-formatet med læring og træning\\.\n\n\\- Robert vil præsentere Haaukins\\-platformen\\, og de valg der ligger bag i forhold til at skabe en platform\\, der er egnet til “begyndere” indenfor cybersikkerhed \\- herunder de mange IT\\-professionelle\\, der gerne skal opnå en grundlæggende viden om sikkerhed uden nødvendigvis at blive eksperter\\. Deltagerne får også mulighed for selv at arbejde med på nogle af opgaverne\\, der indgår som eksempler i oplægget\\."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - September 2023 (Online)",
        "date": "2023-09-26",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705763",
        "timezone": "America/Chicago",
        "description": "*Due to the meeting location host supplying lunch for attendees, so we have sufficient foods, if you would like to attend in-person at NI, please see* -- [https://owasp-austin-2023-september.eventbrite.com](https://owasp-austin-2023-september.eventbrite.com).\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Baku",
        "repo": "www-chapter-baku",
        "name": "OWASP Baku - Show Must Go On",
        "date": "2023-09-29",
        "time": "5:00+04:00",
        "link": "https://www.meetup.com/owasp-baku-chapter/events/295899957",
        "timezone": "Asia/Baku",
        "description": "## Fortifying the Future of Application Security\n\nJoin us for an exciting online event, **OWASP Baku - Show Must Go On**! This is your chance to dive into the world of web application security and network with like-minded professionals. Our expert speakers will share their knowledge and insights on the latest trends, challenges, and best practices in the field. Don't miss out on this incredible opportunity to learn, grow, and connect with the cybersecurity community. Mark your calendars and get ready for an unforgettable experience!\n\n**Event Agenda**\n\n1. **Azar Alili** \\- Welcoming 3:00 PM \\- 3:10 PM\n2. **Sabuhi Safarov** \\- Threat Modeling 3:10 PM \\- 3:25 PM\n3. **Aghadadash Guliyev** \\- The Art of Deception 3:25 PM \\- 3:40 PM\n4. **Sakhavat Suleymanli** \\- Secure Coding Best Practices 3:40 PM \\- 3:55 PM\n5. **Javid Alizadeh** \\- DevSecOps vs\\. DevOps 3:55 PM \\- 4:10 PM\n6. **Orhan Jan** \\- Mobile Application Pentest: Best Practices and Emerging Threats 4:10 PM \\- 4:25 PM\n7. **Q&A** 4:25 PM - 5:00 PM"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combine Monthly meetup on September 16th.",
        "date": "2023-09-16",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/295604606",
        "timezone": "Asia/Kolkata",
        "description": "| **Name** | **Speaker** | **Start Time** | **End Time** |\n\n| ---- | ------- | ---------- | -------- |\n\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM |\n\n| [Supply Chain Security](https://null.community/event_sessions/3841-supply-chain-security) | [nk vijay](https://null.community/profile/11622-nk-vijay) | 09:40 AM | 10:10 AM |\n\n| **Intoductions** | 10:10 AM | 10:25 AM |\n\n| [Bug Hunting For Everyone](https://null.community/event_sessions/3843-bug-hunting-for-everyone) | [Pawan Chhabria](https://null.community/profile/18434-pawan-chhabria) | 10:25 AM | 11:10 AM |\n\n| **Networking Session + Break** | 11:10 AM | 11:35 AM |\n\n| [DataSource & XSS Scanner (Open Source Tool Demo)](https://null.community/event_sessions/3845-datasource-xss-scanner-open-source-tool-demo) | [Rohit Kumar](https://null.community/profile/37808-rohit-kumar) | 11:35 AM | 12:20 PM |\n\n| [Securing CI/CD using Github Actions](https://null.community/event_sessions/3846-securing-ci-cd-using-github-actions) | [Bharath Kumar N](https://null.community/profile/11361-bharath-kumar-n) | 12:55 PM | 01:40 PM |\n\n| [Reverse Engineering: Ghidra or IDA](https://null.community/event_sessions/3847-reverse-engineering-ghidra-or-ida) | [Manish](https://null.community/profile/20729-manish) | 01:40 PM | 02:10 PM |\n\n| **Feedback + Next Month’s Planning** | 02:10 PM | 02:30 PM |"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "GitHub + OWASP Bay Area Security Meetup for September",
        "date": "2023-09-20",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/295787414",
        "timezone": "America/Los_Angeles",
        "description": "For our September Meetup we are partnering with GitHub once again.\n\n**Important Note: Registration is [here](https://resources.github.com/github-owasp-sf-security-meetup-sep20/?utm_source=meetup&utm_medium=social&utm_campaign=OWASP) and not through the meetup app. GitHub requires that you enter your email address for access to their location but it will not be used for any other purpose.**\n\nDon't miss the opportunity to gain valuable insights straight from the stage with engaging talks from GitHub, LinkedIn and Apiiro.\n\nDrop by for education, mingling, food, crafted cocktails and of course some GitHub swag!\n\n*The first 50 people to register for the event will get a GitHub Security Champion hoodie. Following registration confirmation, we will reach out to you for your size.*\n\n**Date** \\| Wednesday\\, September 20\\, 2023\n\n**Time** \\| 5:00 p\\.m\\. \\- 8:00 p\\.m\\.\n\n**Guest Check-in**\n\nGitHub\n\n275 Brannan Street\n\nSan Francisco, CA 94107\n\n**Agenda**\n\n* 5:00 - Check in, grab some food/drinks and network\n* 5:45 - Introductions\n* 6:00 - 6:20 - Building a Robust Secret Scanning Pipeline (LinkedIn)\n* 6:30 - 7:00 - GitHub Advisory Database Alerts (GitHub)\n* 7:00- 7:30 - Stop Thinking \"Vuln\": Quantifying Risk to Optimize your AppSec Program (Apiiro)\n* 7:30 - Networking\n* 8:00 - Conclusion\n\n## About the Sessions\n\n**6:00pm - 6:20pm**\n\n**Building a Robust Secret Scanning Pipeline**\n\n*Speakers:*\n\n*Aashna Sethi, Security Engineer, LinkedIn*\n\n*Francis Alexander, Staff Security Engineer, LinkedIn*\n\n*Emmanuel Law, Senior Staff Security Engineer, LinkedIn*\n\nLeakage of Secrets is one of the most common problems organizations face and often acts as the starting vector for the majority of the attacks. In this talk, we delve into the implementation of how we rolled out secret scanning capabilities within LinkedIn and outline the steps taken to establish an effective secret scanning pipeline.\n\nOur talk navigates you through the complete lifecycle of the secret scanning pipeline starting from identifying secrets, verifying them through our custom validation service, managing the security alert lifecycle alongside developers, and ultimately focusing on the prevention of secrets. Join us to gain understanding of the intricacies and lessons learned while building a robust secret scanning pipeline, from inception to execution.\n\n**6:30pm - 7:00pm**\n\n**GitHub Advisory Database Alerts**\n\n*Speaker: John Maroney, Security Analyst III, GitHub*\n\nThe GitHub advisory database powers security alerts delivered through dependabot. The data itself is curated by the GitHub security lab and is made available for free for everyone forever. Come learn about the curation process and see how the sausage is made.\n\n**7:00pm - 7:30pm**\n\n**Stop Thinking “Vuln”: Quantifying Risk to Optimize your AppSec Program**\n\n*Speaker: Idan Plotnik, CEO of Apiiro*\n\nNot all vulns are created equal. Whether surfaced via a tool (SAST, SCA, DAST, container, IaC security, etc.) or a human-led process (bug bounty, pen test, etc.), a vulnerability may or may not actually pose a risk to your business. Is it in deployed code? Is that code internet-facing? Is it exploitable? Is it in a high business impact application? More often than not, it’s non-trivial to answer those questions to understand how risky it is and prioritize it amongst the mountain of other tasks on our plate.\n\nMultiply that across dozens of alert feeds, a constantly-changing application attack surface, and different types of application weaknesses (misconfigs, exposed secrets, API weaknesses, etc.)...There has to be a better way.\n\nIn this talk, we’ll explore the many dimensions of risk and the factors you need to determine whether a vulnerability, misconfiguration, exposed secret, etc. is a real risk, vaguely following the industry-standard risk matrix (also used in the OWASP Risk Rating Calculator). We’ll cover the different likelihood and impact indicators you need to quantify risk and how to get that context programmatically, proactively, and automatically to drastically cut down your backlog and prevent critical risks from being deployed—without overburdening your developers.\n\nPlease complete the form linked above by Tuesday, September 19, 2023 6pm PDT to reserve your spot. Space is limited.\n\n**Super important note: Do not join the waitlist as you will not be registered that way!**"
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "OWASP Belfast September meetup",
        "date": "2023-09-28",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/295904214",
        "timezone": "Europe/London",
        "description": "Hello OWASP Belfast!\n\nWe are delighted to announce our next hybrid event for 2023 with an exciting lineup of talks from local industry leaders. The Meet up will be in partnership with ESO, who have also kindly offered to host the evening and provide pizza, beers, and soft drinks for everyone.\n\n**Date: 28th September 2023**\n\n**Time: 6.00 PM**\n\n**Location: ESO, 42 Fountain St, Belfast BT1 5EF.**\n\n**Zoom Link: [https://eso.zoom.us/j/91099302428?from=addon](https://eso.zoom.us/j/91099302428?from=addon)**\n\nFirst, we will share an example of how identifying and assessing an attack on an application was used to gain insights into attacker behavior, and how invaluable this can prove in informing future actionable steps to prevent exposure. Next, we will present an overview of the key vulnerabilities associated with the use of social media in business and how easy it is to experience a breach when you do not have the correct policies and procedures in place. We will then delve into the world of ethical hacking, exploring the most common \"low-hanging fruit\" issues encountered over the past year. We will focus on prevalent vulnerabilities like HTML injection, Insecure Direct Object References (IDOR), and authentication flaws. Finally, we will finish with a technical talk from Ciaran from Rapid 7 who will take you through software supply chain software issues – malicious attackers, unsuitable licenses, and deprecated code which can all lead to problems in stuff that used to \"just work\". He will talk about how (despite what sales teams might tell you) there’s no single simple solution to this and show you how to manage your risk in an achievable way.\n\n**Agenda:**\n\n6.00 - 6.20 Networking & Food\n\n6.20 - 6.30 Welcome to ESO Finian / Sarah\n\n6:40 - 7:00 Talk 1: \"The Safety Law of An Idiot Next to You\" by Tanya Vacarda\n\n7:00– 7:20 Talk 2: \"From Likes to Leaks: Understanding the Security Risks of Social Media\" by Anne-Marie O'Donnell\n\n7:20 – 7:30 BREAK (10 min)\n\n7:30 – 7:50 Talk 3: \"Hacking For Devs: Bridging the Gap Between Developers and Hackers\" by Jacob Steadman\n\n7:50 – 8:10 Talk 4 \"A Pragmatic Approach to Software Supply Chain Security\" by Ciaran Conliffe\n\n8.10 - 8.30 Networking and Exit\n\n**Disclaimer**\n\nAs always, our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nOWASP, the Open Web Application Security Project, is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. So come along to Belfast chapter meetings if you would like to hear about, or share information with the community on how to ethically hack your own systems, how to defend your applications, and how to build security into your applications. Chapter meetings also provide a great opportunity to meet like-minded people with similar interests for general discussion, chit-chat, and banter!\n\n**Speaker Info:**\n\nTanya Vacarda - Allstate NI, Sr. Consultant [https://www.linkedin.com/in/tanyavacarda/](https://www.linkedin.com/in/tanyavacarda/)\n\nJacob Steadman- Vertical Structure Ltd, Ethical Hacker/Lead Penetration Tester [https://www.linkedin.com/in/jacob-steadman-08b17395/](https://www.linkedin.com/in/jacob-steadman-08b17395/)\n\nAnne-Marie O'Donnell, BH Consulting Ltd, Cybersecurity Consultant [https://www.linkedin.com/in/anne-marie-o-donnell-71536411a/](https://www.linkedin.com/in/anne-marie-o-donnell-71536411a/)\n\nCiaran Conliffe, Security Architect, Rapid7 [https://www.linkedin.com/in/ciaran-conliffe-7133843a/](https://www.linkedin.com/in/ciaran-conliffe-7133843a/)\n\n**Additional Information**\n\nESO is located between Waterstones bookshop and the back of Boots in Belfast city center. They have two working lifts. ESO employees will be at the door to welcome attendees and show them to the meetup space."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter September 2023 Meetup",
        "date": "2023-09-13",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/295661566",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person at 5:30pm or online at 6:30pm (link to be provided to attendees).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nThis month we will welcome Itzik Alvas, CEO & Co-founder at Entro to present to our chapter their talk: *The art of keeping secrets - Strategies for next-gen secrets security.* Itzik will share with us his experiences and teams research on the complexities of secrets management in modern application development and highlight the risk they pose.\n\nItzik started his cybersecurity journey 17 years ago when he was selected to join the elite cyber security unit of the IDF (Israel Defense Forces). He was introduced to the cyber security ecosystem there and gained enormous knowledge and experience on a nation-state level. After serving for five years, He moved to the ‘real world’ where he held various positions in the industry, including developer, DevOps, cybersecurity researcher, and CISO of a major healthcare organization, before becoming the Head of Security and SRE at Microsoft.\n\nIn 2022, Itzik Co-founded Entro Security where he serves as the CEO."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - September 2023",
        "date": "2023-09-26",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/295901737",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "Adding SAST to CI/CD, Without Losing Any Friends",
        "date": "2023-09-26",
        "time": "7:00+01:00",
        "link": "https://www.meetup.com/owasp-cambridge-meetup/events/295961836",
        "timezone": "Europe/London",
        "description": "Hosted by the Cyber Security & Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, & BCS Cybercrime Forensics SG\n\n**Background**\n\nThe **BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG)** promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.\n\n**OWASP (Open Web Application Security Project)** is a 501(c)(3) not-for-profit worldwide charitable organisation focused on improving the security of application software. Their mission is to make application security visible, so that people and organisations can make informed decisions about true application security risks.\n\n**The Cyber Security and Networking (CSN) Research Group** at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, CIISec & the Cyber East Cluster amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment.\n\n**Abstract : Adding SAST to CI/CD, Without Losing Any Friends**\n\nEveryone wants to put tests into the release pipeline, but no one wants to wait hours for them to finish. In this learning lab we will discuss multiple options for adding static application security testing (SAST) to your CI/CD, in ways that won’t compromise speed or results, such as learning which results can be safely ignored, writing your own rules, company-specific checks, scanning PRs instead of commits, splitting blocking scans versus deep audit scans, etc. We will also cover ways to continuously find vulnerabilities.\n\n**Provisional Agenda**\n\n16:45 - Webinar waiting lobby opens\n17:00 - Start of Presentation\n17:50 – Questions & Answers"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS September 2023",
        "date": "2023-09-28",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/295850529",
        "timezone": "America/Denver",
        "description": "Speaker: Jeff Tomkiewicz: \"Gone Vishing: A DEFCON 31 Social Engineering Story\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\n\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Self XSS, but Useful",
        "date": "2023-09-21",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295118453",
        "timezone": "America/New_York",
        "description": "Ben says: 'While testing a web app used by multiple groups, the question came up \"can members of group A attack members of group B?\" It took some serious tinkering, but by chaining the otherwise useless (but widespread) exploits of self-xss and login-csrf, an attack was found. This talk (and demo!) details the necessary components, how they work, and how they come together to cross \"group boundaries\" on websites. While the talk will be highly technical, terms and techniques will be explained and should be approachable by anyone who has logged into a website before.'\n\nAnd Tracy from Checkpoint will be bringing some snax, so come hungry and ready to learn."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Septembre 2023",
        "date": "2023-09-12",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/295629230",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **Zenika** que nous remercions chaleureusement de leur soutien.\n\n**Date limite d'inscription: dimanche 10 septembre au soir**\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\n\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\n\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\n\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\n*--*\n\n*Pour des raisons de sécurité d'accès aux locaux de notre sponsor, il est nécessaire de fournir votre nom et prénom pour ce meetup. **Une pièce d'identité sera demandée** pour l'obtention d'un badge d'accès. Nous vous remercions de votre compréhension.*\n\n*--*\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #62 - SAP from the Attackers side  & CI/CD Orchestration",
        "date": "2023-09-21",
        "time": "7:30+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/295190157",
        "timezone": "Europe/Berlin",
        "description": "Hi all, we are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within Product & Cyber Security. There will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\n\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **codecentric AG.**\n\n_What are we going to talk about?\n\n**My CI/CD pipeline contains all security tools available! Now what...?**\n\n*Jasmin Mair* *\\- Experienced application security professional and global product security manager at Leica Microsystems\\.*\n\nTools are helpful to enable DevSecOps, many challenges and pitfalls highlight the need for a cultural shift. Explore issues such as security resistance, conflicting KPIs and organizational silos. Real-world examples and best practices will provide actionable insights to overcome these obstacles.\n\n**Talk 2 - SAP from an Attacker’s Perspective – Common Vulnerabilities and Pitfalls**\n\n*Nicolas Schickert, penetration tester at usd AG, spearheading the SAP pentest team & Tobias Hamann penetration tester at usd AG with an interest in reverse engineering and vulnerability research*\n\nThis talk will give an overview of vulnerabilities discovered during SAP pentests and what approach was taken to assess an SAP system’s security. One significant aspect of this talk will be sharing real-world examples of SAP vulnerabilities that were discovered during pentesting. This will help the audience to understand the practical implications of these vulnerabilities and how they can be exploited by attackers. Overall, the takeaway for the audience will be a better understanding of common SAP vulnerabilities, the potential impact of these vulnerabilities, and practical ways to mitigate them. By the end of this presentation, the audience will be equipped with the knowledge and tools needed to secure their SAP systems and prevent attacks.\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **codecentric AG**. Due to the hard end at 21.30, everyone interested can join us at the **Bockenheimer Weinkontor** (https://goo.gl/maps/6DWRcgFEH27FkaDb8) for drinks at their own cost.\n\n_When?\n\nOur Meetup takes place on 21.09.2023 from 17.30 to 21.30 o'clock CEST.\n\n_Where?\n\ncodecentric AG, Lise-Meitner-Straße 4, 60486 Frankfurt am Main\n\n_Interested in **giving a talk** yourself?\n\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\n\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\n\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "SEC-T Community Event",
        "date": "2023-09-14",
        "time": "3:00+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/295934827",
        "timezone": "Europe/Stockholm",
        "description": "Join fellow security enthusiasts in Gothenburg and watch the live stream from the [Sec-T conference](https://www.sec-t.org/schedule/) (check link for schedule of talks) in great company! Viewing starts \\~13:00 and ends at 17:30.\n\nWhen: Thursday 14/9 13:00-17:30\nWhere: Codic’s co-working office at Kronhusgatan 2G\nAlso: Snacks and drinks will be provided. Possibly a spontaneous after work 17:30 and onwards!\n\nFeel free to bring more snacks, a bag full of curiosity and yourself - but don’t forget to sign up!"
    },
    {
        "group": "Hartford",
        "repo": "www-chapter-hartford",
        "name": "OWASP Hartford Meetup",
        "date": "2023-09-21",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/ct-cyber-security-meetup-owasp-hartford/events/295568205",
        "timezone": "America/New_York",
        "description": "Hello esteemed members and web security enthusiasts!\n\nWe are thrilled to announce our next meetup scheduled for September 2023, and we'd love for you to be there!\n\n**Details of the Event:**\n\n* **Host:** Connecticut OWASP (Open Web Application Security Project) Chapter\n* **Date:** Thursday September 21th 2023\n* **Time:** 6:00 PM to 9:00 PM\n* **Location:** Thomas Hooker Brewery\n* **Address:** 16 Tobey Rd, Bloomfield, CT 06002-3522\n\n**Highlights of the Meetup:**\n\n* Engage with fellow web security professionals and enthusiasts.\n* Network and share insights over some of the finest brews offered by Thomas Hooker Brewery.\n* This event is free and open to the public\n\n**RSVP:**\n\nYour participation is important to us! Kindly let us know if you'll be attending by 9/7/23. This will help us in making appropriate arrangements.\n\n**About OWASP:**\n\nFor those who are new, the Open Web Application Security Project (OWASP) is an open community dedicated to enabling organizations to develop, purchase, and maintain software applications that can be trusted.\n\nOur local Connecticut Chapter regularly hosts meetups and events to bring together professionals and students interested in web application security.\n\nWe're looking forward to an evening of learning, networking, and fun. Hope to see you there!\n\nBest Regards,\n\n[Bill Reyor/OWASP Connecticut Chapter Team]"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2023",
        "date": "2023-09-11",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/294083412",
        "timezone": "Europe/Rome",
        "description": "In collaboration with Politecnico di Milano (Polimi) University, we are excited to announce the upcoming OWASP Italy Day 2023 on September 11th. It will be a full-day event dedicated to application security (AppSec)!\n\nThe Open Worldwide Application Security Project (OWASP) stands as a well known international non-profit organization dedicated to the crucial field of web and application security.\n\nAt its core, OWASP operates as a vibrant online community, diligently producing a wealth of freely-available resources. These include insightful articles, comprehensive methodologies, extensive documentation, cutting-edge tools, and advanced technologies, all focused on bolstering web application security.\n\nThe impact of OWASP's work extends far and wide, with numerous standards, books, tools, and organizations drawing upon the invaluable insights provided by the Top OWASP 10 project. Esteemed entities such as MITRE, PCI DSS, the Defense Information Systems Agency (DISA-STIG), and the United States Federal Trade Commission (FTC) all recognize and reference OWASP's contributions.\n\nAn eagerly anticipated event in the OWASP calendar is the OWASP Italy Day 2023. This captivating one-day conference is exclusively dedicated to web application and software security, as well as application security testing tools and technologies.\n\nIt presents a golden opportunity for attendees to expand their knowledge on critical application security topics and to network with esteemed professionals and experts. Participants include application security professionals/managers, software engineers, software quality engineers/testers, and computer science students.\n\nFor further details regarding the OWASP Italy Day 2023, please refer to the following link:\n\n[https://owasp.org/www-chapter-italy/events/OWASPItalyDay2023](https://owasp.org/www-chapter-italy/events/OWASPItalyDay2023)\n\n**REGISTRATION IS NOW CLOSED**\n\n**Important Registration Update**\nWe would like to inform you that due to an overwhelming response, registration for the upcoming OWASP Italy event in collaboration with Politecnico di Milano is now closed.\nWe apologize for any inconvenience this may cause and appreciate your understanding."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-09-11",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/295620096",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "OWASP Jakarta Night x Fastly.com (Offline Meetup)",
        "date": "2023-09-15",
        "time": "8:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/295313578",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n\n• Tool dan standar keamanan aplikasi\n\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n\n• Kendali keamanan dan pustaka standar\n\n• Cabang lokal di seluruh dunia\n\n• Riset terkini\n\n• Konferensi lengkap di seluruh dunia\n\n• Mailing list\n\n• Dan banyak lagi … di www.owasp.org\n\nKali ini OWASP Jakarta Meetup akan membahas:\n\nJadwal Acara\n\n6:00PM: Registrasi Peserta\n\n6:30PM: Topic Terkini dari OWASP\n\n7:00PM: Presentasi topik khusus:\n\n‘Evolusi Bot dan Penipuan’ oleh Fastly (30mins)\n\n‘Keamanan Aplikasi Modern’ oleh Fastly partner A10 (30mins)\n\n8:00PM: TBD\n\n8:30PM: Foto session and networking\n\nHosts / Speakers :\n\nHos: Flo\n\nOWASP JKT Chairman & CEO Appsec.asia : Ade Yoseman Putra\n\nPembicara Fastly: Guy Brown\n\nPembicara A10: untuk di konfirmasi(TBC)\n\nVenue :\n\nWework Parc 18\n\nTower E, SCBDJl. Jend. Sudirman No.Kav. 52-53Jakarta, DKI Jakarta 12190\n\nthank you sponsor this event - Fastly.com"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Os ataques XSS e sua mitigação com o OWASP Java Encoder",
        "date": "2023-09-18",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/295631047",
        "timezone": "America/Fortaleza",
        "description": "Os ataques XSS (Cross-Site Scripting) são brechas comuns em sites, onde o explorador insere código malicioso para atacar usuários. Isso pode levar ao roubo de informações ou controle da sessão. Existem tipos como armazenados, refletidos e DOM-based. Prevenir requer validação rigorosa e práticas seguras de codificação, como CSP. A conscientização é fundamental.\n\nO Java Encoder é uma ferramenta chave contra ataques XSS. Ele converte os dados para um formato seguro, bloqueando códigos maliciosos, auxiliando na proteção do site em questão."
    },
    {
        "group": "Kolkata",
        "repo": "www-chapter-kolkata",
        "name": "OWASP KOLKATA MEETUP #8",
        "date": "2023-09-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-kolkata/events/295846120",
        "timezone": "Asia/Kolkata",
        "description": "#### Proposed sessions for this event:\n\n* Get Started with Cyber Security and Its landscape by **Anurag Roy**\n* Reverse Engineering and It’s Basic by **Prasenjit Kanti Paul**\n* GSM call flow & security features (2G,3G,4G) by **KRISHNENDU GHOSH**\n* Cyber Forensic by **Soham Das**"
    },
    {
        "group": "Lima",
        "repo": "www-chapter-lima",
        "name": "OWASP Meeting Setiembre 2023",
        "date": "2023-09-21",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/owasp-lima-meetup-group/events/295729119",
        "timezone": "America/Lima",
        "description": "**OWASP Meeting Setiembre 2023**\n\nReunión Mensual de Seguridad de Aplicaciones (VIA ZOOM)\n\n**PRESENTACIONES:**\n\n***El arte del engaño: Desarrollo Seguro de Software: Evolución y Tendencias -***\n\n***\\- Ing\\. Miguel Salvador \\- Software Architect at Charles Taylor***\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n***Abordando la Seguridad de las APIs: Estrategias Efectivas de Pentesting***\n\n***\\- Eduardo Sarria Palacios \\(PE\\) \\- Ethical Hacker Senior en Falabella\\. Bachiller en Ciencia de la Computación\\. BSCP\\, eWPTXv2\\, eCPPTv2 y CEH Practical\\.***"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#04 - The Room",
        "date": "2023-09-19",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/295466709",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on Sep 19th, 2023, at 18:00, **supported by [BNP Paribas](https://www.bnpparibas.pt).**\n\nThe schedule is the following:\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n**18:15** \\- How to test and compare SAST solutions\n**19:00** \\- Unmasking Azure Kubernetes Service \\- Unveiling Inherent Security Risks in K8S Environments\n**20:00** \\- Snacks & Drinks sponsored by BNP Paribas\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **How to test and compare SAST solutions**\n\nSpeaker:\nGuillaume Montard\n\nAbstract:\nOver the past two decades, many of us have had negative experiences with SAST. In this talk, I will explain SAST, its significance, and introduce a framework that allows you to test and compare the latest SAST solutions. By the end, I hope to change your perspective on SAST.\n\nBio:\nGuillaume, co-founder of Bearer, developer-first security solution. Previously CTO and VP of Engineering at Skillsoft.\n\nLinkedIn: [https://www.linkedin.com/in/guillaumemontard/](https://www.linkedin.com/in/guillaumemontard/)\nTwitter: [https://twitter.com/g_montard]( https://twitter.com/g_montard)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Unmasking Azure Kubernetes Service - Unveiling Inherent Security Risks in K8S Environments**\n\nSpeaker:\nSadi Zane\n\nAbstract:\nThis talk delves into the security risks associated with Azure Kubernetes Service (AKS). Specifically, it focuses on a deep dive into key security controls like Role-Based Access Control (RBAC) and explores associated risks with service accounts. Additionally, the talk presents a novel approach highlighting how an attacker could exploit Node authorization certificate keys to achieve long-term persistence within AKS environments and their underlying containers. Furthermore, the presentation describes and demonstrates an attack against a vulnerable Grafana enterprise application by leveraging directory traversal techniques to steal privileged tokens. These tokens serve as a stepping stone for further pivoting into the container environment. The talk also addresses the inherent shortcomings of default Azure Kubernetes deployments, including vulnerabilities related to secrets management, pod security admission, and underlying networks. By shedding light on these deficiencies, attendees gain a comprehensive understanding of the security challenges and potential avenues for improvement in AKS environments.\n\nBio:\nSadi Zane is a Principal Cyber Security Consultant specialising in offensive security, Red Team/Purple Team exercises, and extensive experience in Orchestration technologies e.g., Cloud on premise Kubernetes container security systems.\n\nLinkedIn: [https://www.linkedin.com/in/sadi-zane-bb6430206/](https://www.linkedin.com/in/sadi-zane-bb6430206/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - SEPT 27, 2023",
        "date": "2023-09-27",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294467841",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Safety in your Embedded Systems, how to Prepare for the next Generation\n\nJoin us for great networking, dinner and drinks, and see a presentation by **Stephen Olsen**, Principal Field Application Engineer for North America with BlackBerry QNX.\n\n**ABSTRACT**: Discover the intricate connection between safety and security in product development, where safeguarding against external threats and internal risks is paramount. Delve into the nuances of isolating safety and non-safety functions, along with securing data. This talk addresses the significance of safety across various industries, particularly in the evolving medical field. Gain insights into the concept of virtualization and its optimal application. Explore why safety matters, its diverse applications, and the critical need to protect cutting-edge devices. A must-attend discussion for those shaping the future of embedded systems.\n\n**Thanks to our Sponsor**: *[BlackBerry QNX](https://blackberry.qnx.com/en)*\n\n*BlackBerry® QNX® is a trusted supplier of commercial operating systems, hypervisors, development tools, support, and services, all purpose-built for the world’s most critical embedded systems. BlackBerry QNX helps customers streamline their development efforts to efficiently launch safe, secure, and reliable systems. Our technology is trusted in more than 235 million vehicles and is deployed in embedded systems around the world across a range of industries including aerospace and defense, automotive, commercial vehicles, heavy machinery, industrial controls, medical, rail and robotics.*\n\n**SPONSORSHIP Opportunities Available**\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "The Techno Security & Digital Forensics Conference 2023",
        "date": "2023-09-11",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/295892104",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** has organized an exceptional opportunity for OWASP membership to participate in *[Techno Security & Digital Forensics Conference](https://www.technosecurity.us/west/owaspla23-campaign)*, September 11-13 in Pasadena, CA. Join us to learn about new tools, training, and networking.\nUse promo code **OWASPLA23** for **10% off** registration! Check the full schedule at [Techno Security & Digital Forensics Conference - Schedule at a Glance](https://www.technosecurity.us/west/schedule-at-a-glance)\n\nNOTE \\*\\*\\* THIS IS NOT A FREE EVENT \\*\\*\\*\n\nThe West edition of Techno Security & Digital Forensics Conference will take place September 11-13, 2023, at the Pasadena Convention Center in Pasadena, CA. Attend the conference for a unique education experience that blends the digital forensics, cybersecurity, and eDiscovery industries for collaboration between government and private sectors. Educational sessions cover topics within the following primary tracks from which CPE credits can be earned: Cybersecurity, eDiscovery, Forensics, Investigations, and Sponsor Demos. For additional event details and to register, visit https://www.technosecurity.us/west/owaspla23-campaign\n\nDon't forget to visit us at the OWASP Los Angeles booth!"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Breaking Yourselves, But In The Best Way Possible",
        "date": "2023-09-21",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/295909646",
        "timezone": "Europe/London",
        "description": "Hello & Welcome\n\nIn this session we'll be discussing various ways to improve your offensive security testing.\n\nUsing these offensive security techniques, your teams will find new ways to break applications, and test your defenses.\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name AND show photo ID when checking in to the event.\n\nPlease note this event will be recorded so we can put these talks on our YouTube channel afterwards. We will also be trying out our live streaming capabilities.\n\n**6:00 - Open doors & networking & drinks**\n**6:30 - Dr Katie Paxton-Fear: Go Hack Yourself: API hacking for beginners**\nOver the past few years, we've really seen API hacking take off as a field of its own, diverging from typical web app security, but yet parallel to it. Often we point to the amorphous blob that is web security and go: \"here you go, now you can be a hacker too\", with top 10 lists, write-ups, conference talks and whitepapers smiling as we do. This creates a major challenge for developers who want to test their APIs for security or just people who want to get into API hacking, how on earth do you wade through all the general web security to get to the meat of API hacking, what do you even need to know? This talk is going to break down API hacking from a developer point of view, teaching you everything you need to know about API hacking, from the bugs you can find and to the impact you can cause, to how you can easily test your own work or review your peers. So what are you waiting for join me and go hack yourself!\n\n**7:15 - Refreshments (Food & Drinks & Networking**\n**8:00 - Gerald Benischke - Application DoS vulnerabilities**\nThis AppSec-focussed talk demonstrates how denial of service attacks can be carried out without throwing lots and lots of traffic at a system and effectively stop services. This uses a couple of vulnerabilities in the play framework as an example and describes the impact. This approach can be likened to using precision guided missiles rather than the carpet bombing of DDoS attacks.\n\nI will explore the role that convenience for developers in frameworks combined with unexpected payloads and how this can be exploited. I also draw on how the service mesh can amplify this attack such that multiple instances can be killed with a single request. Furthermore, we look at how Web Application Firewalls (WAFs) offer no protection against this type of attack.\n\nLastly, I will look at what can be done to protect applications against this type of attack.\n\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBooking.com\n6 Goods Yard Street Manchester M3 3BG\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Dr Katie Paxton-Fear**\nA lecturer in Cyber Security at Manchester Metropolitan University and a cyber security researcher, but she's far more well known for her hobby. In her free time, she's a hacker, specialising in API hacking teaching others through her YouTube videos. A former developer turned hacker, she used to make RESTful APIs and now she breaks them. She found her first API vulnerability in 2019 which affected Uber and since then she has been hacking APIs ever since, creating hours of content to help others follow in her footsteps. With her PhD in cyber security and machine learning, she loves to introduce a data-driven approach to hacking combining new tools with manual testing to ensure an impactful bug report every time.\n\n**Gerald Benischke**\nI tend to describe myself as both an Agile Fundamentalist and an AppSec Snooper. What does this mean? On the one hand my software development experience has led me to think that the principles of the agile manifesto form the basis of good practices. It boils down to lots of common sense, small steps, learning along the way, not writing code that nobody will want or need and taking processes and procedures with a pinch of salt.\n\nAs an AppSec Snooper, I have been working to make security more approachable and more pragmatic. You could even say, more agile. The only way to deal with a deluge of supply chain vulnerabilities, bad practices copied from StackOverflow or hallucinated by an LLM is to bring security together with development (this is where the “shift left” buzzword applies).\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBooking.com - Venue Sponsor\nBooking.com - Food & Drink Sponsor\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAre you passionate about a security topic?\n\nDo you want to speak at a future event?\n\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\n\nDoes your company want to sponsor a venue and/or refreshments?\n\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Maulana Azad National Institute Of Technology",
        "repo": "www-chapter-maulana-azad-national-institute-of-technology",
        "name": "How to stay safe on Social Media?",
        "date": "2023-09-16",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-maulana-azad-national-institute-of-technology-chapter/events/295772860",
        "timezone": "Asia/Kolkata",
        "description": "Dear attendees,\n\nWe are excited to communicate with you at our upcoming event at IES Public School Bhopal on Saturday, 2nd September 2023. Please find below all the necessary information and details for the event:\n\nEvent: How to stay safe on Social Media\n\nDate: Saturday, 16th September 2023\n\nTime: 12:30 PM - 2:00 PM\n\nAgenda:\n\n1\\. Address common problems as Cyberbullying\\, Phishing\\, Scamming\\, etc\\.\n\n2\\. Aware students about various privacy settings in social media apps\\.\n\n3\\. How to check if your social media is compromised and how to deal with it\\.\n\n4\\. Give Conclusion\n\n5\\. Play a game called Interland by google on cybersecurity by including the audience\\.\n\nYou don't need anything to have you on person to attend this event. All students are encouraged to come with an open mind and a willingness to engage in the presentation and game.\n\nWe are thrilled about this collaboration with IES school and are looking forward to a successful event. If you have any further questions or require additional information, please do not hesitate to reach out to us.\n\nThank you for your support and cooperation.\n\nBest regards,\n\nDurgesh Shah\n\nCoordinator\n\nOWASP Consortium, Manit Bhopal"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation on Microsoft Azure and Amazon AWS",
        "date": "2023-09-23",
        "time": "0:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "September 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-09-21",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/295296523",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Hogeschool van Utrecht\n**Address:** Heidelberglaan 15, 3584CS Utrecht\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **SAST, DAST, IAST… xAST de-mystified** by **Martin Knobloch**\n20:00 - 20:15- **Break with drinks**\n20:15 - 21:00 - **DAST in the world of DevSecOps** by **Amit Sharma**\n\n**SAST, DAST, IAST… xAST de-mystified**\n*Abstract:*\nDev[Sec]Ops has embraced CI/CD’s build, test and deployment approach, now pushing secure test automation into the dev’s build pipelines.\nNow with SCA added to the xAST security verification in your pipeline, as more is better, right?\nBut, without clear expectation what to expect from your tool (usage), how to choose the right tool?\nDuring this presentation, you will be guided to define the problem first, in order to choose the tools to solve it. Let’s grow maturity and not push on security test automation in the development pipelines but adding useful quality assurance in your production line!\n\n*Bio:*\nMartin Knobloch, Global AppSec Strategist with Fortify, part of OpenText, is a long-time security leader with more than 25 years of experience in the field of IT and +15 in Cyber security.\nWith a background in software development and architecture, his focus is on software security. Martin is actively involved in OWASP where he is a frequent contributor to various projects and initiatives. Martin is taking part in the organizing of local and global OWASP conferences and served more than 5 years as a member of the Board of Directors, two of them as Chairmen of the board.\nDuring his career, Martin has been a recognized teacher, guest lecturer at various universities and invited speaker and trainer at local and international software development, testing and security conferences throughout the world.\n\n**DAST in the world of DevSecOps**\n*Abstract:*\nDuring this session, we will delve into the intricate details of dynamic testing as a cutting-edge technology. We aim to uncover the finer nuances that define this approach and shed light on the experiences that illuminate the path to harnessing its full potential. Particularly, we will focus on navigating the transition from conventional software development life cycle (SDLC) methodologies towards embracing novel processes in software development. By sharing valuable insights, we aspire to guide you through the journey of effectively integrating dynamic testing into your evolving strategies, ensuring optimal outcomes and enriched decision-making as you embark on this transformative expedition.\n\n*Bio:*\nAmit Kumar Sharma is a Security Evangelist with more than a decade of experience in Application Security and Fuzz testing. He has worked in various roles including but not limited to Penetration Testing and Red Teaming. During his career he got a chance to work with various technologies in the domain of Telecom, Medical, ICS and Automotive Security. He works as a Security Specialist with Synopsys Inc , an organization which provides Products and Consultation on how security fits in the SDLC and evangelizing technologies like IAST, Open Source Security, Binary Analysis and Fuzz testing to uncover security issues. Currently his areas of research includes DevSecOps, Security in SDLC, Kubernetes Security and Secrets Management."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Global AppSec - Singapore",
        "date": "2023-10-03",
        "time": "4:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/294274627",
        "timezone": "Pacific/Auckland",
        "description": "Join us for the 2023 Global AppSec-Singapore (virtual) conference.\n\nConference will be presented through the conference's Whova app (access provided after registration) and training will be presented via Zoom (private links provided to registrants).\n\n**NOTE:** The conference's schedule is 9:00 a.m. - 5:00 p.m. Singapore Time (UTC+8) each day.\n\nDesigned for private and public sector InfoSec professionals, the one-day OWASP conference equips developers, defenders, and advocates to build a more secure web. We are offering educational\n\n* Three (3) one-day training courses, 4th October - US $260\n* API Security Testing 101 (Abdessamad Temmar)\n* Threat Modelling: From none to done (John DiLeo)\n* Don’t trust my input: Frontend Security for Developers (Gian-Luca Frei)\n* One (1) two day training course, 3rd-4th October - US $1,010\n* Hacking Modern Web Apps - Master the Future of Attack Vectors (Ashwin Shenoi)\n* One-day conference, 5th October - US $35.00\n\nConference and Training schedule: [https://singapore.globalappsec.org/schedule/](https://singapore.globalappsec.org/schedule/)\nRegistration link: [https://whova.com/portal/registration/owasp_202310/](https://whova.com/portal/registration/owasp_202310/)"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-09-13",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721023",
        "timezone": "Pacific/Auckland",
        "description": "**NOTE DATE CHANGE:** Due to a scheduling conflict, the September Meetup isn't on its usual date. This month, we're meeting on **Wednesday, 13 September.**\n\nFor our September Meetup, our friends at SMX ([smxemail.com](https://smxemail.com/)) have kindly agreed to be our hosts. SMX's office is located in the B:HIVE shared workspace, in Takapuna, and we'll be meeting in one of the ground-level conference rooms.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nIn late 2021, we restarted our introductory coverage of the OWASP Top 10, with the 2021 edition, and we're nearing the end of the cycle. Our Top 10 topic for September will be **A09:2021 - Security Logging and Monitoring Failures.**\n\n**Technical Topic Speaker:** John DiLeo (IriusRisk and OWASP NZ)\n\n**Talk Title:** Listener's Choice (I have a few talks I can do, or we can have a general AMA session about OWASP projects/tools, or...)\n\nThe Auckland-area OWASP Meetup usually takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP x D.O.N.E.",
        "date": "2023-09-21",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/294887196",
        "timezone": "Europe/London",
        "description": "After the success of our last joint meetup we're back for another. It's September which means CyberFest. We're delighted to be joining up with the wonderful Dev.Ops.North.East for an evening about all things Dev**Sec**Ops.\n\nWe’ll be doing our usual two talks and pizza format.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n\n1815 - 1820 OWASP Newcastle and D.O.N.E. Welcome\n\n1820 - 1830 Andrew Pounder on CyberNorth and CyberFirst\n\n1830 - 1920 Talk one\n\n1920 - 2000 Pizza and networking\n\n2000 - 2045 Talk two\n\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk 1\n\n**Title:** Driving the most out of DAST\n\n**Speaker:** Simon Gurney\n\n**Speaker Bio:** Simon is one of the Punk Security Co-Founders and has over 15 years experience working within IT, primarily focused on automation and InfoSec.\n\nSimon has a wealth of experience and approaches DevOps from an infrastructure background, but is a keen Python and .NET CORE developer. He has authored two open source projects, pwnSpoof and SMBeagle.\n\n**Talk Synopsis:** Unlike SAST and IAST, DAST can be a difficult tool to implement and configure in DevSecOps pipelines. In this session, we will explore why this is and what the real prerequisites are to getting meaningful results from DAST tooling.\n\nSimon will explore a few different DAST tools, including ZAP, and discuss how using functional testing scripts can help navigate your apps and drive out DAST findings.\n\nTalk 2\n\n**Title:** Securing your software supply chain\n\n**Speaker:** Jonny Brodie\n\n**Speaker Bio:** Jonny Brodie is Cloud Security Engineer, currently working in DevSecOps.\n\n**Talk Synopsis:** The ability to reuse opened sourced libraries and packages has given rise to rapid software development. This talk will discuss what we defined in code as part of DevOps and how we can secure that code. The talk will cover Application Code, Infrastructure as Code and Dockerfile configuration.\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\nYou can also join our Google Group which is how we'll be sending out emails to events and is also going to be used as a forum for discussion.\n\nhttps://groups.google.com/a/owasp.org/forum/#!forum/newcastle-chapter"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Chapter Meeting",
        "date": "2023-09-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/295595923",
        "timezone": "America/New_York",
        "description": "This is an In-Person Event\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nSpeaker 1: **TBD**\n\nTopic: **TBD**\n\nSpeaker 2: **TBD**\n\nTopic 2: **TBD**"
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "Test Driven Application Security + Post-Quantum Cryptography 101",
        "date": "2023-09-20",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-oslo/events/295822703",
        "timezone": "Europe/Oslo",
        "description": "Welcome to OWASP Oslo September meetup. Special thanks to venue and food sponsor Visma.\n\nFirst presentation:\n**Test Driven Application Security**\n\nMost penetration tests find vulnerabilities present in the OWASP TOP 10 lists. Many originate from unclear non-functional requirements and a lack of tests with security in mind. This presentation will demonstrate a test-driven approach to application security and show how we can write automated tests to prove that our defenses work as expected. Demos will be in C#, for an API in [ASP.NET](http://asp.net/) Core 7.\n\nTarget audience\nAll concerned with building secure applications. The demos are in C#, it is good to have a basic understanding of C# and unit testing, but the concepts and security best practices relevant regardless of programming background and level.\n\nTobias Ahnoff - Application security specialist at Omegapoint\nTobias Ahnoff is an experienced .NET developer and architect with focus on application security. He specializes in implementing authentication flows and authorization for web applications and APIs that manage sensitive data in the bank, finance, and health sectors. He performs security reviews and penetration tests as part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security.\n\nMartin Altenstedt - Application security specialist at Omegapoint\nMartin Altenstedt is a software developer and architect with 25 years of experience in Sweden's IT industry. He specializes in being able to take part in both the development and management of software. He is part of Omegapoint Cybersecurity Gothenburg, a group of experts in application security, and has developed several courses in secure application development and gives presentations on application development and security.\n\nSecond presentation:\n**Post-Quantum Cryptography 101 - aka. The end of the world as we know it**\n\nYou might have heard that the advent of Quantum Computers heralds the end of commonly used cryptography, but what does that mean, and why does it concern you?\nIn this talk, I will help answer some of these questions. You will learn what a Quantum Computer is, why they are such a bad thing for cryptography, and what you should do about it.\n\nTarget audience\nThe talk does not require any prior knowledge, but some points will be lost to non-technical participants.\nDevelopers, Tech Leads and Architects will get the most out of the talk, but the content is adapted to a varied audience so managers of technology businesses would also benefit.\n\nStian Svedenborg\nStian is a security enthusiast with a passion for cryptography. He graduated from NTNU in 2014 specializing in cryptography and spent a number of years as a developer. He has entered the eID space as the Security Architect for BankID."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa September 20th 2023: Vulkan Unveiled-Tools of the Trade",
        "date": "2023-09-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/295676016",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\n**Health Notice:**\n\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=PDU9_aooRRU\n\n**6:00 PM EDT** Arrival, setup, mingle\n\n**6:30 PM EDT** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **Vulkan Unveiled-Tools of the Trade.**\n\n**Abstract:**\n\nThe Vulkan files have exposed a clandestine world of state-sponsored cyberwarfare, revealing the collaboration between NTC Vulkan, a private defence contractor, and Russian intelligence agencies. This presentation delves into the significance of the leaked files, shedding light on the role of private contractors in cyber warfare and the implications for global cybersecurity. It explores the capabilities of Amezit, Skan, and Krystal2V, three prominent tools mentioned in the leaked documents, providing insights into their functionality and potential impact. By examining the authenticity of the files, assessing their usage, and analyzing the broader implications, this research aims to deepen our understanding of Russia's cyber capabilities and the challenges they pose for international security. The findings underscore the need for stronger regulations, international cooperation, and enhanced defence strategies to counter the evolving threats in the cyber domain.\n\n**Speaker Bio:**\n\nBy day, Julian works as a penetration tester hunting vulnerabilities to exploit. By night, Julian is a researcher and journalist focused on Russian cyberspace. Using his OSINT skills, Julian uncovers emerging threats to the Western world\n\nPavle is a cybersecurity analyst with an academic background in political science. He is fluent in English, French, Russian, Serbian, and Bulgarian, with a keen interest in understanding the implications of the evolving threat landscape on human and civil rights.\n\nDriven by a deep curiosity about the intersection between cybersecurity and global politics, Pavle focuses on the motivations behind state-sponsored cyberattacks, cyberwarfare domains, and emerging cyber governance.."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-09-28",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/295239486",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Poland Day 2023 - The truly underground IT security conference",
        "date": "2023-10-04",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/295385092",
        "timezone": "Europe/Warsaw",
        "description": "OWASP Poland Day 2023 - Guido Coal Mine - Zabrze\n\n**[Register using this link](https://owasp-poland-day-2023.eventbrite.com/?aff=meetup)**\n\n(event is paid, but we are doing our best to keep it as low as possible)\n\nOWASP Poland Day is the largest annual security conference in Poland focused on topics related to application security. The conference brings together developers, penetration testers and CISOs responsible for ensuring application security. Apart from great presentations delivered by leading application security professionals and researchers the conference will be fantastic networking opportunity.\n\nAfter the pandemic we are back with an even better conference. Since we organize it in Silesia, it will be very unique – probably the only one in the world application security conference:\n\n* 320 meters under the ground\n\n* Held in coal mine and museum\n\n* 2 tracks, 17 presentations. 300+ attendees.\n\nIf you want to attend, you have to use Eventbrite for registration. Please do not RSVP using Meetup. It's a paid event but we are doing our best to keep entrance fee as low as possible, just to cover venue, coffee and lunch, speakers expenses, evening networking event etc.\n\n**Register at: [https://owasp-poland-day-2023.eventbrite.com/?aff=meetup ](https://owasp-poland-day-2023.eventbrite.com/?aff=meetup)**\n\nAgenda and speaker list at: [https://owasp-poland.day/](https://owasp-poland.day/)\n\nPlease spread the word!"
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "So You Want a Career in Security?",
        "date": "2023-09-21",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/295909126",
        "timezone": "America/Los_Angeles",
        "description": "Let’s talk about the different career options in the vast security field, how to prepare and gain the necessary skills in order to break in and succeed. Hopefully this will help you focus on a particular area of the security field that best matches your interests and skills.\n\nThis is going to be a short presentation with hopefully lots of interactions and Q&A.\n\nDoors open at 5:30. The presentation will begin about 6:00.\n\nNetSPI is the sponsor for our September event. They are providing food as well as a location. They have sponsored us before, and we are grateful for their continuing support."
    },
    {
        "group": "Riyadh",
        "repo": "www-chapter-riyadh",
        "name": "Data Privacy and KSA PDPL",
        "date": "2023-09-14",
        "time": "1:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/295697538",
        "timezone": "Asia/Riyadh",
        "description": "**Topics covered:**\n\n* Introduction to KSA PDPL\n* Timelines of KSA PDPL\n* Position Prior to PDPL\n* What is the scope of Applicability\n* Privacy Definitions, Role of Regulatory Authority\n* Organizing Data Protection & Internal External compliance"
    },
    {
        "group": "Sao Jose Dos Campos",
        "repo": "www-chapter-sao-jose-dos-campos",
        "name": " Debate: Carreira de TI - Verdades e Mitos",
        "date": "2023-09-14",
        "time": "1:00-03:00",
        "link": "https://www.meetup.com/owasp-sao-jose-dos-campos-chapter/events/295736158",
        "timezone": "America/Sao_Paulo",
        "description": "Prezados entusiastas de tecnologia,\n\nVocê está convidado para um emocionante evento online que irá explorar o fascinante mundo da Carreira de Tecnologia da Informação (TI). Se você está considerando entrar na área de TI, já está nela ou apenas tem curiosidade sobre os aspectos reais por trás dos mitos, este encontro é feito para você!\n\n**Tema: Carreira de TI - Verdades e Mitos** **Data: 14/09/2023** **Horário: 21:00** **Local: Online**\n\nJunte-se a nós enquanto exploramos os altos e baixos da Carreira de TI, desvendando mitos comuns e trazendo à tona as verdades que moldam o setor. Teremos a honra de receber especialistas do campo que compartilharão suas histórias pessoais, insights sobre o setor e dicas práticas para navegar na carreira de TI.\n\n**Destaques do Evento:**\n\n* **Mitologia vs. Realidade:** Vamos desmascarar os mitos populares que cercam a TI e discutir as realidades que os profissionais enfrentam.\n* **Jornadas Inspiradoras:** Nossos palestrantes compartilharão suas jornadas únicas na indústria, incluindo desafios superados e conquistas marcantes.\n* **Orientação de Carreira:** Aprenda sobre as diferentes trilhas de carreira em TI, oportunidades de crescimento e como se preparar para o sucesso.\n* **Perguntas e Respostas:** Um momento valioso para você tirar suas dúvidas diretamente com nossos experientes palestrantes.\n*\n\nEste é o momento perfeito para obter insights de profissionais que prosperam na indústria de TI e desmistificar as ideias preconcebidas. Independentemente de você ser um estudante aspirante, um profissional em transição de carreira ou um veterano da indústria, este Meetup oferece uma oportunidade única para explorar e se conectar.\n\n**Agende seu lugar hoje mesmo!**\n\nhttps://youtube.com/live/wmRllgSdzRk\n\nVenha se juntar a nós para uma tarde enriquecedora de aprendizado e discussão. Espalhe a palavra entre seus colegas de tecnologia e amigos que também possam se beneficiar com essa experiência.\n\nMal podemos esperar para ver você lá e compartilhar insights valiosos sobre a emocionante Carreira de TI!\n\nAtenciosamente,\n\nOWASP São José dos Campos"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Team Goes on a Vacation: Self-service threat modeling",
        "date": "2023-09-13",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/295662087",
        "timezone": "America/Los_Angeles",
        "description": "Instead of a lunchtime social, this month we have a guest speaker lined up that you'll be eager to see. Welcome [Jeevan Singh](https://www.linkedin.com/in/jeevansecurity/) as he helps us explore self-service threat modeling!\n\nThreat Modeling is an important part of every company’s Security Development Lifecycle, but as development teams grow bigger, Security will have to choose which features they want to Threat Model or they will become a bottleneck for the development organization.\n\nWhat if I told you, you could have your cake and eat it too? It is possible to scale your threat modeling program to \\*every\\* feature and you don’t have to be a bottleneck to the development organization. What if I also told you that the Threat Models in this utopia are also of higher quality as well?\n\nIn this utopian world, Threat Modeling is no longer the Application Security team’s responsibility. The responsibility now lies with the development teams. Self-serve Threat Modeling is the way of the future.\n\n* [Slack @ #chapter-seattle](https://bit.ly/owasp-seattle-slack)\n* [seattle-chapter@owasp.org](https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - September 2023",
        "date": "2023-09-26",
        "time": "9:30+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/295821190",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Threat Modeling in a Zero Trust World",
        "date": "2023-09-21",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/295884874",
        "timezone": "America/New_York",
        "description": "Zero trust is all the rage. Nevertheless, zero trust has vast implications for AppSec and threat modeling. Zero trust threat modeling means the death of the trust boundary and assumes attackers are in the environment, and data sources and flows can no longer hide.\nApply the concept of zero trust to threat modeling by understanding what changes and considering a threat model of the zero-trust architecture. Explore new design principles in a zero-trust threat model and apply a mnemonic and taxonomy of threats impacting zero-trust applications.\nLong live the threat model, but say goodbye to the trust boundary."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Attacking Android applications",
        "date": "2023-09-21",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248516",
        "timezone": "America/Vancouver",
        "description": "**Attacking Android applications** with **Harsh Modi**\n\nThis talk will cover in depth on how attackers attack android applications in the wild, and earn bounties from it. Modern methodologies, tools and techniques with live demonstration will be covered. The viewers will dive into basic understanding of android applications to advance techniques used in the modern world. Finally, some core devsecops concepts will be introduced and how the vulns are mitigated at an organizational level.\n\n**Speaker**\n\nWith over 7 years of dedicated experience as an Offensive Security Engineer and Penetration Tester, Harsh Modi has honed an exceptional skill set in identifying and mitigating security vulnerabilities. His relentless pursuit of knowledge and mastery in the field has propelled him to become a respected figure in the cybersecurity landscape. Alongside his dynamic role, he has played a pivotal part in shaping the security domain as an Entrepreneur and Lead Security Architect at Bell. His influence extends beyond corporate boundaries, as he also serves as the Director of the ISACA Mentorship Program, nurturing the next generation of security professionals. A sought-after speaker, Harsh Modi has graced prestigious platforms such as VIPSS, BSides Vancouver, OWASP Vancouver, BSides Edmonton, and BSides Calgary, where he shares invaluable insights and contributes to the industry's advancement. With an unwavering commitment to excellence, Harsh Modi continues to champion a more secure digital realm."
    },
    {
        "group": "Security Integration System",
        "repo": "www-project-security-integration-system",
        "name": "Data Privacy and KSA PDPL",
        "date": "2023-09-14",
        "time": "1:00+03:00",
        "link": "https://www.meetup.com/owasp-riyadh-meetup-group/events/295697538",
        "timezone": "Asia/Riyadh",
        "description": "**Topics covered:**\n\n* Introduction to KSA PDPL\n* Timelines of KSA PDPL\n* Position Prior to PDPL\n* What is the scope of Applicability\n* Privacy Definitions, Role of Regulatory Authority\n* Organizing Data Protection & Internal External compliance"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #62 - SAP from the Attackers side  & CI/CD Orchestration",
        "date": "2023-09-21",
        "time": "7:30+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/295190157",
        "timezone": "Europe/Berlin",
        "description": "Hi all, we are delighted to host the next in-person event in Frankfurt! For this event, we will have a range of interesting talks delivered by leaders within Product & Cyber Security. There will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\n\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **codecentric AG.**\n\n_What are we going to talk about?\n\n**My CI/CD pipeline contains all security tools available! Now what...?**\n\n*Jasmin Mair* *\\- Experienced application security professional and global product security manager at Leica Microsystems\\.*\n\nTools are helpful to enable DevSecOps, many challenges and pitfalls highlight the need for a cultural shift. Explore issues such as security resistance, conflicting KPIs and organizational silos. Real-world examples and best practices will provide actionable insights to overcome these obstacles.\n\n**Talk 2 - SAP from an Attacker’s Perspective – Common Vulnerabilities and Pitfalls**\n\n*Nicolas Schickert, penetration tester at usd AG, spearheading the SAP pentest team & Tobias Hamann penetration tester at usd AG with an interest in reverse engineering and vulnerability research*\n\nThis talk will give an overview of vulnerabilities discovered during SAP pentests and what approach was taken to assess an SAP system’s security. One significant aspect of this talk will be sharing real-world examples of SAP vulnerabilities that were discovered during pentesting. This will help the audience to understand the practical implications of these vulnerabilities and how they can be exploited by attackers. Overall, the takeaway for the audience will be a better understanding of common SAP vulnerabilities, the potential impact of these vulnerabilities, and practical ways to mitigate them. By the end of this presentation, the audience will be equipped with the knowledge and tools needed to secure their SAP systems and prevent attacks.\n\n_Afterwards? We will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks** kindly provided by **codecentric AG**. Due to the hard end at 21.30, everyone interested can join us at the **Bockenheimer Weinkontor** (https://goo.gl/maps/6DWRcgFEH27FkaDb8) for drinks at their own cost.\n\n_When?\n\nOur Meetup takes place on 21.09.2023 from 17.30 to 21.30 o'clock CEST.\n\n_Where?\n\ncodecentric AG, Lise-Meitner-Straße 4, 60486 Frankfurt am Main\n\n_Interested in **giving a talk** yourself?\n\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\n\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\n\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]