[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2024 (Online)",
        "date": "2024-05-28",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207005",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "May 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-05-09",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299656219",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, May 9th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “AI study group\"",
        "date": "2024-05-02",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536962",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\n**When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/).\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Beja",
        "repo": "www-chapter-beja",
        "name": "0x01 Securing the Web",
        "date": "2024-05-23",
        "time": "14:30+01:00",
        "link": "https://www.meetup.com/owasp-beja-chapter/events/300539527",
        "timezone": "Europe/Lisbon",
        "description": "Securing the Web is the second meetup of OWASP Beja chapter which will be held on May 23rd, 2024, at 14:30 sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**.\n\n**Schedule**\n\n14:30 - **Welcome Notes** by OWASP Beja chapter leadership team\n14:35 - **Purple Team Approach Towards Confluence RCE** by Paulo Viegas\n15:00 - **Newton's Third Law: Static vs. Dynamic Abusers** by Diogo Sousa\n16:00 - **Snacks & Drinks** sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**\n\n**Talks**\n\n**Purple Team approach towards Confluence RCE**\nby Paulo Viegas, Threat Detection Analyst @ Siemens\n\nTalk about the value of collaboration between the red and blue team with a practical example.\n\n**About the Speaker**\nCurious Blue Teamer with special taste for malware and forensics.\n\n\\-\\-\\-\n\n**Newton's Third Law: Static vs. Dynamic Abusers**\nby Diogo Sousa, Engineering Manager @ Canonical\n\nIf you offer a service on the web, odds are that someone will abuse it. Be it an API, a SaaS, a PaaS, or even a static website, someone somewhere will try to figure out a way to use it to their own needs. In this talk we'll compare measures that are effective against static attackers and how to battle a dynamic attacker who adapts to your counter-measures.\n\n**About the Speaker**\nAn opinionated individual with an interest in cryptography and its intersection with secure software development."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE Chapter Meeting (21/05/2024, Brussels)",
        "date": "2024-05-21",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/300566355",
        "timezone": "Europe/Brussels",
        "description": "On May 21st, we organize our next OWASP Belgium chapter meeting at BeCentral (Brussels), by the courtesy of Proximus-ADA.\n\n**Agenda**:\n\n* 18h00-18h30: Welcome and refreshments\n* 18h30-18h40: **OWASP Update**\n18h40-19h30: **[User Privacy in Online Location-Based Services](https://owasp.org/www-chapter-belgium/#user-privacy-in-online-location-based-services---victor-lepochat-and-karel-dhondt-distrinet---ku-leuven)** (by Victor LePochat and Karel Dhondt, KU Leuven-Distrinet)\n19h30-19h45: Break\n19:45-20h35: **[Signaling New Frontiers: SS7 Insights by Jeremy Schmidt (Proximus ADA)](https://owasp.org/www-chapter-belgium/#signaling-new-frontiers-ss7-insights---jeremy-schmidt-proximus-ada)** (by Jeremy Schmidt, Proximus ADA)\n21:00: Close\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE Chapter Meeting (02/05/2024, Antwerp)",
        "date": "2024-05-02",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/300566321",
        "timezone": "Europe/Brussels",
        "description": "On May 2nd, we organize our next OWASP Belgium chapter meeting at [Karel de Grote](https://www.kdg.be/) University of Applied Sciences and Arts (Antwerp).\n\n**Agenda**:\n\n* 17h30-18h20: Welcome and refreshments\n18h20-18h30: **OWASP Update**\n18h30-19h30: **Navigating the Evolving Landscape of Cyber Security Legislation as an IoT Device Manufacturer** (by Joris Gorinsek, NIKO)\n19h30-19h45: Break\n19:45-20h45: **OWASP Cornucopia and Scrum: A strategic approach to introduce threat modeling in an Agile development process** (by Ive Verstappen & Jev Meijvis, DotNET lab)\n21:00: Close\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Bham Chapter Meetup May 2024!",
        "date": "2024-05-23",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/300370233",
        "timezone": "Europe/London",
        "description": "Welcome from OWASP Birmingham our first Meetup of 2024\n\nOnce again we'll be @Hays at One Colmore Square Thursday 23rd May for two great Infosec talks\n\nWatch this space, more details to come! Looking forward to another oppotunity to connect around Cybersecurity with lots of interesting folks from all over the Midlands"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Rethinking attack surface management for an entire country",
        "date": "2024-05-14",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/300746223",
        "timezone": "Australia/Brisbane",
        "description": "In the physical world, if our neighbours left their front door open and were being robbed in broad daylight, the community would do something about it, like calling the police or yelling at the criminals from a safe distance. On the internet, we don’t really do anything. Even the government just sits around waiting for people to (virtually) get shot and then report an incident. We need to rethink our approach.\nIn this talk, Haoxi will talk about trench stories over the last 6 months of running DirectCyber, a volunteer based CSIRT that tracks exposures to critical vulnerabilities and notifies potential victims with pinpoint accuracy. He will cover why this was feasible to run with 2.5-person team, how to prioritise which vulnerabilities to track, challenges for disclosure, and legal concerns. He will share success cases from other public and private sector companies such as DIVD and TruffleSec, along with the bigger picture of how we can influence government security strategy for the better if we work together."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "OWASP Top 10 for Large Language Model Applications",
        "date": "2024-05-16",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295530895",
        "timezone": "America/New_York",
        "description": "The OWASP Top 10 for Large Language Model Applications project aims to educate developers, designers, architects, managers, and organizations about the potential security risks when deploying and managing Large Language Models (LLMs). The project provides a list of the top 10 most critical vulnerabilities often seen in LLM applications, highlighting their potential impact, ease of exploitation, and prevalence in real-world applications. Examples of vulnerabilities include prompt injections, data leakage, inadequate sandboxing, and unauthorized code execution, among others. The goal is to raise awareness of these vulnerabilities, suggest remediation strategies, and ultimately improve the security posture of LLM applications."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Mai 2024",
        "date": "2024-05-13",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/300715711",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **[Theodo](https://www.theodo.fr/)** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - May 2024",
        "date": "2024-05-08",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/300284832",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is excited to welcome you to our latest Meetup event! \nPrepare to dive into the world of AppSec with an evening filled with engaging security topics, networking, and of course, plenty of food and drinks.\n\nThis time, we're delighted to have Playtika host our gathering!\n\n====================================================================\n\n**Agenda**:\n 18:00 - 18:30 - gathering and food - We will gather at Playtika's Cafe for drinks, great treats, and mingling.\n\n 18:30 - 18:45 - Keynote + Microphone tuning\n\n 18:45 to 19:30 - Surviving The Jungle of SCA\nRaz Rosh - Product Security Engineer and DevSecOps Expert @ Playtika\nThis presentation is tailored for developers, security professionals, and anyone interested in advancing the security and efficiency of integrating open-source and third-party components into software projects. It will delve into the vital practices of identifying, analyzing, and managing third-party dependencies to mitigate risks and ensure compliance. Attendees will discover how to integrate Software Composition Analysis (SCA) tools into the CI/CD pipeline, address common challenges such as false positives and performance overhead, and deploy strategies to minimize alert noise and prioritize vulnerabilities efficiently. The aim is to streamline the SCA process, making it a seamless component of the development lifecycle and empowering participants to significantly bolster their software security posture. Join us to transform SCA from a daunting task into a manageable and integral part of your DevSecOps practices.\n\n 19:30 - 20:00 \\- Malvertising \\| tactics\\, techniques\\, and procedures \\(TTP\\) implemented in auto redirect attack\nLiran Lavi - Security Research Team Leader @ GeoEdge\nMalvertising, a fresh cyberattack tactic, entails embedding malicious code into digital advertisements. This insidious technique poses challenges for both internet users and publishers, as the infected ads are often spread through reputable advertising networks. Given that ads are visible to all website visitors and often contain many security misconfigurations, virtually every page viewer faces the threat of infection.\n\n 20:00 - 20:30 - Understanding Prompt Injection Attacks in Generative AI\nAviv Avraham Levy - Senior Security Researcher @ F5 Networks\nThis presentation provides an in-depth look at Generative AI and Large Language Models (LLMs), focusing on the mechanics of prompt injection attacks. It highlights various types of prompt injections and showcases real-world scenarios to illustrate how these vulnerabilities can be exploited. The session includes demonstrations of prompt injection attacks in action and concludes with an overview of potential mitigation strategies.\n\n=====================================================================\n\nThis event is hosted by Playtika in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-05-20",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/299878996",
        "timezone": "America/New_York",
        "description": "An introduction to OWASP's Juice Shop. A vulnerable website built for CTF practice."
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "OWASP KC May Meetup",
        "date": "2024-05-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-kansas-city/events/300496496",
        "timezone": "America/Chicago",
        "description": "TBD"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAY 22, 2024",
        "date": "2024-05-22",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300022938",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Securing Generative AI Applications using the OWASP Top 10 for Large Language Models\nJoin us for dinner+drinks, networking, and see a presentation by **Steve Wilson**, OWASP project leader and Chief Product Officer at **Exabeam**\n\n**ABSTRACT**: What are the new risks that generative AI brings to your environment? In this cutting-edge session, we uncover the potential hazards that Large Language Models (LLMs) introduce to modern application ecosystems. Drawing on the expertise distilled in the OWASP Top 10 for LLMs, we offer a comprehensive roadmap for mitigating these risks. Attendees will gain insights into securing generative AI applications, recognizing the nuances of LLM vulnerabilities, and deploying defenses. This talk is a call to action for developers and security professionals to foster a culture of secure, responsible AI development. Equip yourself with the knowledge to anticipate threats, apply best practices, and build AI systems that are not only intelligent but also resilient in the face of cybersecurity challenges.\n\n**THANKS to OUR SPONSOR**: *[Kodem](https://www.kodemsecurity.com/)*\n*Kodem means “first” or “early” in Hebrew. A priority. We believe in helping appsec teams make security a priority by spotlighting risks that truly matter. We believe in helping developers improve code quality by shifting left and catching issues early. And we believe in making people a priority: our customers, our team, and our partners.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: May Meetup (Speaker TBA)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Mark your calendars, for our next meetup! We will be editing this shortly with the speaker info and topic!"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Supply Chain Security with Dan Lorenc, CEO Chainguard",
        "date": "2024-05-22",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/298689779",
        "timezone": "America/Chicago",
        "description": "Join us for an informative and hands-on workshop on securing your software supply-chain. In this event, we will be joined by Dan Lorenc, CEO and founder of Chainguard Inc. We will have food, learning, swag and, of course, networking with other like-minded folks in the area.\n\nNote: This event is organized by the OWASP Nashville Chapter and is open to both OWASP members and non-members. Whether you are already a member or interested in becoming one, we encourage you to attend this event and learn more about the benefits of being part of the OWASP community."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Understanding the Cyber Kill Chain with Elizabeth Stephens",
        "date": "2024-05-01",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300316300",
        "timezone": "America/Chicago",
        "description": "This session will delve into the Cyber Kill Chain, a foundational framework for comprehending cyberattacks. We'll explore how attackers operate and empower ourselves to build targeted defenses. While a valuable tool, we'll also discuss the Kill Chain's limitations and the evolving nature of attacker tactics."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "CyberBooked 2024",
        "date": "2024-05-23",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/300656600",
        "timezone": "Europe/Amsterdam",
        "description": "### **Book your ticket now as seats are limited!**\n\nCyber Booked is a one of a kind physical CyberSecurity event, featuring both recently published and more well-known CyberSecurity books. The authors will share the latest insights from their books and you will have the opportunity to ask them questions about their books. During the break and drinks you can meet & greet with the authors and maybe even get your book signed!\n\nThis event is a joint event organised by the Dutch chapters of OWASP along with ISACA, ISC2 and the Secure Software Alliance (SSA).\nThe event is free of charge and CPE certificates will be issued from ISACA and ISC2. The event will be presented in English.\n\nPlease use the link below to register for the event with you full and correct information as this information will be used to process your CPE points.\n\nhttps://isaca.nl/events/cyber-booked-2024/"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-05-21",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780385",
        "timezone": "Pacific/Auckland",
        "description": "We've resumed our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for May will be **A02:2021 - Cryptographic Failures**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-05-30",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/300641588",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "May 2024 Meeting",
        "date": "2024-05-07",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/300506523",
        "timezone": "America/Phoenix",
        "description": "**Topic #1 - GitHub Supply Chain Attack Overview** \\- 5 Minutes\n*In March, Dark Reading reported a [GitHub Supply Chain Attack](https://www.darkreading.com/application-security/github-developers-hit-in-complex-supply-chain-cyberattack). Learn about the GitHub platform, software package dependencies, and the attack techniques in this high level overview.*\n\n**Topic #2 - OWASP Top 10 Web Application Risks Quiz -** 20 Minutes\n*Test your knowledge of the [OWASP Top 10 web application security risks](https://owasp.org/www-project-top-ten)! Compete for a chance to win fabulous prizes (aka candy bars).*\n\n**Cost**\n\nFree!\n\n**OWASP Info**\n\nOWASP is a non-profit dedicated to **application security**. Our meetings are free to attend and you do not need to be a member, nor have any experience with application security. All are welcome!\n\n**Meetings Every Month!**\n\nMeetings occur the first Tuesday of every month. Be sure to join our Meetup page to be notified of future meetings and topics.\n\n**Free Parking**\n\nFree Parking Lot:\n1 N Macdonald St, Mesa, AZ 85201\n[https://downtownmesa.com/parking/green-lot](https://downtownmesa.com/parking/green-lot)\n\nNote that this parking lot is across the street from HeatSync Labs. There are other nearby lots and street parking as well."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: May Meetup (Speaker TBA)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Mark your calendars, for our next meetup! We will be editing this shortly with the speaker info and topic!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Seattle OWASP Chapter Talk: So you want a career in Security?",
        "date": "2024-05-08",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300238774",
        "timezone": "America/Los_Angeles",
        "description": "This is really 2 talks, the first:\n\n**So you want a career in Security?**\n\nLet’s talk about the different career options in the vast security field, how to prepare and gain\nthe necessary skills in order to break in and succeed. Hopefully this will help you focus on a\nparticular area of the security field that best matches your interests and skills.\n\nFollowed up with my personal journey:\n\n**My job hunt journey (Nov 2023-Feb 2024)**\nThis is mostly related around what I had to do in order to land the job, self promotion,\nnetworking, applying, preparing, etc.\nThis is going to be a short presentation with hopefully lots of interactions and Q&A.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Zero Trust in API Security",
        "date": "2024-05-08",
        "time": "19:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/300531477",
        "timezone": "Asia/Singapore",
        "description": "The ultimate goal of Zero-Trust Architecture is to protect an organization’s critical data against advanced threats. However, the current market focus is overly focused on network architecture, overlooking the elephant in the room.\n\nIn a modern application architecture, APIs are the backbone of interconnecting microservices. This means APIs are the most closely related ‘services’ to an organization’s data, which explains why advanced attackers target APIs. In this session, we will explain how the zero-trust concept protects APIs."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - The EU Cyber Resilience Act and why the SBOM is so important",
        "date": "2024-05-21",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/300469641",
        "timezone": "Europe/Stockholm",
        "description": "EU is about to become a market leader in software cybersecurity regulation. With a large set of proposed and active laws, software development will be regulated like never before.\n\nWith the coming EU Cyber Resilience Act (CRA) all software and embedded systems will have to get a CE mark, which is now expanded to include cybersecurity aspects. It’s going to be a huge change and will mean that the manufacturers (and in some cases importers) will get responsibility for the user’s security and will have to provide free security patches for the lifetime of the product. Software developers will have to learn secure coding and the need for cyber security professionals will be very high.\n\nOne of the focus areas is vulnerability management. To keep a product secure during its lifetime, all 3rd party components will have to be monitored and up to date. At the heart of this process is the Software Bill of Materials, SBOM, which is used to monitor for known vulnerabilities in both Open Source and commercial components. The OWASP CycloneDX project fits right in and have been working with various kinds of bill-of-materials for a long time. CycloneDX is in the process of becoming an ECMA standard and thus fits better in to the EU regulation.\n\nIn this talk Olle E. Johansson will introduce the proposed EU CRA legislation and talk about the SBOM with a focus on the toolchain needed to manage vulnerabilities.\n\nWe will start the evening with a mingle at 17:30 followed by a presentation that will start at 18:00. The talk will be around 1 hour long followed by a further mingle/time for questions and answers.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcoming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - Security Game Night @ Detectify",
        "date": "2024-05-02",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/300467215",
        "timezone": "Europe/Stockholm",
        "description": "It's board game night, for anyone interested in both board games & security!\n\nThe meetup will start with a mingle with snacks and refreshments at 17:30. The actual gaming will begin at 19:00 and the main presentation will begin at 18:00.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcoming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter ](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\n\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Threat Modelling with Reliable Data",
        "date": "2024-05-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/299507519",
        "timezone": "Europe/Zurich",
        "description": "Reliable data is inherently critical for application threat models. As threat modelling continues to proliferate across security programs, bad habits in feeding threat models with relevant data is becoming prevalent. This session will explore top 3 mistakes of \"data starvation/ gluttony\" with respect to application threat models and how to achieve a contextualized, balanced data diet.\n\nJoin this OWASP Switzerland event to learn more from Tony about threat modelling and how to make sure you use quality data in doing so."
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #25: Firewalls, Product Security & Contingency plans [IN-PERSON]",
        "date": "2024-05-23",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/300712957",
        "timezone": "Europe/Bucharest",
        "description": "The next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\n\nTheme sessions - Theme: Firewalls, Product Security & Contingency plans.\n\n\\`Schedule\\` **\\`Time:\\`**\\` 18:00 to 20:30\\`\nIntroduction, OWASP News & Updates - Catalin Curelaru\nSecuring the Gates: The Hidden Flaws Behind the Firewall - Adrian Daniel BACANU (RAZDON)\nRunning a Product Security Assessment Program at scale - Alina NICULA (VISMA)\nContingency plan from security point of view - Adrian BARAN (VITESCO)\n\nLocation of the event: UBC3, et 10, Sediu VISMA, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by VISMA\n\nMore about the speakers and topics:\n**Adrian Daniel BACANU - CEO @ RAZDON,** is the CEO and co-founder of Razdon, a pioneering CyberSecurity startup. With 14 years of enterprise experience and a lifelong passion for hacking—now spanning two decades—Daniel brings a wealth of expertise to the cybersecurity field. He still offers some Security Architectural consultancy for different companies across Europe, and from time to time, he engages in bounty hunting. When not decoding the matrix of cyber threats, Daniel enjoys life with his wife and two boys, plays football twice a week, and maintains a spirited sense of humor—because in cybersecurity, sometimes, you really can't afford to joke.\n***\\~Securing the Gates: The Hidden Flaws Behind the Firewall\\~***\nEffective cybersecurity is not just about having defenses in place but ensuring they are properly designed. 'Securing the Gates: The Hidden Flaws Behind the Firewall' illuminates the common pitfalls in firewall implementations that often go unnoticed. This presentation will demonstrate typical design errors that compromise security and provide actionable insights on how to rectify these flaws to create robust defenses. Attendees will learn how to not only deploy but also optimize firewalls to safeguard their digital assets effectively.\n\n**Alina NICULA** - **VASP Lead and Product security assessment service owner and reviewer @Visma**. Alina has been working within product development teams as a software developer, security engineer, software and cloud service architect. In the last years she focused on software security by guiding Visma teams into securing their applications, data, cloud workloads, and delivery pipelines to avoid potential cybersecurity risks.\n***\\~Running a Product Security Assessment Program at scale\\~***\nHaving a product security assessment program is essential for any company. It is equally critical to ensure that this program remains relevant over the time and is scalable as the company grows.In this presentation, I will discuss how we ensure that our designed processes empower development teams to make informed security decisions while also giving them ownership over the remediation of the security aspects that impact their products.\nHowever, achieving this goal requires a strong and knowledgeable security review team that supports the delivery teams with informed security by design best practices.\nSo, how have we been able to grow our program? I hope you will leave this presentation with a clear understanding of our approach.\n\n**Adrian BARAN -** **Security Manager @ VITESCO**,\n\n***\\~ Contingency plan from security point of view \\~***\nAbstract:"
    },
    {
        "group": "Tirunelveli",
        "repo": "www-chapter-tirunelveli",
        "name": "Basics Of API - 101",
        "date": "2024-05-12",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-tirunelveli-chapter/events/300732125",
        "timezone": "Asia/Kolkata",
        "description": "Calling all OWASP and NULL enthusiasts in Tirunelveli!\nJoin us for an introductory session on APIs, led by Surya from the YouTube channel Cyterix. In this webinar, you'll gain a solid understanding of:\n=> What APIs are and how they work\n=> The role of APIs in app development\n=> Everyday applications of APIs\n=> How to make your first API request (with hands-on practice)\n\nThis session is perfect for anyone curious about how applications communicate and the power behind APIs. Whether you're a developer, security professional, or simply interested in tech, this workshop will equip you with the foundational knowledge to dive deeper into the world of APIs.\n\nDon't miss out on this chance to level up your tech skills!"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup - Mayo",
        "date": "2024-05-07",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/300745805",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY te invita a su próximo Meetup!**\n\n**Charlas**: aún por confirmar.\n**¿Cuándo?** Martes 7/5, 19:00.\n**¿Dónde?** Urudata, Santiago de Chile 1322, Barbacoa, piso 17.\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Ensuring Application Security Excellence in the Age of AI",
        "date": "2024-05-16",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516396",
        "timezone": "America/Vancouver",
        "description": "**Ensuring Application Security Excellence in the Age of AI** with Michael Argast\n\nIn a time where artificial intelligence (AI) permeates every facet of digital existence, the imperative to ensure application security has reached unprecedented heights. In this talk, Michael Argast, Co-founder and CEO of Kobalt.io will delve into the essential strategies for ensuring application security excellence amidst the pervasive influence of AI. By exploring the intricate interplay between AI and cybersecurity, you will gain insights into how AI augments defensive strategies, mitigates vulnerabilities, and addresses emerging threats within application environments. Through real-world case studies and practical recommendations, this session equips you with the knowledge and tools needed to leverage AI effectively in the face of evolving challenges.\n\n**Michael** is an experienced cybersecurity professional with over 20 years of industry experience. He is the co-founder and CEO of Kobalt.io, a rapidly growing cloud-focused security services provider. Kobalt.io works with over 200 cloud-focused technology companies to help develop their cyber security programs and ensure the security of their organization.\n\nWe would like to thank **Microsoft** for sponsoring this event."
    }
]