[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - April",
        "date": "2024-04-23",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460499",
        "timezone": "Europe/Copenhagen",
        "description": "**IMPORTANT:**\n\n* **You need to accept your attendance 14 days before start, April 9th!**\n* **You need to reverse into the parking spot!**\n\nOWASP Aarhus and Siemens Gamesa are happy to invite you to this OWASP Aarhus meetup - in Brande.\n\n**19:00 – 19:05** Welcome by Siemens Gamesa and OWASP Aarhus\n\n**19:05 – 20:00** Matija Stevanovic\n**Title:** *Safeguarding Wind Power – Cybersecurity in the context of Wind Power Plants*\n**Abstract:**\nIn recent years, the global energy landscape has undergone a remarkable transformation, with renewable energy sources emerging as pivotal players in the pursuit of a sustainable future. Among these, wind power has surged to the forefront, harnessing the natural force of wind to generate clean and efficient electricity. As we embrace the transition towards greener energy solutions, it is imperative that we also confront the challenges that accompany it. One such challenge, though perhaps less visible, is cybersecurity.\nThroughout this presentation, we will delve into the intricacies of cybersecurity as it pertains to wind power plants. We will explore the broader business context, provide overview of customer expectations and the increasingly stringent requirements imposed by national legislators. Additionally, we will sketch the threats and vulnerabilities facing these critical assets. Finally, we will provide an overview of the strategies and technologies deployed to mitigate these risks, ensuring the resilience and safety of our wind power infrastructure amidst the ever-evolving landscape of cyber threats.\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** Aleksander Kjær vil give en grundlæggende introduktion til forhandling baseret på Harvard Negotiations Project og Uri & Fishers bog \"Getting to Yes\".\n\nHan vil introducere nøglekoncepterne og teknikkerne inden for forhandling og vise, hvordan deltagerne selv kan anvende disse til at forbedre deres forhandlingsevner - både professionelt og personligt. Det er hans holdning, at alle kan blive en dygtig forhandler!\nDerudover vil han illustrere disse teknikker med konkrete eksempler fra virkelige forhandlingssituationer.\n\nHan vil også præsentere, hvordan man kan overbevise en tvær og nærrig ledelse om at investere mere i IT-sikkerhed ved hjælp af de forhandlingsteknikker, der har gennemgået.\n\nKort om Aleksander - Jeg har en kandidatgrad i økonomi og antropologi og har altid haft stor interesse for forhandling gennem mine studier, især i en international kontekst. Bl.a. var jeg i praktik på den danske ambassade i Tallinn Estland i 2018, hvor der skete en masse inden for det militære og cyber- og informationssikkerhed området i Danmark og Estland. Efterfølgende tilbragte jeg fire måneder i New York City, hvor jeg skrev mit speciale om danske virksomheders udfordringer med at etablere sig på det amerikanske marked. På nuværende tidspunkt studerer jeg softwareteknologi på 6. semester og er særligt interesseret i governance-området inden cyber- og informationssikkerhed, som jeg håber at gøre en karriere indenfor i fremtiden.\n\n21:15 – 21:30 Closing notes and goodbyes"
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "1. OWASP Augsburg Stammtisch",
        "date": "2024-04-17",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/300135115",
        "timezone": "Europe/Berlin",
        "description": "Die Agenda folgt in den nächsten Tagen und steht noch nicht fest. Inputs sind immer gerne willkommen!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-05-02",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536962",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2024 (Online)",
        "date": "2024-04-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207001",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-04-25",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536957",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-04-18",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/300097227",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "April 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-04-11",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299656027",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, April 11th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar @ Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Riscosity](https://www.riscosity.com/)\n*Riscosity is the data flow security platform that empowers teams to have full visibility of all data in transit and automates the redaction or redirection of sensitive events, simplifying how companies meet security and privacy requirements. With Riscosity teams can:*\n\n* *Track and pinpoint any data being sent to any 3rd-party APIs*\n* *Easily map data sub-processors and the information shared with them*\n* *Automatically replace detected sensitive data with redacted inputs*\n* *Continuously monitor and block APIs from data transfers that violate organizational policies*\n\n*For more information, please visit [www.riscosity.com](https://www.riscosity.com/).*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-04-11",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536939",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 27 April 2024",
        "date": "2024-04-27",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/300066541",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 27 April 2024 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* CTF Solvings for OSCP Aspirants by **SATHIYANARAYANA S**\n* Firmware diffing to Nday exploits by **IamAlch3mist**\n* Wannacry : Behind The Scenes by **Abhay Naik (Abhay Vox)**\n* Threat Intel by **Ashwin Maganahalli**\n* Shielding Cloud Buckets by **Pradeep Bhat**\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "April meetup",
        "date": "2024-04-23",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/300013837",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming April meetup, which will be hosted by the wonderful team at **Truffle Security**. Get ready for insightful discussions, delicious refreshments, and the chance to network with some of the brightest minds in the industry.\nAgenda:\n5-5.45Pm :- Doors open, networking and food\n5.45-6.30PM :- Leaked Secrets and Unlimited Miles\n6.30-7.15PM :- Secrets from a bygone era\n7.15-8 PM :- The Internet is broken, Putting IPv6 into perspective\n8PM Doors closed.\n\n**Talk#1: Leaked Secrets and Unlimited Miles by Sam Curry**\nNearly every major rewards program (United MileagePlus, American Express, Southwest Rapid Rewards, etc.) is powered by a single provider: [points.com](http://points.com/). Join us as we discuss vulnerabilities identified in [points.com](http://points.com/) and other pieces of airline infrastructure which lead to mass PII disclosure, an infinite money glitch, and free upgrades.\n\n**Talk #2 -** Secrets from a bygone era by **Dylan Ayrey**\nGitHub is a platform that was designed for sharing, it wasn't designed for unsharing. So how difficult does it become to unshare? This talk will dig into all the different ways your secrets might get replicated, propagated, persisted, and shared, for decades following your mistake.\n\n**Talk#3** The Internet is broken, Putting IPv6 into perspective\n**Description**:\nMost of the Internet is currently running on a legacy version of the Internet Protocol: IPv4. Despite of this, the number of engineers, especially in security, who know how to use IPv6 is relatively low. In this talk, previously presented internally at NCC Group, I will show you why today's Internet does not live up to its original vision, take you back to the past to show you what the IPv4 Internet used to look like and through this reveal the secrets that will make you understand IPv6.\n\n**Speaker**:**Denis Smajlović,** Founding Security Consultant at Nova Information Security. With a background in security consulting having worked for some of the largest financial institutions in Scandinavia and biggest tech companies in the Bay Area, I started Nova to provide web application and network pentesting services with the idea that we are able to work closer with clients and provide greater value."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Understanding the attack vectors in open-source packages",
        "date": "2024-04-17",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/299905218",
        "timezone": "Australia/Brisbane",
        "description": "All software ecosystems have their own tools and methods for managing dependencies and packages. However, with its widespread usage comes the inherent risk of vulnerabilities that can compromise the security of projects.\nColby will delve into common vulnerabilities such as package hijacking, malicious code injection, and dependency confusion, examining their impact on project security. Through real-world examples and best practices, attendees will gain a deeper understanding of how to identify, address, and prevent pip vulnerabilities within their Python projects."
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A night of OSINT and war stories",
        "date": "2024-04-09",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/300007686",
        "timezone": "Europe/Copenhagen",
        "description": "On this meetup in OWASP Copenhagen we'll focus on OSINT so we've arranged a few talks. One more may come, so hold on to your hats!\nSo far we have:\n\n* An Intro to OSINTer\n* Tracking down the killer (with OSINT)\n\nHere's a brief synopis:\n\n**OSINTer**\n*Synopsis*\nOSINTer is a new, digital platform tailored towards breezing through the complexities involved in extracting strategic cyber threat intelligence from news about cyber threats. Designed to streamline the traditionally laborious process of manually tracing and compiling data, OSINTer offers an automated, efficient means of identification, collection, and tracking of the ever moving cyberthreat landscape. At this workshop we will delve into the platform's journey from a spark of an idea to a robust platform, currently serving 30.000 monthly users, and go over how you can integrate it into your daily work, helping you stay on top of the constant inflow of information.\n\n*Speaker bio*\nBertram Madsen and David Clayton co-conspirators in the realm of cybersecurity, with each specializing in different facets of the industry to combat digital threats effectively. Bertram, a proficient full-stack software developer, emphasizes open-source development and community collaboration, manifesting in the creation of a range of cybersecurity solutions. Most notably, he's responsible for the development of OSINTer, a digital platform designed to ease collection of strategic cyber threat intelligence (CTI), and in collaboration with David, they are attempting to rethink how we do CTI. David is an established leader within Denmark's cybersecurity landscape, with a breadth of experience spanning various critical infrastructure sectors, financial security and strategic leadership roles. He's renowned for championing the SagaLabs concept, gaining TF-CSIRT certification for his team, and providing exceptional insights as one of only two official SIM3 auditors in Denmark.\n\n**Tracking down the killer**\n*Synopsis*\nIn the mid 1990’s Rasmus Kierkegaard Kristiansen – suspected of killing and dismembering a business partner I Portugal – managed to escape and hide from authorities. After a longer period of intense investigation, the trail was considered cold.\nIn 2018, 25 years after the murder, the unsolved case was still bugging the leading investigator at the time. He teams up with a TV production company to give the investigation another shot. As a\nbase requirement for funding, Kristoffer Scavenius was tasked with making a probable case that the murderer was in fact still alive. After initial setbacks, Kristoffer was eventually able to make the\ncase that Rasmus Kierkegaard Kristiansen was still alive and well, living in Sao Paolo, Brazil.\nThe talk will discuss some of the OSINT approaches used in this investigation.\n\n*Speaker bio*\nKristoffer Scavenius has worked in OSINT since 2013 and has held positions as researcher/programmer in both government and the private sector."
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "Security and Compression",
        "date": "2024-04-24",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-delaware-chapter/events/300190943",
        "timezone": "America/New_York",
        "description": "**Agenda**\n\n* **Chapter Intro**\n\n* **Main presentation: Title: Security and Compression**\n\nAuthor: Lucas Driscoll [https://github.com/Lukerd-29-00/](https://github.com/Lukerd-29-00/)\nAbstract: This is a talk on the cybersecurity risks caused by using compression, especially in a web context. It goes over the basic mechanics of attacking a scheme where text is compressed and then encrypted, the attacks that have been discovered in practice, and mitigations against them.\nThis relates to attacks against TLS, such as Compression Ratio Info-leak Made Easy (CRIME) and BREACH (Browser Reconnaissance and Exfiltration via Adaptive Compression of Hypertext) .\n\n* **Web Academy hands-on labs** \\- We continue our journey through the Web Academy at [https://portswigger.net/web-security/](https://portswigger.net/web-security/)\n\nThe meeting will be held in the library's computer lab to encourage people to get some hands-on web security testing experience."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP April Meetup - Join Us!",
        "date": "2024-04-17",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/300180802",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on in the new year on April 17th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:00 - food is served at 5:30 and the presentation starts at 6:00.\n\n**Presentation:** AppSec 2.0: Reimagine AppSec With Runtime Analysis\n\n**Abstract:** SCA tools (container and dependency scans) generate too much noise. Runtime security tools don’t understand SCA findings, and don’t come in until production. What if you could marry SCA with runtime analysis during dev, test, and prod?\n\nIn this session, Kiran Kamity, CEO and Founder of Deepfactor, will discuss how the next generation of AppSec needs to go beyond just integrating static SCA into your CI pipeline, to analyzing insecure behaviors inside running apps and correlating that back to SCA to understand which vulnerable components are actually loaded into memory and used by your application. This new approach to AppSec will detect both known vulnerabilities/CVEs with SCA scans and unknown vulnerabilities with runtime reachability analysis. It will then prioritize known vulnerabilities with runtime correlation of SCA findings. End result: you catch most of the key risks in your app, prioritize the key items your devs need to work on without flooding them with alerts, and remove unused components from your containers to burn down your CVE debt rapidly….and achieve the true mission of AppSec…to empower engineering and security teams to create secure applications"
    },
    {
        "group": "Fortaleza",
        "repo": "www-chapter-fortaleza",
        "name": "OWASP Fortaleza - Chapter Meetup 2024.1",
        "date": "2024-04-06",
        "time": "09:00-03:00",
        "link": "https://www.meetup.com/owasp-fortaleza/events/299259416",
        "timezone": "America/Fortaleza",
        "description": "Anunciamos oficialmente nosso primeiro encontro em 2024 da comunidade OWASP Fortaleza.\n\nGaranta sua vaga.\n\n**Teremos:**\nPalestras,\nCTF,\nSorteios de cursos\n\nEm breve mais informações."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #65 - Data Centricity and Securing AI",
        "date": "2024-04-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/299501950",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #65! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Data Centricity for Cloud and Application Security**\n\n*Prof. Dr. Igor Podebrad, Director CISO Office, Google Cloud*\n\nIgor's talk will demystify data-centricity as a key driver for robust application and cloud security. He'll contrast the shift to data-centricity focus how it underpins cloud, AI and supports sound risk decisions. He will also discuss how this shift is reshaping security and resilience in for digital transformation. Igor is currently a Director at Google Cloud's Office of the CISO and a former Group CISO at Commerzbank AG. He holds a PhD in Medical Care Logistics from the University of Berlin.\n\n**2\\. Talk: Securing GenAI Applications on Cloud: Three pronged approach**\n\n*Hari Hayagreevan - Senior Cloud Security Architect, IBM*\n\nThe convergence of Generative Artificial Intelligence (Gen AI) with cybersecurity introduces a spectrum of challenges and prospects. To embrace Gen AI extensively within enterprise contexts, it's imperative for these AI systems to be devoid of vulnerabilities in their application and infrastructure. This necessitates a holistic approach to securing Gen AI platforms. In this session, Hari will take you through the different viewpoints, offering insights from an Enterprise Security Architect’s perspective, with practical enterprise scenarios. Hari is Enterprise Security Architect and currently is the Technical Leader for IBM Consulting’s GenAI Security practice in DACH. He started his career as Cybersecurity incident responder (SOC Analyst) 18 years ago and now advises Enterprise CISOs and Security Architecture teams on adopting security principles for preventing cyber attacks.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 24.04.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\ncodecentric AG, Lise-Meitner-Straße 4, 60486 Frankfurt am Main\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-04-15",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/299874698",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-04-30",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/299453895",
        "timezone": "America/Los_Angeles",
        "description": "Join us for our 2nd mixer with participating cybersecurity communities in Southern California, enjoy the beautiful weather, amazing sunset, great conversations, network with your peers, make new friends!\nYou **don'**t have to be a member of any group to participate. Mark your calendars; see you there!!\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring OWASP LA events please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - APR 24, 2024",
        "date": "2024-04-24",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/298386031",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Building A Product Security Team – The Good, The Bad And The Ugly - Lessons From The Field\nJoin us for great networking, dinner and drinks, and see a presentation by **Peter Morin**, Principal, National Cyber Security Leader, **Grant Thornton LLP**\n\n**ABSTRACT**: Ensuring that the products and services we build, and deliver are as threat resistant as possible is extremely important today. Meeting this challenge is not just about building secure applications since we all know that rapid development of software as well as the evolution of threats and vulnerabilities can see our applications as secure today but vulnerable tomorrow. That is why having an established product security team and response capability is extremely important.\nDuring this discussion, I will discuss, using real-world examples, including that of my own, how organizations can meet the demands of product security including:\n\n* Building a culture of security within your organization beyond firewalls and anti-virus\n* How to “sell” security to executive management and explaining what product security does and doesn’t do (e.g., staffing, budgets, etc.)\n* Building and deploying software using the \"DevOps\" approach, while maintaining a high level of security\n* The difficulties of wearing multiple hats, with security being one of them Embedding “security” in the software development life cycle (SDLC)\n* Establishing a proper security “response” program Product vulnerability transparency and developing a disclosure policy How to measure the success of your program\n* Establishing a bug bounty program\n\n**THANKS to OUR SPONSOR**: *[DevOcean](https://www.devocean.security)*\n*DevOcean Cloud-First Remediation OS helps organizations cut the time, backlog and manual efforts required to close more issues, reduce MTTR and the attack surface. It is an API-based SaaS that connects the dots between cloud, code, security scanner and alert tools to consolidate and enrich remediation context with root cause analysis, owner identification, customized prioritization and tailored fix suggestions.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Forward or Reverse Engineering - Get your app security into gear",
        "date": "2024-04-18",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/299457955",
        "timezone": "Europe/London",
        "description": "Hello & Welcome!\n\nIn this session we'll be discussing application security.\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name when signing up to the event.\n\nPlease note this event will be recorded so we can put these talks on our YouTube channel afterwards. We will also be trying out our live streaming capabilities.\n\n**6:00 - Open doors & networking & drinks**\n\n**6:30 - Eliza-May Austin - DRACOEYE the browser-based freebie that’s going to streamline your SOC teams.**\nIn this session, we'll delve into the origins of DRACOEYE, discussing why it was created and the driving forces behind its development. We'll explore the motivations behind making it freely available and the importance of accessibility in the realm of cybersecurity.\n\nDiscover how DRACOEYE's intuitive design makes it ridiculously easy to use, so much so that even your granny could navigate it with ease – we even have a YouTube series in the pipeline to demonstrate this claim! Through a quick demo, you'll see firsthand just how simple and effective DRACOEYE is in bolstering your online security.\n\nWhether you're a seasoned cybersecurity professional or a curious beginner, this talk is for you. Learn who should be using DRACOEYE and how it can benefit individuals and organizations alike. Stick around for a lively Q&A session where you can ask anything about DRACOEYE, from its features to its development journey.\n\n**7:15 - Refreshments (Food & Drinks & Networking)**\n\n**8:00 - Jay Harris -** **Putting Flutter in the Gutter: how to reverse engineer flutter applications**\nIn the ever-evolving landscape of mobile application development, Flutter has emerged as a powerful framework, enabling developers to create cross-platform applications with a single codebase. However, with innovation comes the need for robust security measures. This talk aims to delve into the realm of reverse engineering and security assessment specific to Flutter mobile applications.\n\nReverse engineering, the process of dissecting and understanding the inner workings of an application, is a double-edged sword. While developers leverage it for debugging and optimization, adversaries exploit it to identify vulnerabilities and potential security weaknesses. In this presentation, we will explore various reverse engineering techniques tailored to Flutter apps, shedding light on the underlying architecture and highlighting potential attack vectors.\n\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nGM Digital Security Hub (DiSH)\n47 Lloyd Street · Manchester\nM2 5LE\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Eliza-May Austin**\nEliza knew she wanted to work in tech from the moment she saw Sandra Bullock order Pizza over dial-up in her favourite film, 1995's 'The Net'. Eliza has a degree in Digital Forensics, is SANS-trained in Network Forensics, PurpleTeaming and Penetration Testing. She has previously worked in cyber defence in a number of FTSE100 companies and was the original founder of the Ladies Hacking Society. Despite her fascination with tech she has taken on a more business-centric role and guided the company through impressive growth, won a slew of awards, and was voted one of the most inspirational voices in cybersecurity.\n\n**Jahmel Harris**\nJahmel Harris is a seasoned security researcher, hacker, and co-founder of Digital Interruption, a Manchester based cyber security consultancy. His expertise lies in securing organizations through a blend of penetration testing and integrating security practices into application development pipelines.\n\nJahmel’s impactful work has garnered international recognition, with media coverage of his research and widespread attendance at his workshops on mobile hacking. His contributions extend beyond the technical realm, as he actively participates in cyber security advisory groups and tech conferences, including 44Con, Hacklu and leHACK. Jahmel’s dedication to advancing security practices has led to the release of multiple public disclosures, further enhancing software protection. His commitment to the field is evident through open-source contributions and free online and in person security workshops and training.\n\nJahmel’s impact on the cybersecurity landscape continues to grow, making him an invaluable asset in the realm of mobile application reverse engineering and security assessments.\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Cytix** \\- Venue Sponsor\n**ReportURI** \\- Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "April meetup: GitHub Actions Security Landscape",
        "date": "2024-04-17",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/300170456",
        "timezone": "America/Chicago",
        "description": "**GitHub Actions Security Landscape**\n**Girish Nair, Account Executive, Cycode**\n\nTraditional application security programs have always focused on code security in the DevOps pipeline. However, security of the pipeline is equally important as observed in some recent high-profile breaches. Join us at the next OWASP meeting to learn about the importance of pipeline security through an example of GitHub Actions and how bad actors might exploit them.\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nPlease remember to register and keep your registration up to date so we know how many to expect."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "April 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-04-18",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/299755205",
        "timezone": "Europe/Amsterdam",
        "description": "This is an online meeting and will be streamed on YouTube. The meeting will start at 19:00.\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n19:00 - 19:10 - **Welcome and OWASP updates**\n19:10 - 19:55 - **API Security: OWASP API Top 10 Unlocked** by **Erez Yalon** and **Paulo Silva**\n19:55 - 20:00 - **Questions and Break**\n20.00 - 20.15 - **OWASP Security Champions Guide - Updates**\n20:15 - 21:00 - **How (not) to use secrets with OWASP WrongSecrets** by **Ben de Haan**\n\n**API Security: OWASP API Top 10 Unlocked**\n*Abstract:*\nAPIs play a central role in today’s economy, powering the exchange of data and services between applications and businesses. However, with great power comes great responsibility, and API security is more critical than ever.\n\nIn this session, we will discuss the OWASP API Security Top 10, a comprehensive guide to the most critical API security risks which was first released in 2019 and updated in 2023. We will then dive into real-world examples of API security issues found on well-known solutions powered by APIs, providing a detailed analysis of the vulnerabilities and the impact they could have had on the affected organizations.\n\nBy the end of this session, you will have a better understanding of the importance of API security and the steps you can take to protect your organization’s APIs from attacks.\n\n*Bio:*\nErez Yalon is the VP of Security Research at Checkmarx. Yalon oversees Checkmarx’s research team comprising analysts, pen testers, security engineers, and bug bounty hunters. He brings vast experience to his position and his efforts to empower today’s developers and organizations to deliver more secure applications. Yalon is the Founder of the DEF CON AppSec Village and co-leads the OWASP API Security Project. Over the years, Yalon has been invited to speak at prominent events, including RSAC, Black Hat, DEF CON, and OWASP’s global conferences, and featured in news outlets such as Fortune, Forbes, Wired, TechCrunch, and Dark Reading.\nPaulo Silva is a security practitioner with a solid background in software development, who has spent the last decade focused on identifying critical vulnerabilities and breaking software. Paulo is a long-time OWASP volunteer and co-leader of the OWASP API Security Project, where he advocates for secure API practices and contributes significantly to mitigating security risks in the API landscape.\n\n**OWASP Security Champions Guide - Updates:**\nOWASP Security Champions Guide project team will provide updates on the release of the next OWASP Security Champions Guide!\n\n**How (not) to use secrets with OWASP WrongSecrets**\n*Abstract:*\nIf you want to bring an app to production, you need to know where to put your secrets and how to access them safely. In this session, we’ll go into how to *not* use secrets with a purposefully vulnerable application. We hope you’ll take this knowledge and not make the same mistakes in your own app. Of course, you’ll also learn a thing or two on how to do secrets management properly. Alternatively, you can use this app to teach others!\n\n*Bio:*\nI am a Freelance Security Consultant and engineer, and co-project lead of OWASP WrongSecrets. My specialties are security in application development/SRE and cloud. Outside of regular work, I like to spend time creating cool (and secure) apps."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Workshop: Using Runtime Reachability Analysis to Prioritize SCA Vulnerabilities",
        "date": "2024-04-25",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/300191397",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on April 22nd, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and will join via livestream instead.*\n\n**Abstract**\nPicture this: Your application is composed of 12 Docker containers. Together, they have 400 packages. Your SCA scan detects 120 critical and high vulnerabilities. Your dev team doesn’t have the cycles to fix all of them in time. How do you identify which vulnerabilities truly represent higher risk?\nIn this hands-on workshop, Deepfactor will walk you through the process of using runtime analysis to identify which vulnerable components in an application are actually loaded into memory and, therefore, represent a higher risk to your business. You’ll learn how to be a hero in your organization by helping your dev teams save time and fix a significantly smaller number of high-risk vulnerabilities!\n**The workshop includes:**\nIntro to ‘Next-gen SCA’:\n\n* Why traditional static SCA approaches are outdated\n* How to cut down this noise with runtime analysis\n* How ‘Runtime SCA’ can result in risk-based prioritization\n* How ‘Runtime SCA’ can help organizations approach new zero-days more maturely\n\n**Hands-on session**\n\n* Scan sample container artifacts to obtain a list of CVEs\n* Observe running applications with a simple command to identify which modules actually got loaded into memory\n* Correlating SCA scans with runtime analysis to identify the intersection between what is vulnerable, exploitable, used and reachable.\n* Review dependency scans using an example application with a vulnerable version of Log4j and identify high-risk instances of Log4j based on runtime usage and reachability.\n* Identify which classes within Log4j were actually loaded into memory\n* Review container scans using an example of the recent OpenSSL vulnerability\n* Identify high-risk instances of OpenSSL based on which shared objects within the vulnerable version of OpenSSL were loaded into memory\n* Review findings and remediation guidance\n* Receive self-directed “homework” for the morbidly curious!\n\n**Key Takeaways**\n\n* Receive homework to help you use Deepfactor with your own applications\n* Receive an in-depth introduction to a new AppSec tool delivered by the VP of Engineering who built it\n* You'll learn a new way to prioritize alerts based on those that are used and address first, reducing noise\n\n**Schedule:**\n6:00pm - 6:30pm Networking, Food & Drinks\n6:30pm - 8:00pm Presentation"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa April 17th 2024: OAuth and OpenID Connect - An Introduction",
        "date": "2024-04-17",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/300170676",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\n**Live Stream**:\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBD\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **OAuth and OpenID Connect - An Introduction**\n\n**Abstract:**\nThe session with provide a detailed technical overview of the OAuth & OpenID Connect protocols used in all major Identity and Access Management (IAM) solutions. The session will show a live demo of the details of the interaction between the various OAuth entities.\n\n**Speaker:**\nRifaat Shekh-Yusef is the Director, Identity & Cybersecurity at EY, and chairs the OAuth WG at the IETF."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-04-25",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/300080531",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Evil Twin and TLS Certificates",
        "date": "2024-04-18",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/300129882",
        "timezone": "America/Los_Angeles",
        "description": "An overview of the Evil Twin attack scenario, how TLS cert chain checks and cert pinning help guard against Machine-In-The-Middle, and some of the ways you can still be vulnerable.\n\nDoors open at 5:30. The presentation will begin about 6:00.\n\nNetSPI is the host and sponsor for our April event. We are grateful for their continuing support."
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "OWASP San Antonio Chapter Quarterly Meeting-Threat Modeling for LLM",
        "date": "2024-04-19",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/299305618",
        "timezone": "America/Chicago",
        "description": "Threat Modeling for Large Language Models\n\nLarge language models represent a historic opportunity to further accelerate the pace of software development. A GitLab survey reported that 67% of organizations planned to use AI in software development in the immediate future. Unfortunately, many organizations are moving quickly to adopt AI in development with little thought of security consequences. Threat modeling enable security analysts to understand the additional risks that development with LLMs represents. This session will provide an overview of AI and LLM security challenges and demonstrate how threat modeling can identify potential security weaknesses. Inspired by the OWASP Top 10 list for LLMs, the session will provide a threat modeling approach for LLMs that is straightforward to adopt in production.\n\n**NOTE: there will be door prize drawings for those that attend in person**\n\nAGENDA\n\n* Lunch: 11 to 11:30\n* Meeting Kick-off (JoeG: 15 min)\n* Presentation: (30 min)\n* John Dickson: CEO Bytewhisper Security\n* Threat Modeling for Large Language Models\n* AI Survey Results and Panel Discussion (15 min)\n* John Dickson: CEO Bytewhisper Security\n* Edward Contreras: CISO Frost Bank\n* Topics for Future Meetings (Priya Parthasarathy) (10 min)\n* Membership and Door Prizes (Brent Daugherty) (10 min)\n* Close Meeting (JoeG) (5 min)"
    },
    {
        "group": "Scotland",
        "repo": "www-chapter-scotland",
        "name": "OWASP Scotland Chapter Meeting - April",
        "date": "2024-04-18",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-scotland-chapter/events/300167834",
        "timezone": "Europe/London",
        "description": "Join us at the OWASP Scotland Chapter Meeting where we have two exciting talks lined up focusing on Large Language Models (LLMs) security and risk aspects; as well as a deep dive into the recent \"iSOON Leak\".\n\nThis event is perfect for software developers, ethical hackers, and cybersecurity enthusiasts interested in learning about the latest trends in cyber security.\n\n#### Talk 1 - Large Language Models (LLMs) and Risk Management\n\nSpeakers: Jason Fish and Jamie Cranmer\n\nThis talk will cover the below talking points:\n\n1. Introduction to LLMs - Overview of Generative AI and potential Use Cases\n2. LLM Risk - Risks associated with LLM and how they differ from other types of AI\n3. AI Risk management and ML Ops - Core capabilities that support the management of AI and Generative AI risks\n\n#### Talk 2 – The iSOON Leak: What Is It and How to Analyse It\n\nSpeaker: Jim Slaughter\n\nIn late February, an unusual event occurred. While it was widely known the PRC was actively engaged in espionage around the world, glimpses into how this was done were few and far between. Then a repo appeared on GitHub.\nThe iSOON leak has revealed a significant amount of information about the internal operations and capabilities of a state-affiliated hacking contractor in China. Given the challenges of analysing a large trove of files (often without the aid of a native language speaker), new ways of utilizing technology (including AI) were needed to fully understand this dataset.\n\nBio:\nWho Am I? I'm Canadian, eh! Currently a Senior Threat Intel Engineer at Fortinet\n\n* Day-to-day responsible for looking for \"interesting samples\", and reversing them. Blogs - [https://www.fortinet.com/blog/search?author=James+Slaughter](https://www.fortinet.com/blog/search?author=James+Slaughter)\n\nPrior to Fortinet:\n\n* 8 years at NatWest as the Cyber Threat Hunting and Analytics Tech Lead\n* 10 years at BlackBerry as a Dev\n\nMy hobbies match my vocation. You can usually find me tinkering with malware or code that I stick up on GitHub - [https://github.com/slaughterjames](https://github.com/slaughterjames)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-04-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/298337413",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stavanger",
        "repo": "www-chapter-stavanger",
        "name": "The Wonders of Threat Modeling",
        "date": "2024-04-16",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-stavanger-chapter/events/300025653",
        "timezone": "Europe/Oslo",
        "description": "Welcome to the first ever meetup of the OWASP Stavanger Chapter! \n\nJoin us for an evening discovering the wonders of Threat Modeling! \n\nAgenda:\n\\- We will start off with a presentation of what threat modeling is and how can it be applied\\.\n\\- We will finish the evening by applying what we learnt to defend or attack a system\\! This will be a red  vs blue  team competition\\, the winner takes home a surprise prize \n\nWe will offer snacks and refreshments \n\nLooking forward to seeing you at Bouvet in Stavanger!"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - TruffleHog Disclosure @ Omegapoint",
        "date": "2024-04-24",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/299767743",
        "timezone": "Europe/Stockholm",
        "description": "Welcome to another OWASP Stockholm event! This time we will be visiting Omegapoint!\n\nThe meetup will start with a mingle with food and drinks at 17:30 and the main presentation will begin at 18:00.\n\n***18:00 TruffleHog Security Issue Disclosure - Helena Rosenzweig***\nThis presentation covers a set of security issues in TruffleHog, an open source, automated security tool that scans code repositories and configuration files for active secrets. The session provides a detailed walkthrough with several live demos, showing how the tool can be exploited to remotely harvest credentials from anyone running a default installation of TruffleHog v3. This presentation is part of a coordinated disclosure together with Truffle Security, the team behind TruffleHog.\n\n**Location**: Vasagatan 16, 111 20 Stockholm\nTime: April 24th, 17.30 – 21.00\nLighter food & drinks will be served.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcomming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto: Avoid Becoming a Headline: A General Approach on AI Security",
        "date": "2024-04-17",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/300219092",
        "timezone": "America/Toronto",
        "description": "TALK\n\nAvoid Becoming a Headline: A General Approach on AI Security\n\nSummary:\n\nThough AI/ML is a relatively ancient field of study (in computer science timekeeping years), so much hype, rightfully, has been generated with “today’s” significant advancements. Unsurprising to security practitioners, perhaps, is the security implications that follow an explosive cycle of implementation. Companies are implementing fast and new security concerns are arising daily, before their traditional security teams can even answer the question “What is AI/ML?”\n\nPresenter:\n\nDavid Benas\n\nDavid Benas, AI Security practice lead within Synopsys, will leverage Synopsys Consulting’s broad experience with many large clients and industry partners to present an introduction on AIML security; including an overview of the current implementation & threat landscape, the risks and challenges you should be aware of, and share some (hopefully very fun, or perhaps scary, depending on where you are in the process) anecdotes along the way."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "The real truth behind secure and privacy by design",
        "date": "2024-04-17",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/300137941",
        "timezone": "America/New_York",
        "description": "A simple goal has existed since the dawn of software: make software resilient against threats and protect the personal information the software stores. Does your software need a dose of security and privacy? Enter secure and privacy by design.\n\nExamine tactics for designing software incorporating a secure, privacy-by-design mindset and how to implement these tactics at scale. Then, discover how secure and privacy by design converge with threat modeling as the vehicle for discovering and mitigating threats.\n\nWalk away with an understanding of tactics for applying these concepts, best practice tips to implement actionable threat modeling, and a roadmap for building a solid and successful threat modeling and secure and privacy by design program. Gain a practitioner's perspective on secure and privacy by design."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "RuleCrafters: Forging Better Static Analysis Weapons",
        "date": "2024-04-18",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516368",
        "timezone": "America/Vancouver",
        "description": "**RuleCrafters: Forging Better Static Analysis Weapons** with David Streat\n\nStatic analysis plays a crucial role in mitigating security risks by identifying potential software security flaws early in the development process. However, evaluating the effectiveness of individual detections is often overlooked. In this presentation, we will delve into objective methods for assessing the quality of static analysis detections without incurring additional resources. We’ll learn about how Microsoft’s M365 Application Security team develops new detections and how they evaluate the effectiveness of those detections to ensure maximum impact at reducing security risk.\n\n**David Streat** is an experienced application security professional with almost 20 years in software development and application security. Having led Appsec teams at both EA and Microsoft, David has always strived to create solutions that improve code security where developers work. Plus, telling corny dad jokes doesn’t hurt either."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #65 - Data Centricity and Securing AI",
        "date": "2024-04-24",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/299501950",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #65! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Data Centricity for Cloud and Application Security**\n\n*Prof. Dr. Igor Podebrad, Director CISO Office, Google Cloud*\n\nIgor's talk will demystify data-centricity as a key driver for robust application and cloud security. He'll contrast the shift to data-centricity focus how it underpins cloud, AI and supports sound risk decisions. He will also discuss how this shift is reshaping security and resilience in for digital transformation. Igor is currently a Director at Google Cloud's Office of the CISO and a former Group CISO at Commerzbank AG. He holds a PhD in Medical Care Logistics from the University of Berlin.\n\n**2\\. Talk: Securing GenAI Applications on Cloud: Three pronged approach**\n\n*Hari Hayagreevan - Senior Cloud Security Architect, IBM*\n\nThe convergence of Generative Artificial Intelligence (Gen AI) with cybersecurity introduces a spectrum of challenges and prospects. To embrace Gen AI extensively within enterprise contexts, it's imperative for these AI systems to be devoid of vulnerabilities in their application and infrastructure. This necessitates a holistic approach to securing Gen AI platforms. In this session, Hari will take you through the different viewpoints, offering insights from an Enterprise Security Architect’s perspective, with practical enterprise scenarios. Hari is Enterprise Security Architect and currently is the Technical Leader for IBM Consulting’s GenAI Security practice in DACH. He started his career as Cybersecurity incident responder (SOC Analyst) 18 years ago and now advises Enterprise CISOs and Security Architecture teams on adopting security principles for preventing cyber attacks.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 24.04.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\ncodecentric AG, Lise-Meitner-Straße 4, 60486 Frankfurt am Main\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    }
]