[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Atlanta Cybersecurity Holiday Party",
        "date": "2024-12-17",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304447788",
        "timezone": "America/New_York",
        "description": "Free with RSVP, 21+ with valid ID\n\nJoin the Atlanta Cybersecurity Engineers Holiday Party sponsored by OWASP Atlanta Chapter in partnership with BlackHat Society, DC404, and Cyber Breakfast Club. We will celebrate our vibrant community with fresh tunes from local DJs, and play video games from gaming pop-up CartridgeATL. The winner of the gaming tournament will receive a $100 prize! Arrive on time so you can sign up.\nEvening festivities will be from 7PM - 11PM on Tuesday, December 17th, 2024.\n\nIf you're interested in donating to the evening so we can provide complimentary food and drinks, please email [atlanta-leaders@owasp.org](mailto:atlanta-leaders@owasp.org). They will provide you details on your tax deductible donation. Thank you!\n\nPlease RSVP directly with the venue here:\n[https://smithsoldebar.freshtix.com/events/owasp-foundation-holiday-party](https://smithsoldebar.freshtix.com/events/owasp-foundation-holiday-party)"
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "7. OWASP Augsburg Stammtisch",
        "date": "2024-12-11",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/304563550",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda tbd**\n**-> WICHTIG: Dieses Mal *nicht* im Thing, sondern bei Meteocontrol!**\n\nDu hast einen Vortrag? Melde dich! Wir sind immer auf der Suche nach interessanten Inhalten!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "6. OWASP Augsburg Stammtisch",
        "date": "2024-11-27",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/304187062",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda:** **GOD in a Nutshell**\nChristian Kölbl wird einen kurzen Erfahrungsbericht über den German OWASP Day 2024 geben: Insights, Training, Chapter Meeting und Vorträge.\n...es ist aber natürlich noch Platz für einen Vortrag :-)\n\nDu hast einen Vortrag? Melde dich! Wir sind immer auf der Suche nach interessanten Inhalten!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BeNeLux Days 2024",
        "date": "2024-11-28",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/304003498",
        "timezone": "Europe/Brussels",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2024\" edition on November 28th and 29th in Utrecht, the Netherlands.\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "Belo Horizonte",
        "repo": "www-chapter-belo-horizonte",
        "name": "Criptografia Pós-Quântica: O Futuro da Segurança Digital - OWASP BH no BHack ",
        "date": "2024-11-30",
        "time": "12:00-03:00",
        "link": "https://www.meetup.com/owasp-belo-horizonte-chapter/events/304565975",
        "timezone": "America/Sao_Paulo",
        "description": "**Criptografia Pós-Quântica: O Futuro da Segurança Digital - OWASP BH no BHack Conference 2024**\n\n **Apresentação Especial OWASP Belo Horizonte**\n **Data: 30/11/2024 (Sábado)**\n⏰ **Horário: 12:00**\n** Local: MinasCentro - Auditório Principal**\n **Desconto Especial para Membros OWASP BH**\n\n **ATENÇÃO ESPECIAL**\nNossa palestra acontecerá durante o intervalo do almoço. Quando for anunciado o horário de almoço, pedimos que os interessados na apresentação **permaneçam no auditório principal**. A palestra começará logo em seguida!\n\n**Sobre a Palestra**\nEm um momento crucial para a segurança da informação, onde a computação quântica ameaça os fundamentos da criptografia atual, convidamos você para uma apresentação especial sobre Criptografia Pós-Quântica (PQC).\nNesta sessão, exploraremos:\n\\- Fundamentos da criptografia pós\\-quântica\n\\- Análise detalhada do paper NIST sobre PQC\n\\- Os algoritmos selecionados para padronização FIPS\n\\- Impactos práticos para a segurança da informação\n\n**Nosso Palestrante**\nLucas Gontijo\n\\- Gerente Sênior de Cybersecurity do Inter\n\\- \\+20 anos de experiência em Tecnologia\n\\- Membro do PCI Standards Security Council\n\\- Membro da liderança do capítulo OWASP Belo Horizonte\n\\- Conselheiro regional e global de segurança de cartões\n[LinkedIn do Palestrante](%5Bhttps://www.linkedin.com/in/lucas-gontijo/%5D(https://www.linkedin.com/in/lucas-gontijo/))\n\n**Como Participar**\n**Ingressos**\n [Adquira seu ingresso aqui](https://www.sympla.com.br/evento/bhack-conference-2024/2370955)\n\n**Desconto Especial OWASP**\n\n **Membros OWASP BH**: Use o cupom **BHack-OWASP2024-68AJFR** para obter 20% de desconto!\n\n**Local do Evento**\nMinasCentro\nRua dos Guajajaras, 1022 - Centro\nBelo Horizonte, MG\n\n**Informações Importantes**\nEsta apresentação faz parte da programação oficial do BHack Conference 2024, um dos mais importantes eventos de segurança da informação do Brasil, em sua 13ª edição.\n\n**Cronograma do Dia**\n\\- Quando for anunciado o intervalo para almoço\\, fique no auditório principal\n\\- Nossa palestra começará pontualmente às 12:00\n\\- Duração: 2 horas de conteúdo exclusivo\n\n**Observações**\n\\- Este é um evento presencial\n\\- A apresentação acontecerá no auditório principal do MinasCentro\n\\- Aproveite a oportunidade para networking durante o horário do almoço\n\nNão perca esta oportunidade única de aprender sobre o futuro da criptografia com um dos principais especialistas da área!\n\n#OWASP #BHack #Cybersecurity #PQC #CriptografiaPosQuantica #InfoSec"
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Birmingham December Meeting ",
        "date": "2024-12-05",
        "time": "18:15Z",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/304245900",
        "timezone": "Europe/London",
        "description": "Hey all,\n\nJust a heads up to get this in your calendar - we've got our next meetup coming up!\n\n Date: Thursday 5th December 2024\n⏰ Time: 6:00 PM onwards\n Location: Hays Office, Central Birmingham\n\nAs usual, we'll have:\n\n* Two exciting cybersecurity talks\n* Food and refreshments provided\n* A chance to talk and connect with folks from across the cyber sector in the Midlands\n\nAll are welcome - from students to veterans and everyone in between!\n\nFull agenda and speaker details will follow closer to the date.\n\n*\\*\\*\\*First Talk Announcement\\*\\*\\**\n**Speaker:** David Archer (Solution Architect at Endor Labs)\n**Title:** Ship Happens: The Stormy Seas of Supply Chain Security\n**Synopsis:** Modern software development is a sprawling network of open-source dependencies, sophisticated build tools, plugins, pipelines, repositories and runtimes.\nThis “supply chain” is under relentless attack and many of the potential threats are poorly understood by our development and security teams.\nWe’ll take a warts-and-all look at how software is produced, re-used and “secured”.\nWe'll explore strategies to mitigate some of the threats that exist and share practical takeaways that you can immediately implement in their software development practices.\nExpect to leave with a feeling of dread(!), but also hopefully a deeper understanding of supply chain security and where you should pay closer attention to your software factory.\n\n*\\*\\*\\*Second Talk Announcement\\*\\*\\**\n**Speaker:** James Holland (Technology Innovation at Palo Alto Networks)\n**Title:** How to secure the Black Hat infrastructure\n**Synopsis:** There's a good reason that the organisers of the Black Hat conferences don't use the hots venue's own infrastructure. In fact there are many: ethical hackers learning and testing their skills, not-so-ethical hackers looking for targets, researchers demonstrating new offensive techniques, plus a lot of legal implications too.\nWe'll go behind the scenes at the network and security operations centres for the Black Hat conferences worldwide, to share more details, stories and plain-text credentials.\n\nLooking forward to seeing you there!\n\nBest regards,\n\nJim + Nathe\nOWASP Birmingham Chapter Leaders"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "End of year celebration!",
        "date": "2024-12-05",
        "time": "15:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/304212914",
        "timezone": "Australia/Brisbane",
        "description": "Join us in celebrating yet another end to an amazing year. No presentations, just a catch up with all you hackers, security experts and enthusiasts alike.\nTell us about sweet hacks you’ve done or things you’ve heard about.\nHope to see you there!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Recent Discoveries in My Source Code Review Journey: Navidrome Vulnerabilities",
        "date": "2024-11-18",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/304394056",
        "timezone": "Australia/Brisbane",
        "description": "Join me on a journey through my recent source code reviews, where I uncovered vulnerabilities in Navidrome, an open-source music server written in Go, and explored how JWT libraries prevent algorithm confusion attacks in JSON Web Tokens (JWT).\nIn the first part of this talk, I will share my findings from examining Navidrome’s codebase, discussing specific security issues that emerged from my review, including insights gained from a CVE analysis.\nThe second part will focus on JWT algorithm confusion—a prevalent security issue that arises when implementations fail to enforce proper algorithm selection. I will examine real-world examples of this vulnerability and outline common strategies that developers use to prevent such issues."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Security Journey CTF",
        "date": "2024-11-21",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301084006",
        "timezone": "America/New_York",
        "description": "*This will be at the new location, as shown below! Don't go to the wrong place!*\n\nHands-on hacking time! Security Journey has graciously allowed us to borrow their CTF for the evening to see and fix coding flaws that lead to security vulnerabilities. It's all web based, so bring your laptop! (There really isn't anything to install, so bring your work laptop.) But be there!\n\nWe'll start off with a few highlights related to what is new in the world of appsec, and have a good-of-the-order style chat about the near, they we will dig into finding and fixing some stuff."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP November Meetup - Join Us!",
        "date": "2024-11-20",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/304436398",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on November 20th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:00 - food is served at 5:30 and the presentation starts at 6:00.\n\nThis month's presentation is brought to you by Mend.io!\n\n**Presentation:**\nFrom Reactive to Effective: Building Application Security that Works\n\n**Abstract**:\nIn 2023, 71% of enterprises admitted their AppSec programs were reactive, playing catch-up with vulnerability alerts -– while at the same time, applications remain the top target for threat actors. That adds up to increased business risk for a lot of companies and fuels an urgent need to improve application security strategies. But how?\nThe key is to move from a compliance-based approach to managing application risk.\nJoin us for an in-depth discussion of what it takes to stop playing defense when it comes to application security. He'll wrangle over topics like:\n\n* The tell-tale signs of reactive mode\n* The value of preventative best practices\n* How to build security actions into the developer experience\n* The need for a holistic view and effective prioritization\n* Arming the security team with instant control at scale"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #69 - Software Maturity Model and OWASP initiatives",
        "date": "2024-11-27",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/303263383",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #69! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n**DSOMM and AppSec Program:** We are excited to welcome Timo Pagel, Cloud and Web Security Architect at PagelShield, a core member of the OWASP Germany Chapter, and contributor to various OWASP projects. Timo will discuss the DevSecOps Maturity Model (DSOMM) and how it can help kick-start your application security program. We will also have another speaker joining us for this event—details to be announced soon!\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **27.11.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 AG, located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg Security Pub (SäkPub)",
        "date": "2024-11-20",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/304399091",
        "timezone": "Europe/Stockholm",
        "description": "**OWASP Gothenborg Chapter invites you to an evening of security and entertainment!**\n\nCome hang out, grab a beer, and play arcade games with other security minded people! The event is open to anyone, but people on the guest list will receive arcade tokens from our sponsor KITS (if they show up before 18:30, or the tokens will be given to others).\n\nWhen: Wednesday 20/11 17:30 - 21:30\nWhere: Zamenhof, Esperantoplatsen 5, 411 19 Göteborg"
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Q4 Meeting - Social with IndyHackers",
        "date": "2024-12-14",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/indyowasp/events/303813178",
        "timezone": "America/New_York",
        "description": "Hi everyone -\n\nLet's plan to meet up at the Indy Hackers Holiday Social as our final meeting of the year!\n\n**\\*\\* Important \\*\\***\nRSVP'ing to this meetup event doesn't register you for the Indy Hackers Holiday Social.\n\nPlease register for the event at -\n\nhttps://www.eventbrite.com/e/2024-indy-hackers-holiday-social-tickets-1063326240409?aff=ebdssbdestsearch"
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Secure Coding Tournament with Security Journey",
        "date": "2024-12-05",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/indyowasp/events/304526987",
        "timezone": "America/New_York",
        "description": "**Title**\nOnline Secure Coding Tournament with Security Journey\n\n**Location**\nVirtual - Register at [https://info.securityjourney.com/owasp-indianapolis-ctf](https://info.securityjourney.com/owasp-indianapolis-ctf). You will be emailed login information before the tournament starts.\n\nThere will be a Zoom call during the event - [https://us02web.zoom.us/j/87163909513?pwd=L3pCVSWXDuEreLZwS8o8wHr0c5INPh.1&from=addon](https://us02web.zoom.us/j/87163909513?pwd=L3pCVSWXDuEreLZwS8o8wHr0c5INPh.1&from=addon)\n\n**Details**\n\n* **Prizes** \\- Security Journey will provide $100\\, $50\\, & $25 for first\\, second\\, and third place\\. The tournament will be running for 48 hours\\, but the prizes will be awarded to the leaders at 8PM on the day of the meetup\\.\n* **Languages -** The supported languages in the tournament are C#, Java, JavaScript, Ruby, and Python"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-12-16",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242792",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-11-18",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242791",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2024-11-25",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-london/events/304531909",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted by Civo Tech Junction and sponsored by Security Compass. There is limited seating available for in-person attendees. Registration required.**\n\n**This event will be live-streamed on YouTube.**\n\n**Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Civo Tech Junction, First Floor, 32-37 Cowper Street, London, EC2A 4AW\n**Nearest Tube:** Old Street (Northern Line), Cowper Street exit - 1 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n\n**\"Security by Design, Not Injection\"** – Trevor Young\n\nSecurity by Design encompasses a variety of processes and technologies aimed at embedding security and compliance early in the development lifecycle. We know adopting Security by Design culture and processes can lower risk by preventing vulnerabilities in software, however effectively educating and shifting teams to implement these changes is notoriously difficult. It is a paradigm shift for most organizations, and many of them fail on their first attempt before finding\nsomething that works for them. This discussion will highlight how to explain what Security by Design is and will present strategies for communicating the importance and value it delivers.\n\n**\"OWASP Depscan v6 - The SCA Tool For Agile Builders, Creators, And Doers\"** \\- Prabhu Subramanian\n\nMost SCA tools can be best described as simple SBOM scanners with a backing vulnerability database. This naive design can lead to numerous false positive alerts due to a lack of comprehensive context. To accurately assess an application's security posture, it's crucial to consider its entire lifecycle, from pre-build to post-build, and capture the full-stack information in the form of SBOM, SaaSBOM, CBOM, OBOM etc.\nOWASP depscan v6 is a groundbreaking SCA tool that addresses these limitations by leveraging full-stack information. This innovative approach enables more precise vulnerability triage and prioritization, empowering developers to take informed action.\nJoin us to meet the project leader behind depscan v6, explore live demos, and delve into the technical intricacies of an xBOM-based SCA tool.\n\n**Guest Talk: TBC**\n\n**RAFFLE - win a prize kindly donated by our sponsors!**\n\n**SPEAKERS:**\n\n**Trevor Young**\n\nTrevor Young is an entrepreneurial product and technology leader who stays on top of the latest in design, architecture, and creative technologies. Having founded and led companies providing digital offerings, he uncovered his passion for collaborative problem solving, and innovation.He excels at finding inefficiencies in digital markets and disrupting them.\nTrevor combines strategic leadership with technical ability, formed from experience in a broad background of practical applications. Trevor currently serves as Chief Product Officer at Security Compass, where heleads product strategy for the company's Secure by Design platform, and Application Security Training library.\n\n**Prabhu Subramanian (@_prbh)**\n\nPrabhu Subramanian is a distinguished security expert and active contributor to the open-source security community. Prabhu is the author and OWASP Leader behind projects such as OWASP CycloneDX Generator (cdxgen) and OWASP depscan. He specializes in Supply Chain Security and offers consultancy to global clients via his company, AppThreat Ltd.\n\n**TICKETS:**\n\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security.\n\n**CODE OF CONDUCT:**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "The 2024 Los Angeles Cybersecurity Summit",
        "date": "2024-11-21",
        "time": "07:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/304037309",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** has organized \\***ANOTHER**\\* exceptional offer for our meetup membership to participate in ***Ninth Annual Los Angeles Cybersecurity Summit*** on November 21st, in Los Angeles, CA. Join us for deep insight in new tools and technology, training, and take advantage of this great opportunity to network with industry professionals.\n\n[Register ](https://cybersecuritysummit.com/register/losangeles24/)now using code **CSS24-OWASPLA** for your **complimentary** pass! Space is limited so act now to secure your place.\nCheck the full schedule at [2024 California Technology Summit Agenda](https://cybersecuritysummit.com/summit/losangeles24/)\n\nThe **Ninth Annual Los Angeles Cybersecurity Summit** connects C-Suite & Senior Executives responsible for protecting their companies’ critical infrastructures with innovative solution providers and renowned information security experts. Admission gives you access to all Interactive Panels, Discussions, Catered Breakfast, Lunch & Cocktail Reception.\n\n**Conference Highlights:**\n\n### Interactive Panel Discussions\n\n**Defining Cybersecurity-Readiness: How do you evaluate yours?**\nWhen looking at how to best protect your business, cybersecurity readiness should be top priority, but what is it? Let’s discuss GRC & the best steps to take when quantifying cyber risk, developing your incident response plan, creating a data security policy & more.\n**2024 & The Biggest Threats to Your Business**\nOn this panel our lineup of industry experts will discuss the most dangerous and emerging threats to your organization as well as the solutions that go beyond anti-malware/anti-virus to include endpoint security, vulnerability management, Active Directory monitoring, credential protection, DNS security tools, SIEM, DLP and encryption.\n**Conceptualizing Cloud Security & Why it Matters Today**\nCloud computing solves many problems like flexibility, cost-efficiency & scalability, so it’s no surprise that use of the cloud is consistently growing. Our experts will look at hybrid and multi-cloud environments, adopting the concept of cybersecurity mesh & Zero Trust, the Secure Access Service Edge (SASE) framework, cloud-native tools & platforms, as well as why the future of network security is in the Cloud.\n\n### Top 8 Reasons to Attend the Cybersecurity Summit\n\n1\\. Learn\n2\\. Evaluate Demonstrations\n3\\. Time\\, Travel and Money Savings\n4\\. Engage\\, Network\\, Socialize & Share\n5\\. CEUs / CPE Credits\n6\\. Investment\n7\\. Atmosphere\n8\\. Reality Check\n\n### [Questions](mailto:Samantha@CyberSummitUSA.com)\n\nFor any questions, please contact **[Samantha@CyberSummitUSA.com](mailto:Samantha@CyberSummitUSA.com)** or call **212.655.4505 ext. 225**\n\nAnd finally **don't forget** to visit us at the OWASP Los Angeles booth!"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "OWASP BeNeLux Days 2024",
        "date": "2024-11-28",
        "time": "09:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/303987709",
        "timezone": "Europe/Amsterdam",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2024\" edition on November 28th and 29th in Utrecht, the Netherlands.\n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-11-19",
        "time": "18:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297786624",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for November will be **A05:2021 - Security Misconfiguration**.\n\n**Technical Topic Speaker:** Jagan Boda (Jay)\n**Talk Title:** How scary is a Post-Quantum Computing Crypto World?\n\nIn my presentation, I will explore the transformative potential and security challenges of quantum computing. I will try to explain key quantum concepts like superposition and entanglement, contrasting them with classical computing principles.\n\nI will address security concerns by discussing the vulnerability of current cryptographic algorithms and infrastructure to quantum attacks. A brief history of cryptography and solutions to the challenges from quantum computing. Then we will outline ongoing efforts to develop quantum-resistant cryptography and the standardization processes from organizations such as NIST.\n\nOpportunities for adoption of post-quantum computing safe algorithms exist today and can be planned for and budgeted. Education and awareness will be crucial, ensuring stakeholders understand the implications of quantum computing on cybersecurity.\n\nBy the end of the presentation, attendees will gain a foundational understanding of quantum computing's impact on security and practical steps to protect sensitive data in a quantum-enabled future.\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The Defender's Advantage: A guide to activating cyber defense / Developing an Ap",
        "date": "2024-11-21",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/303770736",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, November 18th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Talk 1**\n**The Defender's Advantage: A guide to activating cyber defense**\nOrganizations today face relentless cyberattacks that can compromise their critical assets. The Defender’s Advantage is the concept that organizations have the upper hand in defending against attacks on their own environments. The overview will guide you through understanding the threat landscape, detecting and investigating malicious activity, testing and validating the effectiveness of controls and operations, hunting for active threats. The book goes into detail about each of these concepts to help organizations take control and galvanize their defender’s advantage.\n\n**Speaker 1 Bio**\nGursev Singh, Sr. Information Security Consultant at Google.\n\nA seasoned cybersecurity professional with over 16 years of experience in the field. He has a strong track record of success, leading and managing cybersecurity projects for major customers.Gursev's expertise in cloud security (Google, AWS & Azure), SIEM, and data protection. His deep understanding of infrastructure security and cyber threat and vulnerability management further enhances his ability to analyze threats, identify vulnerabilities, and respond to security incidents.Currently, he's a Sr. Information Security Consultant at Google.\n\n**Talk 2**\n**Developing an Application Security Champions Program**\nApplication security focuses on a specific set of issues which incur risk. Software security in general may cover everything from IT to cloud to access, to authentication, etc. What we are addressing in this discussion is a security program designed to surface and mitigate risk found within applications.\nAgenda\n\n* Remote Code Execution – an infamous example\n* The recurring cycle of scan, assess, mitigate\n* Update, Update, Update!\n* Ownership is essential\n\n**Speaker 2 Bio**\nRich Newman, Technical Account Manager at Black Duck Software, Inc.\n\nRich was a developer for 13 years in the embedded space, primarily embedded C and assembly code. He then transitioned to field engineering for Wind River, Intel, Coverity and Synopsys for the past 26 years. The technologies he supported covered a wide range of embedded operating systems and tools, live patching, static analysis and security tools and services. He has an active CISSP certification."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2024-12-05",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181930",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **Tony Turner**\nTopic: Five Elements of Trust - Tony with present on 5 elements of trustworthy software, useful in establishing software and technology assurance in your supply chains.\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "Bug Bounty Bonanza",
        "date": "2024-11-27",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-oslo/events/304502608",
        "timezone": "Europe/Oslo",
        "description": "Velkommen til OWASP temakveld om bug bounty! Finnerlønn for sårbarheter burde vært obligatorisk for viktige publikumsløsninger på internett, men i Norge er det unntaket heller enn regelen. Vi har gleden av å invitere til to erfaringsforedrag om innføring og drift av bug bounty-programmer, og et foredrag om hvordan det er å delta som tester.\n\nDet serveres mat kl 17:30, og foredragene starter kl 18:00. Vi vil ha tid til spørsmål og diskusjoner.\n\nTemakvelden arrangeres i SpareBank 1 Utviklings møteromssenter. Vi ber om at dere oppgir telefonnummer under påmelding, så vi kan forhåndsregistrere dere som besøkende.\n\n**Sett skuddpremie på sårbarhetene dine - Jon Are Rakvåg, SpareBank 1 Utvikling**\n\nSpareBank 1 Utvikling lager nettbank, og vi gjør alt vi kan for å gjøre den sikker. Likevel var vi overbevist om at vi hadde sårbarheter vi ikke hadde funnet ennå. Det stemte!\n\nLa oss snakke om hva SpareBank 1 lærte av å innføre finnerlønn for sårbarheter, og hvorfor du er sprø om du ikke gjør det samme. Hva gjør bug bounties unikt, og hvordan reddet det rumpa til foredragsholderen?\n\n30 min\n\n**FINN.no's Secret Sauce: how we went from finding 15 vulnerabilities to over 100 per year! - Emil Vaagland, FINN.no**\n\nSince 2019 FINN.no has tried a lot of different appsec tools and processes to improve our security. In this talk you will learn about the most effective of them all, namely our private bug bounty program. In terms of finding real vulnerabilities, this activity outshines any other appsec tool or process by a large margin, it enables us to find a lot more vulnerabilities than before at a fraction of the cost of traditional pen-testing. We will talk about how to run an effective bug bounty program and why it should be the key ingredient of your appsec program. We will also show-case some high impact vulnerability reports we have received to show the real impact you can get from a bug bounty program.\n\n20-30 min\n\n**Sårbarheter som hobby - Joakim Harbitz**\n\nÅ jakte etter sårbarheter kan være både spennende og utfordrende, men hvordan starter man egentlig?\n\nJoakim er pentester på dagtid og en dedikert bug bounty hunter på kveldstid. I dette foredraget deler han sine beste tips og triks for å komme i gang, og hvordan man utvikler et tankesett som øker sjansene for å finne den neste sårbarheten.\n\nEnten du er nybegynner eller har litt erfaring, vil dette foredraget gi deg innsikt i hvordan du kan skille deg ut i en konkurransepreget arena. Hvordan små detaljer kan avsløre store muligheter og lede deg til sårbarheter ingen andre ser.\n\n20-30 min"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa November 20th 2024: DevSecOps Worst Practices/The OWASP Top 10 Intro",
        "date": "2024-11-20",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/304507525",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in-Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=OGbhN2UazZI\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **A Brief Overview of the OWASP Top 10 with Gabriel Kronfeld.**\n3. **DevSecOps Worst Practices with Tanya Janca.**\n\n**Abstract:**\n*A Brief Overview of the OWASP Top 10 with Gabriel Kronfeld.*\nThe OWASP Top 10 reveals the most critical security vulnerabilities facing modern web applications. This talk will walk attendees through each item on the 2021 list, from broken access control to server-side request forgery. Each vulnerability is explored in detail—understanding how it works, why it’s dangerous, and what’s needed to prevent it. With real examples to bring these threats to life, this session is an accessible introduction for beginners and a useful refresher for seasoned practitioners.\nJoin us to get a solid foundation in web security essentials.\n\n*DevSecOps Worst Practices with Tanya Janca.*\nQuite often when we read best practices we are told ‘what’ to do, but not the ‘why’. When we are told to ensure there are no false positives in the pipeline, the reason seems obvious, but not every part of DevOps is that intuitive, and not all ‘best practices’ make sense on first blush. Let’s explore tried, tested, and failed methods, and then flip them on their head, so we know not only what to do to avoid them, but also why it is important to do so, with these DevSecOps WORST practices.\n\n**Speakers:**\n**Gabriel Kronfeld** is a graduate from the University of Ottawa with a degree in Computer Engineering. With experience spanning backend programming, DevOps, system administration, and database management, Gabriel has collaborated with various Ottawa-based companies on technical projects. Although new to cybersecurity, he brings a strong technical foundation and is keen to expand his knowledge in this field. Outside of work, Gabriel enjoys cycling, photography, and building drones as hands-on hobbies.\n\n**Tanya Janca**, aka SheHacksPurple, is the best-selling author of 'Alice and Bob Learn Secure Coding', 'Alice and Bob Learn Application Security’ and ‘Cards Against AppSec'. Over her 28-year IT career she has won countless awards (including OWASP Lifetime Distinguished Member and Hacker of the Year), spoken all over the planet, and is a prolific blogger. Tanya has trained thousands of software developers and IT security professionals, via her online academies (We Hack Purple and Semgrep Academy), and her live training programs. Having performed counter-terrorism, led security for the 52nd Canadian general election, developed or secured countless applications, Tanya Janca is widely considered an international authority on the security of software. Tanya currently leads education and community for Semgrep."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "End of year meal",
        "date": "2024-12-12",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/303804635",
        "timezone": "Europe/London",
        "description": "Invite only meal, please submit attendance though group comms channel"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-11-28",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/303254411",
        "timezone": "Europe/London",
        "description": "It's music night! Come join us for live music and great chat. \n\nThirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "OMFG We've been hacked! Cyber Insurance Policy after the Walls Come Down",
        "date": "2024-11-19",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/304442953",
        "timezone": "America/New_York",
        "description": "Last Call!! Woah has it been (almost) a year?! You'd forgive me if I am confused while we experience May weather in November. Anyhow, this will in fact be our last in person meeting for the good year 2024. Please join us for comradery, security, and our final speaker - Mike Briley! There's been quite a buzz (not an OWASP joke) around this one since we announced it way back in September. Close down the year with us with this engaging speaker. Lite refreshments will be served.\n\nThis talk will explore many elements of the cyber insurance industry. Security controls have failed, leading to a system compromise. So now what?! He will discuss what a cyber policy covers and how the process unfolds while taking a deep dive into a real-life claims example."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "December 2024 Meeting",
        "date": "2024-12-03",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/304602289",
        "timezone": "America/Phoenix",
        "description": "**Reverse Engineering Basics** (75 min)\nWe'll go over the basics of reverse engineering starting with what it is and why the activity is so important.\n\nWe'll cover the reverse engineering mindset, executable formats, tools (we'll mostly use Ghirda [https://ghidra-sre.org/](https://ghidra-sre.org/), but touch on IDAPro, and ImHex) of the trade, we'll touch on reverse engineering techniques for embedded devices as well.\n\nLastly we'll have an executable for everyone to reverse engineer.\n\nSo bring your laptop with Ghirda installed (feel free to install the other two as well).\n\n**NOTE: We are starting at 7:30 pm beginning this month.**"
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Threat Modeling",
        "date": "2024-12-03",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/304454776",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\nThis time we will focus on threat modeling - a proactive technique of risk analysis which could help to determine and fix potential vulnerabilities before they will even appear in the code, configuration or architecture.\nNowadays \"threat modeling\" has become a trendy buzz word. During our meetup we will try to uncover it's real meaning and discuss how to practically implement threat modeling in software development lifecycle.\n\nAgenda:\n\n1. **Threat modeling for application security – a case study**\n*Marta Rusek (Senior Cloud Security Engineer) & Wiktor Cudek (Principal Cloud Security Engineer) - Pegasystems.*\nThreat modeling is one of the parts of the SDLC process, that embed security throughout early stages of development. Thanks to that, we are able to detect potential problems at the beginning and avoid a lot of changes on the advanced maturity of the product.\nThe goal of this presentation is to compare the most well-known Threat\nModeling methodologies, their strong and weak sides. Based on our knowledge, we will compare these methods with the process and tools that are used in our company, and share our experience based on the work with development teams.\n2. After the break, we will host a **discussion about threat modeling**. Share our experiences with TM. When it's applicable. How to start doing TM in your project? Which techniques and methodologies works and when? What should be our goals? Is it possible to simplify the threat modeling process? That's just example of questions that we want to ask.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this invitation** with friends and in your social media."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Mentorship, Networking, and Growth: My Cybersecurity Journey",
        "date": "2024-12-11",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539102",
        "timezone": "America/Los_Angeles",
        "description": "**Haley Kelly** is a dedicated cybersecurity professional who is passionate about sharing knowledge and inspiring others. After overcoming some challenges in the job market, she successfully landed an internship at GuidePoint Security. Through mentorship, networking, and continuous learning, Haley has gained valuable insights into the cybersecurity industry. In this talk, she will share practical tips and strategies that helped her break into the field, including the importance of building relationships, attending industry events, and staying current on the latest trends.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "3rd OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-12-10",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/301313769",
        "timezone": "Europe/Berlin",
        "description": "**Exploiting deserialization vulnerabilities in recent Java versions**\n\nDue to attack techniques such as Insecure Deserialization and JNDI Injection, Java applications were prime targets for attackers. However, recent changes in Java have rendered many known exploits and attack patterns ineffective in newer versions. This talk will provide an overview of these changes and discuss which techniques are still viable. Additionally, we will discuss how to harden existing Java applications that run on current Java versions.\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Building tools using eBPF to trace applications / containers",
        "date": "2024-11-21",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516385",
        "timezone": "America/Vancouver",
        "description": "**Building tools using eBPF to trace applications / containers** with **Adam Harrison**\n\neBPF is a revolutionary technology that can help solve a variety of use-cases. This talk will provide an introduction to building tools with eBPF, and show how it can be leveraged in the application and network security space."
    },
    {
        "group": "Vilnius",
        "repo": "www-chapter-vilnius",
        "name": "OWASP Vilnius #6",
        "date": "2024-11-21",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-vilnius/events/304394672",
        "timezone": "Europe/Vilnius",
        "description": "Hello OWASP Vilnius community!\n\nIt's been a while and I'm super happy to announce, that there will be a physical event again organised at the new Visma Tech office in Artery Vilnius ! Beer and snacks guaranteed :)\n\nSave the date in your calendars: Thursday, November 21st.\n\nMore information soon.\n\nSee you soon!\n-Dominykas"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #69 - Software Maturity Model and OWASP initiatives",
        "date": "2024-11-27",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/303263383",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #69! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information on application security topics. Anyone interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member to attend our event.\n\n*What are we going to talk about?*\n\n**DSOMM and AppSec Program:** We are excited to welcome Timo Pagel, Cloud and Web Security Architect at PagelShield, a core member of the OWASP Germany Chapter, and contributor to various OWASP projects. Timo will discuss the DevSecOps Maturity Model (DSOMM) and how it can help kick-start your application security program. We will also have another speaker joining us for this event—details to be announced soon!\n\n**Socializing Opportunities:** There will be plenty of time to socialize before and after the event.\n\n*Afterwards?* We will begin and conclude the evening with the opportunity to socialize at the venue with free food and both cold & hot drinks. For those interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n*When?* Our Meetup takes place on **27.11.2024** from **18.00 to 22.00** o'clock CEST.\n\n*Where?* The event will be held at CHECK24 AG, located at Speicherstraße 55, 60327 Frankfurt am Main.\n\n*Interested in giving a talk yourself?* Submit your talk here: [https://www.papercall.io/owasp-chapter-frankfurt](https://www.papercall.io/owasp-chapter-frankfurt)\n\n*And now?* Save the date, spread the word, and bring your friends and colleagues along to our event.\n\n*Follow Us!* Also, follow us on LinkedIn and refer to our OWASP Frankfurt site for information, including slides and recordings of previous presentations. We're looking forward to seeing you at our event!"
    }
]