[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Atlanta Cybersecurity Holiday Party",
        "date": "2024-12-17",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/304447788",
        "timezone": "America/New_York",
        "description": "Free with RSVP, 21+ with valid ID\n\nJoin the Atlanta Cybersecurity Engineers Holiday Party sponsored by OWASP Atlanta Chapter in partnership with BlackHat Society, DC404, and Cyber Breakfast Club. We will celebrate our vibrant community with fresh tunes from local DJs, and play video games from gaming pop-up CartridgeATL. The winner of the gaming tournament will receive a $100 prize! Arrive on time so you can sign up.\nEvening festivities will be from 7PM - 11PM on Tuesday, December 17th, 2024.\n\nIf you're interested in donating to the evening so we can provide complimentary food and drinks, please email [atlanta-leaders@owasp.org](mailto:atlanta-leaders@owasp.org). They will provide you details on your tax deductible donation. Thank you!\n\nPlease RSVP directly with the venue here:\n[https://smithsoldebar.freshtix.com/events/owasp-foundation-holiday-party](https://smithsoldebar.freshtix.com/events/owasp-foundation-holiday-party)"
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "7. OWASP Augsburg Stammtisch",
        "date": "2024-12-11",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/304563550",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda**\n**\\- Moderierte offene Diskussion:**\nHaben Cookies eine Daseinsberechtigung in sicherheitsrelevanten Anwendungen? Sind Cookies noch sicher? Waren sie es jemals? Achim wird uns hierzu noch ein paar Argumente mitbringen. Klingt spannend? Ist es! :-)\n\nZu Achim:\n**Achim Hoffmann** ist als 'OWASP-Urgestein' ein langjähriger (>25 Jahre), auf Web Application Security spezialisierter Berater, (Pen-)Tester, Trainer und Sprecher; Er ist Board Member von OWASP-Germany und OWASP-Project-Leader u.a. für O-Saft\n\n**\\- Navigating the Security Maze: Ein interaktives Abenteuer**\nObwohl seit Jahren in aller Munde, ist DevSecOps noch lange kein gelöstes Problem.\nDiese interaktive Session macht die Herausforderungen von Sicherheit im Entwicklungsprozess erlebbar: Die Teilnehmenden werden mit mehreren Szenarien aus dem Projektalltag konfrontiert und gestalten mit ihren Entscheidungen den weiteren Verlauf des Vortrags mit. Sie müssen dabei Sicherheitsanforderungen mit Budget, Entwicklungsgeschwindigkeit und Benutzerfreundlichkeit in Einklang bringen und das Projekt sicher von der Idee zum Livegang bringen.\n\nZu Clemens:\n**Clemens Hübner** studierte Mathematik und Informatik und schloss mit einer Masterarbeit zur Sicherheit in agilen Entwicklungsmodellen ab. Nach Tätigkeiten als Software Developer sowie im Penetration Testing ist er seit 2018 als Security Engineer bei inovex. Dort begleitet er heute Projekte auf Konzeptions- und Implementierungsebene, schult Kolleg:innen und berät zu DevSecOps.\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "A Night of CTF with Secure Code Warriors",
        "date": "2024-12-10",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-copenhagen-chapter/events/304647432",
        "timezone": "Europe/Copenhagen",
        "description": "Join us for an exciting evening of cybersecurity challenges at the IT-University of Copenhagen on December 10th, starting at 17.00!\n\nGet ready to embark on a thrilling adventure as we host a Viking-themed Capture The Flag (CTF) tournament, sponsored by Secure Code Warrior. Gather your crew, test your skills, and compete for prizes while enjoying pizza and drinks provided by our generous sponsor.\nWhether you're a seasoned pro or new to the world of CTFs, this event promises to be a fun and engaging experience for all. Put your best Viking attire, form your teams, and prepare for battle!\n\nDon’t miss out on this opportunity to sharpen your skills, connect with fellow enthusiasts, and have a great time!\n\nP.S. In order to participate you need a laptop with a browser. So please bring that if you want to play along."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "OWASP Edmonton Xmas Party",
        "date": "2024-12-13",
        "time": "14:00-07:00",
        "link": "https://www.meetup.com/owasp-edmonton/events/304640552",
        "timezone": "America/Edmonton",
        "description": "**Join us for the Edmonton OWASP Christmas Party at Beer Revolution!**\nCelebrate the holiday season with fellow cybersecurity enthusiasts as we socialize, enjoy great beer, and dive into fun and interactive cybersecurity board games. It's the perfect mix of networking, games, and festive cheer—don’t miss out! \nThis casual event kicks off at 2 PM, but there’s no strict schedule. Drop by anytime in the afternoon or evening to join the fun. Whether you’re popping in for a quick drink, some socializing, or diving into a full game session, you’re welcome to come and go as you please. Relax, connect, and enjoy the festive vibes at your own pace!\n**Cybersecurity Games to Play:**\n\n1. **Backdoors and Breaches**\nA strategic incident response game where players simulate cyberattacks and defenses using real-world TTPs. Can you outsmart the attackers or defenders?\n2. **Hoxhunt Social Engineering Game**\nA *Cards Against Humanity*-style game with a cybersecurity twist! Craft hilarious and devious social engineering attacks for laughs and learning.\n3. **SANS Pen Test Poster: Pivots & Payloads Boardgame**\nA hands-on pen-testing board game where players exploit networks, deploy payloads, and test their skills in lateral movement and defense.\n\nCome for the beer, stay for the fun, and celebrate the season with cybersecurity flair! \n\n**RSVP now to let us know you're coming and help us plan for an amazing time!**  Whether you're a cybersecurity pro or just curious, we’d love to see you there!"
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "Q4 Meeting - Social with IndyHackers",
        "date": "2024-12-14",
        "time": "19:00-05:00",
        "link": "https://www.meetup.com/indyowasp/events/303813178",
        "timezone": "America/New_York",
        "description": "Hi everyone -\n\nLet's plan to meet up at the Indy Hackers Holiday Social as our final meeting of the year!\n\n**\\*\\* Important \\*\\***\nRSVP'ing to this meetup event doesn't register you for the Indy Hackers Holiday Social.\n\nPlease register for the event at -\n\nhttps://www.eventbrite.com/e/2024-indy-hackers-holiday-social-tickets-1063326240409?aff=ebdssbdestsearch"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-12-16",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242792",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly [VIRTUAL] Meeting - DEC 12, 2024",
        "date": "2024-12-12",
        "time": "11:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/304689555",
        "timezone": "America/Los_Angeles",
        "description": "/\\*\\* VIRTUAL \\*\\*/\n**TOPIC**: AI and OWASP – a guide to Artificial Intelligence for security professionals\nJoin us for our last meeting of 2024 for an amazing talk by **Rob van der Veer**\\, founder of OWASP AI Exchange\\, a pioneer and veteran in AI\\, security\\, and software engineering \\| Senior principal expert at SIG\\.\n\n**ABSTRACT**:\nOWASP is on the forefront of AI security, with the AI Exchange directly contributing to international standards and the LLM top 10 gaining broad adoption. Let’s go over these OWASP projects to see what they offer, and what is important for you as security professional when it comes to protecting and red teaming AI systems.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Capture the Flag [Placeholder]",
        "date": "2025-01-01",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/296181595",
        "timezone": "Europe/London",
        "description": "**Cyber Peterborough are hosting a CTF!**\n\nWe're working out the details, in the meantime - please sign up to watch out for updates!\n\n**What?**\n\n* A hosted capture the flag event\n\n**Where?**\n\n* TBD\n\n**When?**\n\n* TBD\n\n**Who for?**\n\n* All ages and abilities will be catered for!"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "End of year meal",
        "date": "2024-12-12",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/303804635",
        "timezone": "Europe/London",
        "description": "Invite only meal, please submit attendance though group comms channel"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/WASATCH AppSec Meetup - Happy hour  (@Hopkins Brewing Company in SLC)",
        "date": "2024-12-11",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/304966880",
        "timezone": "America/Denver",
        "description": "Hi All,\n\nCasual meetup planned for next Wednesday (12/11).\nCome meet some fellow OWASP folks during happy hour at Hopkins Brewing Company in SLC on 11th.\n\nTopics will be open forum. Feel free to raise questions about implementing software security programs or just come to meet/support other friends in the AppSec space.\n\nSee you then!\n\n**Address**:\nHopkins Brewing Company\n1048 E 2100 S, Salt Lake City, UT 84106"
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Secure Coding Workshop and CTF (with prizes!)",
        "date": "2024-12-12",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/santa-barbara-owasp-chapter/events/304989557",
        "timezone": "America/Los_Angeles",
        "description": "NOTE: You need to RSVP here in the OWASP SB group and also register in [SCW's tournament page](https://discover.securecodewarrior.com/SecureCodingTournamentDecember12.html) in order to participate and be eligible for prizes (Amazon gift cards or similar). Please make sure to do both.\n\n**Event Agenda**\n05.30pm -- Event kickoff & announcements, by W. Martín Villalba (OWASP SB).\n05.45pm -- Secure Coding Workshop and CTF, by Secure Code Warrior.\n07.15pm -- Announcement of prize winners.\n07.30pm -- Event end.\n\n**Secure Coding Workshop and CTF**\n[Secure Code Warrior](https://www.securecodewarrior.com/) brings you a defensive security-based tournament from a developer's perspective. The tournament allows you to test your skills against other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability. You don’t need extensive programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but also secure. Players can choose to compete in their preferred software language, including Java Spring, C# MVC, C# WebForms, Go, Ruby on Rails, Python Django & Flask, Scala Play, Node.JS, React, and both iOS and Android development languages.\n\nCome prepared!\n\n* You can find the tournament step-by-step guide here: [SCW Tournament Guide](https://www.youtube.com/watch?v=o8XhKK_eOOs).\n* Get ready to go for gold and warm up with [Secure Code Coach](https://www.securecodewarrior.com/coach)'s secure coding [guidelines and Missions](https://www.securecodewarrior.com/coach/public-missions-guidelines).\n\nPlease make sure to RSVP here in this group and also register in [SCW's tournament page](https://discover.securecodewarrior.com/SecureCodingTournamentDecember12.html) in order to participate and be eligible for prizes (Amazon gift cards or similar).\n\nLooking forward to seeing you all online!\n\nMartín\nOWASP SB Leader"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-01-08",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349987",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Mentorship, Networking, and Growth: My Cybersecurity Journey",
        "date": "2024-12-11",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539102",
        "timezone": "America/Los_Angeles",
        "description": "**Haley Kelly** is a dedicated cybersecurity professional who is passionate about sharing knowledge and inspiring others. After overcoming some challenges in the job market, she successfully landed an internship at GuidePoint Security. Through mentorship, networking, and continuous learning, Haley has gained valuable insights into the cybersecurity industry. In this talk, she will share practical tips and strategies that helped her break into the field, including the importance of building relationships, attending industry events, and staying current on the latest trends.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sofia",
        "repo": "www-chapter-sofia",
        "name": "OWASP Sofia - December Meetup",
        "date": "2024-12-13",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-sofia-chapter/events/304859184",
        "timezone": "Europe/Sofia",
        "description": "Добре дошли в месечната ни сбирка на OWASP Sofia!\n\nWelcome back to the OWASP Sofia Meetup! This event will also be in Bulgarian. We will do English-speaking events as soon as we have some international speakers.\n\nПрез Коледният месец ще си говорим за много интересни теми, които сме сигурни, че вълнуват много от вас. Ще си говорим за OWASP API vulnerabilities и за видове атаки срещу автомобилни ключалки.\n\n**Програма за 13 Декември 2024**\n\n* 19:00 - Начало и въведение - [Тодор Тодоров](https://todorov.bg) @ [Payhawk](https://payhawk.com)\n* 19:10 - [Николай Димитров](https://www.linkedin.com/in/nikolay-dimitrov-a26781b9/), Cyber Security Consultant @ [C-Serv](https://c-serv.com/) \\- OWASP Top 10 attacks & defenses\n* 20:00 - Здравко Здравков, Physical Pen Tester @ Vigils Defence - How did I end up in your car\n* 20:45 - Закриване\n\nСъбитието ще се проведе онлайн в Google Meet. Ако желаете да споделите нещо интересно свързани с Уеб Сигурност, моля изпратете ни вашата сесия на https://sessionize.com/owasp-sofia/\n\nЗа следващите ни събития планираме да ги организираме на място, за целта си търсим желаещи хост компании, пишете ни ако имате интерес!"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "Pub evening - Xmas OWASP meet up and after-work near Odenplan",
        "date": "2024-12-11",
        "time": "17:00+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/304810093",
        "timezone": "Europe/Stockholm",
        "description": "Last chance in 2024 for us OWASP members to hang out and have a beer. This is the perfect opportunity for all of us app-sec interested folks to get together and meet up in real life for a relaxed chat and maybe a beer or some other refreshments.\n\n When: Wed, 11 December, 2024 17:00\n Where: The Old Brewer - Public House & Dining Room at Luntmakargatan 98, 113 51 Stockholm\n\nExpect:\n Quick AppSec Tips\n Networking\n Drinks & Laughter\n\nThe meeting will start at 17:00, but it's a casual event so turn up when it suits."
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "3rd OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-12-10",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/301313769",
        "timezone": "Europe/Berlin",
        "description": "**Exploiting deserialization vulnerabilities in recent Java versions**\n\nDue to attack techniques such as Insecure Deserialization and JNDI Injection, Java applications were prime targets for attackers. However, recent changes in Java have rendered many known exploits and attack patterns ineffective in newer versions. This talk will provide an overview of these changes and discuss which techniques are still viable. Additionally, we will discuss how to harden existing Java applications that run on current Java versions.\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Chapter Meeting - Social Event",
        "date": "2024-12-10",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/304781594",
        "timezone": "Europe/London",
        "description": "**Let me invite you to our first in-person event of the year!**\nThis is a great opportunity for knowledge sharing and networking. There is no strict agenda—this will be a more casual meeting where we can discuss interesting security-related topics and make plans for the chapter in 2025. Please bring your ideas, questions, and any topics you’d like to share.\n**Agenda:**\n\n* Open discussions on security (and other related) topics\n* Exchange of experiences, thoughts and ideas"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Río de la Plata 2024",
        "date": "2024-12-12",
        "time": "09:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/304655923",
        "timezone": "America/Montevideo",
        "description": "¡Para cerrar la actividad de OWASP UY del año traemos \"**OWASP Río de la Plata**\"!\n\nEs un evento imperdible para todos los amantes de la ciberseguridad y la seguridad en aplicaciones. Únete a nosotros el **Jueves 12 de diciembre** a las **09:00** en la Torre de las Comunicaciones - ANTEL para un día lleno de conferencias y networking. ¡No te pierdas esta oportunidad única de aprender de expertos en la industria y conectar con otros profesionales del sector!\n\nLa entrada es **gratuita** con registro previo **en Eventbrite**: [https://www.eventbrite.es/e/owasp-rio-de-la-plata-montevideo-tickets-1063158538809](https://www.eventbrite.es/e/owasp-rio-de-la-plata-montevideo-tickets-1063158538809)\n\nVisita el sitio en los próximos días para conocer la agenda y la lista completa de oradores:\n[https://appsecriodelaplata.org/](https://appsecriodelaplata.org)\n\n¡Te esperamos!"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | Winter 2024 In-Person Social Event",
        "date": "2024-12-12",
        "time": "18:30-08:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/304814922",
        "timezone": "America/Vancouver",
        "description": "We’re excited to invite you to our Winter 2024 in-person social gathering, a fantastic opportunity to connect with fellow cybersecurity enthusiasts!\n\n **Location:** Moxies\n **Date:** Thursday, December 12, 2024\n⏰ **Time:** 6:30 PM – 8:30 PM\n\nWhether you’re a seasoned professional or just starting your journey in hacking and cybersecurity, this event is perfect for anyone passionate about the field. Come share ideas, discuss trends, and network in a relaxed, friendly environment.\n\n No laptops needed! As this is a social and networking-focused event, just bring your curiosity and enthusiasm.\n Seats are limited, so be sure to click the RSVP button to secure your spot.\n\nWe look forward to seeing you there!"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "December community call - OWASP SAMM",
        "date": "2024-12-11",
        "time": "15:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/305003091",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A."
    }
]