[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - February",
        "date": "2024-02-27",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/298670348",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus and Danske Commodities are happy to invite you to this OWASP Aarhus meetup.\n\n19:00 – 19:05 Welcome by Tobias Evar Lauridsen, Danske Commodities, and Thomas Ljungberg Kristensen, OWASP Aarhus\n\n19:05 – 20:00 Frans aims to facilitate a case study centered around a simulated security breach, where participants will navigate a company through a security incident, emphasizing the management of employees, customers, authorities, and other stakeholders. This exercise will simulate a scenario where the participants must effectively handle the aftermath of a security breach, addressing concerns related to internal personnel, external clients, regulatory bodies, and other relevant stakeholders.\n\nThrough this simulation, Frans aims to facilitate a comprehensive understanding of the complexities involved and enable participants to apply effective strategies in real-world scenarios\n\nAbout Frans: Frans Skovholm is an attorney and partner at DAHL Law Partnership, responsible for DAHL's compliance team, which includes specialists in NIS2, ISMS, and Commercial compliance. Frans specializes in systematic risk management and advisory services related to ISMS management systems, including ISO 27001. He holds certification as an ISO 27001 Lead Implementer from PECB, which he applies in his consultation on information security law. Furthermore, he engages in work related to data protection law, assisting numerous companies in implementing internal regulations to ensure compliance with the requirements of the General Data Protection Regulation (GDPR).\n\n20:00 – 20:30 Networking break\n\n20:30 – 21:25 Overcoming the DevSecOps Imposter Syndrome by Michael Man, DevSecOps Evangelist and Community Leader, Veracode\n\nThe technology landscape is forever changing, and this is also reflective within the security field. As such, it is very overwhelming for people trying to break into the security domain and it is no difference for people who works in it. In this talk, I will share my perspective with how I had tackled this problem, how I drowned in the tsunami of information which impacted me mentally and tips for you to consider taking your first steps with your Continuous Learning journey.\n\nKey takeaways:\n\\- Admit to yourself that nobody knows it all\n\\- Be brave and ask those questions \\(others will be thankful\\)\n\\- Do not let the opinionated people overwhelm you\n\\- Techniques I use as part of my Continuous Learning\n\nAbout Michael: Michael brings more than 20 years of IT security experience. He has advised large enterprises on secure software development, working across all stages of delivery, while engaging with the different stakeholders to deliver successful business outcomes. His favourite certification is his OSCP due to his keen understanding of ethical hacking practices. Michael is also the founder of one of the largest DevSecOps community meetups “DevSecOps - London Gathering” and has co-organised the conference “DevSecOps Days London”.\n\n21:15 – 21:30 Closing notes and goodbyes"
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Scanning at scale using Semgrep and CycloneDX at FanDuel",
        "date": "2024-02-27",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/298785828",
        "timezone": "America/New_York",
        "description": "When looking at the diverse landscape of source code repositories at a large organization like FanDuel, a series of questions arise:\n\n* What patterns **currently** exist across these repositories?\n* What patterns **should** exist? (ideal state)\n* How ***aligned*** are the current patterns with our ideal state?\n\nCombining theory, practicality, and memes, we demonstrate how FanDuel set out to answer these questions by creating a platform empowering relentless iteration. Learn from our real-world case study how the convergence of application security, data schemas, and vulnerability management—powered by OWASP CycloneDX and Semgrep—revolutionizes the prevention and mitigation of risks. Step into the forefront of innovation and discover a new paradigm that transforms challenges into opportunities in the dynamic information security landscape."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - February 2024 (Online)",
        "date": "2024-02-27",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298206982",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n**Presentation: API Security flaws that are commonly exploited.**\nAs more and more development focusses on APIs to make things faster and easier, security needs to be pushed more toward the front. Mistakes that have been corrected in web application security have now returned as APIs aren’t offered the same protections as they are usually out of the normal flow via security tooling such as WAFs. This means identifying and fixing flaws prior to production is important. This discussion will be around lessons learned from testing and breach data with an eye for prevention. This attendees will learn:\nApplication and API stacks are full of dangerous over-powered methods. These lurking menaces are built into libraries, frameworks, appservers, and runtime platforms. They do crazy things (from a security perspective) like start native processes, parse XML documents, evaluate expressions, and deserialize objects. And they are totally unprotected. Developers can use them without restriction, and attackers can target these binary Bambis without being detected or stopped. Unfortunately, the security of the entire digital ecosystem is entirely reliant on getting developers to take the right steps to use these methods safely… but it’s way too hard.\n\n**Speaker:**\nJason Kent -- jason.kent@cequence.ai\n\nRSVP:\nhttps://owasp-austin-2024-february.eventbrite.com -- Eventbrite(in-person)"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "February Meetup",
        "date": "2024-02-15",
        "time": "17:00-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/298887422",
        "timezone": "America/Los_Angeles",
        "description": "Thrilled to share the news about our upcoming February meetup scheduled for the 15th! . Make sure you seize the chance to acquire valuable insights directly from the stage through engaging talks by Jit and Semgrep.\n\nJoin us for an educational experience, networking, delicious food, expertly crafted cocktails, and, of course, the chance to snag some cool swag and participate in exciting raffles Courtesy our awesome hosts.\n\n**Talk #1 Tackling Vulnerabilities in Third-party Packages**\n\n**Title**: Tackling vulnerabilities in third-party packages\nDependency scanners often overwhelm developers with non-critical issues, reducing development efficiency. This session will introduce strategies for effective software dependency management, aimed at realistic security goals. We'll cover how to identify and prioritize key vulnerabilities using tools like code-scanning reachability analysis, ensuring a smoother remediation process.\n**Speaker**: Kyle Kelly - Security Research at semgrep\nKyle Kelly is a Security Researcher on the Supply Chain Team at Semgrep, a fast, open source static analysis tool for finding bugs, detecting vulnerabilities in third-party dependencies, and enforcing code standards. In addition, Kyle is the Founder of CramHacks, a Supply Chain Security Newsletter, where he tries to convince people coffee is a supply chain risk.\n\n**Talk#2 Velocity + Safety - Security Metrics All Engineers Should Care About**\nMeasuring security remains difficult - but in order to level up as an industry we need to be more transparent about how we measure and optimize our security practices. This talk will unpack a novel and measurable way to quantify security progress, the same way we measure other engineering disciplines.\n\n**Speaker:** Aviram Shmueli, Chief Research Officer\nAs the Chief Research & Innovation Officer and Co-Founder of Jit, the Continuous Security Platform for Developers, Aviram combines his passion for creating innovative products with deep expertise in security. With over 20 years of hands-on experience, he has held senior roles in research, engineering and product management at industry-leading organizations such as CyberArk & SentinelOne. A strong advocate for the transformative power of OSS, he believes in giving back to the community—a principle central to Jit’s ethos. Aviram holds a B.Sc & M.Sc in Computer Engineering, an MBA, and an MA in Law"
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Introduction and overview to OWASP",
        "date": "2024-02-16",
        "time": "11:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/298658258",
        "timezone": "Asia/Kolkata",
        "description": "Join us for the OWASP Bhopal Chapter meetup where we will discuss the latest trends and best practices in web application security. Our guest speakers will share their expertise on topics such as computer security, application security, open source technologies, and network security.\n\nAt this event, you will have the opportunity to learn about new technologies and tools aimed at improving software security and protecting sensitive information. Whether you are a beginner or an experienced professional in the field of cybersecurity, this meetup will provide valuable insights and a chance to network with like-minded individuals.\n\nDon't miss out on this opportunity to enhance your knowledge and skills in the ever-evolving field of web security. Join us for an engaging evening filled with informative talks, discussions, and networking opportunities. RSVP now for our OWASP Bhopal Chapter meetup and stay ahead in the world of web application security!"
    },
    {
        "group": "Bogota",
        "repo": "www-chapter-bogota",
        "name": "Fiesta de Willkommen del 2024",
        "date": "2024-02-10",
        "time": "15:00-05:00",
        "link": "https://www.meetup.com/owasp-bogota-meetup-group/events/299086856",
        "timezone": "America/Bogota",
        "description": "Encuentro de 2024 para charlar, beber, comer y hablar de Hacking\n\nIncluye Hamburguesa + Papas + Cerveza\n\nCharla de Eduardo Chavarro\n\nPara confirmar su asistencia es necesario consignar el valor de 30.000:\n\nNequi ó Daviplata\n3183737510\nCuenta de ahorros Bancolombia\n#89392134248\n\nConserve el pantallazo de su transferencia"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "OWASP Cairo: Penetration Testing Workshop",
        "date": "2024-02-10",
        "time": "10:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/298989314",
        "timezone": "Africa/Cairo",
        "description": "Join OWASP Cairo Chapter for an immersive Web Applications Penteration Testing Workshop. In this hands-on session, we will explore the latest techniques and tools used to identify vulnerabilities in web applications. Our experienced speakers will guide you through the fundamentals of penetration testing, from mapping networks to exploiting vulnerabilities. Discover the OWASP Top 10 and learn how to effectively secure web applications against common threats. Whether you're a beginner or an experienced professional, this workshop will equip you with practical skills to enhance your career in information security and application security. Don't miss this opportunity to network with fellow cybersecurity enthusiasts and enhance your knowledge in software security and web application security."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS February 2024",
        "date": "2024-02-29",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/298912741",
        "timezone": "America/Denver",
        "description": "Speaker: Ishan Brown: \"Is The OSCP Right For Me?\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "OWASP SnowFROC Conference: GREAT talks, workshops, networking, food and drinks!",
        "date": "2024-03-07",
        "time": "08:00-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/299034782",
        "timezone": "America/Denver",
        "description": "SnowFROC (Front Range OWASP Conference) is Denver's premier application security conference. It is an annual, one-day conference which draws about 400 people. For SnowFROC 2024 the event will be held Thursday March 7th. While billed as, \"Denver's premier application security conference\", SnowFROC's presentations and workshops focus on many facets of cybersecurity and over the years, SnowFROC has come to be known for its exceptional value: Hands-on training, excellent food, spectacular networking, great location/venue and professional orchestration.\n\n**REGISTER HERE**: [https://www.eventbrite.com/e/owasp-snowfroc-2024-tickets-788326514827](https://www.eventbrite.com/e/owasp-snowfroc-2024-tickets-788326514827)\n\n2024 TICKET PRICES:\n\n* General Admission Tickets: $95 (required to attend)\n* Premium Workshops: $30 (optional)\n* Basic Workshops: $20 (optional)\n\nSnowFROC includes breakfast, lunch, presentations, vendor giveaways, a panel discussion and optional hands on training and workshops."
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Février 2024",
        "date": "2024-02-26",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/299012483",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **Escape** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter Meeting #64 - Data-Centricity and SecOps Evolution",
        "date": "2024-02-28",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/298501459",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to kick off our first OWASP Chapter meeting in 2024! Our Chapter serves central Germany particular within the Rhine-Main (Hesse) region as a platform to discuss and share topics all around information and application security. Anyone with an interested and enthusiastic about application security is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup - talks and location are to be announced!\n\n_What are we going to talk about?\n\n**1\\. Talk:** **The Role of Data-Centricity in Application and Cloud Security**\n\n*Prof. Dr. Igor Podebrad - Director, Office of the CISO, Google Cloud and former Group CISO at Commzerbank*\n\nIn this talk, Igor explores the journey towards a data-centric security culture. He will delve into the challenges and strategies of embedding data-centricity in cloud and application security initiatives. Drawing from his experience, Igor also shares his experience how this approach transforms organizational security culture.\n\n2\\. Talk **SecOps Evolution: Navigating Security Risks and Operational Changes in the Era of Cloud**\n\n*Esra Yildiz - Security Cloud Solution Architect, Microsoft*\n\nEsra from Microsoft addresses the complex SecOps challenges in the cloud transformation era. Drawing from her experience, Esra will provide her insights on how to identify risks and managing operational changes into creating effective security strategies for evolving cloud environments.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**.\n\n_When?\nOur Meetup takes place on 28.02.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nDZ Bank, Platz d. Republik, 60325 Frankfurt am Main (Meet at the main Entrance and follow the OWASP signs to guide you)\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Hyderabad",
        "repo": "www-chapter-hyderabad",
        "name": "OWASP Hyderabad Chapter Meetup '2024",
        "date": "2024-02-10",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/hyderabad-owasp-meetup-group/events/298818247",
        "timezone": "Asia/Kolkata",
        "description": "Dear Owaspians,\n\nWe are into the 2024 , we are excited to invite you to the first OWASP (Open Web Application Security Project) Hyderabad Chapter Meet. This event promises to be an engaging and insightful gathering of cybersecurity professionals, enthusiasts, and experts from our local community.\n\n**Date:** 10/02/2024 **Time:** 10:30 AM **Location:** Virtual\n**Agenda:**\n\n1. **Welcome and Intro**\n\n* OWASP Team\n**Topic by Expert :** **Mobile Security Framework - MobSF**\n* MobSF is an automated mobile application security testing environment designed to help security engineers, researchers, developers, and penetration testers to identify security vulnerabilities, malicious behaviors and privacy concerns in mobile applications using static and dynamic analysis. It supports all the popular mobile application binaries and source code formats built for Android and iOS devices. In addition to automated security assessment, it also offers an interactive testing environment to build and execute scenario based test/fuzz cases against the application. Ajin will cover the following in this session\n* **Walk through of the latest Static Analysis features**\n* **Brand new MobSF iOS Dynamic Analyzer**\n* **Analyzing and Defeating an Android ransomware at Runtime**\n* **Solving Mobile app CTF challenges**\n* **Adding MobSF to your CI/CD pipeline**\n\n**Speaker Profile:**\n\n* A expert on Computer Security, Applied Security Research and Author of some of the well known open source security tools like\n* **Mobile Security Framework - MobSF, an automated pentesting platform for mobile applications**\n* **OWASP Xenotix XSS Exploit Framework, an advanced cross site scripting detection and exploitation framework**\n* **Droid Application Fuzz Framework, an android browser**\n**pdf fuzzing framework**\n* **nodejsscan, a semantic aware SAST for Node.js web applications**\n*\n* *A special mention for OWASP Xenotix and MobSF by Ajin has been among the Top 10 Security tools by ToolsWatch for the years 2013, 2014, 2016 and 2017.*\n\nHe has been a regular in publishing of security research at notable security conferences around the globe including BlackHat Europe, BlackHat Asia, Hack In the Box, OWASP AppSec AsiaPac, OWASP AppSec EU, Nullcon, ClubHack, Sacon, c0c0n, Ground Zero Summit, Hack In Paris, and PHDays.\n\nVery recently he has released the brand new version of MobiSF iOS Dynamic Analyser.We are glad to bring him here via a virtual session with him.\n\n**RSVP:** Please confirm your attendance by Meetup link"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-02-19",
        "time": "18:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/298399889",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#06 - The Eggs",
        "date": "2024-03-05",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/298504205",
        "timezone": "Europe/Lisbon",
        "description": "Join us for the first event of the year, with two great speakers!\n\nThe OWASP Lisboa chapter meetup will be held on Mar 5th, 2024, at 18:00, **and is** **supported by [Celfocus](https://www.celfocus.com/) and [AP2SI](https://ap2si.org/).**\n\nThe schedule is the following:\n**18:00** - **Welcome notes** by the OWASP Lisboa chapter leadership team\n**18:15** - **LLM Security: The OWASP Top 10 Journey** by Jorge Pinto\n**19:10** - **SBOM, SBOM, you're an SBOM** by Diogo Sousa\n**20:00** - **Drinks & Dinner** by Celfocus\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **LLM Security: The OWASP Top 10 Journey**\n\nSpeaker: **Jorge Pinto**\n\nAbstract:\nJoin me for a journey into the development of the OWASP Top 10 for Large Language Model Applications. In this presentation, we will uncover the background, challenges, and collaborative efforts that led to the creation of this resource for the cybersecurity community.\n\nThe presentation will be around 20\\~30 minutes incl. Q&A and will have the following structure:\n\n(1) Introduction\n\nIntroduce the audience to Large Language Models (LLMs) and their significance.\nExplain why creating an OWASP Top 10 for LLMs was necessary to address LLM security concerns.\n\n(2) Project Development\n\nDescribe the inception of the OWASP Top 10 for LLMs project and key contributors.\nHighlight any challenges faced during its development and how they were overcome.\n\n(3) Top 10 LLM Security Risks and Mitigation\n\nPresent the identified top security risks associated with Large Language Models.\nOffer practical recommendations and mitigation strategies to address these risks.\n\n(4) Conclusion and Future Outlook (2-3 minutes)\n\nSummarize the main takeaways from the presentation.\nDiscuss the ongoing relevance and future of LLM security and the OWASP Top 10 for LLMs.\n\nBio:\nWith more than 25 years of experience, Jorge Pinto is a professional in the area of information security in Portugal. With a degree in Computer Engineering from the University of Lisbon, he is a Senior Engineer and has several certifications such as CISSP, CISA, CISM and CRISC. Throughout his career he has played several roles, contributing to the effective response of various entities to security, privacy and business continuity challenges. Founder and president of AP2SI, co-organizer of BSidesLisbon and active member of several associations, including OWASP, he is a committed professional dedicated to promoting good practices and knowledge of information security in Portuguese society.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **SBOM, SBOM, you're an SBOM**\n\nSpeaker: **Diogo Sousa**\n\nAbstract:\nSoftware Bill of Materials (SBOM) is a concept that recently has been making waves in SDLC spaces but it isn't entirely new. Most mature languages have a (sometimes) mature package management system, either built-in (e.g., Rust's cargo) or de facto (e.g., Maven) that allows developers to define dependencies, resolve conflicts and do composition analysis.\n\nSBOMs, however, allow you to take this one step further, making it language-agnostic and allowing components from different ecosystems to use a common language for comparisons and analysis. However, we don't get those features out of the box. For example, consider common libraries in different package repositories - are all OpenSSL packages created equally and equivalent?\n\nOWASP is playing a part in this via its support for projects like CycloneDX which aims to provide a full-stack BOM standard to cover specific scopes such as the CBOM (Cryptography) and HBOM (Hardware) among others.\n\nThis shift towards software being more transparent and traceable is not without its detractors, as entire business models are predicated on customers using purely opaque boxes.\n\nIn the spirit of the topic, here is a Talk Bill of Topics:\n\n\\- Are BOM requirements burdensome?\n\\- Are we revealing too much of the \"secret sauce\"?\n\\- Does having an SBOM instantly make a piece of software more secure?\n\\- If we take a piece of software and replace every entry in its BOM with fully equivalent packages\\, one by one\\, is it still the same software in the end?\n\nThis talk targets a beginner to intermediate audience and will provide an overview of (S)BOMs, their ongoing challenges, and what they can bring to the table in terms of security.\n\nBio:\nAn opinionated individual with an interest in cryptography and its intersection with secure software development.\n\nLinkedIn: [https://www.linkedin.com/in/0xdsousa/](https://www.linkedin.com/in/0xdsousa/)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "20th Anniversary OWASP London (RSVP on Google's own system)",
        "date": "2024-02-22",
        "time": "17:00Z",
        "link": "https://www.meetup.com/owasp-london/events/299058348",
        "timezone": "Europe/London",
        "description": "**DO NOT RSVP on Meetup**, use Google RSVP system here:\n[https://rsvp.withgoogle.com/events/20th-anniversary-owasp-london-google](https://rsvp.withgoogle.com/events/20th-anniversary-owasp-london-google)\n\n**[20 years of OWASP London](https://rsvp.withgoogle.com/events/20th-anniversary-owasp-london-google)**\n\nJoin us as we celebrate a remarkable milestone - the 20th anniversary of OWASP in London! This special event will reflect on the evolution of application security, celebrate our community's achievements, and look ahead to the challenges and opportunities of the future.\n\n**Date:** Thu Feb 22 2024\n**Time:** 5pm-9pm\n**Location:** Google London - 6 Pancras Square\n\nAt this milestone event, we'll delve into the latest trends, challenges, and innovations in the ever-evolving world of cybersecurity. Renowned experts will share their insights through engaging talks and interactive sessions.\n\nWhether you're a seasoned professional or just starting your cybersecurity journey, this event offers a unique opportunity to expand your knowledge and connect with industry leaders.\n\nTo secure your spot, please follow the **[external page](https://rsvp.withgoogle.com/events/20th-anniversary-owasp-london-google)** for registration details. Hurry, as spaces are limited!\n\nWe look forward to seeing you there!"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - FEB 28, 2024",
        "date": "2024-02-28",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/297895052",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Navigating the Maze: Making Sense of Vulnerability Risk Indicators\nJoin us for great networking, dinner and drinks, and see a presentation by **Raffi Erganian** co-founder and CTO at VULNERA\n\n**ABSTRACT**: There is no shortage of risk indicators for vulnerabilities in cybersecurity, between the different versions of CVSS, CWE's, CISA KEV, proprietary vendor risk metrics (Tenable VPR, Qualys TruRisk) and the widely popularized EPSS, developers, security engineers, and stakeholders are left confused and wondering – \"How do we make sense of these numbers/metrics to prioritize patching?\". Turns out, reducing vulnerability risk to a single score or generic category removes much-needed context, these metrics are meant to guide, not be the end-all in the prioritization process. Join us in this presentation as we explore practical strategies on how to effectively use the variety of risk indicators for swift and accurate vulnerability prioritization.\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Kubernetes Top 10 with Jimmy Mesta",
        "date": "2024-02-29",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/298480853",
        "timezone": "America/Chicago",
        "description": "Let's leap forward in container security on leap day! Join us for [a bite to eat from Joyland](https://www.eatjoyland.com/) and to talk with OWASP Kubernetes Top 10 lead Jimmy Mesta, CTO of KSOC.\n\nThe meeting will be catered by Joyland, celebrity chef Sean Brock's nod to nostalgic fast food joints serving up kitchy comfort food with southern flair, like biscuits, smash burgers, and fried chicken on a stick. Brock has been featured on Netflix's Chef's Table and PBS's The Mind of a Chef, owns several award winning restaurants throughout the Southeast, and has been named the best chef in the Southeast by the James Beard Foundation. Join us for some tasty food and rich networking after Jimmy's presentation on the Kubernetes OWASP Top 10.\n\nGiven the growth and adoption of Kubernetes, a number of projects have been published in the OWASP community to help practitioners assess and secure the security of their containerized infrastructure including the recently released [Top Ten for Kubernetes](https://owasp.org/www-project-kubernetes-top-ten/). This OSS project is a community-curated list of the most common Kubernetes risks backed by data collected from organizations varying in maturity and complexity. This session will discuss the project in detail, examples for each of the risks in the list, and how you can get involved."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "February 2024 OWASP Chapter Netherlands Meetup",
        "date": "2024-02-15",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/298627782",
        "timezone": "Europe/Amsterdam",
        "description": "This is an online meeting and will be streamed on [YouTube](https://youtu.be/G_av5tQDa_Y). The meeting will start at 19:00.\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n19:00 - 19:10 - **Welcome and OWASP updates**\n19:10 - 19:55 - **OWASP ModSecurity: A Few Plot Twists and What Feels Like a Happy End** by **Christian Folini**\n19:55 - 20:05 - **Questions and Break**\n20:05 - 20:50 - **OWASP Dependency-Track** by **Niklas Düster**\n\n**OWASP ModSecurity: A Few Plot Twists and What Feels Like a Happy End**\n*Abstract:*\nModSecurity is an open-source, cross-platform web application firewall (WAF) engine. Originally written by Ivan Ristić, it was acquired by Trustwave and then developed for over 10 years by Trustwave’s SpiderLabs.\n\nModSecurity exists as a module for the Apache HTTP Server, Nginx, and IIS (v2) and it has also been released as standalone daemon for NGINX (v3), accessible via an API and a webserver specific connector module. It is able to inspect HTTP requests and HTTP responses and it configured via rules in a rather cumbersome config language called “SecLang”. OWASP CRS is the dominant rules project used by most ModSecurity users.\n\nIn 2021, Trustwave announced the end of support and the plan to hand over ModSecurity into the hands of the community by Summer 2024. OWASP tried to convince Trustwave to hand it over to the foundation several times, but only succeeded in November 2023. A plan was thus drawn and a new project was prepared from December 2023. The main repository was transferred on January 25 and OWASP ModSecurity was declared a “production level” OWASP project by the OWASP project committee.\n\nThe new project operates with a preliminary leader team, the first release is already out and the community is growing, all in line with the 3-6 month project plan drawn up in December 2023.\n\nThis talk gives an overview of this dynamics at play, how OWASP operates on projects like this and the perspectives are for ModSecurity and OWASP as a whole.\n\n*Bio:*\nDr. Christian Folini is a Swiss security engineer and open source enthusiast. He brings 15 years of experience with ModSecurity configuration in high security environments, DDoS defense and threat modeling. Christian Folini is the author of the 2nd edition of the ModSecurity Handbook and the best known teacher on the subject. He co-leads the OWASP ModSecurity Core Rule Set project and serves as the program chair of the “Swiss Cyber Storm” conference.\n\n**OWASP Dependency-Track**\n*Abstract:*\nSince its inception over a decade ago, OWASP Dependency-Track has pioneered many concepts in the realm of software supply chain security, and software bill of materials (SBOM).\n\nWith increasingly more governments, regulators and organizations asking for SBOMs, the project is more relevant than ever. On the other hand, a non-negligible portion of folks is still puzzled as to what to even do with SBOMs once they have them.\n\nIn this talk, we’ll explore what Dependency-Track is, how it can help organizations in identifying and reducing risk in their software supply chain, and give an outlook into what’s next!\n\n*Bio:*\nAfter years as Security Engineer for a large European payment service provider, Niklas currently works as Cloud Native Engineer for ControlPlane. He is passionate about AppSec, DevSecOps and Open Source. He co-leads the OWASP Dependency-Track project and is a contributor to the OWASP CycloneDX Bill of Materials standard, for which he maintains the official Go tooling."
    },
    {
        "group": "Noida",
        "repo": "www-chapter-noida",
        "name": "OWASP Delhi, Kalyan, and Noida Chapters Join Hands: A Security Extravaganza",
        "date": "2024-02-11",
        "time": "11:00+05:30",
        "link": "https://www.meetup.com/owasp-noida-chapter/events/299005901",
        "timezone": "Asia/Kolkata",
        "description": "Dear Security Enthusiasts,\nWelcome to the inaugural meetup of **OWASP New Delhi, Kalyan, and Noida Chapters**, coming together for a **Security Extravaganza**! This marks the beginning of a series of collaborative events aimed at fostering knowledge exchange, networking, and community growth within the cybersecurity domain.\n**Agenda Highlights:**\n **Opening Keynote:** Join us as an industry expert sets the tone for an engaging day filled with insights and discussions.\n **Networking Opportunities:**\n\n* Connect with fellow professionals, students, and enthusiasts. Share experiences, exchange ideas, and expand your cybersecurity network.\n\n **Closing Remarks:** The closing session will wrap up the day, summarizing key takeaways and thanking our contributors.\n**What to Expect:**\n\n* **Interactive Sessions:** Engage in thought-provoking discussions.\n* **Networking:** Connect with industry professionals, like-minded enthusiasts, and potential collaborators.\n* **Learning Opportunities:** Gain insights into the latest cybersecurity trends and best practices.\n* **Community Building:** Be part of the foundation of a growing cybersecurity community.\n\n**What to Bring:**\n\n* Curiosity and enthusiasm for cybersecurity.\n* Your questions and insights for our speakers and panelists.\n* Networking spirit!"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Developing LLM Application Using Private Data",
        "date": "2024-02-15",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/298951512",
        "timezone": "America/New_York",
        "description": "Large language models (LLMs) have opened up new possibilities for a range of downstream applications leveraging natural language generation, understanding, and reasoning. This talk provides an introduction to LLMs, then explores their potential downstream enterprise use cases with enterprise private data . We will overview popular architecture patterns that make LLMs amenable for downstream tasks, as well as tech stacks that enable easier integration. Additionally, we compare open source versus closed source LLMs in the context of customizability, transparency and security - important considerations for downstream applications. The talk also dives into LLMOps - best practices around monitoring, maintenance and updates to preserve integrity and performance in downstream production applications. Overall, the goal is to equip the audience with an understanding of how LLMs can drive value through customized downstream enterprise applications while also considering practical implications of security, operations and responsible AI."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Security properties of LLM-assisted code",
        "date": "2024-02-29",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/299073790",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n1. **RSVPs will close at 11:59 PM PT on February 25th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n2. **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n\n* If your first and last name do not appear in our admin view, we will contact you. Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Abstract**\nHelping programmers write code faster is now one of the top use-cases of large language models. But is that code secure? In this talk we will cover both the promise and security risks of using LLMs for coding. Attendees will come away with an understanding of how to get the productivity benefits of LLM copilots for coding, while mitigating the risk of writing insecure code.\n\n**Agenda**\n6:00 PM - 6:30PM Food, drinks, and networking\n6:30 PM - 7:30 PM Presentation\n7:30 PM - 8:00 PM Raffle, networking, and cleanup"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa February 21st 2024: K8s:Insecure by Default, and what to do about it",
        "date": "2024-02-21",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/298931231",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\n**Live Stream**:\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBA\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **Kubernetes Is Insecure by Default and What You Can Do About It**\n\n**Abstract:**\nWe tend to build things that are insecure by default. Kubernetes is no different. To be clear, this isn’t a value judgment. Kubernetes is an amazing open-source project made up of the contributions of thousands of people. Why Kubernetes is the way it is by default makes sense—we want it to be as easy to use as possible to start. As well, there were particular design decisions made that impact how we think about security in Kubernetes. Unfortunately, security is a trade-off, and ultimately, we need to undo the insecure by default stance and implement some level of security. But at what level? What changes? And where? In this talk, we’ll discuss three major areas where we can make some positive security trade-offs to vastly improve the baseline level of security in Kubernetes without overly affecting ease of use or user expectations; a way that we can create a new baseline to build on. This talk would demo setting up open source automation to configure Kubernetes to have a default level of security, as well as using Falco for threat detection as a last line of defence.\n\n**Speaker:**\nCurtis Collicutt works to make complicated software and systems safer and easier to use. He has spent his career managing complex infrastructure and applications, working to make them reliable and secure through the principles of automation and organisational models such as DevOps. Curtis approaches his work from a socio-technical perspective, believing that it's not just about what technology can do, but how we use it, and that we'll be both safer and more productive if we approach difficult problems like cybersecurity through a human-centric lens. Currently he works at Sysdig helping customers achieve cybersecurity outcomes."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2024-02-29",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/298902117",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Hacking a SaaS: A Practical Guide to Understanding Attack and Defense",
        "date": "2024-02-15",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/298661513",
        "timezone": "America/Los_Angeles",
        "description": "*Hacking a SaaS: A Practical Guide to Understanding Attackers and Defending Against Them*\n\nIn this talk, we will delve into the mindset of an attacker and explore the vulnerabilities they exploit in SaaS systems. We will cover the following topics:\n\n* What motivates hackers to target SaaS systems (5%)\n* How hackers conduct reconnaissance on SaaS systems (50%)\n* The anatomy of exploit chains (40%)\n* Strategies for defending against attacks (5%)\n\nOur goal is to provide a practical guide to understanding attackers and defending against them. We will share lots of hacker tips and tricks, and provide plenty of quiz moments to train your intuition. Our focus will be on vulnerabilities that hackers actually care about, rather than theoretical ones. All of our examples will be based on real-world exploit chains, and we will explore multiple vulnerabilities chained together to create media-news-headline-worthy outcomes. By the end of this talk, you will have a better understanding of how attackers think and operate, and you will be better equipped to defend against their attacks.\n\nOur February host and sponsor is Solutional Inc, and the talk will take place in their Portland office at 301 SE 2nd Ave.\n\nPlease RSVP here if you are planning to attend.\n\nThis is a monthly event of OWASP's Portland chapter.\n\n*[This was our January event, which was canceled for weather. We have rescheduled it for February.]*"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Do you know where your secrets are?",
        "date": "2024-02-22",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/298955593",
        "timezone": "America/Los_Angeles",
        "description": "*Do you know where your secrets are?*\n\n*Do you know what Uber, CircleCI, and Toyota all have in common? They had hardcoded credentials in plaintext somewhere in their environments, leading to either a public leak or enabling an attacker to expand their footprint during a breach.*\n\n*Understanding the problem with hardcoding secrets is simple, but how widespread is this problem? How fast is it growing? How does it keep happening? Moreover, what can you do to address it?*"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-02-14",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/297834962",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Feb 2024: SSRF & Breaking down Software Integrity failures in the wild",
        "date": "2024-02-27",
        "time": "19:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/298921821",
        "timezone": "Asia/Singapore",
        "description": "We have 2 speakers for our very 1st meetup of 2024 and many thanks to Zühlke Singapore for sponsoring the venue and food!\n\n**Topic 1: Understanding Server-Side Request Forgery – The new kid on the OWASP Top 10**\n\n**Synopsis:**\nJoin our OWASP meetup for a critical exploration of Server-Side Request Forgery (SSRF), the latest addition to the OWASP Top 10. This talk will introduce SSRF, explaining its 2 flavours and impact on web applications. Gian-Luca will cover its emergence in the security landscape, analyze real-world case studies, and discuss mitigation strategies. For newcomers we’ll do a short practical demo and for app sec experts we are looking forward to a fruitful discussion about potential mitigation strategies.\n\n**Speaker Bio:**\nGian-Luca Frei is an experienced Application Security Consultant based in Singapore, currently working at Zühlke. With a passion for security, Gian-Luca has a proven track record of securing systems with the highest security standards, including e-banking portals and health applications. He brings a wealth of knowledge and expertise in the field of application security, having worked in the industry for several years. Gian-Luca is also the founder and co-leader of the OWASP Application Gateway Project, which focuses on developing open-source tools to help secure web applications. In addition to his professional engagements, Gian-Luca is a researcher at heart. He has a keen interest in modern cryptographic protocols and has conducted extensive research in this field. His contributions have been recognized with the ISSS Excellence Award in 2019.\n\n**Topic 2: Cracks in the pipeline - Breaking down Software Integrity failures in the wild**\n\n**Synopsis:**\nOpen-source libraries and packages have long been invaluable resources for developers of all skill levels. However, is this dynamic about to shift? Shockingly, between 2022 and 2023, there was a staggering 11,973% surge in reported malicious packages in the wild. Despite this alarming trend, there's a tendency to overlook A08:2021 – Software and Data Integrity Failures in the OWASP Top 10.\nJoin us as we delve into the unprecedented rise of malicious packages, explore their inner workings, ingenious tactics, and discuss proactive measures we can adopt to counter these threats.\n\n**Speaker Bio:**\nVinoth leads the Cyber Offensive consulting team in Singapore at softScheck APAC. His insatiable curiosity led him into the world of hacking, where he dedicates his time to uncovering vulnerabilities and safeguarding clients across various industries. Vinoth maintains an avid interest in security research, and a particular passion for low-level systems engineering and exploit development."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - Resilience, APIs and Web Security @ Akamai",
        "date": "2024-02-13",
        "time": "17:30+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/298857354",
        "timezone": "Europe/Stockholm",
        "description": "Welcome to an evening with focus on resilience, APIs, and web security!\nThe meetup will start with a mingle (wraps/drinks) at 17:30, the main presentations begins at 18:00. The talks will also be streamed online from 18:00.\n\n**Architecting web applications to achieve DDoS resiliency - [Johan Aldor](https://www.linkedin.com/in/johanaldor/)**\nIn this session, [Johan Aldor](https://www.linkedin.com/in/johanaldor/), Senior Solutions Engineer from Akamai will cover how to architect web applications to achieve DDoS resiliency. DDoS attacks are getting more common and also bigger, if you don’t architecture your web application correctly, coping with attacks can be a hassle. Akamai has over 25 years of experience in running distributed systems and overlay networks. Join us in this session where we share the benefits of using a distributed architecture for DNS, Web Application Firewalls and datacenter protection that will make you ready for any attack.\n\n**API Security is NOT Appsec - [Alexander Cedergren](https://www.linkedin.com/in/acedergr/)**\nAPI Security has become a hot topic and this is what you need to know about it. OWASP recently released the updated OWASP Top 10 API Security Risks, and to be secure you need to rethink your normal security strategy. Join [Alexander Cedergren](https://www.linkedin.com/in/acedergr/), Senior Solutions Engineer at Akamai to learn more about why API Security is NOT AppSec, and what needs to be done different now when APIs is dominating the modern world."
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Quantum Computing & Cryptography",
        "date": "2024-02-29",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/298549900",
        "timezone": "Europe/Zurich",
        "description": "In this talk, we will delve into the complex world of quantum computing and explore the basics of **how these machines operate**.\nWe will discuss the **fundamental concepts of quantum states**, including their properties and measurement, as well as the phenomenon of entanglement.\n\nAdditionally, we will cover **how to implement functions on a quantum computer** and provide an overview of popular **quantum algorithms** such as the Deutsch-Jozsa algorithm, Grover's algorithm, and Shor's algorithm.\nWe will also explore the **practical implications of quantum computing**, including an overview of the current state of quantum computers and their potential **impact on cryptography**.\n\nThe talk will conclude with an examination of the popular cryptosystems that are under threat and the efforts by organizations, such as NIST, to address these challenges.\n\nJoin Petar in this OWASP Switzerland event for a comprehensive overview of quantum computing and its real-world implications."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2024Q1 Lunch and Learn",
        "date": "2024-02-22",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/298757282",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2024Q1 Lunch and Learn!**\n\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda:**\n\n* 11:30am - Registration and Lunch\n* 12:00pm - Speaker - Chris Hatter - Appsec in an AI-powered world\n* 1:00pm - Depart\n\n**Speaker:**\nChris Hatter is an Operating Partner at NumberOneAI where he provides technical leadership to portfolio companies within the incubator. Additionally, Chris serves as the COO/CISO of Qwiet.AI, an AI-powered AppSec platform.\n\nHe has over a decade of experience in cybersecurity strategies, managing threats and vulnerabilities, risk assessment, cyber resilience, legal and compliance issues, and crisis management. Prior to his current roles at N1AI and Qwiet, Chris served as the Global CISO for Nielsen, at the time, a global technology and data company that operated in over 150 countries with 80,000+ employees.\n\nChris holds a Bachelor of Business Administration in Management Information Systems from the University of South Florida and sits on the university’s advisory board of cybersecurity for executives.\n\n**Abstract**:\nIn this bold new age of artificial intelligence, software is evolving at a blistering pace. From AI-generated code to automated devops to ingenious new AI applications, innovation is accelerating. Businesses across every industry stand to gain enormously in productivity and efficiency. However, with such great power comes great risk. As AI accelerates the pace of software innovation, it also increases the prevalence of vulnerabilities and exploits.\n\nGiven that application security teams are often under-resourced and equipped with weak technologies... What can they do to manage the inevitable complexity introduced by AI? This interactive talk will lay out the escalating challenges for application security and engineering teams while offering some practical solutions.\n\n**Location:**\nGuidePoint Security\n3030 N Rocky Point Drive W\nSte 600\nTampa, FL\n\n**Sponsors:**\n[Qwiet.AI](https://qwiet.ai/)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Psychology of phishing attacks",
        "date": "2024-02-15",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-toronto/events/298936718",
        "timezone": "America/Toronto",
        "description": "TALK\n\nPsychology of phishing attacks\n\nSummary:\n\nThis presentation will discuss the psychology behind phishing attacks. We will examine why people are susceptible to such attacks. In this talk, you will learn about persuasion cues, factors of persuasion, and common phishing indicators. The goal is to provide you with a framework that helps identify phishing attacks. We will further touch on strategies to detect phishing attacks, existing gaps, and approaches to improve detection capabilities.\n\nPresenter:\n\nHassan Anees\n\nHassan is a recent master's graduate of the Cybersecurity and Threat Intelligence program at the University of Guelph and holds dual undergraduate degrees in psychology and computer science. He has a background as a software engineer and security analyst. He has worked within the financial industry creating phishing simulations and mitigating insider risk. Hassan is currently preparing to embark on a PhD focused on phishing research at the University of Waterloo."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter Meeting #64 - Data-Centricity and SecOps Evolution",
        "date": "2024-02-28",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/298501459",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to kick off our first OWASP Chapter meeting in 2024! Our Chapter serves central Germany particular within the Rhine-Main (Hesse) region as a platform to discuss and share topics all around information and application security. Anyone with an interested and enthusiastic about application security is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup - talks and location are to be announced!\n\n_What are we going to talk about?\n\n**1\\. Talk:** **The Role of Data-Centricity in Application and Cloud Security**\n\n*Prof. Dr. Igor Podebrad - Director, Office of the CISO, Google Cloud and former Group CISO at Commzerbank*\n\nIn this talk, Igor explores the journey towards a data-centric security culture. He will delve into the challenges and strategies of embedding data-centricity in cloud and application security initiatives. Drawing from his experience, Igor also shares his experience how this approach transforms organizational security culture.\n\n2\\. Talk **SecOps Evolution: Navigating Security Risks and Operational Changes in the Era of Cloud**\n\n*Esra Yildiz - Security Cloud Solution Architect, Microsoft*\n\nEsra from Microsoft addresses the complex SecOps challenges in the cloud transformation era. Drawing from her experience, Esra will provide her insights on how to identify risks and managing operational changes into creating effective security strategies for evolving cloud environments.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**.\n\n_When?\nOur Meetup takes place on 28.02.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nDZ Bank, Platz d. Republik, 60325 Frankfurt am Main (Meet at the main Entrance and follow the OWASP signs to guide you)\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    }
]