[
    {
        "group": "Bellingham",
        "repo": "www-chapter-bellingham",
        "name": "Virtual OWASP Bellingham first meeting",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/owasp-bellingham-chapter/events/281383573/",
        "timezone": "US/Pacific",
        "description": "<p>Hello folks,</p> <p>Please join us on November 18th at 6 PM for the inaugural meetup of Bellingham's brand new OWASP chapter. We'll talk about our plans for the Bellingham chapter as well as go over some upcoming events in the region and if you're working on something cool and would like to share we'd love to hear about it!</p> <p>Thank you and we'll see you soon.</p> "
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston November 2021 Meetup - Virtual Attendance",
        "date": "2021-11-11",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspboston/events/281596072/",
        "timezone": "US/Eastern",
        "description": "<p>More details to come, including a potential in-person option!</p> "
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston November 2021 Meetup - In Person",
        "date": "2021-11-11",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspboston/events/281675417/",
        "timezone": "US/Eastern",
        "description": "<p>More details to come, including a potential in-person option!</p> "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC",
        "date": "2021-11-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/279155585/",
        "timezone": "Europe/London",
        "description": "<p>We are looking to publish on @YouTube the recordings of our meetups. If you would like to be notified when we a new video is published, please feel free to subscribe on our channel at:<br/><a href=\"https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ\" class=\"embedded\">https://www.youtube.com/channel/UC1lUjD1zM1gD2JkSa1rxMYQ</a></p> "
    },
    {
        "group": "Cork",
        "repo": "www-chapter-cork",
        "name": "Neurodiversity in Cyber Security",
        "date": "2021-11-03",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Cork/events/281395587/",
        "timezone": "Europe/Dublin",
        "description": "<p>Our next meetup is supporting HAYS and Genius Within's discussions around neurodiveristy as it applies to cybersecurity. An interesting and important topic which we are excited to hear more about.</p> <p>Expert speakers Daniel CM Browne (<a href=\"https://www.linkedin.com/in/dcmbrowne/\" class=\"linkified\">https://www.linkedin.com/in/dcmbrowne/</a>) and Jacqui Wallis (<a href=\"https://www.linkedin.com/in/jacquiwallis/\" class=\"linkified\">https://www.linkedin.com/in/jacquiwallis/</a>) talk openly about how businesses, business leaders, and all of us in the Cyber/Tech world can do more to attract, support, and retain Neurodiverse talent. We intend to have a thought-provoking conversation, that will hopefully drive some habitual changes and do more to support the neurodiverse community.</p> "
    },
    {
        "group": "Czech Republic",
        "repo": "www-chapter-czech-republic",
        "name": "OWASP Czech Chapter Meeting",
        "date": "2021-11-25",
        "time": "09:00",
        "link": "https://www.meetup.com/owasp-czech-republic-meetup-group/events/281716573/",
        "timezone": "Europe/Prague",
        "description": "<p>Dear OWASP fellows,<br/>It’s our pleasure to inform you that the next local chapter meeting will be held on November 25th 2021 at NN IT HUB, Karla Engliše 6/3201, Praha 5-Smíchov.</p> <p>This time we prepared for you  a full day event. You can enjoy workshop during the morning and interesting talks during the afternoon together with the CTF. The admission is as usual free of charge.</p> <p>Schedule<br/>Morning workshop<br/>9:00 - 12:00 Jan Kopecký: Fuzzing workshop<br/>9:00 - 12:00 CTF led by TunaSec.cz</p> <p>Talks<br/>12:00 - 12:15 Opening ceremony with OWASP chapter leaders and announcing winners of the CTF<br/>12:15 - 13:00 LUNCH TIME!<br/>13:00 - 13:45 Václav Chlad: I'm you: Caller ID spoofing<br/>14:00 - 14:45 Filip Holec: Hacking 101<br/>15:00 - 15:45 Ondřej Bouček: Should I Trust? Exploring New Approaches to Detecting Computational Propaganda<br/>16:00 - 16:45 Kamil Vávra: WordPress Supply Chain Attack<br/>17:00 - 17:45 Marek Jílek: Hey Google, give me tons of public calendars! (how I become #1 on H1 in CZ)<br/>17:45 - .......... Closing ceremony and networking</p> <p>Information about the trainer, workshop and CTF</p> <p>The registration for the talks or workshop is possible ONLY by Eventbrite - <a href=\"https://www.eventbrite.com/e/199371514567/\" class=\"linkified\">https://www.eventbrite.com/e/199371514567/</a></p> <p>Additional information</p> <p>If using public transportation you can go to the metro station Anděl and walk 5 minutes. For cars there are paid parking lots in the street Kováků or you can park in the OC Nový Smíchov.</p> <p>NN IT HUB is in the Anděl Park office building, there will be someone to guide you at the main entry. There will be signs showing you way to the conference hall and the lecture room for workshop.</p> <p>For the workshop, please come at least 10 minutes ahead of time, otherwise it can happen that your seat is taken by somebody on the waiting list.</p> <p>We have to follow current COVID rules - please check your email a few days before the event, we will inform you about current conditions.</p> <p>There will be some snacks and soft drinks prepared for you during the event and of course the lunch! :)</p> <p>Unless stated otherwise, talks will be in English and the recordings will be available online ( with speakers' permission) after the convention</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP November Meeting",
        "date": "2021-11-09",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/280769873/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>What is an SBOM, why do I care, and how does my organization get started?</p> <p>Description:</p> <p>It’s nice to know what’s in the food on the shelf at the store so you can make an informed decision whether you should buy it. And when there are recalls of certain ingredients it’s nice to quickly know whether those ingredients are already in your cupboard. Software Bills of Materials enable you to know what’s in the software you consider procuring, and let you quickly know what’s already inside your organization. Of course, you can even use them to understand the risk in the portfolio of software your organization baked itself! Since the May Executive Order on Improving the Nation’s Cybersecurity SBOMs have gotten a lot more attention, but what does it really mean for an organization to make the most of this capability? This talk will help you prepare your organization for the near future when generating, evaluating, and leveraging SBOMs will be expected.</p> <p>Bio:</p> <p>Greg Mohler is a Manager within KPMG's Cyber Defense practice, and has spent the past four years helping over 20 clients solve difficult problems related to DevSecOps, Application Security, and Vulnerability Management. He is passionate about minimizing the distraction of security incidents so that businesses can focus on innovation, growth, and speed to market. Greg has led the delivery of services that not only uplift clients' technical capabilities, but also bolster security education &amp; culture.</p> <p>Caleb Queern is a Director in KPMG's Cyber practice and is based in Austin. He has more than 15 years of technology and information security experience. His focus is reducing risk and improving performance so organizations can meet business goals and enable growth. Caleb has lead engagements in technology companies, pharmaceutical companies, higher education, financial services, manufacturing, and others. His specialties include secure DevOps and application security, security operations, and operational excellence.</p> "
    },
    {
        "group": "Dublin",
        "repo": "www-chapter-dublin",
        "name": "Neurodiversity in Cyber ",
        "date": "2021-11-03",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Dublin/events/281710265/",
        "timezone": "Europe/Dublin",
        "description": "<p>The OWASP Dublin chapter are partnering with Hays Technology, who are shortly going to be running a webinar, with expert speakers Daniel CM Browne SSCP EX-CEH and Jacqui Wallis from Genius Within CIC to talk openly about how businesses, business leaders and all of us in the Cyber/Tech world, can do more to attract, support and retain Neurodiverse talent. Join a thought provoking conversation, that will hopefully drive some habitual changes and do more to support the neurodiverse community.</p> <p>Please ensure that you register using link below.</p> <p>Register @ <a href=\"https://hays.zoom.us/webinar/register/WN_MLcgov-8ToKB8aglH-MNbg\" class=\"linkified\">https://hays.zoom.us/webinar/register/WN_MLcgov-8ToKB8aglH-MNbg</a></p> "
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Novembre 2021",
        "date": "2021-11-08",
        "time": "19:00",
        "link": "https://www.meetup.com/owasp-france/events/281564797/",
        "timezone": "Europe/Paris",
        "description": "<p>Vous l'attendiez? Et bien voici le meetup de la rentrée 2021 de l'OWASP France à Paris!<br/>Un peu en retard... Mais avec une surprise!<br/>Le prochain meetup aura lieu en physique.<br/>Nous serons accueilli par notre sponsor Total Energies que nous remerçions de leur soutien.</p> <p>Face à la situation sanitaire et aux conditions d'accès aux locaux, plusieurs conditions sont présentes:<br/>- Le meetup est limité à 20 personnes. Si vous avez un empechement, nous vous remerçions de bien vouloir libérer votre place au plus tôt pour qu'une autre personne en profite<br/>- Un passe sanitaire valable et une pièce d'identité vous seront demandés pour accéder à ce meetup<br/>- Un wifi est présent. Vous pourrez vous y connecter grâce à l'adresse email utilisée pour Meetup. Les comptes seront créés en avance. L'inscription se terminera donc le mercredi 3 novembre en fin de journee.</p> <p>OWASP Paris est le meetup dédié à la sécurité applicative. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.<br/>Ce meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!</p> <p>Lightning Talks:<br/>La soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.</p> <p>Workshop:<br/>La soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles</p> <p>Pour rappel, le meetup se veut non commercial.</p> <p>Le format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.</p> <p>L'agenda et le compte-rendu des précédents meetups est accessible ici: <a href=\"https://owasp.org/www-chapter-france/\" class=\"linkified\">https://owasp.org/www-chapter-france/</a></p> "
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP GBG + CloudNativeGbg - Cloud security",
        "date": "2021-11-11",
        "time": "17:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/281753680/",
        "timezone": "Europe/Stockholm",
        "description": "<p>This time OWASP Göteborg is happy to collaborate with CloudNativeGbg!! We will bring you two interesting talks that focusing on Cloud Security. The event is hosted by Pagero at their office on Västra Hamngatan 1 in Gothenburg.</p> <p>--&gt; OBS! The tickets to this events has to be booked through Eventbrite:<br/><a href=\"https://www.eventbrite.com/e/owasp-gbg-cloudnativegbg-cloud-security-tickets-200472397337\" class=\"linkified\">https://www.eventbrite.com/e/owasp-gbg-cloudnativegbg-cloud-security-tickets-200472397337</a> . The attendee limit in Meetup is incorrect ;)</p> <p>-- &gt; It will be an IRL event and we of course expect all participants to be fully vaccinated.</p> <p>Agenda:<br/>17:00 - 17:40 Welcome to Pagero<br/>Beer, Pizza and this newly hip thing called socializing. Sponsored by Xenit AB.</p> <p>17:40 - 18:00 Introduction<br/>Introduction from the event hosts and presentation of tonight's speakers.</p> <p>18:00 - 18:40 #1 Cloud security best practices<br/>Many corporations have already migrated fully to the cloud to meet the requirements of our ever changing IT demands and our free and remote workspace. Those who haven't already are probably looking to migrating or are already running a hybrid IT environment. With the COVID outbreak there's even a greater demand today enable workers to work from anywhere and forces organizations to integrate cloud solutions quickly. But what about security? In this talk Benjamin will walk you through a brief introduction to the cloud and cloud security components, present common mistakes made in cloud environments and leave you with good cloud security resources and functions available at several cloud providers.<br/>Benjamin Svensson is a IT-security specialist in networking and infrastructure with everal years of experience with security products, penetration testing and network security. Co-founder and organizer of SecurityFest, a technical IT-Security conference on the Swedish West Coast!</p> <p>19:00 - 19:40 #2 Cloud Whisper - Connecting the dots between vulnerabilities and cloud compromises<br/>Running your infrastructure through a cloud provider is nowadays a no brainer, start small and scale to infinity and beyond. We have established the norm of continuous everything, but what effects does this extremely agile way of working have on security? This presentation will take a dive into the deep and often murky waters of common cloud security flaws, introduced by either vulnerabilities within your code base or through cloud misconfiguration. Jesper will showcase ways of exploiting common vulnerability classes that will severely make any DevOps, SysOps day a lot more interesting.<br/>Jesper Larsson is a freelance IT-security specialist and vulnerability researcher penetration tester, focusing on technical infrastructure with a special focus on orchestrations, infrastructure-as-code, deployment pipelines, cloud implementation and integrations. Working for multinational clients spanning several fields and helping companies, foundation entities with implementing secure infrastructure solutions worldwide. Jesper has audited numerous open source projects for a plethora of foundations and companies, such as the CNCF, Mozilla foundation and Linux foundation. Also Jesper is one of the co-founder and organizer of SecurityFest, a technical IT-Security conference on the Swedish West Coast!</p> <p>19:40 - 21:00 Over-Time (Optional)<br/>Let´s have a couple of beers and continue the discussion around CloudNative! We will try to close down at around 21:00 and we usually go somewhere close to end the night with another beer or two.</p> "
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Online meeting ",
        "date": "2021-11-08",
        "time": "18:45",
        "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/nnccjsyccpblb/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-11-22",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccpbdc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Karachi",
        "repo": "www-chapter-karachi",
        "name": "Exploiting Cloud Storage - By Saad Ahmed",
        "date": "2021-11-02",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Karachi-Chapter/events/281667583/",
        "timezone": "Asia/Karachi",
        "description": "<p>Cloud storage is based on a virtualized storage model that stores any type data in the cloud. This talk would be focusing on Exploiting Cloud Storage.</p> <p>About the Speaker<br/>Saad Ahmed who is a CXO in Security Foster (<a href=\"https://www.linkedin.com/in/XSaadAhmedX/\" class=\"linkified\">https://www.linkedin.com/in/XSaadAhmedX/</a>)</p> <p>He is having 7 years of experience in bypassing Firewall and Exploiting security vulnerabilities and he is an author of \"itsOver\" tool (<a href=\"https://github.com/SaadAhmedx/Subdomain-Takeover\" class=\"linkified\">https://github.com/SaadAhmedx/Subdomain-Takeover</a>) for checking subdomain takeover vulnerability.</p> "
    },
    {
        "group": "Leeds Uk",
        "repo": "www-chapter-leeds-uk",
        "name": "November OWASP meet ",
        "date": "2021-11-10",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Leeds-Chapter/events/281093548/",
        "timezone": "Europe/London",
        "description": "<p>After the recent success of the re-booted Leeds Chapter, we've decided to do another!</p> <p>Speakers TBA and if you'd like to speak - please get in touch.</p> <p>See you there, drinks and nibbles will be provided</p> "
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly Virtual Meeting - NOV 24, 2021",
        "date": "2021-11-24",
        "time": "23:45",
        "link": "https://www.meetup.com/OWASP-Los-Angeles/events/278725708/",
        "timezone": "US/Pacific",
        "description": "<p>Come join us as we hear the monthly presentation by Sean Wright Lead Application Security SME at Immersive Labs</p> <p>TOPIC: Open Source Software Supply Chains</p> <p>ABSTRACT: As modern software development evolves; we no longer build things from the ground up. Extensive use is made of open source software such as libraries and frameworks. While this is fantastic from a development point of view (allowing for faster development of applications and features), it does present a potential drawback if not done correctly, an increased risk. Often, we see libraries being used and seldom updated, also we see several libraries being blindly with little to not inspections and reviews. This is gold mine for attackers, there are many ways that they have will continue to use this to their advantage. The purpose of this talk is to cover some of the techniques which attackers could use to exploit open source supply chains. This will include a live demonstration of one such technique which an attacker could used. The talk will then focus on the excellent OWASP Dependency Track tool, showing how this can help reduce the risk to organizations when it comes to dealing with open source packages in software.</p> <p>BIO: Sean Wright is the Lead Application Security SME at Immersive Labs with an origin as a software developer. Primarily focused on web-based application security with a special interest in TLS related subjects. Experienced in providing technical leadership in relation to application security, as well as engaging with teams to improve the security of systems that they develop. Passionate to be a part of the community and giving back to the community. Additionally, enjoy spending personal time performing personal security-related research.</p> <p>Meeting info will be visible to you only if you RSVP for the meeting.</p> <p>ATTENTION SPONSORS: YOUR NAME COULD BE HERE<br/>Check out sponsorship opportunities here<br/><a href=\"https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471\" class=\"linkified\">https://www.eventbrite.com/e/owasp-los-angeles-chapter-meeting-sponsorship-tickets-30572600471</a></p> "
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Filipi Pires",
        "date": "2021-11-18",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/281288393/",
        "timezone": "US/Eastern",
        "description": "<p>Filipi Pires (@FilipiPires) will present on \"Keep your code safe during the development path using Opensource tools.\"</p> <p>Abstract:</p> <p>Practical demonstration of how a Developer can use a SAST tool for static analysis in code vulnerability, executing it in source code, byte code and/or binary and identifying security holes during the development process, analyzing many languages and codes.<br/>The ecosystem will have the opportunity to know about an open source tool that orchestrates other security tools and identifies security flaws or vulnerabilities in projects and put all results in a database for analysis and generation of metrics, working this analysis with select the languages ​​and/or tools to be used on the project based on the available stack.<br/>These languages and tools are: Python, Ruby, Javascript/Typescript, GoLang, C#, Java, Kotlin, Kubernetes, Terraform, some Leaks, Leaks(optional search in git history), PHP, C, HTML, JSON, Shell Script and Elixir, it being done in source code, byte code or binary, finding “Leaks\" checks the source code for possible leaks of credentials, private keys or hard coded passwords and analyze the project’s dependencies to check for vulnerabilities in third-party libraries. in third-party libraries.</p> <p><a href=\"https://horusec.io\" class=\"linkified\">https://horusec.io</a><br/><a href=\"https://docs.horusec.io\" class=\"linkified\">https://docs.horusec.io</a></p> <p>Similar presentations:<br/><a href=\"https://www.youtube.com/watch?v=ZIY0Wf6QUdY\" class=\"embedded\">https://www.youtube.com/watch?v=ZIY0Wf6QUdY</a> - (D.C. Cybersecurity Professionals – 2021)<br/><a href=\"https://www.youtube.com/watch?v=no5iUdRd64g\" class=\"embedded\">https://www.youtube.com/watch?v=no5iUdRd64g</a> - (RTV 2021 - Learning Thrusday)</p> "
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "(Alert Level 1 permitting) The new OWASP Top 10 Web Application Security Risks",
        "date": "2021-11-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-Zealand-Chapter-Christchurch/events/281034378/",
        "timezone": "Pacific/Auckland",
        "description": "<p>Important! Traction on Demand (formerly Trineo) is not hosting events under Alert Level 2, so this is a tentative placeholder for the next meetup. Details to be added soon…</p> "
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Making the New OWASP Top 10 List",
        "date": "2021-11-04",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/281550694/",
        "timezone": "US/Eastern",
        "description": "<p>Bio:<br/>Brian has over 20 years of experience in various roles in IT and over a decade and a half of that in application development and security. His day job is serving as an Assistant Professor teaching a full load of Computer Science and Cybersecurity classes at Union University. He helped build FedEx's AppSec team, worked on the Trustworthy Computing team at Microsoft, consulted on software security for years, and served as a project lead and active contributor for SAMM v1.1-2.0+ and OWASP Top 10 2017 and 2021. Brian is a contributor to the RABET-V Pilot Program. He holds several Cybersecurity and IT certifications and is currently working on his Doctor of Computer Science in Cybersecurity and Information Assurance.</p> <p>Abstract:<br/>Ever wonder how the bread is made? We'll take you back into the kitchen so you can see how the Top 10:2021 was made. We'll walk through the process of which decisions were made and why. Covering data collection, survey, data analysis, categorization, drafts, reviews, and the released product. This talk is not about what's in the Top 10, this talk is about what went into making the Top 10:2021 and some insights the data can tell us outside of the Top 10.</p> "
    },
    {
        "group": "Omaha",
        "repo": "www-chapter-omaha",
        "name": "Q4 Meeting: Securing your Applications with the OWASP ASVS",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/owaspomaha-meetup-group/events/280673562/",
        "timezone": "US/Central",
        "description": "<p>Michael Born, Director of Security Consulting at SecureSky, Inc. will walk the audience through how to employ the OWASP Application Security Verification Standard to harden modern applications. This presentation will also provide guidance for deploying applications in Microsoft Azure that comply with the OWASP ASVS.</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Analyzing source code for vulnerabilities: A how-to workshop",
        "date": "2021-11-18",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-OC/events/281234132/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Vickie Li, Developer Evangelist, ShiftLeft</p> <p>Topic: Analyzing source code for vulnerabilities: A how-to workshop</p> <p>Live stream: <a href=\"https://www.twitch.tv/owaspoc\" class=\"linkified\">https://www.twitch.tv/owaspoc</a></p> <p>Abstract and workshop preparation guide:<br/>Writing code is hard. Writing secure code is even harder. Serious security vulnerabilities often stem from small programming mistakes. As developers, we can safeguard our applications by catching these mistakes in our own code.</p> <p>Performing a source code review is one of the best ways to find security issues in code. But how do you do it? In this workshop, we will first go through the basics of how to review your code for vulnerabilities and some tactics for performing an effective security code review on your application.</p> <p>But the process of manually analyzing code for vulnerabilities can be very time-consuming. In the second part of this talk, we will also talk about how to use the interactive code analysis tool Joern to make code analysis more efficient. How do you effectively trace user input in code? How can you efficiently link bug sources to sensitive sink functions? If you’d like to follow along, here is what you need to get ready.</p> <p>Joern is open-sourced, download Joern and install:<br/>$ wget <a href=\"https://github.com/joernio/joern/releases/latest/download/joern-install.sh\" class=\"linkified\">https://github.com/joernio/joern/releases/latest/download/joern-install.sh</a><br/>$ chmod +x ./joern-install.sh<br/>$ sudo ./joern-install.sh</p> <p>If you need help here are some important links:<br/>Joern Community: <a href=\"https://discord.gg/ff3ahcFrJq\" class=\"linkified\">https://discord.gg/ff3ahcFrJq</a><br/>Joern Documentation: <a href=\"https://docs.joern.io\" class=\"linkified\">https://docs.joern.io</a><br/>Joern query database: <a href=\"https://queries.joern.io\" class=\"linkified\">https://queries.joern.io</a></p> <p>Speaker Bio:<br/>Vickie Li is the resident developer evangelist at ShiftLeft. She is an experienced web developer with an avid interest in security research. She can be found on <a href=\"https://vickieli.dev\" class=\"linkified\">https://vickieli.dev</a>, where she blogs about security news, techniques, and her latest bug bounty findings. She also hosts “Security Simplified”, a developer education series focusing on web security: <a href=\"https://www.youtube.com/c/vickielidev\" class=\"embedded\">https://www.youtube.com/c/vickielidev</a>.</p> <p>Twitter: @vickieli7<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/vickie-li-103a35b8\" class=\"linkified\">https://www.linkedin.com/in/vickie-li-103a35b8</a></p> <p>--------------------------------------------------------------------------------------<br/>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Saint Louis",
        "repo": "www-chapter-saint-louis",
        "name": "OWASP Night",
        "date": "2021-12-02",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-STL/events/277429806/",
        "timezone": "US/Central",
        "description": "<p>Celebrating OWASP's 20th anniversary!</p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "Monthly Meeting",
        "date": "2021-11-18",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccpbxb/",
        "timezone": "US/Pacific",
        "description": "<p>Monthly OWASP meeting</p> "
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2021-11-10",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Seattle-Chapter/events/pfhhqsyccpbnb/",
        "timezone": "US/Pacific",
        "description": "<p>At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.</p> <p>Suggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.</p> <p>Slack @ #chapter-seattle (<a href=\"https://bit.ly/owasp-seattle-slack\" class=\"linkified\">https://bit.ly/owasp-seattle-slack</a>)</p> <p>seattle-chapter@owasp.org (<a href=\"https://groups.google.com/a/owasp.org/g/seattle-chapter\" class=\"linkified\">https://groups.google.com/a/owasp.org/g/seattle-chapter</a>)</p> "
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": "OWASP Seoul Conference 2021",
        "date": "2021-11-17",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Seoul/events/280484529/",
        "timezone": "Asia/Seoul",
        "description": "<p>OWASP Seoul Chapter  AIOT    \"AIoT  /  \"  \"OWASP SEOUL CONFERENCE 2021\"  .       .</p> <p>The OWASP Seoul Chapter will hold the \"OWASP SEOUL CONFERENCE 2021\" event under the theme of \"Security of AIoT Convergence Products/Services\" to improve AIOT security at home and abroad.<br/>We hope that many of you who are interested in the event will participate.</p> <p>&lt; Event Overview &gt;<br/>- When : 2021.11.17(Wed) 19:00 ~ 21:00, KST<br/>- Where : Zoom (<a href=\"https://url.kr/pn52f6\" class=\"linkified\">https://url.kr/pn52f6</a>)<br/>- Target :  AIOT     <br/>Anyone interested in AIOT security at home and abroad</p> <p>&lt; Event Program &gt;<br/>#1 : IoT     <br/>- ()   (DualAuth Jonghyun Woo CEO)</p> <p>#2 : 5G    (Security Threats in 5G Edge Environments)<br/>-    (ETRI Youngsoo Kim Principal Researcher)</p> <p>#3 : IoT       <br/>-    (KISA Sanggeol Lee Principal Researcher)</p> <p>#4 : IoT     (IoT Software Supply Chain Attack)<br/>-  : Checkmarx Korea   (Greg Song Korea Country Manager)</p> <p>       .</p> "
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Malware Discovered in Popular NPM: Anatomy of Next-Gen Supply Chain Attacks",
        "date": "2021-11-16",
        "time": "19:30",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/281710523/",
        "timezone": "Asia/Singapore",
        "description": "<p>In this meetup, we will explore some tools and understand guidelines that can secure popular software packages and dependencies such as NPM, PyPI, Maven, NuGet, Crates and RubyGems.</p> <p>We will also learn how Gitops play a critical role in \"shifting left\" and learn how to set up guardrails, not roadblocks, to help developers. We will also look at how fuzzing can be incorporated into DevSecOps.</p> <p>Finally we will learn the importance of having Cloud Infrastructure Entitlements Management (CIEM) to enforce permissions and security identities across workloads and clouds. Demo will be included in this meetup.</p> <p>Speaker: Nathan Aw<br/>With over 9 years of experience as a software developer and application (security) architect, Nathan Aw is a firm believer-practitioner of zero trust and advocate of secure coding practices. His passion is in designing, building and rolling out asynchronous, polyglot-based microservices that are both zero-trust, performant which can securely run anywhere (multi-cloud and/or on-premise) that scale without limits.</p> <p>Through hands-on setup of a Secure Software Factory (SSF), he understand the importance of setting up a first-class secure software factory that is able to industralise “shift left” practises that translates to quicker delivery of trusted and secure digital services to its customers.</p> <p>Other interests include emerging technology frameworks such as WebAssembly and frontier technologies like quantum computing.</p> <p>More on Nathan Aw at <a href=\"https://nathanawmk.github.io/\" class=\"linkified\">https://nathanawmk.github.io/</a> and <a href=\"https://sg.linkedin.com/in/awnathan\" class=\"linkified\">https://sg.linkedin.com/in/awnathan</a></p> "
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Security in a games world (working title)",
        "date": "2021-12-02",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASPSwitzerland/events/281403322/",
        "timezone": "Europe/Zurich",
        "description": "<p>Hear from a security officer working in the games domain what's different and the same regarding security considerations and security measures.<br/>(Details to follow)</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney - Fun with Hack the Box",
        "date": "2021-11-11",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/279765803/",
        "timezone": "Australia/Sydney",
        "description": "<p>Please join us to play/train in Hack The Box (HTB), what you need is a Hack the Box account, free is cool, join us in discord (link <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a>) - FC-Announcements-Voice Channel, please ensure, after registration in Discord you go to the Bot and accept the Code of Conduct, otherwise, you won't be able to access the channels.</p> <p>There is no format to this night, we just want to get together to have some fun playing some battlegrounds, doing some of the machines or challenges; having fun overall!</p> <p>Please make sure you know the basics about HTB, eg. how to connect to the HTB VPN and that you have a valid account.</p> "
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "November Event - OWASP Threat Dragon | Failure to Report",
        "date": "2021-11-10",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Toronto/events/281510935/",
        "timezone": "Canada/Eastern",
        "description": "<p>LIGHTNING TALK<br/>------------------------</p> <p>OWASP Threat Dragon, A modern threat modeling tool, done right.</p> <p>Summary:</p> <p>OWASP Threat Dragon is a threat modeling tool used to create threat model diagrams as part of a secure development lifecycle. Come to this talk for a brief overview of the project, how it works, and how you can contribute!</p> <p>Presenter:</p> <p>I am Matthew McCarty, an application security engineer currently working for Coinsquare in Toronto. I am passionate about security and ensuring users of all kinds can safely and securely use the applications they want without worry! (a little cheesy I know)</p> <p>TALK<br/>-------</p> <p>Failure to Report</p> <p>Summary:</p> <p>Andrew has worked in infosec long enough to have seen and written many good and bad reports, and there's a few trends that are slowly driving him insane. Andrew hopes that his screaming in his talk, \"Failure to Report: A Semi-Structured Rant on What's Wrong with Vulnerability Assessment Reporting\" will help banish some bad practices to the land of wind and ghosts, never to be seen again. Or at least it will make him feel better.</p> <p>Presenter:</p> <p>Andrew Turnsek is a Senior Security Consultant at Security Compass and has been primarily working in penetration testing and vulnerability assessment since 2013, with brief stops in threat intelligence, security architecture review, and as a \"BS Detector\" for auditing teams. He can be found at security conferences and hockey games, usually wearing a Marlies hat.</p> "
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Detectify x OWASP Toronto - Pre-SecTor virtual meetup",
        "date": "2021-11-02",
        "time": "17:00",
        "link": "https://www.meetup.com/OWASP-Toronto/events/281660781/",
        "timezone": "Canada/Eastern",
        "description": "<p>** YOU NEED TO REGISTER VIA EVENTBRITE HERE - <a href=\"https://www.eventbrite.com/e/pre-sector-meetup-tickets-196349385297\" class=\"linkified\">https://www.eventbrite.com/e/pre-sector-meetup-tickets-196349385297</a> **</p> <p>Welcome to a Pre-SecTor Meetup on the Gather Town platform by Detectify and the OWASP Toronto Chapter!</p> <p>Join us for an evening of lightening talks and mingling. We will have 3 amazing speakers talking about how the security landscape is changing and how as a researcher you can stay ahead.</p> <p>AGENDA:</p> <p>5 PM - login to the platform</p> <p>5:30 PM - Introduction</p> <p>5:35 PM - Talk by Adam Greenhill - Discussing latest OWASP Top 10 updates</p> <p>5:50 PM - Talk by Alissa Knight (@alissaknight) - TBA</p> <p>6:05 PM - Talk by Jasmin Landry (@JR0ch17) - EASM and external attack surface from hackers perspective</p> <p>6:20 PM - Q&amp;A and virtual mingle</p> <p>SPEAKERS AND TALKS:</p> <p>ADAM GREENHILL is a chapter co-lead at OWASP Toronto. He will be discussing the recent updates to the new OWASP Top 10 2021.</p> <p>ALISSA KNIGHT (@alissaknight) - A recovering hacker of over 20-years, Alissa Knight is one of the hottest hacker influencers on the scene today that specializes in hacking connected devices. Her recent research includes hacking law enforcement cars, healthcare apps and banking apps. She's a frequent keynote speaker and you can catch more from her on Youtube with her channel KnightInk.</p> <p>JASMIN LANDRY (@JR0ch17) is currently in charge of IT &amp; Security at Metrio and does bug bounty as a hobby in his free time. He is currently ranked 23rd all-time on Detectify's Leaderboard.</p> <p>YUK FAI CHAN is a chapter co-lead at OWASP Toronto and will be a moderator for this event.</p> <p>Make sure to invite your friends and fellow security professionals!</p> <p>PRACTICAL INFORMATION:</p> <p>The event is FREE for anyone to attend.</p> <p>You must register on Eventbrite with an email address to be added to our Gather Town guest list. You can register using any email address.</p> <p>Our Gather Town link will be sent to you upon completing the registration.</p> <p>Space is limited! Once you are registered, make sure you arrive early to claim your spot.</p> <p>Time: Talks start at 5:30 PM, Q&amp;A from 6:20 PM.</p> <p>** YOU NEED TO REGISTER VIA EVENTBRITE HERE - <a href=\"https://www.eventbrite.com/e/pre-sector-meetup-tickets-196349385297\" class=\"linkified\">https://www.eventbrite.com/e/pre-sector-meetup-tickets-196349385297</a> **</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2021-11-25",
        "time": "18:30",
        "link": "https://www.meetup.com/owasptriangle/events/pqfzhsyccpbhc/",
        "timezone": "US/Eastern",
        "description": "<p>TBA</p> "
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "November 2021 Threat Modelling Virtual Workshop",
        "date": "2021-11-23",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/281402288/",
        "timezone": "Canada/Pacific",
        "description": "<p>The OWASP Victoria chapter is proud to present our next quarterly event. Jeevan Singh will be delivering a talk with an accompanying workshop on Threat Modelling 101.</p> <p>The event will be held on November 23 from 5:30 pm to 8:00 pm PT.</p> <p>This event will feature Jeevan’s talk followed by a Q&amp;A, workshop, and a draw for a prize (must be a registered member and reside in Canada). Join us for an evening of threat modelling!</p> <p>Visit our OWASP Chapter to learn more about us at:<br/><a href=\"https://owasp.org/www-chapter-victoria/\" class=\"linkified\">https://owasp.org/www-chapter-victoria/</a></p> <p>Speaker: Jeevan Singh<br/>Presentation: Talk, Q&amp;A, and accompanying workshop</p> <p>Event Details:</p> <p>Threat Modelling is a great way to discover and remediate threats in your system before they are even created. Security professionals commonly perform it, but anyone can do threat modelling. This hands-on workshop will cover the threat modelling workflow, common classes of vulnerabilities, and hands-on examples that will have *you* discover threats in different systems. Threat Modelling is an integral part of every company’s Security Development Lifecycle. Still, as development teams grow more prominent, security will have to choose which features they want to Threat Model, or they will become a bottleneck for the development organization.</p> <p>Speaker Biography:</p> <p>Jeevan Singh is an Application Security Engineering Manager for Twilio Segment (<a href=\"https://segment.com\" class=\"linkified\">https://segment.com</a>), where he is embedding security into all aspects of the software development process. Jeevan enjoys building a security culture within organizations and educating staff on security best practices. Jeevan is responsible for a wide variety of tasks, including architecting security solutions, working with development teams to resolve security vulnerabilities, and building out security features. Before life in the security space, Jeevan had a wide variety of development and leadership roles over the past 15 years.</p> "
    },
    {
        "group": "Zhytomyr",
        "repo": "www-chapter-zhytomyr",
        "name": "OWASP Zhytomyr 2021 Meetup #3",
        "date": "2021-11-24",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Zhytomyr-Chapter/events/281782803/",
        "timezone": "Europe/Kiev",
        "description": "<p>Увага! Там наче карантин посилили знову, тож буде багато вiльного часу. Пiклуючись про вас, ми натякаємо вам на те, що це виглядає як кльова можливiсть приєднатись до мітапу OWASP Zhytomyr, поширювати знання та ділитися досвідом в сфері кібербезпеки. Також ви можете скористатися цим часом щоб підготувати гарну доповідь на онлайн івент, що відбудеться 24.11.2021 о 19:00.<br/>Не втрачайте змогу зустрiтись iз ламповим OWASP Zhytomyr =)<br/>Ми за вами вже скучили!<br/>CFP: <a href=\"https://www.papercall.io/events/4544\" class=\"linkified\">https://www.papercall.io/events/4544</a></p> "
    },
    {
        "group": "Wia",
        "repo": "www-committee-wia",
        "name": "Cloud Security by Dr. Abhilasha Vyas",
        "date": "2021-11-27",
        "time": "13:00",
        "link": "https://www.meetup.com/womeninappsec/events/281539760/",
        "timezone": "US/Eastern",
        "description": "<p>This talk will discuss about Cloud Security. What are the security services provided by CSPs. How we can manage our resources on Cloud.</p> <p>Dr. Abhilasha Vyasr's LinkedIn profile: <a href=\"https://www.linkedin.com/in/dr-abhilasha-rakesh-vyas-96a15b199\" class=\"linkified\">https://www.linkedin.com/in/dr-abhilasha-rakesh-vyas-96a15b199</a></p> "
    },
    {
        "group": "Devslop",
        "repo": "www-project-devslop",
        "name": "Containers in a nutshell — ähm pod! Containers in a pod",
        "date": "2021-11-07",
        "time": "10:00",
        "link": "https://www.meetup.com/OWASP-DevSlop-Project/events/280310972/",
        "timezone": "Canada/Eastern",
        "description": "<p>Make sure you join us LIVE to get a chance to win a <a href=\"https://kodekloud.com/\" class=\"linkified\">https://kodekloud.com/</a> subscription</p> <p>Through the past few years, Docker has been synonymous with containerized software. Containers help us to automate our development lifecycle, and businesses across industries are increasingly moving towards this modern way of deploying and managing software.</p> <p>If you are using CI/CD pipelines, you have likely come across containers as part of these pipelines. While there are several different tools that help us build containers, Docker has remained the most popular.</p> <p>But what happens when we have to deal with thousands of containers at a time? This is where container orchestration tools such as Kubernetes come in.</p> <p>In this session, Anaïs will provide an overview of Kubernetes, how it changes our processes around deploying software, its benefits, and how you can get started.</p> <p>ANAIS URLICHS</p> <p>Anaïs is a Site Reliability Engineer at Civo, a cloud computing company based on Kubernetes. When she is not advocating DevOps best practices, she runs her own YouTube Channel centered around cloud-native technologies. Before transitioning to the cloud-native ecosystem, Anaïs helped blockchain projects scale and find adoption. As a CNCF ambassador, her passion lies in making tools and platforms more accessible to developers and community members.</p> <p>Make sure you join us LIVE to get a chance to win a <a href=\"https://kodekloud.com/\" class=\"linkified\">https://kodekloud.com/</a> subscription</p> "
    }
]