[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2025-01-28",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299786143",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with Norlys.\n\nAgenda:\n**19:00 – 19:10** Welcome by Norlys and OWASP Aarhus\n**19:10 – 20:00** ”Hybridwar, critical infrastructure and resilience…” by Ken Bonefeld Nielsen\n\nGet an insight into how vulnerable modern societies are when it comes to hybrid warfare. What can we do to make critical infrastructure more resilient…\n\nKen Bonefeld Nielsen – Senior Cyber Security and Resilience Advisor at Norlys shares his many years of experience from the military and international work for organizations like Sony, Tele2, Lundbeck and Norlys\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** \"The Journey of Cyber Entrepreneurship, Community Building, and Open Source Opportunities\" by Bjarke Petersen\n\nDiscover how true innovation emerges in entrepreneurial environments, the challenges it faces, and what it takes to succeed. Explore the vision behind Cybersikker.dk, a community designed to become Denmark's leading self-help hub for IT security. The session concludes with a collaborative exploration of impactful and affordable technological solutions, emphasizing the transformative potential of open-source tools.\n\nBjarke Petersen – Serial Cyber Entrepreneur and Community Enthusiast with experience in creating businesses. Now dedicated to building a free, self-help Cyber Community to support Danish SMEs in navigating and resolving their IT security challenges."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "The Menace of Mobile Malware",
        "date": "2025-01-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/305244493",
        "timezone": "America/New_York",
        "description": "As mobile devices become indispensable, they have also become prime targets for malicious actors. \"The Menace of Mobile Malware\" is a live-action presentation designed to expose attendees to the real-world dangers of mobile malware. From trojan horses to full-scale ransomware attacks targeting mobile platforms, this session will explore how these threats operate, their tactics, and how to detect and mitigate them."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "8. OWASP Augsburg Stammtisch",
        "date": "2025-01-22",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/305388800",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda - tbd**\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n Es werden noch Speaker\\*innen gesucht!! \n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "January 2025 OWASP Happy Hour sponsored by Cequence",
        "date": "2025-01-09",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/304571321",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, January 9th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "OWASP Meetup JAN 2025",
        "date": "2025-01-18",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/305358664",
        "timezone": "Asia/Kolkata",
        "description": "* Demystifying Zero Trust Network Architecture by **Ezekiel Jebaraj Solomon**\n* Impact of AI in Cybersecurity by **Kavitha Karunakaran**\n* Drone Forensics: Hack Those Flying Things !! by **Sriram Kesavan**\n\nFor registration:\n[Enroll here](https://docs.google.com/forms/d/1jFcASMbo5wWD1lL4RT_KYsEhr74OZBvUNF-Y2IUroRo/edit)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2025-01-20",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242793",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#08 The Passenger",
        "date": "2025-01-15",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/305279929",
        "timezone": "Europe/Lisbon",
        "description": "We are back!\nAfter a long break following the Global AppSec Lisbon, we want to start 2025 with an OWASP Lisboa Meetup right in January.\n\nThe meetup takes place on January 15th, 2025, at 18:00, at the OLX office, and is **sponsored by OLX and AP2SI**.\n\nThe schedule is the following:\n18:00 - **Quick intro** by the OWASP Lisboa chapter leadership team\n18:10 - **AI for Next-Gen Security: OpenAI and Security Copilot Synergy** by Sergey Chubarov\n19:10 - **Practical Security Guard Rails for LLM** by Nick Vinson\n20:00 - **Drinks & Dinner** by OLX\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **AI for Next-Gen Security: OpenAI and Security Copilot Synergy**\n\nSpeaker: **Sergey Chubarov**\n\nAbstract:\nThis demo-based session explores the potent collaboration between OpenAI and Copilot for Security.\n\nDiscover how the fusion of artificial intelligence is revolutionizing threat detection, response strategies, and proactive risk mitigation.\n\nThe session contains following topics:\n\\- Start free: Microsoft Copilot for SOC Operations\n\\- Security Copilot: Extra helping hand of Analyst\n\\- Azure OpenAI: How AI\\-driven incident response leverages intelligent automation\n\nBio:\nSergey Chubarov is a Security and Cloud Expert, Instructor with 15+ years' experience on Microsoft technologies.\n\nHis day-to-day job is to help companies securely embrace cloud technologies.\n\nHe has certifications and recognitions such as Microsoft MVP: Security, OSCP, OSEP, eCPPT, eCPTX, Microsoft Certified Trainer, MCT Regional Lead, EC Council CEH, CPENT, LPT, CCSE, CEI, CREST CPSA, CRT and more.\n\nFrequent speaker at local and international conferences like Global Azure, DEF CON, Black Hat Europe, Wild West Hackin' Fest, Security BSides, Workplace Ninja, Midwest Management Summit, Hack in the Box, Hack in Paris etc.\n\nPrefers live demos and cyberattacks simulations.\n\n[https://www.linkedin.com/in/schubarov](https://www.linkedin.com/in/schubarov)\n[https://www.sessionize.com/schubarov](https://www.sessionize.com/schubarov)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Practical Security Guard Rails for LLM**\n\nSpeaker: **Nick Vinson**\n\nAbstract:\nLLM based systems are being built and deployed at a rapid pace and new security threats are being introduced as a consequence. In this talk we'll discuss the nature of these threats and what security controls can be implemented to protect against them.\n\nBio:\nNick has 14 years in the tech industry spanning across both security and engineering roles. In his current role Nick leads the Product Security function at Snyk, a cybersecurity company that builds developer-first security products.\n\n[https://www.linkedin.com/in/nick-vinson-a147971bb/](https://www.linkedin.com/in/nick-vinson-a147971bb/)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2025-01-15",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-london/events/305137055",
        "timezone": "Europe/London",
        "description": "**This event is kindly sponsored and hosted by JustEat. There is limited seating available for in-person attendees. Registration required.**\n**This event will be live-streamed on YouTube. Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: JustEat, Fleet Place House, 2 Fleet Pl, London, EC4M 7RF (note: the entrance is directly opposite Starbucks front doors)\n**Nearest Tube Station:** St. Pauls (Central Line) - 6 mins walk\n**Doors Open at 6pm** for registration, food, drinks and networking. The talks start at **6:30pm** (we start on time).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Sherif Mansour and Andra Lezza\n\nWelcome and a brief update on OWASP Projects & upcoming OWASP Conferences from the OWASP London Chapter Leaders\n\n**\"Go Hack Yourself: API Hacking for Beginners\"** \\- Dr Katie Paxton\\-Fear\nOver the past few years, we've really seen API hacking take off as a field of its own, diverging from typical web app security, but yet parallel to it. Often we point to the amorphous blob that is web security and go: \"here you go, now you can be a hacker too\", with top 10 lists, write-ups, conference talks and whitepapers smiling as we do. This creates a major challenge for developers who want to test their APIs for security or just people who want to get into API hacking, how on earth do you wade through all the general web security to get to the meat of API hacking, what do you even need to know?\nThis talk is going to break down API hacking from a developer point of view, teaching you everything you need to know about API hacking, from the bugs you can find and to the impact you can cause, to how you can easily test your own work or review your peers.\n\n**\"Maturing Your Application Security Program\"** \\- Tanya Janca\nAfter working with over 300 companies on their application security programs the most common question I receive is “what’s next?”. They want to know how to mature their programs, and when they look at the maturity models available, they find them intimidating and so far beyond their current maturity level that they feel impossible. In this talk I will take you through 3 common AppSec program maturity levels I have encountered over the years, with practical and actionable next steps you could take immediately to improve your security posture.\n\n**SPEAKERS**\n\n**Dr Katie Paxton-Fear ([@insiderPhD](https://x.com/@insiderPhD))**\nDr Katie Paxton-Fear is an API hacker and content creator at Traceable. She has a PhD in cyber security and artificial intelligence, but if you know her it’s not for her academic work.\nShe’s a hacker and YouTuber who's found bugs in over 30 companies. She wants to show that anyone can be a hacker, and share her passion and knowledge with others. She has hacked everything from the military to social media, reporting her findings promptly and making sure the attackers don't get their first! In her free time she makes videos, teaching her audience of 80k+ how to get into ethical hacking. You can\nfind her all over the internet as InsiderPhD.\n\n**Tanya Janca ([@shehackspurple](https://twitter.com/shehackspurple))**\nTanya Janca, also known as SheHacksPurple, is the best-selling author of ‘Alice and Bob Learn Application Security’. She is also the founder of \"We Hack Purple\", an online learning community that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years, won countless awards, and has been everywhere from public service to tech giants, writing software, leading communities, founding companies and ‘securing all the things’. She is an award-winning public speaker, active blogger & podcaster and has delivered hundreds of talks on 6 continents. Tanya values diversity, inclusion, and kindness, which shines through in her countless initiatives. Advisor: Nord VPN, Aiya Corp Faculty: IANs ResearchFounder: We Hack Purple, OWASP DevSlop, #CyberMentoringMonday, WoSEC\n\n**TICKETS**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST book your place to be admitted to the event by the building security - your name will be checked against the guest list.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: https://owasp.org/www-policy/operational/code-of-conduct"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Secure Coding Tournament with Security Journey",
        "date": "2025-01-22",
        "time": "16:30-06:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885971",
        "timezone": "America/Chicago",
        "description": "TBD"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The State of Secure Coding: Talk + Hands-On Tournament",
        "date": "2025-01-30",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/305300856",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, January 27th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**The State of Secure Coding: Talk + Hands-On Tournament**\nIn this talk, we will explore the current state of secure coding, focusing on common vulnerabilities and pitfalls developers face today. Drawing from the OWASP Top 10, the session highlights real-world examples of flawed code and their potential risks. Attendees will gain practical insights into better coding standards and participate in a hands-on workshop to learn how to identify and fix these issues effectively. By the end, participants will be equipped with actionable techniques to create more secure and resilient applications."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2025-01-30",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/304844725",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "January 2025 Meeting",
        "date": "2025-01-07",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/305156490",
        "timezone": "America/Phoenix",
        "description": "**Overview and Usage Feedback for New Patent:**\n**\"Method to encode and decode otherwise unrecorded private credentials, terms, phrases, or sentences.\" (45 - 60 min)**\n\n* The two inventors of patent #US20200387595A1 will share the basic concepts using \"Glyphs\" to encode recallable, robust passphrases.\n* The goal is to get constructive, candid feedback on the practicality of personal and enterprise usage\n* To test the concepts behind GlyphPass, please bring several photos on your phone that have good, non-obvious stories associated with the pictures.\n* Patent can be read here: [https://patents.google.com/patent/US20200387595A1/en?oq=%23US20200387595A1](https://patents.google.com/patent/US20200387595A1/en?oq=%23US20200387595A1) .\n\n**NOTE: We are starting at 7:30 pm since December.**"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - In-person Meetup (@HealthEquity)",
        "date": "2025-01-22",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/305384600",
        "timezone": "America/Denver",
        "description": "Hi All, first Wasatch AppSec/ OWASP-SLC event of the year!\n\nWe'll be meeting in person at the **HealthEquity** Office building in Draper for lunch. We'll discuss one of the great books on the topic of Application Security.\n\nHelp us plan for food via RSVP.\nSee you there!\n\n**Agenda**:\n\n1. Introductions/Admin\n2. Discussion Topic: Alice and Bob Learn Application Security, By: Tanya Janca -- Discussion Lead: [@Derek McGhie](https://wasatchappsec.slack.com/team/U05G9FYQ415)\n\n**Location:**\nHealthEquity\n[121 W Scenic Pointe Dr](https://www.google.com/maps/search/?api=1&query=40.479885%2C%20-111.89508)\nHow to find us\nThe building closest to the freeway. Come to the front desk and let them know you're attending the OWASP Meetup. They'll direct you to the conference room."
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "Shift Left  - A discussion of AppSec Best Practices",
        "date": "2025-01-17",
        "time": "11:00-06:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/305152881",
        "timezone": "America/Chicago",
        "description": "**Shift Left - A discussion of AppSec Best Practices**\n11am-2pm for session\n2pm-3pm for happy hour\n\n**Details**\nTopics- See abstracts below\n\n* **Strategies for Aligning Programs with Modern Expectations-Frost Bank**\n* **Cultivating Developer Adoption in the era of Artificial Intelligence-Snyk**\n* **The radical future of app and API security is in production-Contrast Security**\n* **Shift Left: Design for Security and Quality**-**CheckMarx**\n\n**Lunch Provided**\nScuzzi’s Italian Restaurant - 4035 N Loop 1604 W #102, San Antonio, TX 78257\n\n**HAPPY HOUR** networking after session!!\n\n**ZOOM** link provided below for remote attendees\n**https://optiv.zoom.us/j/91529424588?pwd=bgMmGiqvaLkEn9GeX8tISW9lcmPoFc.1&from=addon**\n\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\n\nPlease reply **“ONSITE”** if you plan on attending in person so we can finalize headcount for food and room attendance \n**Presentations will include:**\n\n***I. Strategies for Aligning Programs with Modern Expectations***\n***Vipul Gupta-SVP Frost Bank***\nIn this talk, Vipul plans to share his experience with building and scaling an Application Security program. He will share why engaging with development and business teams is essential for the Shift Left journey.\n\n***II. Cultivating Developer Adoption in the era of Artificial Intelligence-Snyk***\nIn today’s fast-paced, AI-driven development landscape, securing developer adoption is key to integrating security seamlessly into workflows. This presentation explores practical strategies to overcome challenges like trust, tooling complexity, and unclear ownership. By focusing on people, processes, and tools, we demonstrate how to empower developers, reduce friction, and scale security effectively. Attendees will gain actionable insights to foster a collaborative culture where security becomes a natural part of development.\nOne of the biggest challenges that organizations face when shifting left is getting developers to actually adopt the “shift left\" tools. This presentation speaks to how to overcome that.\n\n***III.*** **Development Team Transformation -Contrast Security**\nThe lines between proactive and reactive cyber defenses are somewhat arbitrary. If you blur those lines, you can some serious advantages. A SAST or SCA tool finding is a theoretical vulnerability that may or may not be exploitable, but if you can see that a vulnerability is within the blast radius of active probes or attacks, it suddenly becomes real. What might have been labeled as \"critical\" in pre-prod suddenly becomes \"super-critical\". On the other hand, things that are not exploitable in a production context due to compensating control, can be deprioritized preserving the limited attention of development for things that really matter. Join DevSecOps pioneer, Larry Maccherone, for this thought-provoking discussion on going right to shift left\n\n***IV.*** **Shift Left: Design for Security and Quality**-**CheckMarx**\nThis presentation will discuss the elements of design phase security, highlighting the critical role of design decisions in achieving a secure and high-quality software product."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-01-08",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349987",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Jan 2025 Meetup: Safeguarding the Future of Artificial Intelligence",
        "date": "2025-01-15",
        "time": "18:30+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/305359308",
        "timezone": "Asia/Singapore",
        "description": "The evening will kick off with a thought-provoking presentations by our line up of speakers, setting the stage for an intellectual journey into the heart of AI vulnerabilities and defenses. Attendees will gain insights into the latest adversarial attacks on AI models, delve into the nuances of privacy preservation in AI systems, and explore ethical considerations in AI development and deployment.\n\nThe event will culminate in an interactive Q&A session, encouraging attendees to engage directly with our speakers and fostering the collaborative spirit that both AiSP and OWASP hold dear. This open dialogue will not only address current challenges but also spark discussions on future trends and potential solutions in AI security. Join us for an evening of enlightenment, engagement, and empowerment as we collectively work towards a more secure AI-driven world. Together, we’ll explore how to build unassailable fortresses in the cognitive realm, ensuring that as AI advances, our defenses evolve in tandem.\n\n**Synopsis**:\nIn the rapidly evolving landscape of artificial intelligence, where Large Language Models (LLMs) and advanced AI systems are reshaping our digital world, the need for robust security measures has never been more critical. The Association of Information Security Professionals (AiSP) and the Open Web Application Security Project (OWASP) proudly present “Safeguarding the Future of Artificial Intelligence” an enlightening evening session that bridges the gap between AI innovation and cybersecurity. This event embodies the shared values of AiSP and OWASP – fostering knowledge sharing, promoting best practices, and nurturing a vibrant community of security-conscious professionals.\n\n**Securing AI systems: An overview and the lifecycle approach**\nSpeaker: Mr Loh Chee Keong, Lead Consultant for AI Security, Cybersecurity Engineering Centre, Cyber Security Agency of Singapore\n\n**OWASP Top 10 for LLMs**\nSpeaker: Mr Wong Onn Chee, OWASP SG Chapter Co-Leads & AiSP Data & Privacy SIG EXCO Lead\n\nPlease RSVP your attendance at [Eventbrite page](https://www.eventbrite.sg/e/aisp-ai-sig-meetup-tickets-1076265552239?aff=oddtdtcreator) by 14 January 2024 7pm SGT."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-Jan Lunch and Learn",
        "date": "2025-01-24",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/305346191",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-Jan Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\\- 11:00am \\- Registration and Lunch\n\\- 12:00pm \\- Speaker \\- Eaton Zveare \\- API Security Blunders: Tales from the Cyber Trenches\n\\- 1:00pm \\- Depart\n\n**Speaker**:\nEaton is a security researcher at Traceable. As a member of Traceable's ASPEN Labs team, he has contributed to the security of some of the world's largest organizations by finding and responsibly disclosing many critical vulnerabilities. He is best known for his high-profile security disclosures in the automotive space.\n\n**Abstract**:\n**API Security Blunders: Tales from the Cyber Trenches**\nDive into API Security by dissecting real-world API vulnerabilities that have caused security breaches. We'll guide you through the process of hunting for such vulnerabilities, and provide insights to effectively defend against such attacks.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W,\nSTE 600\nTampa, FL\n33607\n\n**Sponsors**:\nTraceable - [https://www.traceable.ai/](https://www.traceable.ai/)"
    }
]