[
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "4. OWASP Augsburg Stammtisch",
        "date": "2024-07-24",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/302130564",
        "timezone": "Europe/Berlin",
        "description": "**!WANTED! --> Women in IT Security <-- !WANTED!**\n\n**Agenda tbd**\nDu hast einen Vortrag? Melde dich! Wir sind immer auf der Suche nach interessanten Inhalten!!\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst einen Talk halten? Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-08-01",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302074820",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - July 2024 (Online)",
        "date": "2024-07-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207014",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation! Presentation begins at 12 CDT!\n\nPresentation: **Cyber Resilience - Findings from the 2024 Futures Report**\n\nWe are poised on the precipice of a new era of computing underpinned by new networks, new apps, and a digital-first experience.\nHear the latest findings from AT&T Cybersecurity research and learn about:\n\\- What high\\-priority edge computing use cases are across seven industry markets\n\\- How to secure and work with the edge ecosystem\n\\- How the attack surface is changing\n\\- How endpoints are diversifying\nThe data from this research helps audiences understand challenges and opportunities of the future and examines:\n\\- Balanced investment strategies\n\\- Collaboration and communication needs\n\\- Building with dynamic cyber resilience in mind\nSecurity is now a critical part of business - learn how to move your team to the future!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-25",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302063790",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Study Group",
        "date": "2024-07-18",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/301903126",
        "timezone": "America/Chicago",
        "description": "Since 4/25/24: discussions on AI and LLM's generally and the Coursera Prompt Engineering series from Vanderbilt specifically. We are now studying ChatGPT Advanced Data Analysis....\n\nFor General Study Group info, see #studygroup in OWASPAustin Slack\nFor topic specific info, see #ai in the OWASPAustin Slack"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combined Monthly Meet on 20 July 2024",
        "date": "2024-07-20",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/301657456",
        "timezone": "Asia/Kolkata",
        "description": "null/owasp combined meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n* Deepfakes Detection Techniques by **pretti Rajesh**\n* Block chain and Smart contracts by **Meera**\n* There's no honour among phishers: free phishing kits with hidden backdoors by **Anshuman**\n* Building your own threat intel sink by **Pavan Karthick M**\n\n### Session Schedule\n\n| Name | Speaker | Start Time | End Time | Resources |\n| ---- | ------- | ---------- | -------- | --------- |\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM | |\n| [Deepfakes Detection Techniques](https://null.community/event_sessions/4336-deepfakes-detection-techniques) | [pretti Rajesh](https://null.community/profile/48106-pretti-rajesh) | 09:40 AM | 10:10 AM | |\n| **Introduction to beginners** | 10:10 AM | 10:25 AM | |\n| [Block chain and Smart contracts](https://null.community/event_sessions/4338-block-chain-and-smart-contracts) | [Place Holder](https://null.community/profile/2-place-holder) | 10:25 AM | 11:20 AM | |\n| **Networking Session + Break** | 11:20 AM | 11:45 AM | |\n| [There's no honour among phishers: free phishing kits with hidden backdoors](https://null.community/event_sessions/4340-there-s-no-honour-among-phishers-free-phishing-kits-with-hidden-backdoors) | [Place Holder](https://null.community/profile/2-place-holder) | 11:45 AM | 12:40 PM | |\n| [Building your own threat intel sink](https://null.community/event_sessions/4341-building-your-own-threat-intel-sink) | [Pavan Karthick M](https://null.community/profile/37062-pavan-karthick-m) | 12:40 PM | 01:35 PM | |\n| **Feedback + Next Month’s Planning** | 01:35 PM | 01:55 PM |"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "July meetup",
        "date": "2024-07-17",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/302137729",
        "timezone": "America/Los_Angeles",
        "description": "We're excited to announce our upcoming July meetup, which will be hosted by the awesome **Oligo Security** team at **Hackerdojo mountainview**. Get ready for insightful discussions and the chance to network with some of the brightest minds in the industry. Along with some nice food and drinks.\n\nThis meetup is Joint Collaboration with Pacific hackers group(https://www.pacifichackers.org)\n\nBrief agenda below:\n\n5:00 – 5:45: Networking/Food and drinks\n5.45-6:00: Introductions\n6:00-6.45: Talk from Oligo Security\n6.45-7:30: Tackling Hallucinations in Enterprise LLM apps\n7:30-8:00: 10 Fundamental Qualities of Modern Application Security Teams\n\n**Talk#1:** The Problem With Shifting Left and Why Context Matters\n**Description:** In the 1980s, a famous study by IBM formed the basis for modern ideas around shifting security further to the left. Join Oligo for this talk where we'll dig into why it made sense then and explore whether this still rings true today in the modern world of DevOps, Agile methodologies, and cloud-native applications.\n\n**Speaker:** Miles McLean is Oligo's Director of Solutions. After spending over a decade in systems and software engineering leadership, Miles most recently helped build out the Solutions teams at Snyk. He's passionate about technology, security, and enabling engineers to do their best work with the best tools available.\n\n**Talk# 2:** Tackling Hallucinations in Enterprise LLM apps\n**Description:** Large Language Models can sometimes invent information. These inaccuracies or “Hallucinations” are the most common issue with Enterprise Gen AI applications. This talk delves into the world of LLMs and RAGs extensively exploring different types of Hallucinations, their risks, and various mitigation strategies.\n\n**Speaker:** Puneet Anand Co-founder AIMon. With a decade and a half of expertise crafting and deploying B2B Enterprise software for both startups and Fortune 50 giants, I excel in streamlining and resolving challenges with cutting-edge technology. As a patented inventor and seasoned engineering leader, my commitment lies in empowering exceptional individuals to transform their world through the power of AI.\n\n**Talk#2:** 10 Fundamental Qualities of Modern Application Security Teams\n**Description**: This talk will cover the ten key qualities of successful modern application security teams. These include technical, strategic, and interpersonal skills that ensure strong security and quick responses to new threats. The talk will deep dive into each quality in detail, providing examples and best practices to help attendees build or enhance their own security teams. This will be an interactive and engaging discussion.\nThis session is ideal for security professionals and leaders looking to improve their team's application security capabilities. Attending this talk will provide valuable insights and practical advice on building a robust security team, staying ahead of emerging threats, and fostering a security culture within your organization.\n\n**Speaker:** Ankita Gupta, Co-founder and CEO at Akto.io (The open source API Security product.) Prior to Akto she has experience working in VMware, LinkedIn and JP Morgan. She holds MBA from Dartmouth College and Bachelors in Technology from IIT Roorkee. She is also a speaker at Black Hat and Defcon."
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém UEPA 2024",
        "date": "2024-08-03",
        "time": "08:30-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/301800873",
        "timezone": "America/Boa_Vista",
        "description": "No dia 03 de agosto, a **OWASP Belém** é um dos capítulos brasileiros entre os mais de 200 capítulos ativos em todo o mundo. Nosso objetivo é disseminar a missão da OWASP, tornando a segurança das aplicações visível, para que as pessoas e organizações possam tomar decisões conscientes sobre os verdadeiros riscos de segurança das aplicações.\nAlém disso, estamos empenhados em promover práticas de computação forense, ajudando a identificar, preservar, analisar e apresentar evidências digitais de forma adequada. A computação forense é essencial para a investigação de incidentes de segurança, permitindo que as organizações compreendam as origens e impactos de ataques, além de reforçar suas defesas contra futuras ameaças.\n\n**Data:** 03/08/2024\n\n* **Horário:** 8h30m.\n* **Local:** UEPA\n* **Endereço**: Tv. Dr. Enéas Pinheiro, 2626 - Marco - UEPA\n* Inscrição: https://bit.ly/owaspuepa\n\nConfira a programação:\n**08h30m:** Abertura\n**09h00:** Apresentação OWASP\n**09h15 - 09h45:** Em breve.\n\n**10h - 10h45:** Em breve**.**\n\n**10h45 - 11h00:** Intervalo / Networking\n**11h15 - 11h45:** Em breve."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Threat modelling software supply chains during a red team assessment.",
        "date": "2024-07-17",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/301741599",
        "timezone": "Australia/Brisbane",
        "description": "The software supply chain is under increasing threat. New attacks and threats have popped up that we couldn't have imagined even two years ago. Total attacks on the software supply chain are increasing by more than 730% year on year since 2019. One way for organizations to combat this growing threat is to empower their red teams to test the software supply chains for that organization. But many red teams are ill-prepared to tackle this new attack surface.\n\nThis talk will have three distinct parts:\n\n1\\. I will describe how security teams\\, red teams\\, or security researchers can quickly identify the multiple components in a particular applications software supply chain\\, and then how to find soft targets to focus on\\.\n2\\. I will describe my VBP framework \\(value\\, behaviour and patterns\\) which is an applied threat modelling framework for software supply chains\\.\n3\\. Finally\\, I will visually describe one of my red team operations on an open\\-source project and the tools that I use \\(or have written\\) to make that possible\\."
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "Secure by Design: Empowering Enterprise Security through Application Governance",
        "date": "2024-07-27",
        "time": "10:00+03:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/302273299",
        "timezone": "Africa/Cairo",
        "description": "In today's rapidly evolving digital landscape, securing applications is a critical concern for enterprises. This joint event, organized by the OWASP Cairo Chapter and ISACA Egypt Chapter, aims to equip security professionals, developers, and IT leaders with the knowledge and tools necessary to integrate security throughout the application development lifecycle.\n\nThe event will feature two key sessions:\n[10:00 AM - 10:45 AM]⁠ ⁠Integrating Security into the Development Lifecycle: Governance Frameworks and Best Practices [Speaker: Mohamed Alfateh]\n\\- Discover strategies for embedding security within Agile\\, Waterfall\\, and DevSecOps methodologies\n\\- Explore the security manager's role in fostering collaboration\\, driving security awareness\\, and measuring the effectiveness of security initiatives\n\n[10:45 AM - 11:30 AM]⁠ ⁠Secure Coding Practices for Web Applications [Speaker: Mohammed Sherif]\n\\- Explore secure coding principles and techniques to mitigate common application vulnerabilities\n\\- Learn about secure coding standards\\, code review best practices\\, and automated security testing\n\nThrough a combination of expert presentations, interactive discussions, and real-world case studies, attendees will gain a comprehensive understanding of secure application development and the essential role of security governance in empowering enterprises to build secure, resilient, and compliant software solutions."
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Hacking AWS: Hands-On exploitation of cloud services",
        "date": "2024-07-27",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/302116015",
        "timezone": "Asia/Kolkata",
        "description": "**Note:** **1\\. Participants can attend the event by invitation only\\, as we have limited seating\\. Venue details will be sent to selected participants\\.**\n**2\\. This workshop is intended for peoples who already have basic knowledge in AWS environment only\\, not for newbies/beginners\\.**\n\n**Hacking AWS**\nAn immersive 8-hour workshop designed for Blackbox Pentesters looking to enhance their skills in attacking and exploiting AWS resources.\nThis beginner-friendly session dives deep into AWS security, focusing on identifying and exploiting vulnerabilities in various AWS services.\n\n**What You Will Learn**\nThroughout the workshop, attendees will gain hands-on experience in:\n\\- Enumerating and Reconnaissance: Identifying and mapping AWS resources\\.\n\\- IAM Misconfigurations: Exploiting flaws in IAM roles and policies\\.\n\\- S3 Bucket Exploitation: Accessing and exfiltrating data from misconfigured S3 buckets\\.\n\\- EC2 Instance Attacks: Gaining unauthorized access to EC2 instances\\.\n\\- Other Common Misconfigurations: Identifying and exploiting other prevalent AWS vulnerabilities\\.\n\n**Capture the Flag (CTF) Event**\nThe workshop will conclude with a Capture the Flag (CTF) event, allowing attendees to apply what they've learned in a simulated AWS environment.\nThe CTF event will end on the same day, but the labs will remain accessible for 48 hours post-session for further practice.\n\n**Ideal Audience**\nThis workshop is best suited for individuals aiming to work on breaking into AWS environments, including:\n\\- Offensive Security Engineers\n\\- Pentesters Specializing in Cloud Security\n\\- Security Engineers\n\\- Technical Cloud Security Consultants\n\n**Not Suitable For**\nRed Teamers: This session does not cover advanced attack tactics, defense evasion, C2 hosting, or advanced data exfiltration.\nBlue Teamers & Defenders: Defensive strategies against these attacks are not covered.\nBeginners to AWS: Basic understanding of AWS and cloud computing concepts is required.\nRequirements for Participation\nAWS Account: Each attendee must have their own AWS account with root/admin access. Free tier accounts are sufficient.\nAWS CLI v2: Must be installed on the attendee's system.\nHardware: Attendees must bring their own laptops with internet connectivity.\nKnowledge Base: Basic familiarity with AWS services and concepts like IAM, Lambda, EC2, etc., is needed.\n\n**Kindly Fill this form for registration :** [https://forms.gle/GSTZZmfpEUHiDYHN6](https://forms.gle/GSTZZmfpEUHiDYHN6)"
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Inteligencia Artificial versus ISO-9000",
        "date": "2024-07-17",
        "time": "20:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/302168917",
        "timezone": "America/Santiago",
        "description": "Únete a nosotros para un conversatorio sobre la implementación de la norma ISO/IEC 9001 y su impacto en la adopción de herramientas de inteligencia artificial (IA).\n\nNo te pierdas esta oportunidad de mantenerte a la vanguardia de la ciberseguridad en el campo de la IA. Ideal para profesionales interesados en optimizar sus operaciones con IA de manera segura y efectiva."
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "Secrets Revealed for Launching a Successful Enterprise DevSecOps Program",
        "date": "2024-07-18",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/301914266",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nThis presentation walks through the patterns of successfully starting of a DevSecOps program from scratch. As such, it focuses on the strategies derived from both the successes and failures and lessons learned along the way on this journey. Lastly, this talk concludes how White House Executive Order (14028) centered around SBOM shapes the next steps of the DevSecOps maturity model and how organizations can leverage this new piece of legislation to bolster their application security defenses.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "NO EVENT IN JULY",
        "date": "2024-07-25",
        "time": "19:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/301939938",
        "timezone": "America/Denver",
        "description": "We're taking July off so you can enjoy some summer vacation time. See you again in August! -Terry"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "10 Things I Hate About AppSec (It’s not developers)",
        "date": "2024-07-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301083987",
        "timezone": "America/New_York",
        "description": "We’ll take a quick look into recent data breaches and common application security anti-patterns, exploring how to improve security practices while increasing morale and reducing risk."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP July Meetup - Join Us!",
        "date": "2024-07-17",
        "time": "17:00-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/302000550",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on July 17th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:00 - food is served at 5:30 and the presentation starts at 6:00.\n\nThis month's meeting is brought to you by [Synopsys!](www.synopsys.com)\n\n**Presentation:** Managing the Complexity of Software Supply Chains\n\n**Abstract:**Software supply chains are significantly more complex than a traditional materials-based supply chain or B2B software procurement effort. The risk elements in software supply chains are different from those assessed during vendor risk management efforts and are constantly evolving. For example, studies have shown that the average commercial application has hundreds of component suppliers – each with their own release criteria, coding standards, and risk management.\nRegulated industries and global legislative efforts to learn how risk informed software supply chain management can function without disrupting development velocity. SBOMs are a core component of software risk management, but it’s only one element. Attestations, threat models, and continuous threat monitoring transform a simple SBOM into a pillar of a modern cyber risk management program."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt Chapter #66 - Cloud Security & Vulnerability Disclosure",
        "date": "2024-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/300654912",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #66! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Security at Scale - Mastering Cloud Security in the Cyberwar Era**\n\n*Dominik Sowinski, Cybersecurity Architect & Cybersecurity Community Lead, Siemens*\n\nIn the midst of rapid cloud transformation, industrial organisations face an ever-evolving cyber threat landscape, exacerbated by global events such as the war in Ukraine. This presentation will address the latest APT activities and the significant risks they pose to cloud infrastructures and critical industrial operations. We will explore cutting-edge strategies, technical considerations and essential processes to rapidly adapt and secure cloud environments at scale against these relentless threats. The presentation will help you understand how to fortify cloud applications and infrastructure in this dynamic threat landscape.\n\n**2\\. Talk: Let's talk vulnerabilities**\n\n*Vinit K., Independent security research and threat hunting*\n\nA talk and live demo on cybersecurity threats involving terminal emulators and SSH. We will explore how URL handling in iTerm2 and Hyper can be abused for code execution, as well as delve into the recent CVE-2023-51385 vulnerability, which allows unexpected code execution via SSH ProxyCommand. The session will include interactive segments where the audience can contribute exploit ideas and deepen their understanding of these critical security issues.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 31.07.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "Drei spannende Kurzvorträge ",
        "date": "2024-07-23",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-hamburg-stammtisch/events/302138351",
        "timezone": "Europe/Berlin",
        "description": "Moin in die Runde,\n\nwe'll have a series of short talks in German.\n\n# **Eckpunkte**\n\nLokation: An der Alster 64 , Hamburg\nDatum: 23.7.2024\nStart: Einlass ist ab 17:30 . Um 18:00 Uhr starten wir mit den Vorträgen\nAnmeldung: kurz mit oder ohne Klarnamen \"Bescheid\" sagen\nThemen: s.u.\n\n# **Vorträge**\n\n* Björn Kimminich + Jannik Hollenbach: **Brick your Juice Shop in 319 easy steps**\n*In this session, you will learn about a literal hands-on endeavor of OWASP Juice Shop for its 10th anniversary: The official branded LEGO case for your MultiJuicer cluster on 4 Raspberry PIs!*\n* Timo Pagel: **Relevante AppSec Metriken erfassen und analysieren**\n*Auf dem Weg zum ausgereiften Application Security Program ist die Erfassung von Aktivität-Metriken ein wichtiger, jedoch oft übersehener Schritt. Dieser Kurzvortrag erläutert die Kunst und Wissenschaft der Definition, Sammlung und Analyse von Aktivität-Metriken, um bedeutende Verbesserungen im AppSec-Programm voranzutreiben. Timo präsentiert Metriken anhand der Open-Source-Anwendung Metric Collector and Analyser (metricCA). Weiterhin erläutert er kurz die Architektur von metricCA .*\n* Matthias Marx: **Hide and Seek - über Biometrie-Geräte des US-Militärs**\n*Das US-Militär hat massenhaft Geräte zur biometrischen Erfassung von Menschen in Afghanistan genutzt, wovon einige beim hastigen Abzug der NATO-Truppen zurückgelassen wurden und in die Hände der Taliban gelangten. Medien berichteten darüber, der Chaos Computer Club fing an zu recherchieren. Dieser konnte gleich mehrere Geräte ersteigern. Eine Analyse förderte große Mengen biometrischer und weiterer personenbezogener Daten zu Tage. In den falschen Händen bedeutet dies Lebensgefahr für Menschen in Afghanistan und Irak. Matthias hat die CCC-Forschungsgruppe geleitet. Ein Gerät bringt Matthias mit*.\n\nZu Gast sind wir wieder zentral bei Check24, am Anfang der Außenalster (Nähe Hotel Atlantic) In Fußmarschentfernung vom Hauptbahnhof.\nAus planungstechnischen Gründen unseres Hosts (Verpflegung) sag mir bitte per Mail oder hier bei Meetup Bescheid, wenn du dazustoßen möchtest.\n\n# **Generelles zum OWASP-Stammtisch**\n\nBei unseren offenen Treffen geht es um Software und deren Sicherheit im Internet und/oder IT-Security allgemein. Hier treffen sich Menschen, die sich beruflich oder privat mit IT-Sicherheit beschäftigen: Entwickler, Manager, „Pentester“ und alle an (Web)sicherheit interessierte. Die Atmosphäre ist offen und locker. Uns geht's um den Erfahrungsaustausch, Technikschnack und um's Netzwerken. Wer Produkte oder Dienstleistungen verkaufen will, ist hier falsch. Ihr seid herzlich willkommen, euren Kollegen oder Bekannten einen Hinweis auf unsere Treffen weiterzuleiten. Alle Treffen sind frei, für jeden offen und kostenlos.\n\nSchönen Gruß, Dirk"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-07-29",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/301991448",
        "timezone": "America/Los_Angeles",
        "description": "Join us for our 3rd mixer with participating cybersecurity communities in Southern California, enjoy beautiful weather, amazing sunset, great conversations, network with your peers, make new friends!\nYou **don't** have to be a member of any group to participate. Mark your calendars; see you there!!\n\n**VENDOR Opportunities Available**\n*Vendors interested in attending please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JUL 24, 2024",
        "date": "2024-07-24",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/299606717",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Breaking Through CVE Noise: Analyzing 5 Key Prioritization Inputs\nJoin us for great networking, dinner and drinks, and see a presentation by **Chelsea Boling**, a Customer Success Architect at **FOSSA**\n\n**ABSTRACT**: Thousands of new Common Vulnerabilities and Exposures (CVEs) are reported each year, which puts a massive burden on security teams to prioritize and address the most critical threats effectively. This is especially true since most vulnerabilities aren’t actually exploitable in their real-world context, and wasting time on non-exploitable issues can get in the way of remediating the most impactful vulnerabilities.\nThis talk will explore strategies to mitigate CVE overload and streamline the vulnerability resolution process. In addition to exploring complexities around CVE noise — such as the difficulty in distinguishing between high-risk, low-risk, and no-risk vulnerabilities and the pressure to maintain business continuity while ensuring robust security — we’ll analyze five specific vulnerability prioritization inputs:\n\n1. CVSS scores\n2. EPSS scores\n3. VEX\n4. The CISA KEV Catalog\n5. Reachability analysis\n\nAdditionally, the talk will cover the role of automation and tooling to prioritize vulnerabilities at scale as well as recommended workflows between IT, security teams, and business units to ensure comprehensive risk management.\n\n**Thanks to our SPONSOR**: *[FOSSA](https://fossa.com/)*\n*FOSSA is a leading application security and compliance platform that specializes in helping engineering teams deliver trusted software. FOSSA enables companies to prioritize real vulnerabilities in their open source dependencies with comprehensive SCA (software composition analysis) capabilities, while also making it possible for organizations to automate compliance reporting and SBOM (software bill of materials) lifecycle management to meet customer and regulatory requirements. Founded in 2015, FOSSA is trusted by thousands of global organizations, has been downloaded nearly two million times, and has conducted nearly 100 million open-source scans.*\n\n**Thanks to our HOST**: *[HiveWatch](https://www.hivewatch.com/)*\n*Intelligent, efficient, and scalable security*\n*HiveWatch is a cloud-based SaaS platform built for physical security teams to enhance their current security technologies. It streamlines incident response, allows for the consolidation of disparate programs and systems, and reduces false alarms.*\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - July 2024 Meetup",
        "date": "2024-07-31",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/302245868",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nWe had a great meetup last month. Thank you to those that attended.\nTo make it easier, let's call this new format \"Practitioner's Roundtable\". We'll keep this going for the rest of this year. Following the survey last month of when you'd like to have these meetings, 66.7% of you told us you'd prefer the last Wednesday of the month - so, it shall be.\n\nIn our last meetup, attendees voted for [Dr. Watson's Bar in the CBD](https://www.thesherlockholmes.com.au/dr-watsons-bar/) as our location this month. On 31st July 2024 6PM, there we shall meet.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic.* \\*)\\*\n\nPlease remember to update your RSVP if you can no longer attend. Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get.\n\nWe're looking forward to the discussions we had once again.\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is [inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics.\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there.\n\nSee you there.\nThank you."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Capture The Flag Event - SHRED with Security Innovation",
        "date": "2024-08-14",
        "time": "16:30-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300354016",
        "timezone": "America/Chicago",
        "description": "Join us in-person for an exciting day of hacking a cyber range! Thanks to the folks at Security Innovation, we'll host attackers of all skill levels and background to have some fun networking and learning about the mindset, skills and methodologies used in the seemingly growing number of breaches we hear about in the news."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Every app risk, everywhere, all at once",
        "date": "2024-07-24",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885911",
        "timezone": "America/Chicago",
        "description": "Security tooling will identify application security risks and multiple tools will deluge security folks and application developers with signal – to the degree that no human or group of humans can hope to tackle these with anything approaching sanity. In this talk, we’ll discuss a better way to operationalize reducing risk, some stories from the trenches and what both bad and good look like."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Tackling vulnerabilities in third-party packages",
        "date": "2024-07-25",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/302160813",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, July 21st, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**Abstract**\nDependency scanners often overwhelm developers with non-critical issues, reducing development efficiency. This session will introduce strategies for effective software dependency management, aimed at realistic security goals. We'll cover how to identify and prioritize key vulnerabilities using tools like code-scanning reachability analysis, ensuring a smoother remediation process."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2024-08-08",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181908",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-07-25",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/301904100",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - Bezpieczeństwo API + Kariera w branży IT security?",
        "date": "2024-07-30",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/302269188",
        "timezone": "Europe/Warsaw",
        "description": "Przed nami kolejne spotkanie naszej grupy. Mamy dla Was wykład Maćka Kofela o bezpieczeństwie API a w drugiej części proponujemy dyskusję o karierze w IT security.\n\n* **Bezpieczeństwo API (Maciej Kofel)**\nPodczas tworzenia i testowania API często priorytetem są wydajność i funkcjonalność. Ale co z bezpieczeństwem? Czy wiesz, że hakerzy mogą wykorzystać API do wyciągnięcia cennych informacji z Twojej aplikacji lub uzyskania dostępu do Twojego serwera, co umożliwia im dalsze eksplorowanie zasobów Twojej firmy? Na nadchodzącym spotkaniu OWASP zaprezentuję takie przykłady.\nW mojej prezentacji dowiesz się o lukach z listy OWASP API Top10, które mogą wystąpić w API, poznasz narzędzia i techniki testowania bezpieczeństwa API oraz dowiesz się, gdzie szukać pomocy lub rekomendacji dotyczących łatania tych luk.\nTa sesja będzie pełna praktycznych przykładów. Po tej prezentacji, już nigdy nie spojrzysz na API w ten sam sposób.\n*\n* **Kariera w branży IT security (dyskusja)**\nW drugiej części naszego spotkania porozmawiamy o tym jak wejść do branży IT security i jak planować swoją karierę. Zapraszamy zarówno tych którzy dopiero planują rozpoczęcie pracy, tych którzy mają już kilka lat doświadczenia, jak i managerów prowadzących rekrutację. Porozmawiamy o tym co działa a co nie, jaki jest obecny stan rynku pracy, jakie specjalności są dzisiaj a jakie będą w przyszłości, na co warto zwracać uwagę planując swoją karierę w IT security."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Designing an Efficient Penetration Test Suite",
        "date": "2024-07-18",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/301487187",
        "timezone": "America/Los_Angeles",
        "description": "How do you define the scope of penetration testing for a web application project? Is it the OWASP Top Ten, formal guidelines established by organizations such as NIST, security stories developed by the product owner and the security team, or recommendations made by your development team? The answer is all the above depending on the client, your development environment, and your capacity to take the risk.\n\nThis presentation will share experiences gained from penetration testing of a web application hosted by a Government agency providing professional licenses to its prospective clients. The nature of the project touched numerous areas such as CJIS (Criminal Justice Information Service), Personal Identifiable Information (PII), Access Control (Authorization in particular), and adherence to the security standard’s office guidelines. The challenge was to identify and prioritize the test suite that will cover these specific areas in a constrained time period. To enhance the coverage, the test suite had to include DAST (using ZAP) and some specific general scenarios.\n\nThe audience will take away some approaches that when applied can lead to a well balanced (both effective and efficient) penetration testing.\n\nSCHEDULE\nDoors open at 5:30. The talk will begin about 6pm.\n\nENTRY\nThere are doors on Washington and Broadway. Both of them auto-lock at 6pm. From 6 to 6:15pm, only the door on Broadway will be available. Take the elevator to the 11th floor.\n\nNO ENTRY AFTER 6:15 PM\nIt will not be possible to enter the building after 6:15.\n\nACKNOWLEDGEMENTS\nOur host again this month is NedSpace, a co-working space in downtown Portland--a friendly place to work when you don't want to work from home.\n\nFOOD\nWe don't yet have a sponsor for July, so there may not be food this time. Plan accordingly. (If you know a company that might like to sponsor, please put them in touch with us.)"
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro #15 [ONLINE]",
        "date": "2024-07-18",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/301724132",
        "timezone": "America/Sao_Paulo",
        "description": "Em julho teremos o nosso próximo encontro, online e com participação de todos através do **ZOOM**.\n\nVenha aprender e conversar **com um dos principais colaboradores** do OWASP Top 10 For LLM.\n\n**Link para a transmissão:**\nhttps://us06web.zoom.us/j/87962925968\n\n**Confira nossa agenda:**\n\n 19h30 \\~ 20h30\n**\"Segurança de IA na Prática: OWASP Top 10 para LLM Apps\"**\n\nNesta apresentação, exploraremos as melhores práticas de segurança para aplicações que utilizam Modelos de Linguagem de Grande Escala (LLM). Vamos discutir o OWASP Top 10, um guia essencial para identificar e mitigar os principais riscos de segurança nessas aplicações. Através de exemplos práticos e insights detalhados, você aprenderá como proteger suas implementações de IA, garantindo conformidade e segurança robusta. Esta sessão é fundamental para profissionais de segurança, desenvolvedores e líderes de tecnologia que buscam fortalecer suas defesas contra ameaças emergentes no campo da inteligência artificial.\n\n**Palestrante:** Emmanuel Guilherme Junior \\(Cybersecurity Leadership \\| AI & LLM Security \\| Cloud Security \\| OWASP Top 10 for LLM Core Team Member\\)"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - July - Off-grid-Meetup (Campout)",
        "date": "2024-07-26",
        "time": "15:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/302171844",
        "timezone": "America/Denver",
        "description": "**Hey Everyone,**\nWe're excited to announce our second annual **Off-Grid Campout** this July!\nJoin us for the weekend and enjoy the Aldo site in Provo Canyon. We've reserved a campground for **July 26th-27th**.\n\n**Please RSVP**, as our group site has room for 10 cars.\n**Details:**\n\n* **Location:** [Aldo site, Provo Canyon](https://www.recreation.gov/camping/campsites/15948)\n* **Check-in:** As early as 3 PM, (but come whenever makes sense) on July 26th\n* **Checkout:** By 12 PM on July 27th\n\nBring your own dinner and breakfast, and enjoy some downtime, and connect with fellow AppSec engineers at the base of the beautiful Cascade mountain.\nLooking forward to seeing you there!"
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "OWASP San Antonio Chapter Monthly Meeting-July 19th 2024",
        "date": "2024-07-19",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/301446259",
        "timezone": "America/Chicago",
        "description": "Topics- See abstracts below\n\n* Securing API's in the Cloud\n* The top API threats seen in the first quarter of 2024\n* Salesforce Security Pen Testing\n\n**Lunch Provided**\n\nsmall fee for parking est $5-$7.50 Bauerle Road Garage at UTSA Campus\n\nUniversity Room 2.06.04 - Business Building, John Peace Library, 1 UTSA Circle, San Antonio, TX 78249\n\nZOOM link provided for remote attendees\n\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\nPlease reply **“ONSITE”** if you plan on attending in person so we can finalize headcount for food and room attendance \n\n**Presentations will include:**\n***I. Presentation on API Lifecycle-Optiv***\nAPI lifecycle graphic review-provided baseline understanding of API journey-Optiv\n***II. Securing APIs in the Cloud: Insights and Best Practices- Palo Alto***\nThis presentation explores the current state of API security in the cloud, covering industry trends and common challenges organizations face. It delves into effective strategies for API discovery, risk profiling, and real-time protection, providing practical insights and best practices to enhance API security. The discussion will highlight key concerns such as inadequate authentication, lack of visibility, and poor endpoint management, aiming to equip attendees with the knowledge to better secure their API ecosystems.\n***III. API ThreatStats™ Report Q1 2024 Spotlight: Why API Security Is The First Thing For Enterprise AI- Wallarm***\nThe Wallarm Research Team has analyzed billions of data points to identify the top API vulnerabilities and exploits for the 1st quarter of 2024, shining a spotlight on the rising threat of API attacks targeting AI applications. The report explores the top significant threats, identifies key trends, and provides actionable insights that can help you strengthen your API Security program, with an emphasis on identifying and protecting your AI applications from API security issues.\n***IV. Salesforce Pen-testing-Rodney***\nTopic 2-PaaS Cloud Goat is a simulated vulnerable Salesforce\nApplication providing hands-on experience with penetration testing of custom Salesforce applications. The tool is similar to other test tools like AWS CloudGoat, CloudFoxable, AzureGoat, GCPGoat, and Pen-Testing Cloud REST APIs in OpenStack. It is not, however, a tool for attacking [Salesforce.com](http://salesforce.com/) itself. It is novel because it focuses on custom applications deployed using the Salesforce platform and is the first tool to provide lab exercises with a collection of security tests. The main takeaways:\n1\\. Hands\\-on learning opportunity of security tests for a custom Salesforce application\n2\\. Detailed training documentation material about the underlying flaws to look for\n3\\. Single consolidated list of common Salesforce application vulnerabilities"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-08-14",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539097",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Improving the SOC with SOC-CMM",
        "date": "2024-07-17",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/301854096",
        "timezone": "America/Toronto",
        "description": "\\*\\* The talk is hosted on the 3rd floor of 171 John Street \\*\\*\n\n**TALK**\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\n\n**SOC Capability Maturity Model (SOC-CMM)**\n\n**Summary:**\n\nIn today's ever-evolving threat landscape, a robust Security Operations Center (SOC) is no longer a luxury, but a necessity. However, building a SOC from the ground up can be a daunting task. This presentation introduces attendees to the SOC Capability Maturity Model (SOC-CMM), a powerful framework designed to guide organizations in establishing and maturing their SOC capabilities.\n\nThrough practical examples and real-world scenarios, attendees will learn how to leverage the SOC-CMM to:\n\n* Define clear business objectives for their SOC.\n* Develop a comprehensive staffing strategy with the right skill sets.\n* Establish efficient and repeatable security processes.\n* Select and implement the most suitable security technologies.\n* Integrate seamlessly with existing IT infrastructure and security services.\n\n**Presenters**\n\nIvan Salles ([https://www.linkedin.com/in/ivansalles/](https://www.linkedin.com/in/ivansalles/))\n\nA SecOps professional with extensive global consulting experience, specializing in strategic guidance for topics including SOC, MDR, EDR, XDR, SIEM, and Vulnerability Management. Ivan collaborates as an Advisory Board member at Mente Binaria and a staff at SOC Brazil; he currently serves as the Director of Strategic Initiatives - SOC at Trend Micro Canada. Additionally, he shares his expertise as a Professor for Networking & Security at Fanshawe College. Based in London, Ontario, he enjoys spending time with his family."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver Monthly Meetup",
        "date": "2024-08-15",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516374",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Webauthn - WTF or FTW?",
        "date": "2024-07-18",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516371",
        "timezone": "America/Vancouver",
        "description": "**Webauthn - WTF or FTW?** with Don Burks\n\nWhile it has been around for a few years, the Web Authentication Standard (or Webauthn) is just starting to become mainstream. This talk will explore some of the real-world applications of this technology, in particular discussing adoption strategies, observability practices, and evaluating Webauthn against other strategies such as OAuth and 2FA.\n\n**Don Burks** is a technical leader who has been working in the industry for over 25 years. Former Head Instructor of Lighthouse Labs and with experience both in startups and FAANG companies, Don's background in software development and technical leadership has provided a wealth of experience which he shares in books, talks, and the great teams with which he gets to work. Currently, Don is the Director of Engineering for Bulletproof Studio Tools, based in Vancouver, BC."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt Chapter #66 - Cloud Security & Vulnerability Disclosure",
        "date": "2024-07-31",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/300654912",
        "timezone": "Europe/Berlin",
        "description": "Hello everyone, we're excited to invite you to our OWASP Chapter meeting #66! Our Chapter serves central Germany, particularly within the Rhine-Main (Hesse) region, as a platform to discuss and share information and application security topics. Anyone who is interested and enthusiastic about application security or security in general is welcome. All meetings are free and open. You do not have to be an OWASP member.\n\nThere will also be plenty of time to socialize before and after the event.\n\n_What are we going to talk about?\n\n**1\\. Talk:** **Security at Scale - Mastering Cloud Security in the Cyberwar Era**\n\n*Dominik Sowinski, Cybersecurity Architect & Cybersecurity Community Lead, Siemens*\n\nIn the midst of rapid cloud transformation, industrial organisations face an ever-evolving cyber threat landscape, exacerbated by global events such as the war in Ukraine. This presentation will address the latest APT activities and the significant risks they pose to cloud infrastructures and critical industrial operations. We will explore cutting-edge strategies, technical considerations and essential processes to rapidly adapt and secure cloud environments at scale against these relentless threats. The presentation will help you understand how to fortify cloud applications and infrastructure in this dynamic threat landscape.\n\n**2\\. Talk: Let's talk vulnerabilities**\n\n*Vinit K., Independent security research and threat hunting*\n\nA talk and live demo on cybersecurity threats involving terminal emulators and SSH. We will explore how URL handling in iTerm2 and Hyper can be abused for code execution, as well as delve into the recent CVE-2023-51385 vulnerability, which allows unexpected code execution via SSH ProxyCommand. The session will include interactive segments where the audience can contribute exploit ideas and deepen their understanding of these critical security issues.\n\n_Afterwards?\nWe will pre- and conclude the evening with the possibility of **socializing** at the venue with **free food and cold & hot drinks**. For everyone who's interested, we will continue socializing at the Bockenheimer Weinkontor afterward.\n\n_When?\nOur Meetup takes place on 31.07.2024 from 18.00 to 21.30 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nSubmit your talk here: https://www.papercall.io/owasp-chapter-frankfurt\n\n_And now?\nSave the date, **spread the word,** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us here and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information, including slides and recordings of previous presentations\n\nWe're looking forward to seeing you at our event!"
    }
]