[
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days, Cloud Security: The Purple Team Ninja Learning Lab",
        "date": "2023-05-03",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/292970141",
        "timezone": "America/Los_Angeles",
        "description": "After a long time we are happy to announce a hacker day with hands on workshop by Abhay Bhargav. This meetup is sponsored by DeepFactor.\nWe are presenting this event in partnership with Pacific hackers group.\n\nSchedule:\n5PM :- Doors open, food, drinks and networking\n5.45PM :- Introduction and Short talk by Kiran Kamity from Deepfactor\n6PM :- Workshop on The Purple Team Cloud Security Ninja Learning Lab\n8 PM :- Doors closed.\n\nTalk by Kiran Kamity(TBD)\n\n## Session Abstract\n\nThe Purple Team Cloud Security Ninja Learning Lab is meant to be a completely hands-on exploration of cloud security attacks and defense against major cloud providers, AWS, Azure and GCP. In this Learning Lab, participants will be given vulnerable cloud environments on cyber-ranges. The participants have to identify and fix the vulnerabilities in the cloud environments.\n\n## Facilitator(s)\n\n* Abhay Bhargav, Founder and Chief Research Officer, AppSecEngineer\n\n## Technical Requirements\n\n* Participants will need to bring their own laptops that can connect to the conference WiFi network. They will need to access our lab environment on the cloud to access the labs for the learning lab\n* Participants should preferably not have a highly restrictive network policy, especially to access cloud resources\n\n## Outline\n\n* 0-20 minutes: Overview of Learning Lab, Shared Responsibility on Cloud, History of Cloud Attacks and Exploits\n* 21-60 mins - AWS Attack and Defense Scenarios\n* AWS EC2 and Attack and Defense Story and Scenario\n* AWS Lambda Attack and Defense Story and Scenario\n* 60-90 mins - Azure Attack and Defense Scenarios:\n* Azure Compute and Storage Attack and Defense Story\n* Azure Functions and Logic Apps Attack and Defense Story and Scenario\n* 90-110 mins - Google Cloud Attack and Defense Scenarios:\n* Google Storage IAM Attack and Defense Story and Scenario\n* 110-120 mins - Conclusions + Review of Scenarios"
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Birmingham Chapter Meetup May 2023",
        "date": "2023-05-04",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/292724936",
        "timezone": "Europe/London",
        "description": "Welcome from OWASP Birmingham to our first Meetup of 2023 and we're in person @Hays at One Colmore Square Thursday 4th May for two great Infosec talks.\n\nOur guest speakers are:\n\n* Dave Archer from Contrast Security, and\n* Stefania Chaplin (DevStefOps) from Gitlab.\n\n5.45pm - Doors open\n6.15pm - Welcome and Food\n6.30pm - TALK #1 \"Debunking myths about IAST & RASP\" with Dave Archer\n\n\"David has been working on security instrumentation for nearly a decade now, and during this time here he's had countless conversations with people about how and where IAST and RASP can be used to help accelerate DevSecOps. What continues to surprise him is the misconceptions that surface again and again about which teams should use these technologies and where they can benefit from them. David will debunk some of those myths and give us all a clearer picture on their usefulness and how and where we should be using them.\"\n\n7.00pm - Break\n7.15pm - TALK #2 \"DevSecOps with GitLab: How to embed Security within the Software Delivery Process\" with Stefania Chaplin\n\n\"Implementing DevOps can drastically improve the rate we deliver software. Organisations can go from deploying changes a few times a year to multiple times a day. What about vulnerabilities? Security is often considered an afterthought and this can have dire consequences as the world becomes increasingly reliant on software. How do we embed security into the software delivery process? Security is a quality check, there are multiple types and we need to make the software delivery experience as smooth as possible.In this session, you'll find out more about common pain points, solutions, and how to embed security within the software delivery process and secure your DevOps process.\"\n\n7.45pm - Questions/Any Other Business\n8.00pm - Close\n\n***\n\nNathan + Jim"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "Introducing the OWASP Top 10 for Kubernetes",
        "date": "2023-05-10",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/292729353",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person or online (link to be provided).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nFor our May meeting, Andrew Josephides, Director of Security Research at KSOC, will give a talk introducing the [OWASP Kubernetes Top 10](https://owasp.org/www-project-kubernetes-top-ten/).\n\nGiven the growth and adoption of Kubernetes, a number of projects have been published in the OWASP community to help practitioners assess and secure the security of their containerized infrastructure including the recently released Top Ten for Kubernetes ([https://owasp.org/www-project-kubernetes-top-ten/](https://owasp.org/www-project-kubernetes-top-ten/)). This OSS project is a community-curated list of the most common Kubernetes risks backed by data collected from organizations varying in maturity and complexity. This session will discuss the project in detail, examples for each of the risks in the list, and how to get involved."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "Injection Vulnerabilities, with OWASP Suffolk",
        "date": "2023-05-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044436",
        "timezone": "Europe/London",
        "description": "A joint event, by OWASP Bristol and OWASP Suffolk.\n\nInjection vulnerabilities remain a common problem today. A single mistake could expose your whole database and customer data, or give an attacker the ability to remotely execute code on your server.\n\nWe will look at some examples of coding mistakes that can lead to injection vulnerabilities, demonstrate how they can be found with vulnerability scanning tools, and discuss how they can be completely prevented from happening (more than simply hoping developers will use prepared queries or database abstractions correctly).\n\nAgenda:\n\n* OWASP updates\n* Injection Vulnerabilities talk"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - May 2023",
        "date": "2023-05-09",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044026",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS April 2023",
        "date": "2023-04-27",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/292861021",
        "timezone": "America/Denver",
        "description": "Speaker: Panel Discussion composed of cybersecurity hopefuls, current professionals, and cyber veterans.\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Join us LIVE and IN-PERSON for Denver OWASP's May Meetup",
        "date": "2023-05-10",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/293004797",
        "timezone": "America/Denver",
        "description": "**As always, everyone is welcome! You do NOT have to be an OWASP member to attend.**\n\nFor our May meetup, the date is set and the topic is TBD. We'll have a presenter, food, drinks, and networking. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to the sponsor [SpyderSec](https://spydersec.com)**\n\n**Presentation Title:** TBD\n\n**Presentation Details:** TBD"
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #60 - Security Revolution: Women Leading the Way in AppSec",
        "date": "2023-04-26",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291521942",
        "timezone": "Europe/Berlin",
        "description": "Hi all, for our last OWASP Frankfurt Chapter event before the upcoming [German OWASP Day 2023](https://god.owasp.de/2023/) edition, join us for our **Women in AppSec Special**, where we'll be tackling two of the most pressing topics in the industry today: enhancing security culture through security champions, and offensive security beyond the checkbox. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **CHECK24 Frankfurt.**\n\n_What are we going to talk about?\n\n* _Talk 1 - \"**AI-Enhanced Application Security: A Modern Approach**\" by **Diana Waithanji**, Cybersecurity engineer at SAP.\nThis talk will discuss how AI is being used to solve application security issues. We will explore the potential benefits of using AI in this area, such as increased efficiency and effectiveness in identifying vulnerabilities and threats. Additionally, we will discuss some of the challenges and limitations that come with using AI in application security and how they can be addressed.\n* _Talk 2 - \"**Beyond the Checkbox: Breaking out of Testing Frameworks**\" by **Jiska Classen**, As mobile applications handle sensitive data, ensuring their security is crucial. However, simply securing individual apps is not enough to stop real-world attackers who exploit devices through other avenues. This talk will explore unconventional security testing approaches that can help improve app security by addressing vulnerabilities in the operating system, hardware, and third-party libraries. Discover how attackers can exploit wireless interfaces, sandboxing, privilege checking bypasses, and more. Let's explore why these attack vectors are relevant in practice and how to address them beyond standard security testing checklists.\n\n_Afterwards? We will pre- and conclude the evening with the possibility to **socialize** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24 Frankfurt**.\n\n_When\nOur Meetup takes place on the last Wednesday of the month in April, namely on 26.04.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "AppSec IL 2023",
        "date": "2023-05-16",
        "time": "8:30+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/293101142",
        "timezone": "Asia/Jerusalem",
        "description": "OWASP AppSec Israel 2023 will take place IN-PERSON on May 16th and 17th, 2023!\n\nIt is the largest conference in Israel for application security.\n\nThe [Agenda](https://appsecil.org/Agenda) is out!\n\nMake sure to **Register** [here](https://appsecil.org/Register)\n\nWe still have [sponsor](https://appsecil.org/assets/AppSecIL2023Sponsorships.pdf) spots available as well"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-05-08",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/291605620",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kolkata",
        "repo": "www-chapter-kolkata",
        "name": "OWASP KOLKATA MEETUP #5",
        "date": "2023-04-29",
        "time": "6:30+05:30",
        "link": "https://www.meetup.com/owasp-kolkata/events/293017268",
        "timezone": "Asia/Kolkata",
        "description": "**In this meetup, You will learn how to do ios penetration testing .**\n**Join Us to learn from MR. Vishal Mohan on OWASP KOLKATA MEETUP #5.**"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAY 24, 2023",
        "date": "2023-05-24",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/292313422",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Tactical Security - Improving AppSec Coverage with Fewer Resources\nJoin us for great networking, dinner and drinks, and see a presentation by Rich Newman, Technical Account Manager, Synopsys\n\n**ABSTRACT**: This discussion focuses on the differences in issues detected between SAST, SCA and DAST with detailed examples. There is also an aggregation/correlation section at the end to cover the need to view an application’s AppSec status as a whole and not via individual tools.\n\n* SAST - Examples from Coverity/Sigma\n* SCA - Examples from Black Duck\n* DAST (IAST/Fuzz) - Examples from Seeker & Defensics\n* ASOC - Examples from Code Dx\n\n**Thanks to our Sponsor**: [Synopsys](www.synopsys.com/software)\n*Minimize business risk across the entire SDLC*\n*Every business is a software business. Whether you’re selling it directly to your customers or relying on it to run your operations. **Synopsys** helps you protect your bottom line by building trust in your software—at the speed your business demands.*\n\n### **SPONSORSHIP Opportunities Available**\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - APR 26, 2023",
        "date": "2023-04-26",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/291490081",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: How to Identify Threat Modeling Limitations\nJoin us for great networking, dinner and drinks, and see a presentation by James Rabe, Senior Solutions Architect & Threat Modeling SME at IriusRisk.\n\n**ABSTRACT**: Many cyber and application security tools love to say they can do everything needed to protect your assets. It isn’t rocket science to know that’s not true. It’s helpful to consider the limitations of tools and processes. This presentation will take attendees through how to define the limitations of threat modeling correctly, understand best practices in how, when, and by whom a proper threat model should be performed, and how this process of identifying threat model limitations can help users better understand its utility to systems and processes.\n\n**Thanks to our Sponsor**: [IriusRisk](https://www.iriusrisk.com/)\n*When it comes to application development, security is paramount. With **IriusRisk**’s automated, scalable and easy-to-use threat modeling platform, your engineers can iron out architectural security flaws before writing code, helping you avoid costly re-design and get to market faster with secure products your customers can rely on.*\n\n### **SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "May 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-05-25",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/292932837",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Exact\n**Address:** Molengraaffsingel 33, 2629 JD Delft\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **AppSec in IT contracts** by **Sebastian Avarvarei**\n20:00 - 20:15- **Break with drinks**\n20:15 - 21:00 - **About containers and their escapes: understanding escape patterns and possibilities** by **Mauricio Cano**\n\n**AppSec in IT contracts**\n*Abstract:*\nBack in 2018 I wrote: “In today’s multi-sourced enterprise, your security is as good as your worst written contract.” We have gotten better at writing security into commercial contracts since I first did my talk on this topic, but the yellow brick road ahead of us still goes some ways.\n\nBut how about AppSec, how well is it covered in our IT contracts? What are the pitfalls and the solutions? How do we avoid that someone else’s security issues become our security problems? And, by all means, let’s learn how to be a bit lazy, and do better with less effort!\n*Bio:*\nCurrently working as Information Security Manager at Canon EMEA, Sebastian has been in IT and Security for over 20 years, covering a multitude of roles ranging from Developer, Security Architect, Auditor and Consultant, before moving into security governance and management, giving him a unique multi-faceted view on today’s InfoSec challenges. He has led multiple security improvement programs and performed maturity assessments for a wide variety of organizations - while continuously asking himself:\"Could we do this in another way?\"\n\n**About containers and their escapes: understanding escape patterns and possibilities**\n*Abstract:*\nContainers have become one of the most common underlying infrastructure for microservice architectures. As such, they can often be part of the external attack surface of enterprise systems and applications (e.g., whenever a web application hosted on a kubernetes cluster is Internet-facing). Thus, it is important to understand what types of (mis)configurations can make containers more vulnerable against attacks of different types. In this talk, Mauricio will deep dive into different techniques that can be used to escape containers. In particular, he will talk about how to escape privileged containers, the usage of different capabilities, the usage of kernel exploits and a few other ways in which attackers may use to gain access to the hosts of the containers.\n*Bio:*\nMauricio Cano is a cloud pentester focused on container technologies. In particular, he focuses on the security of containers and serverless architectures. He has pentested Kubernetes clusters and serverless architectures for several multinational financial institutions. Prior to his security work, he has a background in academia and a Ph.D. in Computer Science from the University of Groningen, focused on programming language design and formal methods to ensure correctness. In his spare time, Cano enjoys reading, cooking, and solving puzzles."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP NZ - Auckland Meetup - May 2023",
        "date": "2023-05-09",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291720878",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for May will be **A07:2021 - Identification and Authentication Failures.**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle May 2023",
        "date": "2023-05-15",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/293043420",
        "timezone": "Europe/London",
        "description": "We're back! We’ll be doing our usual two talks and pizza format.\n\nPlease note; there is a new location for this event.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n1815 - 1820 OWASP Newcastle Welcome\n1820 - 1920 Talk one\n1920 - 2000 Pizza and networking\n2000 - 2045 Talk two\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk 1\n**Title:** Threat Modelling\n**Speaker:** Robin Fewster\n**Talk Synopsis:**\ntbc\n\nTalk 2\n**Title:** An Intro to DevSecOps, Devs like carrots not sticks\n**Speaker:** Simon Gurney\n**Talk Synopsis:**\ntbc\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\nYou can also join our Google Group which is how we'll be sending out emails to events and is also going to be used as a forum for discussion.\n\nhttps://groups.google.com/a/owasp.org/forum/#!forum/newcastle-chapter"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "How to Identify Threat Modeling Limitations & AI CTF Workshop",
        "date": "2023-04-27",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/292674721",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Speaker 1: James Rabe, Senior Solutions Architect & Threat Modeling SME at IriusRisk**\nJames Rabe is a Senior Solutions Architect & Threat Modeling SME at IriusRisk and is responsible for designing and implementing threat modeling solutions for customers. He brings nearly 10 years’ experience in technology, security and compliance consulting and is a cybersecurity evangelist. Prior to joining IriusRisk James worked as a Security & Compliance Engineer at a consulting firm. He is a proud husband and father to two kids. James currently is an active board member in a community non-profit that focuses on revitalization and economic development of historic districts across the country.\n**Title: How to Identify Threat Modeling Limitations**\n**Abstract:**\nMany cyber and application security tools love to say they can do everything needed to protect your assets. It isn’t rocket science to know that’s not true. It’s helpful to consider the limitations of tools and processes. This presentation will take attendees through how to define the limitations of threat modeling correctly, understand best practices in how, when, and by whom a proper threat model should be performed, and how this process of identifying threat model limitations can help users better understand its utility to systems and processes.\n\n**Speaker 2: Jonathan Marcil, NorthSec Challenge Designer**\nJonathan is a board member of the OWASP Orange County chapter. Originally from Montreal, he is part of NorthSec CTF as a challenge designer. He is passionate about Application Security and enjoys architecture analysis, code review, threat modeling and debunking security tools. Jonathan holds a bachelor's degree in Software Engineering from ETS Montreal and has more than 19 years of experience in Information Technology and Security.\n**Title: AI (Stable Diffusion) CTF Workshop**\n**Abstract:**\nSurprise! We're going to dive into the marvelous world of \"artificial intelligence\" and \"prompt engineering\".\nThis session will cover two CTF challenges based on Stable Diffusion which is a model capable of generating photo-realistic images given any text input. This will allow us to show in a practical fashion some potential real impact of something otherwise artificial.\nParticipants can bring their laptop to try the challenges by themselves. If you have a gaming laptop with a dedicated graphic card, that could be handy! For the others, rest assured as we will be solving them step by step alongside diving into diffusion models and machine learning technical details.\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-04-27",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/292659929",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "May Meetup",
        "date": "2023-05-17",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/293001314",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of each month. We will announce topics 2-3 weeks in advanced of our meetups.\n\n7PM-9PM\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Community Topics\n* Modern Phishing Techniques with Evilginx2"
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec / OWASP-SLC - April (virtual meetup) - Guest Speaker: Mike McCabe",
        "date": "2023-04-27",
        "time": "2:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/293000021",
        "timezone": "America/Denver",
        "description": "**Agenda:**\n\n1. Discuss upcoming events (e.g. Campout in July, SaintCon this Fall)\n2. Quick intros\n3. Guest Speaker: **Mike McCabe** \\- Title: *Infrastructure as Remote Code Execution: How to abuse Terraform to elevate access*\n4. Q&A\n\n**Talk Abstract:**\n\n```\n\nThis talk will focus on ways to abuse the use of Terraform to elevate privileges, expose data, and gain further footholds in environments from a developer's perspective. We'll cover the common uses of Terraform and how a malicious actor could abuse Terraform and even bypass security controls to execute unapproved code. This talk will include multiple demos of ways to exploit Terraform cloud.\n```"
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "OWASP San Antonio In-Person Meeting - 04/28/2023",
        "date": "2023-04-28",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/292870330",
        "timezone": "America/Chicago",
        "description": "Title: The Ever-Unachievable Practical Security\nSpeaker: Red Thomas, CEO at Red Knight\nAbstract:\n**In this talk, I will walk through an analysis of general risks and threats to businesses, some of the current issues folks find implementing security programs, and then walk through a more practical, sustainable, and more implementable version of the process. I’m drawing on the many failures I’ve seen over the years and pointing out the simple reasons for why they didn’t work.**\n\nWe will meet in person at CoalFire San Antonio office (Previous Denim Group Office: 1354 N Loop 1604 E Ste 110, San Antonio, TX 78232)\nSee you all there. Thanks."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-05-10",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/293028166",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Hands-on walkthrough of API Security & Automated Testing for Complex API",
        "date": "2023-05-10",
        "time": "9:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/292823383",
        "timezone": "Asia/Singapore",
        "description": "Ashwath (co-author of ATOR Burp Plugin) and Avneesh (employee of Akto) will be doing a hands-on walkthrough of API security and talk about automating testing for complex API scenarios. They will cover the following topics:\n\n1\\. What is API Security\n2\\. Why is it important?\n3\\. Why do BB hunters find more bugs than appsec/internal folks?\n4\\. Common problems with API Security\n5\\. Automated tools that are in the market:\na. Burp native scanning\nb. Burp plugins - ATOR\nc. Akto open source\n6\\. Running ATOR against some basic scenarios \\- Demo & Hands on\n7\\. Running Akto against a test setup \\- Demo & Hands on\n8\\. Q&A\n9\\. Wrap\\-up\n\nATOR - [ATOR Github](https://github.com/PortSwigger/ator)\nAkto - [Akto Homepage](https://www.akto.io/)\n\n**Target Audience:** Appsec engineers, Developers who work on APIs, Bug Bounty Hunters\n\n**What will they gain at end of session**:\n1\\. Why is API security important?\n2\\. How do misconfigurations happen?\n3\\. How to build an inventory of APIs?\n4\\. How to automate testing for complex scenarios \\(chained login\\, multi\\-step API request etc\\.\\)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "Injection Vulnerabilities",
        "date": "2023-05-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291863605",
        "timezone": "Europe/London",
        "description": "Injection vulnerabilities remain a common problem today. A single mistake could expose your whole database and customer data or give an attacker the ability to remotely execute code on your server.\n\nWe will look at some examples of coding mistakes that can lead to injection vulnerabilities and discuss how they could be mitigated.\n\nThis is a joint event provided by OWASP Bristol and OWASP Suffolk.\n\nAgenda:\n\n* OWASP updates\n* Injection Vulnerabilities talk\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - May 2023",
        "date": "2023-05-09",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291864867",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney Unmeetup #1",
        "date": "2023-05-09",
        "time": "7:30+10:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/292887824",
        "timezone": "Australia/Sydney",
        "description": "We are thrilled to announce our first community-driven Meetup event, where we aim to build a platform for you to showcase your skills, network with like-minded individuals, and learn from others' real-life experiences.\n\nAt this event, we're doing something different by allowing the community to select the topics of most interest to them. Whether you're an experienced speaker or a first-time presenter, we encourage you to bring an idea for a talk you can give. No slides required, and the minimum time is 5 minutes.\n\nWe're hoping to create a safe space for people of all levels of experience, so if you're a little nervous about speaking, this is the perfect opportunity to overcome that fear. The event is designed to be inclusive and supportive, so even if you don't get to give your talk this time, you can always bring it to the next Meetup!\n\nHere are the details of the event:\n\n**Date:** May 9 2023\n**Time:** Arrive from 5.30 pm\n**Venue:** Talenza, Level 3, 7 Macquarie Place, Sydney\n\n**Schedule:**\n\n* 5.30 pm: Arrive, grab a drink, and meet your fellow attendees\n* 6.00 pm: Food is served\n* 6.00 pm: Submit your talk suggestions (5 to 30 mins each) for the night and begin voting\n* 6.30 pm: Voting closes, and the top selected talks begin\n* 7.30 pm: Talks finish, and networking begins\n* 8.00 pm: Event ends\n\n**Here are some of the talks that have already been submitted:**\n\n* Automating software composition analysis to identity vulnerabilities (est. 5 mins)\n* How we used readily available AppSec tools to get our startup acquired (est. 5-10 mins)\n* The emerging verticals in cyber threat intelligence (est. 5-10 mins)\n* Being ghosted during a security role interview process - and what to do next! (est. 5 mins)\n\nWe're expecting this event to be a little haphazard as it's our first time trying something like this. But we're looking forward to receiving your feedback to make the next event even better.\n\nDon't miss out on this unique opportunity to share your knowledge and connect with your peers. RSVP now, and we'll see you there!\n\nBest regards,\nOWASP Sydney Chapter Committee"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "AppSec Roundtable, hosted by Chris Romeo",
        "date": "2023-04-27",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/291207489",
        "timezone": "America/New_York",
        "description": "Following up on the success of our first AppSec round table in January, we'll continue the format for our April meeting. The host will present questions to get the conversation going, and the group will share insights and wisdom!"
    },
    {
        "group": "Tunisia",
        "repo": "www-chapter-tunisia",
        "name": "Small Coding Mistakes, Big Security Risks",
        "date": "2023-04-28",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-tunis-meetup-group/events/293085149",
        "timezone": "Africa/Tunis",
        "description": "**OWASP Tunisia Chapter** and **SecuriNets** Foundation are glad to invite you to an online Workshop **\"Small Coding Mistakes, Big Security Risks\"**\n\nThe \"Small Coding Mistakes, Big Security Risks\" workshop is a short technical training session aimed at highlighting the importance of code-level security practices. The workshop aims to demonstrate how small coding mistakes can lead to high-impact vulnerabilities in web applications, and how to identify and remediate these issues. The coding issues with be shown, exploited via a live demo, and presented in multiple web-oriented scripting/programming languages: php, python, and java.\n\nOur dear Guest Speaker\n\n**Mohamed Adib Boukthir** is a Securinets alumnus and a previous technical manager/vice president at Securinets ISI. He currently occupies the position of a Cyber Security Tester/Penetration Tester at EY."
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "SQLi en la práctica: De la explotación a la prevención",
        "date": "2023-05-02",
        "time": "8:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/292840705",
        "timezone": "America/Montevideo",
        "description": "Este evento se enfocará en un tema clásico y que últimamente se ha visto menos vulnerado, aunque sigue presente y explotable en nuevos desarrollos: **inyecciones en SQL (SQLi)**. Se abordará desde más de una perspectiva, como individuo que **ataca**, que **prueba** la aplicación o que la **desarrolla**.\n\nSe presentarán los diferentes tipos de inyección: clásicas con retorno de datos visibles, por inferencia (ciegas basadas en errores o demoras) y con visibilidad fuera de banda. El propósito es también comentar cómo **combatir** problemas desde el punto de vista del **desarrollo y configuración,** mencionando algunas herramientas y tecnologías comunes para lograr tanto la detección y explotación como la corrección.\n\n**La participación práctica es opcional**. Se contará con una guía pública unos días previos al evento para quien le interese seguir los ejercicios expuestos con un ambiente en su propia máquina o tener una idea del tema antes de concurrir.\n\nSe lleva a cabo en el **edificio central** de la Universidad Católica del Uruguay, en la **sala Plaza de Encuentro**. La entrada es libre y gratuita. Por dudas, usar la sección de comentarios."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "CMD+CTRL Cyber Range",
        "date": "2023-05-18",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248501",
        "timezone": "America/Vancouver",
        "description": "Want to tap into your inner evildoer and test your skills in hunting down web application vulnerabilities?\nIf so, immerse yourself in the industry’s most authentic environment where players exploit their way through hundreds of vulnerabilities that lurk in business applications today. Success means learning quickly that attack and defense is all about thinking on your feet. For each vulnerability you uncover, you are awarded points. Climb the interactive leaderboard as you vie for the top spot!\n\nThe **CMD+CTRL Cyber Range** is ideal for anyone interested in learning how web applications are attacked, furthering their cybersecurity acumen, or honing the skills needed to protect the enterprise. From curious bystanders to active practitioners to Risk and Security Executives, there’s something for everyone.\n\nTeaser: [https://securityinnovation.hubs.vidyard.com/watch/9NbmLo8rHBqcKJbVP4oLek](https://securityinnovation.hubs.vidyard.com/watch/9NbmLo8rHBqcKJbVP4oLek)\n\nThis event is sponsored by **Security Innovation** \\- thank you for facilitating the workshop and enabling access to their Cyber Range\\.\nThis event is sponsored by **Microsoft** \\- thank you for providing us space\\."
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "Secure Your Apps: A Cybersecurity Event by OWASP Victoria",
        "date": "2023-05-11",
        "time": "8:30-07:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/292413504",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria Chapter is pleased to present an In-Person Application Security Event on May 11, 2023. Join us at Fort Tectoria from 6:30 PM to 9:00 PM for an informative and engaging event focused on the latest trends and best practices in cybersecurity. We are excited to announce that Tanya Janca and Roberto Salgado will deliver two live presentations!\n\nTanya will present \"Pushing Left to Secure Software,\" and Roberto will present \"A Summary of Cybersecurity in 2022\". Whether you're a seasoned security professional or just getting started in the field, you'll leave with valuable insights, actionable takeaways to improve your organisation's security posture, and a chance to win swag/prizes!\n\nIn addition to the presentations, hors d'oeuvres, and prize giveaways, there will be ample opportunities for networking and collaboration with like-minded professionals. You'll have the chance to connect with peers, learn from industry leaders, and exchange ideas about the latest tools and techniques for staying ahead of the ever-evolving cybersecurity landscape.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in cybersecurity. If you would like to attend, please click the RSVP button to reserve your spot, as we have limited seats available.\n\nWe would also like to give a special thanks to Websec and SheHacksPurple for sponsoring this event.\n\n‎\n**Who This Event is For**\n\n* IT and Cybersecurity Professionals\n* Developers and Engineers\n* Executives and Managers\n* Researchers, Academics, and Students\n* IT Vendors and Service Providers\n* Hobbyists\n\n‎\n\n**Speaker Biographies**\n**Tanya Janca**\nTanya Janca, also known as SheHacksPurple, is the best-selling author of 'Alice and Bob Learn Application Security'. She is also the founder of We Hack Purple, an online learning academy, community, and podcast that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years and has been everywhere from startups to public service to tech giants (Microsoft, Adobe, & Nokia). She has worn many hats; startup founder, pentester, CISO, AppSec Engineer, and software developer. She is an award-winning public speaker, active blogger, and streamer and has delivered countless talks and training sessions across six continents. She values diversity, inclusion, and kindness, which shines through in her countless initiatives.\n\n**Roberto Salgado**\nRoberto Salgado, a co-founder of Websec, became fascinated with technology at a very young age and eventually found his niche in Cybersecurity. Through his passion and dedication to this field, he researched and devised new methods of attack and defence; this led Roberto to present his research at several security conferences and contribute to various open-source projects. Roberto also created and maintains the SQL Injection Knowledge Base, one of the most comprehensive references available. During his time at Websec, he has served many roles, from security tester to business developer, which has allowed him to gain a broad perspective and understanding of the field of information security."
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #60 - Security Revolution: Women Leading the Way in AppSec",
        "date": "2023-04-26",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291521942",
        "timezone": "Europe/Berlin",
        "description": "Hi all, for our last OWASP Frankfurt Chapter event before the upcoming [German OWASP Day 2023](https://god.owasp.de/2023/) edition, join us for our **Women in AppSec Special**, where we'll be tackling two of the most pressing topics in the industry today: enhancing security culture through security champions, and offensive security beyond the checkbox. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **CHECK24 Frankfurt.**\n\n_What are we going to talk about?\n\n* _Talk 1 - \"**AI-Enhanced Application Security: A Modern Approach**\" by **Diana Waithanji**, Cybersecurity engineer at SAP.\nThis talk will discuss how AI is being used to solve application security issues. We will explore the potential benefits of using AI in this area, such as increased efficiency and effectiveness in identifying vulnerabilities and threats. Additionally, we will discuss some of the challenges and limitations that come with using AI in application security and how they can be addressed.\n* _Talk 2 - \"**Beyond the Checkbox: Breaking out of Testing Frameworks**\" by **Jiska Classen**, As mobile applications handle sensitive data, ensuring their security is crucial. However, simply securing individual apps is not enough to stop real-world attackers who exploit devices through other avenues. This talk will explore unconventional security testing approaches that can help improve app security by addressing vulnerabilities in the operating system, hardware, and third-party libraries. Discover how attackers can exploit wireless interfaces, sandboxing, privilege checking bypasses, and more. Let's explore why these attack vectors are relevant in practice and how to address them beyond standard security testing checklists.\n\n_Afterwards? We will pre- and conclude the evening with the possibility to **socialize** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24 Frankfurt**.\n\n_When\nOur Meetup takes place on the last Wednesday of the month in April, namely on 26.04.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]