[
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Contributing to Open Source Security",
        "date": "2025-08-28",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/310515087",
        "timezone": "America/New_York",
        "description": "Need experience to get a job, but need a job to get experience?\n\nConsider contributing to open source security.\n\nWant to be a part of something impactful in your free time?\n\nConsider contributing to open source security.\n\nIf you want to gain real-world experience with modern technologies without submitting a single resume, expand your knowledge of security domains in collaboration with subject matter experts without paying tuition, and see the impact of your work in security projects used all over the world without a commute...then I'd say that's pretty reasonable, and perhaps more accessible than you think. From writing code, to improving documentation, to quality assurance, to organizing and volunteering at events - both in-person and virtual - there are many ways to get involved.\n\nIn this talk we will discuss several open source security projects, opportunities to contribute to open source security, and how to get started."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2025 (Online)",
        "date": "2025-08-26",
        "time": "11:50-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489310",
        "timezone": "America/Chicago",
        "description": "A few minutes of meet-and-greet and Chapter information, then the Presentation!\n\n### **Presentation:** \"Advanced Account Security with Identity Threat Detection & Response\"\n\nIdentity-related security challenges are more relevant than ever. As enterprises and consumers increasingly interact with a vast array of digital services, safeguarding accounts from compromise becomes a daunting task. Weak security measures not only expose businesses to financial loss and brand damage but also lead to unhappy customers. Identity Threat Detection and Response (ITDR) solutions offer a powerful way to reduce the risk of account fraud. In this insightful talk, we will explore typical account-related attacks illustrated with real-world examples. We will also discuss the critical non-functional requirements that make ITDR solutions truly effective.\n**Speaker:** **Bertold Kolics**\nBertold Kolics is a Software Testing Lead at Verosint (verosint.com), where he focuses on enhancing identity security through innovative solutions. His previous experience includes engineering identity provisioning and directory products at Sun Microsystems and UnboundID.\n\n\\-\\-\\-\\-\nIf you would prefer to attend in person, please see [Eventbrite](https://owasp-austin-2025-august.eventbrite.com)."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "August Meetup",
        "date": "2025-08-28",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/310531688",
        "timezone": "America/Los_Angeles",
        "description": "We’re excited to announce that our **August OWASP Meetup** will be Sponsored by **Miggo** **Security**\nJoin us for an evening of great conversations, community networking, and insightful security discussions — all in an awesome venue provided by **Miggo Security**. And yes, there will be **delicious food and drinks** generously provided by our sponsors!\n\n5:00 PM : Doors open, Networking, food and drinks\n5.30PM :- Chapter introductions\n5.45-6.15 PM :- Defending AI-Native Applications: A Strategic Framework for Systems That Think\n6.15-7.00 PM :- Talk: Red-Teaming Agentic Workflows: Runtime Security for the Age of Autonomous AI\n7.0-7.45 PM :- RBAC Atlas: Mapping Real-World Kubernetes Permissions and Exposing Risky Projects\n\n**Talk# 1** **Defending AI-Native Applications: A Strategic Framework for Systems That Think**\nThe rapid adoption of AI-native applications, powered by agents, assistants, and embedded LLMs, has transformed modern application behavior. These systems make decisions at runtime, invoke tools, and handle sensitive data in ways that are unpredictable and constantly evolving. For security teams, this marks a fundamental shift in accountability: defending logic that didn’t exist at deployment and changes continuously in production.\nIn this talk, co-delivered by Daniel Shechter, CEO and Co-Founder of Miggo Security, and Pritam Mungse, Director of Product Security at SoFi, will explore the emerging security challenges posed by AI-native applications and introduce a new model: Execution-Aware Defense. They’ll walk through how this approach reframes traditional code,and edge defenses to provide real-time visibility, prioritization, and enforcement against dynamic, AI-driven threats.\nDrawing conversations with 40+ security leaders over the past few months, the session will cover:\nThe unique risks AI introduces to application behavior and attack surface\nHow to apply a layered defense strategy to adapt at runtime\nPractical steps for operationalizing AI native defense in production environment\nAttendees will leave with a clear blueprint for evolving their security stack to meet the demands of software that thinks for itself, without slowing down innovation.\n\n**Talk#2 Talk: Red-Teaming Agentic Workflows: Runtime Security for the Age of Autonomous AI**\n\\*Description:\\* As organizations increasingly deploy autonomous AI agents and agentic workflows, traditional security approaches are failing to address the unique attack surface these systems create. Unlike static AI models, agentic workflows dynamically interact with external systems, make autonomous decisions, and adapt their behavior in real-time - creating unprecedented security challenges that require a new approach.\nWe'll explore the emerging threat landscape of agentic AI systems and demonstrate how red-teaming techniques specifically designed for autonomous workflows can identify vulnerabilities before they're exploited in production. You'll learn:\n• How agentic workflows create new attack vectors beyond traditional prompt injection and jailbreaking\n• Real-world attack scenarios including agent hijacking, tool manipulation, and autonomous privilege escalation\n• Runtime security strategies that evolve with your AI agents' behavior\n• Practical red-teaming methodologies for testing multi-agent systems and workflow orchestration\n• Building continuous security monitoring for autonomous AI deployments\nTraditional pentesting falls short when AI agents can rewrite their own objectives and interact with your infrastructure autonomously. Join us to discover how to secure the next generation of AI systems before adversaries do.\n\n**Speaker:** Aryaman is the Co-Founder and CEO of Repello AI - a leader in AI Runtime Security and AI red teaming products. Previously, he was the captain of top Indian CTF team InfoSecIITR, and undergrad from IIT Roorkee. Repello AI helps Fortune 500 companies and AI unicorns secure their GenAI applications through continuous red-teaming and adaptive security guardrails.\n\n**Talk #3: RBAC Atlas: Mapping Real-World Kubernetes Permissions and Exposing Risky Projects**\nRole-Based Access Control (RBAC) is the final layer of defense between a compromised Kubernetes workload and a full-scale cluster breach. Yet real-world RBAC configurations, especially those shipped by popular open-source operators and Helm charts, are rarely reviewed with an adversarial mindset.\nIn this talk I introduce RBAC ATLAS, a curated index of identities and RBAC policies found in popular Kubernetes projects. We will discuss key findings, calling out the riskiest projects I analyzed, the permission patterns distilled from analyzing over 100 policy objects, and concrete ways attackers and defenders can feed these insights into their daily security operations.\n**Speaker:** Lenin Alevski is a Full Stack Engineer and generalist with a lot of passion for Information Security. Lenin specializes in building and maintaining Distributed Systems, Application Security and Cloud Security in general. Lenin loves to play CTFs, contributing to open-source and writing about security and privacy on his personal blog [https://www.alevsk.com](https://www.alevsk.com/)."
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP August In-Person Meet - Vibe Coding Meets AppSec",
        "date": "2025-08-28",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/dallas-the-open-web-application-security-project-meetup/events/310414265",
        "timezone": "America/Chicago",
        "description": "With the era of “vibe coding” taking off, where speed and fluidity drive software delivery, Static Application Security Testing (SAST) faces a rising challenge: managing false positives without slowing the pace. Striking the right balance between catching real vulnerabilities and avoiding wasted time on non-issues is key.\n\nIn this session, we’ll explore why false positives occur, the trade-offs that cause them, and how context shapes what’s truly risky—especially when rapid, iterative coding styles are in play.\n\nThrough practical, real-world scenarios, we’ll cover:\n\n\\- The FP/FN trade\\-off and why chasing zero false positives can introduce other risks\\.\n\\- The three core drivers of false positives: algorithms\\, rules\\, and context\\.\n\\- How risk appetite and environmental context change the definition of a vulnerability\\.\n\\- Strategies for prioritizing\\, triaging\\, and reducing noise without slowing momentum\\.\n\nBy the end of the session, you’ll have a clearer perspective on why fully eliminating false positives is rarely practical - and how to manage them so SAST remains a trusted safeguard in fast-moving development workflows."
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "MetaCTF Aug 2025 Flash CTF",
        "date": "2025-08-28",
        "time": "17:00-04:00",
        "link": "https://www.meetup.com/owasp-delaware-chapter/events/310614744",
        "timezone": "America/New_York",
        "description": "This free capture the flag (CTF) event is hosted by MetaCTF.com, and will cover challenges in Web Exploitation, Forensics, and more.\n\nThere will be 5 challenges, and you will have 2 hours to solve as many as you can.\n\nParticipation is **individual** and **free** to enter. Although participation is individual, OWASP Delaware will attempt to get a **private scoreboard.** #fancy (more details will be sent to those that RSVP here).\n\nStep 1) **RSVP at Meetup** (a.k.a. \"Attend\") this event. (If we get a private scoreboard the \"key\" will be sent via Meetup to everyone that RSVPed to this event.\nStep 2) **Register for the CTF** at [https://mctf.io/aug2025](https://mctf.io/aug2025)\n\nFor practice, check out the challenges **and solutions** from a previous Flash CTF at [https://mctf.io/practice](https://mctf.io/practice). #TheMoreYouKnow\n\nDuring the event we can chat on the **OWASP Delaware Discord**. Don't know where that is? DM me or another [OWASP Delaware](https://owasp.org/www-chapter-delaware/) chapter co-lead for details.\n\nDisclaimer I saw on the MetaCTF practice CTF: \"*By signing up for this CTF, you consent to be contacted by MetaCTF or sponsors about their services.*\" ¯\\*()*/¯\n\nPS: This event **might** get an **optional physical location** for those that want to collab IRL. Standby for emails via Meetup for more details (sent to those that RSVP here at Meetup for this event)."
    },
    {
        "group": "Indianapolis",
        "repo": "www-chapter-indianapolis",
        "name": "OWASP Meeting",
        "date": "2025-09-09",
        "time": "19:00-04:00",
        "link": "https://www.meetup.com/indyowasp/events/310486026",
        "timezone": "America/New_York",
        "description": "Topic 1\n**Secure Vibe Coding: 5 Key Lessons**\nAI coding assistants like Cursor, Copilot, and Windsurf significantly increase productivity and assist with mundane coding tasks. But while powerful, these tools carry risks: trained on vast public datasets, they inherit bad patterns without necessarily ensuring secure application development. In this talk, we'll share five key lessons for security engineers and developers to improve code security:\n\n1. Implement guardrails\n2. Get real-time security signal\n3. Watch your dependency blast radius\n4. Compensate for non-determinism\n5. Invest in prompt engineering\n\nBio:\n**Nate Michalov** is a seasoned application security professional with over 12 years of diverse experience. Throughout his career, Nate has contributed to organizations such as Endor Labs, Apiiro, Snyk, Veracode, and Annkissam, where he has focused on securing digital ecosystems while aligning technological strategies with business objectives. In various roles including customer success architect, senior sales engineer, and senior SAST specialist, Nate has consistently tackled complex challenges at the intersection of business and technology. Known for his collaborative approach and dedication to staying informed about emerging trends, Nate is recognized as a trusted advisor in promoting innovation and resilience in application security.\n\nTopic 2\n**Title: Past, Present and Future of Automatic Code Remediation**\n\nAbstract: Academic projects, linters, and IDE helpers provided a foundation for simple automatic code refactoring, but lacked the depth to address complex code issues found by tools. Recently, the landscape of tools used to change code saw explosive growth. Several open source code mutation frameworks have emerged, allowing expressive and impactful code transformations. LLMs have also jumped into the picture, promising power and delivering “cool” – but also towing chaos. We’ll explore the capabilities of these tools, including synergistic strategies – all towards answering the question: “are we ready to automatically fix code issues?” Finally, we’ll look at the horizon and make the case that the era of self-healing software is approaching quickly, even if it looks a little different than what you might expect.\n\nBio:\nLeading tech innovator **David Hafley**, Head of Engineering at Pixee, blends leadership with tech expertise. Known for shaping global engineering teams, he champions large language models at Pixee, driving content and vulnerability solutions. Prior roles include Chief Product Officer at Dyknow, VP of Engineering at Contrast Security, and varied leadership roles from AWS environments to DevOps culture building. A seasoned speaker, David Hafley brings a wealth of knowledge to the Python conference stage, connecting tech, leadership, and the Python community."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Jax Monthly Meetup",
        "date": "2025-09-15",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/310150420",
        "timezone": "America/New_York",
        "description": "This is a placeholder event while we confirm this month's speaker. Stay tuned for updates, we'll share details as soon as they're locked in!\n\nInterested in presenting or know someone who might be? Reach out, we're always looking for speakers!"
    },
    {
        "group": "Juiz De Fora",
        "repo": "www-chapter-juiz-de-fora",
        "name": "Taint Analysis no Code Review - OWASP Juiz De Fora Chapter + Pirate Ship",
        "date": "2025-08-27",
        "time": "20:00-03:00",
        "link": "https://www.meetup.com/owasp-juiz-de-fora-chapter/events/310634170",
        "timezone": "America/Sao_Paulo",
        "description": "Use Taint Analysis como técnica estruturada de revisão para mapear fontes não confiáveis até pontos críticos, garantindo que vulnerabilidades sejam detectadas e mitigadas no código-fonte com eficiência."
    },
    {
        "group": "Las Vegas",
        "repo": "www-chapter-las-vegas",
        "name": "Secure Coding Tournament with Security Journey",
        "date": "2025-09-19",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-las-vegas-chapter/events/308588593",
        "timezone": "America/Los_Angeles",
        "description": "I'm excited to announce that **#OWASP** Las Vegas is partnering with **#SecurityJourney** for an amazing event this September!\n\nWe will be co-hosting a multi-day secure code tournament event hosted with support from various local businesses. Come test and hone your coding skills and see how you hold up against some of your local peers when it comes to secure code. With **over $600 in gift cards plus other prizes up for grabs**, you can win a prize without being the top dog.\n\nThis event will be a virtual event, though we will be at the amazing **#CorporateCoworking** offices for the kick-off of the event, as well as for the end where we announce winners and prizes.\n\n**September 19th (6pm-8pm):** Event announcement and kickoff will be streamed via Zoom, and held in person at Corporate Coworking ([https://corporatecowork.com/](https://corporatecowork.com/))\n[https://us06web.zoom.us/j/85892230182?pwd=LJDAHLfFmTvWipDs4Tn6q8KbTqNOcM.1](https://us06web.zoom.us/j/85892230182?pwd=LJDAHLfFmTvWipDs4Tn6q8KbTqNOcM.1)\n\n**September 21st (2pm-4pm):** Prize announcements and event wrap up will be streamed via Zoom, and also held in person at Corporate Coworking\n[https://us06web.zoom.us/j/82494110849?pwd=4nu5nR6rL3ZyWczyFsfjfNKml9UD27.1](https://us06web.zoom.us/j/82494110849?pwd=4nu5nR6rL3ZyWczyFsfjfNKml9UD27.1)\n\nJoin our Discord server to discuss and collaborate on a channel we will have dedicated to the event.\nhttps://discord.gg/fRwFRN49\n\nSignup using the following if you would like to participate in the fun:\n[https://forms.gle/YGWMFKi3opvq7Rqk6](https://forms.gle/YGWMFKi3opvq7Rqk6 \"https://forms.gle/YGWMFKi3opvq7Rqk6\")"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - Aug 27, 2025",
        "date": "2025-08-27",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091958",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Conquering Castle Envy – The Flawed Mindset That’s Holding Application Security Back\nJoin us for great networking, dinner and drinks, and see a presentation by **Jeff Willams,** Co-Founder and CTO, **Contrast Security**\n\n**ABSTRACT:** Application security has spent 25 years stuck in the wrong mindset — treating software like a castle that can be fortified, inspected, and declared secure. That mental model leads to confident failure: endless scanning, training, and compliance rituals that rarely stop real threats. In this talk, we’ll re-examine AppSec’s go-to tools — threat modeling, scanning, pentesting, firewalling — through a new lens, so you can see why they keep falling short. The problem isn’t effort. It’s context. You’re trying to secure a living, breathing software city using a blueprint for a castle.\n\nWe’ll introduce a new model: Runtime Security. This isn’t theory — it’s about observing real production environments, with real users, data, connections, and threats. We’re not trying to secure a castle. Your application ecosystem is a massive, dynamic city — alive, interconnected, and always under construction. It needs monitoring, coordination, fast response, and resilience — not moats and silos. We’ll show how teams are using runtime visibility and feedback loops to focus on what matters, adapt quickly, and prove they’re making a difference. The most serious AppSec threat isn’t in your code — it’s in your head. Shift your thinking, and everything else starts to fall into place.\n\n**Thanks to our SPONSOR**: *[Contrast Security](https://www.contrastsecurity.com/)*\n*You can't stop what you can't see*\n*Application Detection and Response for Modern Enterprises*\n*Stop attacks in your applications and APIs from development to production*\n\n**Thanks to our HOST**: *[Accenture](https://www.accenture.com/)*\n*Assisting our customers in creating their future*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "It Doesn't Have to Be That Hard: Battle of the Hardware Hacking ",
        "date": "2025-09-04",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/310249355",
        "timezone": "Europe/London",
        "description": "This September, OWASP Manchester welcomes you to two talks that smell faintly of solder, tofu, and the quiet hum of rebellion. You’re about to hear from two giants in the world of hardware hacking, people who void warranties not by accident, but as an art form: Jay Harris and Andrew Tierney.\n\nPresenting @JayHarris_Sec (aka Jahmel Harris), former ringmaster of the Manchester Grey Hats, returning to his old stomping grounds with circuits to fry and stories to tell. Alongside him, the inimitable @Cybergibbons (aka Andrew Tierney), a name whispered in reverence across teardown forums and embedded firmware Slack channels.\n\nAway from the crumbling ruins of Twitter, old legends rise again: Heroes of Hardware, Titans of Tinkering, Overlords of the Open-port. Join us as we plug in, pry open, and peer deep into the guts of the machines around us… or, you know, just learn how the masters break them?\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nDue to a corporate policy from the venue sponsor, to get into the venue & up to the event, you will need to register with your full name when signing up to the event **AND** show photo ID when checking in to the event on the night.\n\n**As we're still dealing with a large number of no-shows, if you don't attend without releasing your ticket, we may remove you from future events.**\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**Agenda:**\n**6:00 - Open doors & networking & drinks**\n**6:30 - Talk 1**\n**7:15 - Refreshments (Food & Drinks & Networking)**\n**8:00 - Talk 2**\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**LOCATION**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nBooking.com\n6 Goods Yard Street Manchester\nM3 3BG\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**SPEAKERS**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Jay Harris & Andrew Tierney**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**SPONSORS** (Thank you for supporting our community!!)\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Booking.com** \\- Venue Sponsor AND Food & Drink Sponsor\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "September 2025 OWASP Chapter Netherlands Meetup",
        "date": "2025-09-18",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/310077400",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Trend Micro\n**Address:** Herikerbergweg 92, 1101 CM Amsterdam\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Simple meal**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Beyond the Smoke Screen: Separating Reality from the Rhetoric!!!** by **Deepankar Bhagat**\n20:00 - 20:15 - **Break**\n20:15 - 21:00 - **T.B.D.**\n\n**Beyond the Smoke Screen: Separating Reality from the Rhetoric!!!**\n**Abstract:**\nThis presentation examines AI through a sociotechnical lens, focusing on security implications beyond traditional cybersecurity paradigms. AI systems are embedded within social structures involving hidden “ghost work“ from Global South communities, creating digital colonialism while consuming massive environmental resources. Sociotechnical risk analysis reveals vulnerabilities extending from technical attacks (adversarial examples, data poisoning) to social manipulation through deepfakes and weaponized misinformation. These risks are amplified by model opacity, concentrated capabilities, and the dangerous misalignment between AI’s actual pattern-recognition abilities and social perceptions of intelligence. Security professionals must understand that AI deployment creates new attack surfaces in critical infrastructure while being simultaneously promoted as security solutions. The presentation advocates for security frameworks that account for both technical vulnerabilities and social dimensions of AI risk, challenging hype-driven adoption that ignores fundamental limitations and sociotechnical dependencies\n**Bio:**\nDeepankar Bhagat, Process Expert, Global Identity Access Management. Over 2 decades of experience in financial domain with diverse background in business analysis, IT security, Risk management and process frameworks. Besides Masters in Business Administration (Investment Banking) and Masters in Cybersecurity, I have numerous industry certifications including diploma in emerging technologies like GenAI and Quantum Mechanics and Post quantum Cryptography. I am part time security trainer and also runs a you tube channel spreading knowledge free of cost. I don’t have much free time but whatever i manage to get, i spent on fitness."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand Day",
        "date": "2025-09-02",
        "time": "08:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/304552659",
        "timezone": "Pacific/Auckland",
        "description": "We're thrilled to be continuing our proud tradition and announce the 15th OWASP New Zealand Day conference. This year's conference has returned at last to the **Owen G. Glenn Building (OGGB)**, on the University of Auckland's Grafton campus.\n\nThis event includes a two-day conference on Thursday and Friday (4-5 September), preceded by a mix of half- and two-day training classes on Tuesday and Wednesday (2-3 September).\n\nRegistration for the main conference is still open and is just $50 per person. Student registration is only $20. Training registration fees have not increased from last year, and registration is open until Friday, 22nd August.\n\nThe conference's **Call for Sponsors** is open, with great sponsorship opportunities still available: https://appsec.org.nz/conference/sponsorship.html"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Why you should hack your own APIs",
        "date": "2025-08-28",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/310385035",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: We will email attendees the address.**\n\n**The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, August 25th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org) to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Abstract**\nAPIs power virtually every web and mobile application, accounting for over 80% of all Internet traffic. And APIs are under attack. Gartner states APIs have become the “most frequent attack vector,\" resulting in hundreds of highly successful, high profile breaches. This API security presentation covers 1) why attackers love APIs, 2) real-world breaches (and how they map to the OWASP API Security Top 10), and 3) best practices to keep APIs secure.\n\n**Bio**\nDan brings over 20 years of cybersecurity experience with executive leadership roles at APIsec, Qualys, Anomali, ArcSight and others. He’s led Product Development, Sales teams, and Marketing at startups and publicly traded companies. Dan is the co-founder of APIsec University - a site that offers high quality, no cost courses on API security risks and best practices. APIsec University now has over 120,000 students, covering over 80% of the Fortune 100. Dan has earned engineering degrees from Rensselaer Polytechnic and Cornell University, and an MBA from University of Michigan."
    },
    {
        "group": "Patna",
        "repo": "www-chapter-patna",
        "name": "Active Directory Attacks",
        "date": "2025-08-30",
        "time": "14:00+05:30",
        "link": "https://www.meetup.com/owasp-patna-chapter/events/310677571",
        "timezone": "Asia/Kolkata",
        "description": "This session explores Microsoft’s **Active Directory (AD)**, a fundamental service for identity, authentication, and access control across enterprise networks. Participants will learn why AD is a key target for attackers, focusing on its centralized authentication processes, management of privileged accounts, and inter-domain trust relationships, all of which make it critical—and vulnerable—to compromise."
    },
    {
        "group": "Ruhrpott",
        "repo": "www-chapter-ruhrpott",
        "name": "OWASP Ruhrpott Chapter Meeting - Application Security",
        "date": "2025-09-04",
        "time": "18:30+02:00",
        "link": "https://www.meetup.com/owasp-ruhrpott-chapter/events/308971811",
        "timezone": "Europe/Berlin",
        "description": "Wir laden ein zum Treffen des OWASP Ruhrpott Chapters.\nDas Treffen findet am 04.09.2025, ab 18:30 Uhr an der Ruhr-Universität Bochum Universitätsstr. 150, Gebäude ID, Raum 03/471 statt.\n\n**Was euch erwartet**\n\n* Vortrag & Diskussion zu Application Security\n* Netzwerken mit den Teilnehmern\n\nIm Anschluss besteht erneut die Möglichkeit in umliegende Lokalitäten zu wechseln für gesellige Gespräche.\n\n**Für wen ist das Treffen geeignet?**\nDas OWASP Chapter-Treffen richtet sich an alle, die sich mit dem Thema IT-Sicherheit beschäftigen – unabhängig von Branche oder Erfahrungsstand. Ob im Bereich Offensive Security, Defensive Security, Incident Response, Softwareentwicklung oder Security-Architektur: Wer sich für sichere Systeme, aktuelle Bedrohungen und Schwachstellen interessiert, ist hier genau richtig. Das Treffen bietet eine gute Gelegenheit zum Wissensaustausch, Networking und zur Diskussion aktueller Sicherheitsthemen.\n\n**Weitere Informationen**\nIhr findet weitere Informationen über uns unter [https://owasp.org/www-chapter-ruhrpott/](https://owasp.org/www-chapter-ruhrpott/) oder unseren Discord Server https://discord.gg/dCWJtwJjHb"
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "AppSec War Stories: A Fun Discussion of In-the-Trenches Warfare",
        "date": "2025-09-19",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/310258159",
        "timezone": "America/Chicago",
        "description": "**AppSec War Stories: A Fun Discussion of In-the-Trenches Warfare**\n**Presentation Session:** 11am-2:30pm\n**Happy Hour:** 2:30pm-3:30pm\n\nThe theme of this meeting is to focus on AppSec War Stories: Lesson’s Learned and Opportunities. Industry experts will talk about key AppSec challenges and how these were overcome by leveraging technology, best practices, innovation and teamwork. There will be multiple presentations highlighting different challenges and lessons learned.\n\n**Featured Presentations**\n\n**Securing Today, Safeguarding Tomorrow: A Guide to App and AI Security - Snyk**\nThis talk challenges the traditional, reactive approach to application security, where developers get stuck fixing issues weeks after they're created. We’ll show how new tools and processes can empower developers to integrate security directly into their workflow, making it an efficient part of the development process.\n\nFinally, we'll look at the emerging security challenges presented by AI. We'll discuss the new \"war stories\" we anticipate seeing, and what developers need to know to secure both today's applications and the AI-powered systems of tomorrow.\n\n**Lessons Learned in Application Security from Log4j: A Wake-Up Call for the Industry - OpenText**\nTo explore key takeaways from the Log4j vulnerability (Log4Shell) and how it reshaped the approach to application security, particularly in open-source and enterprise software environments.\n\n**Security Panel: AppSec Futures – Opportunities and Challenges**\nTopics of discussion will cover Agentic AI, defending against AI-powered attacks (deepfakes, phishing, social engineering, etc.), securing the expanded attack surface for APIs and Microservices, emerging threats from Quantum Computing, and preventing Supply Chain attacks.\n\nFeatured panelists:\n\n* Eddie Contreras - CISO - Frost Bank\n* John Dickson - CEO - ByteWhisper\n* Chris Young - OpenText\n* Andrew Gordon - Snyk\n\n**Additional Meeting Details**\n\n* Lunch Provided\n* Location: Scuzzi’s Italian Restaurant - 4035 N Loop 1604 W #102, San Antonio, TX 78257\n* HAPPY HOUR & DEMO LAB networking after session!!!\n* Opentext\n* Synk\n* ByteWhisper\n* Wallarm\n* BlackDuck\n\n**Happy Hour - Sponsors**\n\n* Opentext\n* Synk\n* Bytewhisper\n* Wallarm\n\n**Join Zoom Meeting**\nhttps://ftsc.zoom.us/j/86538235312?pwd=bU4nwzuPmmaqrA3o3qREn56bXpL8TZ.1&from=addon\n**Meeting ID**: 865 3823 5312\n**Passcode**: 429796\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\nPlease reply “ONSITE” if you plan on attending in person so we can finalize headcount for food and room attendance \n\n**Future Presentation Topics To Vote On**\n\n* ASPM\n* Bug Bounty Programs: Successes and Failures\n* Pentest\n* Ransomware\n* DevSecOps - Security as Code\n* Security Controls for AI"
    },
    {
        "group": "Scotland",
        "repo": "www-chapter-scotland",
        "name": "OWASP Scotland Chapter Meeting - September",
        "date": "2025-09-11",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-scotland-chapter/events/310636098",
        "timezone": "Europe/London",
        "description": "Join us at the OWASP Scotland Chapter Meeting where we have two talks lined up for our September session - see details below.\n\nPizza and drinks will be provided to the attendees.\n\nThis event is perfect for software developers, ethical hackers, and cybersecurity enthusiasts interested in learning about the latest trends in cyber security.\n\n#### Talk 1 - Everything Wrong with Dependency Track\n\n**Speaker:** Dr. Lionel Saliou\n**Blurb:** A humorous look back on a project I conducted at my current employer that led to the use (or misuse some might say) of the OWASP flagship project: Dependency Track. This talk provides the context to these decisions and extracts nuggets of wisdom that I believe will be valuable to many security professionals.\n**Who am I?** My name is Dr. Lionel Saliou, Ph.D and I have nearly 2 decades of application security experience. In the past I may have written bugs to remain gainfully employed, nowadays, I am a recovering developer supporting development teams write better software.\n\n#### Talk 2- TBA\n\n**Speaker:** TBA"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-09-10",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/307093545",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seoul",
        "repo": "www-chapter-seoul",
        "name": " OWASP Seoul Chapter 8 :   ",
        "date": "2025-08-26",
        "time": "19:00+09:00",
        "link": "https://www.meetup.com/owasp-seoul/events/310480522",
        "timezone": "Asia/Seoul",
        "description": " OWASP Seoul Chapter 2025 8   !\n\n OWASP   8   ** **.               .\n           ,     .\n\n**    7 ,          7 30 .**\n\n       !\n\n  \n\n**      (5)**\n\n* OWASP Foundation  Seoul Chapter \n* OWASP   \n\n** #1:   (Open Source Gardening) (40)**\n‍ HAHWUL()\n      .          . ()  () , OWASP Noir       .     ?    ?\n\n** #2: ,   (30)**\n‍ \nOWASP Application Security Verification Standard(ASVS)   5.0 .      ,          .\n\n  \n\n*  : 2025 8 26() 19:00 \\~ 21:00 (KST)\n*  :   6(   551 ) [https://naver.me/502MT5HC](https://naver.me/502MT5HC) (     )\n*  : \n* Meetup     .      meetup    .     .\n\n OWASP Seoul Chapter   \n        OWASP Slack   .\n\n*     : [https://open.kakao.com/o/gS5IxXxh](https://open.kakao.com/o/gS5IxXxh)\n* OWASP Slack    ([https://owasp.org/slack/invite](https://owasp.org/slack/invite))   ,   (#chapter-Seoul) .\n\n    \n\n* OWASP         .     seoul-leaders@owasp.org        .\n*    - https://forms.gle/xvEJCjDMEmYr1rKN7"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "OWASP AppSec Days Singapore 2025 (Conference)",
        "date": "2025-09-13",
        "time": "09:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/310566435",
        "timezone": "Asia/Singapore",
        "description": " **Note: This is a paid event. RSVP on Meetup.com does not confirm your spot. You must complete registration at singapore.appsecdays.org to attend.**\n\n## OWASP AppSec Days Singapore 2025 – Conference Day\n\n **Date:** Saturday, 13 September 2025\n **Venue:** M Hotel Singapore City Centre\n\n###  About the Conference\n\nOWASP AppSec Days Singapore returns in 2025 with a full day of inspiring keynotes, deep-dive technical talks, and networking opportunities. Join security professionals, developers, and researchers from across the region to explore the latest in application security.\n\nThis year’s lineup brings together **global leaders in AppSec**, sharing real-world case studies, research, and practical insights to help you build and secure modern applications.\n\n***\n\n###  Conference Talks – Sept 13\n\nExplore technical insights from global leaders:\n\n* **40,000 CVEs and Counting** – Pedram Hayati\n* **XSS is Dead: Browser Security that Eliminates Bug Classes** – Javan Rasokat\n* **Cybersecurity Through a Creator's Lens** – Rishika Desai\n* **Hacking Planes, Trains, and Ships** – Muhammad Shahmeer\n* **Secret Scanning in Open Source at Scale** – Hassan Khan Yusufzai & Danish Tariq\n* **iOS Reversing on a Budget** – Melvin Lee & Nicholas Lim\n* **Hacking Analytics SDKs** – August Joseph\n* **Pwn, Poison & Prompt-Hack Your AI** – Omkar Joshi & Rahul Bhor\n* **Live MFA Hacking** – Niclas Kjellin\n* **Securing Enterprise AI Agents Against Insider Threats** – Keren Katz\n* **Security for Startups** – Rushikesh Ambuskar\n* **Securing Your AWS Lambda 101** – Ilia Mogilin\n\n***\n\n###  Why Attend?\n\n Learn from international AppSec experts\n Gain actionable insights to strengthen modern applications\n Connect with peers, researchers, and security leaders\n\n***\n\n###  Registration\n\n* Conference Ticket: **S$250**\n* Student Ticket: **S$50** (with valid ID)"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver monthly meetup",
        "date": "2025-09-18",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510889",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "ISACA + OWASP Vancouver Social",
        "date": "2025-08-27",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510822",
        "timezone": "America/Vancouver",
        "description": "We are pleased to announce ISACA + OWASP Vancouver joint social event.\n\n**Registration here: [https://lu.ma/CyberBBQ](https://lu.ma/CyberBBQ)**\n\nOWASP members get a discounted rate. If you are an OWASP member, use your @owasp.org email address when registering. If you are not an OWASP member, consider joining: [https://owasp.glueup.com/organization/6727/memberships/](https://owasp.glueup.com/organization/6727/memberships/)"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "Rethinking Security Metrics Through the Lens of Cognitive Load",
        "date": "2025-09-17",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/309892475",
        "timezone": "America/New_York",
        "description": "When we talk about measuring security culture, we describe the **positive impacts that people have** on the security posture of the company. As security leaders, we’re asked to demonstrate that our initiatives like training, Security Champion programs, and SDL have clear benefits. But **are we considering the cognitive cost of our programs**? Every dashboard goal, every “shift left” security integration, and every expectation placed on engineering teams adds to their mental workload, and that load, when unmanaged, silently derails even the most well-intentioned efforts.\n\nThis talk presents practical examples for designing **security culture metrics** that are both impactful and human-aware. At the core is a behavioral science principle often overlooked in security design: **cognitive load theory**—and how this tool can be used to craft realistic metrics that take the human element into account."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call",
        "date": "2025-09-12",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309730245",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "September community call - OWASP SAMM",
        "date": "2025-09-10",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/309874101",
        "timezone": "America/New_York",
        "description": "**Join us for the SAMM Monthly Community Call,** a regular space to hear what’s new with the project, share experiences, and talk about all things SAMM.\n\nWhat to expect:\n\n* Project updates and what’s coming next\n* Occasional podcast-style chats with community guests\n* Open discussion + Q&A: bring your thoughts, questions, or challenges\n\nWhether you’re just starting with SAMM or are already involved, your voice matters. Everyone’s welcome!"
    }
]