[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - August",
        "date": "2023-08-24",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/294346390",
        "timezone": "Europe/Copenhagen",
        "description": "OWASP Aarhus and EAAA are hosting the next meetup on August 24th, 18:30 – 21:30 where we will be doing lighting talks.\n\nThe agenda is therefore still open and feel free to reach out, if you would like to make a short presentation (approx. 20 minutes). It does not have to be a technical presentation, we are open to and welcome presentations about war stories, personal stories, experiences or just cool stuff.\n\nEAAA will provide snacks and drinks!"
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Reversing Stories – Primitives in The Pocket",
        "date": "2023-08-23",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/295078269",
        "timezone": "America/New_York",
        "description": "In the world of vulnerability research & exploit development, much of the public research and findings are primarily centered around the result of said research and activities. However, a lesser known and even lesser publicly talked about part of research is what happens when a bug is discovered where at that current time an abusable condition is not clearly present. What happens? Is this bug now worthless or not worth inspecting further? Many professional teams have a multitude of bugs to analyze specifically from fuzzing campaigns. This can cause teams to have to prioritize certain types of bugs over others, especially when looking for bugs that can lead to bypassing a specific mitigation. They don’t have time to analyze every single bug in depth majority of the time.\u2028\u2028If you are curious about the world of vulnerability research and some of the methodology, this talk aims to help explain a common technique used among research teams where they hold onto potential mitigation breaking bugs in the hopes that in the future an abusable condition become available. We will walk through a real-world example of a bug within the Windows Kernel AFD driver discovered by VerSprite VS-Labs Research team.\n\nSpeaker Bio:\n\nRobert Hawes is the active Director of Research at VerSprite VS-Labs Research team. He Enjoys all things in the area of vulnerability research and exploit development. Robert is passionate about discovering zero-day vulnerabilities and developing accompanying exploits for advance capabilities. Robert is currently focused on userland, and kernel driver exploitation centered around the Windows operating system."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2023 (Online)",
        "date": "2023-08-29",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705760",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI. **Please do not pull both an online and in-person ticket as we purchase food for every in-person ticket.***\n\nWhile the speakers presentation will be online, please feel free to attend in-person at NI. Lunch is sponsored for those who pull tickets via ***https://owasp-austin-2023-august.eventbrite.com***\n\nOnline meeting will be opened at 11:30. The chapter presentation will be starting around 11:55 then the Presentation!\n\nPresentation:\n\n***Undercover Agent in Chinese Card Shop Ecosystem: Become a Phishing Master***\n\nPersonal Identifiable Information (PII) leaks have become more frequent in recent years, and losses from credit card fraud in 2022 have set records respectively in the USA. Where did this information get leaked and sold in the first place?\n\nThe term \"Dark web\" refers to websites inaccessible without the use of Tor protocol, and given added privacy and anonymity while using Tor, and marketplaces in it are proven to be very attractive to criminals.\n\nAn anonymous researcher will share experiences of dealing with vendors from card shops on marketplaces among dark web, focused on insights of shops selling American PIIs, and therefore, TTPs of hackers from these card shops."
    },
    {
        "group": "Belfast",
        "repo": "www-chapter-belfast",
        "name": "Free OPEN Passes to DeveloperWeek CloudX 2023",
        "date": "2023-08-22",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-belfast/events/295147605",
        "timezone": "Europe/London",
        "description": "**Register here:**\n\n[https://www.devnetwork.com/registration/?event=DeveloperWeek%20CloudX%202023&utm_source=meetup&utm_medium=email&utm_campaign=MU13749&discount=MU13749](https://www.devnetwork.com/registration/?event=DeveloperWeek%20CloudX%202023&utm_source=meetup&utm_medium=email&utm_campaign=MU13749&discount=MU13749)\n\nYou must register at the link above (and not just indicate that you are attending here on Meetup).\n\nDeveloperWeek CloudX 2023 (Aug 15-16, San Mateo, CA) + (Aug 22-23, Live Online) is the premier international cloud computing & infrastructure conference where 3,500+ Cloud developers, architects, IT & infrastructure professionals and executives converge to discover the latest cloud developer & engineering innovations. Learn from leaders at Spotify, Uber, Microsoft, Intuit, Akamai, Mercari, Marsh McLennan, CircleCI, Netlify, and dozens more!\n\nThe DeveloperWeek CloudX team has offered our group 25 free OPEN Passes and discounted PRO Passes, so our members can attend for free.\n\nRegister now to get your free OPEN Pass or to SAVE $100 on your PRO Pass.\n\n**To register, go to:**\n\n[https://www.devnetwork.com/registration/?event=DeveloperWeek%20CloudX%202023&utm_source=meetup&utm_medium=email&utm_campaign=MU13749&discount=MU13749](https://www.devnetwork.com/registration/?event=DeveloperWeek%20CloudX%202023&utm_source=meetup&utm_medium=email&utm_campaign=MU13749&discount=MU13749)"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Dependable dependency systems and supply chain risk",
        "date": "2023-08-29",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/295108131",
        "timezone": "Australia/Brisbane",
        "description": "In this talk, Haoxi will be covering the threat landscape of dependency systems (package managers) and why central package registries are not a good model for dependency management. He will then cover open-source tools and data feeds you can use to detect malicious packages in your source code repositories and CICD pipeline, as well as his own open-source experiments in detecting malicious packages in NPM and PyPi.\n\nEvent location coming soon."
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS August 2023",
        "date": "2023-08-24",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/295193476",
        "timezone": "America/Denver",
        "description": "Speaker: James Smith and Bryan Angeles - Red Vs Blue: A Kill Chain Journey\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\n\nhttps://cyber-center.org/"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP August Meetup - Join Us!",
        "date": "2023-08-23",
        "time": "7:30-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/295179375",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us August 23 for food, drinks, networking and an exciting and timely presentation on \"API Security: A CISO Perspective\" from one of the best and brightest in the industry: Gina Yacone. Networking with your peers starts at 5 - food is served at 5:30 and the presentation starts at 6.\n\n**Sponsor: A big thank you to our Denver OWASP sponsor SpyderSec**\n\n**Presentation Title:** API Security: A CISO Perspective\n\n**Presentation Details:** Enterprises manage thousands of Application Programming Interfaces (APIs). Many APIs are not routed through a proxy such as an API Gateway or Web Application Firewall (API);\n\ntherefore, those APIs are not monitored, audited, and may be vulnerable to mistakes or bad actors. Enterprise security teams are playing catch-up when it comes to API security. How are CISOs and security leadership developing governance round API security and incident response readiness?\n\nIn this talk, we will discuss:\n\n1.What are APIs?\n\n2.Why Should API security be top of mind to leadership?\n\n3.API breaches making headlines.\n\n4.API challenges\n\n5.API Breach Examples\n\n6.Approaches to API security\n\nKey takeaways:\n\n1\\. APIs are Everywhere\n\n2\\. How are APIs tied to business success?\n\n3\\. Why having an API strategy is important?\n\n4\\. How to develop API lifecycle management?"
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "CyberSecure Insights: Decoding Bill C-26 - Sponsored by Fortinet",
        "date": "2023-08-31",
        "time": "7:00-06:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/295497528",
        "timezone": "America/Edmonton",
        "description": "  \n\n**RSVP to attend** – **limited space available.** This assists in fire code compliance and planning CATERING and DOOR PRIZES for everyone's enjoyment.\n\n  \n\n**Event Description:**\n\nEmbark on a transformative journey into Canada's cybersecurity landscape, at the OWASP Edmonton chapter event on August 31st. Proudly sponsored by **[Fortinet](https://www.fortinet.com/)**. Delve into the groundbreaking Bill C-26, which lays the foundation for safeguarding critical infrastructure. From dissecting amendments to the telecommunications act to navigating the powers granted to the government under the Critical Cyber Systems Protection Act. This event is made possible with **[Fortinet's](https://www.fortinet.com/)** support. We will unravel the core requirements and demonstrate how evolving security operations lead to compliance. Join us for insightful discussions, network with **[Fortinet](https://www.fortinet.com/)** experts, and savour a delightful array of appetizers as we decode the future of cybersecurity together. Admission is free, however you must RSVP to attend the event. The knowledge gained is priceless. Secure your spot today and be part of the cybersecurity evolution with **[Fortinet](https://www.fortinet.com/)**.\n\n**Culinary Note:**\n\n**[Fortinet](https://www.fortinet.com/)**, a leading name in cybersecurity, will be treating attendees to a selection of delicious appetizers and finger foods. Featuring options to accommodate various dietary preferences. Please your palate with anticipated delights such as gyoza, sliders, wings, and more. All thoughtfully provided by **[Fortinet](https://www.fortinet.com/)**. While exact items may change, you're in for a gastronomic treat. Reserve your spot now to experience the event, expert insights, and our caterer's culinary excellence firsthand!\n\n**Date & Time:**\n\nAugust 31st, 5:00 PM - 6:30 PM\n\n**Location**\n\nNorquest College\n\n*10215 108 St NW, Edmonton, AB T5J 1L6*\n\n*Room 2-013 - SCFL - Downtown*\n\n*Directions and parking information are located in the photos section at the bottom of this page.*"
    },
    {
        "group": "Hartford",
        "repo": "www-chapter-hartford",
        "name": "OWASP Hartford Meetup",
        "date": "2023-09-13",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/ct-cyber-security-meetup-owasp-hartford/events/295568205",
        "timezone": "America/New_York",
        "description": "Hello esteemed members and web security enthusiasts!\n\nWe are thrilled to announce our next meetup scheduled for September 2023, and we'd love for you to be there!\n\n**Details of the Event:**\n\n* **Host:** Connecticut OWASP (Open Web Application Security Project) Chapter\n\n* **Date:** Thursday September 14th 2023\n\n* **Time:** 6:00 PM to 9:00 PM\n\n* **Location:** Thomas Hooker Brewery\n\n* **Address:** 16 Tobey Rd, Bloomfield, CT 06002-3522\n\n**Highlights of the Meetup:**\n\n* Engage with fellow web security professionals and enthusiasts.\n\n* Network and share insights over some of the finest brews offered by Thomas Hooker Brewery.\n\n* This event is free and open to the public\n\n**RSVP:**\n\nYour participation is important to us! Kindly let us know if you'll be attending by 9/7/23. This will help us in making appropriate arrangements.\n\n**About OWASP:**\n\nFor those who are new, the Open Web Application Security Project (OWASP) is an open community dedicated to enabling organizations to develop, purchase, and maintain software applications that can be trusted.\n\nOur local Connecticut Chapter regularly hosts meetups and events to bring together professionals and students interested in web application security.\n\nWe're looking forward to an evening of learning, networking, and fun. Hope to see you there!\n\nBest Regards,\n\n[Bill Reyor/OWASP Connecticut Chapter Team]"
    },
    {
        "group": "Hyderabad",
        "repo": "www-chapter-hyderabad",
        "name": "OWASP Hyderabad Chapter Meetup",
        "date": "2023-08-26",
        "time": "0:30+05:30",
        "link": "https://www.meetup.com/hyderabad-owasp-meetup-group/events/295554693",
        "timezone": "Asia/Kolkata",
        "description": "Dear OWASPIANS & Cybersecurity Enthusiasts,\n\nWe are excited to invite you to the upcoming OWASP Hyderabad Local Chapter Meeting in collaboration with CyberSecurist Technologies and Altimetrik India.\n\nThis event is going to be an on-campus event bringing together cybersecurity enthusiasts, professionals, and experts to discuss the latest trends, best practices, and advancements in web application security.\n\nEvent Details: Date: 26th Aug 2023\n\nTime: Starts at 10:30 am IST\n\nLocation:\n\nAltimetrik India Pvt Ltd CoWrks, 2nd Floor, SKYVIEW 10, The Skyview,\n\nSy no 83/1 Raidurgam, Hitech City Main Rd,\n\nHyderabad,\n\nTelangana,\n\nIndia - 500081\n\nAgenda Highlights:\n\n1. Welcome and Introduction\n\n2. Presentation 1:\n\n\"Preparation of an automated web API Regression test suite\"\n\n3. Open Discussion: Q&A and Knowledge Sharing\n\n4. Presentation 2: \"TBD\"\n\n5. Open Discussion: Q&A and Knowledge Sharing\n\n6. Closing Remarks and Future Events\n\n7. Networking Break: Engage with fellow attendees and speakers\n\nOur guest speakers and facilitators are industry specialists who will share their insights, experiences, and knowledge to help you stay updated on the latest security practices and vulnerabilities.\n\nPlease confirm your attendance via Meetup\n\nDon't miss out on this valuable opportunity to connect with fellow security enthusiasts and enhance your understanding of web application security. We look forward to your presence at the OWASP Hyderabad Chapter Meeting.\n\nNOTE: Please ensure to carry your government-issued ID so as to register and get into the premises.\n\nBest regards,\n\nOWASP Hyderabad Chapter"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2023",
        "date": "2023-09-11",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/294083412",
        "timezone": "Europe/Rome",
        "description": "In collaboration with Politecnico di Milano (Polimi) University, we are excited to announce the upcoming OWASP Italy Day 2023 on September 11th. It will be a full-day event dedicated to application security (AppSec)!\n\nThe Open Worldwide Application Security Project (OWASP) stands as a well known international non-profit organization dedicated to the crucial field of web and application security.\n\nAt its core, OWASP operates as a vibrant online community, diligently producing a wealth of freely-available resources. These include insightful articles, comprehensive methodologies, extensive documentation, cutting-edge tools, and advanced technologies, all focused on bolstering web application security.\n\nThe impact of OWASP's work extends far and wide, with numerous standards, books, tools, and organizations drawing upon the invaluable insights provided by the Top OWASP 10 project. Esteemed entities such as MITRE, PCI DSS, the Defense Information Systems Agency (DISA-STIG), and the United States Federal Trade Commission (FTC) all recognize and reference OWASP's contributions.\n\nAn eagerly anticipated event in the OWASP calendar is the OWASP Italy Day 2023. This captivating one-day conference is exclusively dedicated to web application and software security, as well as application security testing tools and technologies.\n\nIt presents a golden opportunity for attendees to expand their knowledge on critical application security topics and to network with esteemed professionals and experts. Participants include application security professionals/managers, software engineers, software quality engineers/testers, and computer science students.\n\nFor further details regarding the OWASP Italy Day 2023, please refer to the following link:\n\n[https://owasp.org/www-chapter-italy/events/OWASPItalyDay2023](https://owasp.org/www-chapter-italy/events/OWASPItalyDay2023)"
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "OWASP Jakarta Night x Fastly.com (Offline Meetup)",
        "date": "2023-09-15",
        "time": "8:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/295313578",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n\n• Tool dan standar keamanan aplikasi\n\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n\n• Kendali keamanan dan pustaka standar\n\n• Cabang lokal di seluruh dunia\n\n• Riset terkini\n\n• Konferensi lengkap di seluruh dunia\n\n• Mailing list\n\n• Dan banyak lagi … di www.owasp.org\n\nKali ini OWASP Jakarta Meetup akan membahas:\n\nJadwal Acara\n\n6:00PM: Registrasi Peserta\n\n6:30PM: Topic Terkini dari OWASP\n\n7:00PM: Presentasi topik khusus:\n\n‘Evolusi Bot dan Penipuan’ oleh Fastly (30mins)\n\n‘Keamanan Aplikasi Modern’ oleh Fastly partner A10 (30mins)\n\n8:00PM: TBD\n\n8:30PM: Foto session and networking\n\nHosts / Speakers :\n\nHos: Flo\n\nOWASP JKT Chairman & CEO Appsec.asia : Ade Yoseman Putra\n\nPembicara Fastly: Guy Brown\n\nPembicara A10: untuk di konfirmasi(TBC)\n\nVenue :\n\nWework Revenue Tower\n\nScbd, Jl. Jenderal Sudirman No.52-53, RT.5/RW.3, Senayan, Jakarta, Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12190\n\nthank you sponsor this event - Fastly.com"
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "OWASP Community Day",
        "date": "2023-08-26",
        "time": "0:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/294165322",
        "timezone": "Asia/Karachi",
        "description": "**OWASP Community Day Lahore**\n\nJoin us for the highly anticipated OWASP (Open Web Application Security Project) Community Day in Lahore! This event is a gathering of cybersecurity enthusiasts, professionals, students, and experts who are passionate about web application security and its importance in today's digital landscape.\n\nDuring this day-long event, you will have the opportunity to engage with like-minded individuals, learn from industry leaders, and expand your knowledge in the field of web application security. The OWASP Community Day Lahore aims to promote collaboration, knowledge sharing, and awareness of the latest trends and best practices in securing web applications.\n\n_**Highlights of the OWASP Community Day Lahore:_**\n\n1. Expert Talks: Listen to renowned cybersecurity experts and thought leaders as they share their insights and experiences in web application security. Gain valuable knowledge about emerging threats, vulnerabilities, and effective countermeasures.\n\n2. Hands-on Workshops: Participate in interactive workshops conducted by industry professionals where you can enhance your practical skills in areas such as secure coding, penetration testing, threat modeling, and secure software development.\n\n3. Networking Opportunities: Connect with fellow cybersecurity enthusiasts, professionals, and students in a collaborative and engaging environment. Expand your professional network, share ideas, and forge valuable connections with individuals who share your passion for web application security.\n\n4. Capture The Flag (CTF) Challenges: Test your skills and compete in exciting Capture The Flag challenges designed to simulate real-world scenarios. Solve security puzzles, find vulnerabilities, and demonstrate your expertise to win attractive prizes.\n\n5. Lightning Talks and Demos: Engage in quick-paced lightning talks and live demonstrations, where participants showcase innovative tools, techniques, and research findings related to web application security. Discover new solutions and gain inspiration from cutting-edge projects.\n\n6. Community Projects and Initiatives: Learn about ongoing OWASP projects and initiatives, and find out how you can contribute to the community. Explore opportunities to collaborate on open-source security tools, research papers, and resources that benefit the broader cybersecurity ecosystem.\n\nDon't miss out on this incredible opportunity to be part of the OWASP Community Day Lahore! Mark your calendars and join us for a day filled with knowledge sharing, skill-building, and networking in the vibrant world of web application security. Together, let's make the web a safer place for everyone.\n\n**Note: Please stay tuned for updates on speakers, workshops, and additional event details on our official website and social media channels.**\n\nWe look forward to welcoming you to the OWASP Community Day Lahore!"
    },
    {
        "group": "Lima",
        "repo": "www-chapter-lima",
        "name": "OWASP Meeting Agosto 2023",
        "date": "2023-08-22",
        "time": "9:00-05:00",
        "link": "https://www.meetup.com/owasp-lima-meetup-group/events/295181195",
        "timezone": "America/Lima",
        "description": "**OWASP Meeting Agosto 2023**\n\nReunión Mensual de Seguridad de Aplicaciones (VIA ZOOM)\n\n**PRESENTACIONES:**\n\n***El arte del engaño: Revelando la Fascinante Danza entre la Seguridad Física y la Ingeniería Social - David Probisnky* (RD) - Red Team Leader en Elevate Consult**\n\n***Mitigar Vulnerabilidades Sin Morir en el Intento: Priorizando el Trabajo de Seguridad - Nicolás Valcárcel (PE) - Information security Leader en NextRoll***"
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#04 - The Room",
        "date": "2023-09-19",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/295466709",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on Sep 19th, 2023, at 18:00, **supported by [BNP Paribas](https://www.bnpparibas.pt).**\n\nThe schedule is the following:\n\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n\n**18:15** \\- How to test and compare SAST solutions\n\n**19:00** \\- Unmasking Azure Kubernetes Service \\- Unveiling Inherent Security Risks in K8S Environments\n\n**20:00** \\- Snacks & Drinks sponsored by BNP Paribas\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**Talks**:\n\nTitle: **How to test and compare SAST solutions**\n\nSpeaker:\n\nGuillaume Montard\n\nAbstract:\n\nOver the past two decades, many of us have had negative experiences with SAST. In this talk, I will explain SAST, its significance, and introduce a framework that allows you to test and compare the latest SAST solutions. By the end, I hope to change your perspective on SAST.\n\nBio:\n\nGuillaume, co-founder of Bearer, developer-first security solution. Previously CTO and VP of Engineering at Skillsoft.\n\nLinkedIn: [https://www.linkedin.com/in/guillaumemontard/](https://www.linkedin.com/in/guillaumemontard/)\n\nTwitter: [https://twitter.com/g_montard]( https://twitter.com/g_montard)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Unmasking Azure Kubernetes Service - Unveiling Inherent Security Risks in K8S Environments**\n\nSpeaker:\n\nSadi Zane\n\nAbstract:\n\nThis talk delves into the security risks associated with Azure Kubernetes Service (AKS). Specifically, it focuses on a deep dive into key security controls like Role-Based Access Control (RBAC) and explores associated risks with service accounts. Additionally, the talk presents a novel approach highlighting how an attacker could exploit Node authorization certificate keys to achieve long-term persistence within AKS environments and their underlying containers. Furthermore, the presentation describes and demonstrates an attack against a vulnerable Grafana enterprise application by leveraging directory traversal techniques to steal privileged tokens. These tokens serve as a stepping stone for further pivoting into the container environment. The talk also addresses the inherent shortcomings of default Azure Kubernetes deployments, including vulnerabilities related to secrets management, pod security admission, and underlying networks. By shedding light on these deficiencies, attendees gain a comprehensive understanding of the security challenges and potential avenues for improvement in AKS environments.\n\nBio:\n\nSadi Zane is a Principal Cyber Security Consultant specialising in offensive security, Red Team/Purple Team exercises, and extensive experience in Orchestration technologies e.g., Cloud on premise Kubernetes container security systems.\n\nLinkedIn: [https://www.linkedin.com/in/sadi-zane-bb6430206/](https://www.linkedin.com/in/sadi-zane-bb6430206/)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on API Security Workshop with OWASP JuiceShop",
        "date": "2023-08-24",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/295379981",
        "timezone": "America/Los_Angeles",
        "description": "Step into the world of API Security in an immersive two-hour hands-on training event offered by [Akto](https://akto.io) and in collaboration by OWASP LA!\n\nWe’re excited to announce this opportunity for appsec teams to enhance their skills in API Security and writing business logic tests. This instructor led hands-on workshop focuses on creating and running business logic tests using Akto. You will learn to write ten different business logic tests, which will then be executed against Juice Shop and other vulnerable apps. The goal of the workshop is to give hands-on experience in writing and automating custom API security tests related to authentication, authorization and access control issues. The workshop aims to be interactive, engaging, and an enriching learning experience. You will learn the fundamentals of writing, automating, and executing business logic tests. By the end of this training, participants will be able to automate 10 business logic tests, a key skill in the realm of API security.\n\nWhat to Expect?\n\n* By the end of the workshop participants will be able to write 10 business logic tests focused on authentication, authorization and access control issues.\n\n* Networking opportunity with fellow security professionals.\n\n* Ask absolutely any questions about securing APIs\n\nRequirements:\n\n* Attendees are required to bring their laptops\n\nParticipants are encouraged to bring their own API projects or sample APIs they are trying to test to receive personalized guidance and recommendations during the workshop. We will help everyone write their own custom tests during the workshop itself so you can test your own APIs. If not, we will be using Juice Shop or other vulnerable apps for demo purposes.\n\n**Food and drinks** will be provided and there's a free 90 minute **parking** available across the street."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - AUG 23, 2023",
        "date": "2023-08-23",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294355732",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: AppSec 2.0: Reimagine AppSec With Runtime Analysis\n\nJoin us for great networking, dinner and drinks, and see a presentation by Kiran Kamity, CEO and Founder of Deepfactor.\n\n**ABSTRACT**: SCA tools (container and dependency scans) generate too much noise. Runtime security tools don’t understand SCA findings, and don’t come in until production. What if you could marry SCA with runtime analysis during dev, test, and prod?\n\nIn this session, we will discuss how the next generation of AppSec needs to go beyond just integrating static SCA into your CI pipeline, to analyzing insecure behaviors inside running apps and correlating that back to SCA to understand which vulnerable components are actually loaded into memory and used by your application. This new approach to AppSec will detect both known vulnerabilities/CVEs with SCA scans and unknown vulnerabilities with runtime analysis. It will then prioritize known vulnerabilities with runtime correlation of SCA findings. End result: you catch most of the key risks in your app, prioritize the key items your devs need to work on without flooding them with alerts, and remove unused components from your containers to burn down your CVE debt rapidly….and achieve the true mission of AppSec…to empower engineering and security teams to create secure applications.\"\n\n**Thanks to our Sponsor**: *[Deepfactor](https://www.deepfactor.io/)*\n\n*Deepfactor Developer Security is a new approach to AppSec that is cloud-native and developer-friendly. It helps enterprises address supply chain and DevSecOps initiatives with a unique technology approach that combines SCA (Software Composition Analysis), SBOM (Software Bill of Materials) and Runtime Security.*\n\n**SPONSORSHIP Opportunities Available**\n\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-09-12",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721023",
        "timezone": "Pacific/Auckland",
        "description": "For our September Meetup, our friends at SMX ([smxemail.com](https://smxemail.com/)) have kindly agreed to be our hosts. SMX's office is located in the B:HIVE shared workspace, in Takapuna, and we'll be meeting in one of the ground-level conference rooms.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n\n* 6:30 p.m. - Introductions, Top 10 Topic\n\n* 7:15 p.m. - Pizza and more networking\n\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for September will be **A09:2021 - Security Logging and Monitoring Failures.**\n\n**Technical Topic Speaker:** TBC - **This could be you!**\n\n**Talk Title:** TBC\n\nThe Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Reducing Alert Fatigue with Container Scans",
        "date": "2023-08-24",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/295035051",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Speaker:** Kiran Kamity, Founder & CEO, Deepfactor\n\n**Topic:** Reducing Alert Fatigue with Container Scans: Correlate, Prioritize and Filter Based on Usage\n\n**Abstract:**\n\nScenario: Your application is composed of 12 docker containers. Together they have 400 packages. When you run a container scan with an SCA (Software Composition Analysis) tool, you notice that 120 of them have vulnerabilities. Your security team is asking you to fix all the critical and high vulnerabilities, but your dev/DevOps team doesn’t have the cycles. What do you do?\n\nToday, developers and DevOps engineers are being asked to address vulnerabilities and supply chain risks in container images. However, the volume of noisy security alerts often leads to developers ignoring them entirely or wasting valuable sprint time researching “false positives.” This session will focus on how security and engineering teams can correlate vulnerabilities with runtime information, prioritize alerts based on usage, and filter out false positives that don’t represent a true exposure of a vulnerability. Understanding runtime information can provide intelligence such as applicability of the CVE to the running environment, reachability, and usage. This session will focus on usage. Prioritizing security updates to only used packages in your container image is a highly effective approach to reducing alert fatigue with your container scans. In addition, your DevOps team can even consider removing some of the unused packages and shrink your container images.\n\nAs an example, the session will include a demonstration of a typical SCA static container scan of a sample open-source test application and then show how an engineering team can filter alerts to reduce the number of vulnerable and used alerts that actually need to be fixed by developers by up to 90%.\n\n**Bio:**\n\nKiran Kamity is the Founder & CEO of Deepfactor. He is a serial Silicon Valley entrepreneur with a passion for building products that meet a need and make a business impact—with Deepfactor that’s empowering engineering teams to create secure cloud native applications. Prior to Deepfactor, Kiran was the Head of Product at Cisco Cloud BU, Founder/CEO at ContainerX (acquired by Cisco), and the Founder/VP at RingCube (acquired by Citrix). Kiran is a TEDx speaker and loves nature, travel, and food.\n\n**Schedule:**\n\n6:00pm - 6:40pm Networking, Food & Drink\n\n6:40pm - 7:40pm Presentation\n\n7:40pm - 8:00pm Networking\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-08-31",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/295048332",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "How organizations are getting hacked in the cloud, and quick wins to counter",
        "date": "2023-08-23",
        "time": "7:30+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/295567131",
        "timezone": "Europe/Zurich",
        "description": "This event is organized by our friends from DevOps Meetup Zürich.\n\nThey are more than happy to welcome everyone usually an OWASP Switzerland Meetup participant.\n\n**To register and see more details please go to**\n\n**[DevOps Meetup Zürich - on site event](https://www.meetup.com/devops-meetup-zurich/events/295437705/)**\n\nThey actually offer two talks in this event, but the most relevant for security enthusiasts is this one:\n\n* 17:30 Door opening + Drinks\n\n* 18:00-18:45 How organizations are getting hacked in the cloud, and quick wins to improve your security posture by Christophe Tafani-Dereeper\n\n**How organizations are getting hacked in the cloud, and quick wins to improve your security posture by Christophe Tafani-Dereeper**\n\nCloud adoption is rising, in particular in Switzerland where AWS opened their first region last November. Cloud environments bring new challenges to secure identities, data and infrastructure - but security is first and foremost a matter of prioritization. Without knowing the actual threats you face, you can't efficiently direct your security investments.\n\nIn this talk, we'll demonstrate the most common ways companies are getting hacked on AWS and showcase real-world documented data breaches from recent years. We'll then discuss the best ways to protect against them—in particular, setting up secure defaults and ensuring that engineers can ship secure infrastructure without sacrificing speed. Through the process, we'll show that security best practices often align with DevOps ones, and that operational excellence typically leads to more secure cloud environments.\n\nYou'll leave this talk with actionable insights on what's critical to get right from the start, a practical overview of the open source tools you can use, and a shortlist of high-value security quick wins you can take to your AWS environment right away."
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter Q3 Lunch and Speaker Event 2023",
        "date": "2023-08-25",
        "time": "1:30-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/295193215",
        "timezone": "America/New_York",
        "description": "Exploring the OWASP API Top 10 Attack Categories by Andrew Jones\n\nThe OWASP API Top 10 attack categories have recently been updated for 2023. This talk will focus on discussing some of those changes, examining the API threat landscape in general, and demonstrate some API attacks against a vulnerable web application.\n\nRegister today:\n\n[https://www.eventbrite.com/e/owasp-tampa-chapter-q3-lunch-and-speaker-event-2023-tickets-689321297557](https://www.eventbrite.com/e/owasp-tampa-chapter-q3-lunch-and-speaker-event-2023-tickets-689321297557)\n\nVenue Sponsor: GuidePoint Security\n\nFood Sponsor: Salt Security"
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "Conoce OWASP | El Proyecto de Seguridad de Aplicaciones Mundiales Abiertas",
        "date": "2023-08-31",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-tegucigalpa-chapter/events/295366243",
        "timezone": "America/Tegucigalpa",
        "description": "Charla virtual para dar a conocer el Conoce El Proyecto de Seguridad de Aplicaciones Mundiales Abiertas (OWASP), Explorando el mundo de la ciberseguridad, con profesionales y estudiantes del área tecnológica en Honduras.\n\n**[Registro Requerido](https://us06web.zoom.us/meeting/register/tZArf--qpzguHtPg_arEuV7WD2L8Btp2pcgE)**: [https://us06web.zoom.us/meeting/register/tZArf--qpzguHtPg_arEuV7WD2L8Btp2pcgE ](https://us06web.zoom.us/meeting/register/tZArf--qpzguHtPg_arEuV7WD2L8Btp2pcgE)"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2023-08-31",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/295075768",
        "timezone": "America/New_York",
        "description": "TBA"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "Introducción a la seguridad de aplicaciones - Edición Agosto 2023",
        "date": "2023-08-29",
        "time": "8:30-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/295521802",
        "timezone": "America/Montevideo",
        "description": "Esta será la reunión de agosto de una serie de reuniones **presenciales**, enfocadas en lo **práctico** y en inspirar a nuevas generaciones y a personas que no están involucradas aún con la comunidad. Se llevará a cabo en el espacio provisto por GeneXus Consulting: [Parque tecnológico del LATU](https://goo.gl/maps/MKpCgvcP6rsWpZ9u6) (Avenida Italia 6201), edificio Los Abetos (cowork), Sala 2. **Ver en los detalles de cómo encontrarnos y la foto con el mapa**.\n\nEs importante destacar que **no se requieren** conocimientos previos en seguridad de aplicaciones para participar. Si bien tener conocimientos de web/frontend/backend ayuda, la idea es aprender en la marcha, así que sin timidez :)\n\nLa dinámica de *esta jornada* será la siguiente:\n\n* Pueden armarse grupos para compartir ideas y ayudarse en los ejercicios.\n\n* Los grupos tendrán desafíos/objetivos comunes basados en el proyecto [OWASP Juice Shop](https://owasp.org/www-project-juice-shop/).\n\n* Cada grupo tendrá **al menos un** **referente/facilitador** disponible, colaborador de la comunidad con experiencia para apoyar en cualquier duda y generar conocimiento, mano a mano.\n\nEl requerimiento para poder participar es **traer tu notebook**, cada asistente tendrá su ambiente de trabajo. Se proporciona a los asistentes una imagen virtual de Kali Linux preconfigurada con las herramientas necesarias para realizar el taller. Se necesita Virtualbox o VMWare para ejecutarla. Si tus recursos no son suficientes tendrás que seguir tutoriales para instalar un proxy de ataque (Burp Suite Community o ZAP Proxy) y Juice Shop (servidor local o con Docker).\n\nLa imagen se puede descargar de acá: [https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/](https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/)\n\nPara quienes usen MacOS con chip M1-M2 y VMWare está esta máquina virtual con Kali Linux, OWASP ZAP y Juice Shop en Docker:\n\n[https://drive.google.com/file/d/1MKrx8efu0L4Bg71Rw8XUUxjqBiVigb8m/](https://drive.google.com/file/d/1MKrx8efu0L4Bg71Rw8XUUxjqBiVigb8m/)\n\nEl usuario y contraseña es \"kali\". En la imagen para MacOS se levanta Juice Shop con el comando \"sudo docker start juice-shop\".\n\nPara aprovechar mejor el tiempo y el ancho de banda se recomienda asistir con todo pronto. Para verificar la estabilidad y acceso al ambiente local se compartirá una presentación (que se mostrará el día del evento) con algunas instrucciones.\n\nA registrarse, **los cupos son limitados** (se pedirá confirmación para dar lugar a quienes estén en lista de espera). ¡Los esperamos!\n\n***NOTA***:\n\n* *Para quienes hayan asistido a jornadas anteriores, pueden seguir con desafíos más complejos.*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "ISACA x OWASP Compliance Challenges in Agile/DevOps Application Development",
        "date": "2023-08-24",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248511",
        "timezone": "America/Vancouver",
        "description": "This month OWASP Vancouver is collaborating with ISACA Vancouver to bring you a unique event that explores the topics at the intersection of governance and compliance and application security.\n\n**Separate registration is required, register here:** [https://www.eventbrite.ca/e/isacaxowasp-challenge-of-compliance-in-modern-agile-app-development-tickets-688152010187](https://www.eventbrite.ca/e/isacaxowasp-challenge-of-compliance-in-modern-agile-app-development-tickets-688152010187)"
    },
    {
        "group": "Yerevan",
        "repo": "www-chapter-yerevan",
        "name": "OWASP August meetup - Samvel Martirosyan, Artur Papyan",
        "date": "2023-08-30",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/owasp-yerevan/events/295461329",
        "timezone": "Asia/Yerevan",
        "description": "OWASP Yerevan August meetup agenda:\n\n1. Introduction of new chapter leaders: Samvel Martirosyan, Samvel Harutyunyan\n\n2. Samvel Martirosyan - Spyware in Armenia. General steps to be protected.\n\n3. Artur Papyan - Pegasus/Predator and other spyware detection with free and paid programs, including MVT, iMazing, iVerify."
    }
]