[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "May 2024 OWASP Austin Security Professionals Happy Hour",
        "date": "2024-05-09",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299656219",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, May 9th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-05-09",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536968",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "Study Group: “What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram",
        "date": "2024-05-02",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/299536962",
        "timezone": "America/Chicago",
        "description": "From: https://owasp.org/www-chapter-austin/studygroups.html\n\nThe Austin OWASP Study Group is currently working on learning the [“What is ChatGPT Doing and Why Does it Work” by Stephen Wolfram](https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/)\n\n> **When:** The study group meets weekly on Thursdays from 12:00 to 1:00 PM\n\n> **Where:** We are looking for a location to meet in-person. Till then study group is held virtually. Either join the specific channel within Slack AustinOWASP (see below) or [OWASP Austin on Meetup](https://www.meetup.com/OWASP-Austin-Chapter/) to obtain details.\n\n> **How to follow:** Status of meetings and discussion of topic will be communicated through the [Slack AustinOWASP](https://austinowasp.slack.com/). Following is the specific channel for collaborating on the topic:\n\n```\n#chat-gpt-wolfram\n```\n\n> **Additional Information:** If any questions related to the study group, please contact the the group coordinator, @griff in the OWASP Austin Slack workplace."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2024 (Online)",
        "date": "2024-04-30",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207001",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nIf you would like to attend in person, please pull a ticket from [Eventbrite ](https://www.eventbrite.com/e/owasp-austin-chapter-monthly-meeting-april-2024-group-2-tickets-882900538277). Please only pull a ticket from Eventbrite if you are planning on attending, as we purchase food for in-person meeting and don't want to waste both donations and food (and canceling a ticket the day of still has food already purchased.)\n\nAgenda:\n11:30-12 -- Room Opens, food is available and in-room discussions\n12-12:05 -- Chapter/OWASP info presentation\n12:05-1 -- Speaker Presentation\n\n**Presentation: The Truman Show: Real-world application attacks instead of canned demos**\nIn this presentation, Kevin Johnson of Secure Ideas will walk attendees through various scenarios used in penetration testing of applications. These demonstrations will use real attacks and discuss how a penetration tester views applications. This talk will explain the mindset of an attacker, using actual applications as well as demonstration apps to allow for exploitation.\n\n**Speaker: Kevin Johnson**"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 27 April 2024",
        "date": "2024-04-27",
        "time": "09:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/300066541",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 27 April 2024 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* CTF Solvings for OSCP Aspirants by **SATHIYANARAYANA S**\n* Firmware diffing to Nday exploits by **IamAlch3mist**\n* Wannacry : Behind The Scenes by **Abhay Naik (Abhay Vox)**\n* Threat Intel by **Ashwin Maganahalli**\n* Shielding Cloud Buckets by **Pradeep Bhat**\n*\n\nNote: The session details, including schedule are available below."
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- The Anatomy of a Breach : Lessons from common mistakes",
        "date": "2024-04-26",
        "time": "17:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/300344553",
        "timezone": "America/Los_Angeles",
        "description": "Hello...Are you ready to dive into world of enterprise security ?. Join us for an exciting Hacker Days, where we'll explore some of the Information Security essential requirements and it's a shared responsibility to protect systems and data. In this workshop, we will play roles of Developer/End-user/Security Engineer and explore various common mistakes which lead to critical security issues. We will also discuss the best practices for preventing such attacks.\n\nThank you very much to Endor Labs for gracious providing us the venue and Levo.ai - the guardians of the API galaxy! for sponsoring the food and drinks.\nThis event is in partnership pacific hackers community https://www.pacifichackers.org/\n\nWorkshop outline:\n\n\\* Overview\n\\- Introduction: Responsibilities of different roles\\.\n\\- Demo application walkthrough: A custom \\.net web application and a mobile app\\.\n\\- Tools: BurpSuite\\, Wireshark\\, ApkTool\n\\* Developer mistakes: Various mistakes done by developers will be explained along with the impact and how to identify and prevent them.\n\\- Hardcoded Secrets\n\\- Login Credentials\n\\- Lack of Awareness\n\\- Security Misconfiguration\n\\* End-user mistakes: As end-users, one can be a victim of cyber attack due to simple mistakes. Let's explore scenarios with live demo.\n\\- Wi\\-Fi Attack\n\\- Offer and Freebies\n\\* Security Engineer mistakes: Security engineers are responsible for detecting vulnerabilities and recommending fixes. But we are also human being and can commit mistakes which can lead to attacks.\n\\- Misusing available tools\n\\- Lack of scoping\n\\- Few OWASP top 10 vulnerability demo\n\\* Closing Note\n\\* Q&A\n\nSpeaker Details:\nName: Sarwar Jahan M\nLinkedin: [https://www.linkedin.com/in/sarwarjahanm/](https://www.linkedin.com/in/sarwarjahanm/)\nBio: Sarwar Jahan is currently working as a Senior Enterprise Security Engineer, who worked at tech giants like Synopsys, Microsoft and Salesforce. He has 10+ years of experience and was ranked among top ethical hackers globally. He is passionate about sharing knowledge with the community and running a non-profit initiative called InfoSecCamp to spread security awareness among people by conducting Boot Camps.("
    },
    {
        "group": "Beja",
        "repo": "www-chapter-beja",
        "name": "0x01 Securing the Web",
        "date": "2024-05-23",
        "time": "14:30+01:00",
        "link": "https://www.meetup.com/owasp-beja-chapter/events/300539527",
        "timezone": "Europe/Lisbon",
        "description": "Securing the Web is the second meetup of OWASP Beja chapter which will be held on May 23rd, 2024, at 14:30 sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**.\n\n**Schedule**\n\n14:30 - **Welcome Notes** by OWASP Beja chapter leadership team\n14:35 - **Purple Team Approach Towards Confluence RCE** by Paulo Viegas\n15:00 - **Newton's Third Law: Static vs. Dynamic Abusers** by Diogo Sousa\n16:00 - **Snacks & Drinks** sponsored by **[Checkmarx](https://checkmarx.com/?utm_source=meetup&utm_medium=sponsorship&utm_campaign=owasp-beja)**\n\n**Talks**\n\n**Purple Team approach towards Confluence RCE**\nby Paulo Viegas, Threat Detection Analyst @ Siemens\n\nTalk about the value of collaboration between the red and blue team with a practical example.\n\n**About the Speaker**\nCurious Blue Teamer with special taste for malware and forensics.\n\n\\-\\-\\-\n\n**Newton's Third Law: Static vs. Dynamic Abusers**\nby Diogo Sousa, Engineering Manager @ Canonical\n\nIf you offer a service on the web, odds are that someone will abuse it. Be it an API, a SaaS, a PaaS, or even a static website, someone somewhere will try to figure out a way to use it to their own needs. In this talk we'll compare measures that are effective against static attackers and how to battle a dynamic attacker who adapts to your counter-measures.\n\n**About the Speaker**\nAn opinionated individual with an interest in cryptography and its intersection with secure software development."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE Chapter Meeting (21/05/2024, Brussels)",
        "date": "2024-05-21",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/300566355",
        "timezone": "Europe/Brussels",
        "description": "On May 21st, we organize our next OWASP Belgium chapter meeting at BeCentral (Brussels), by the courtesy of Proximus-ADA.\n\n**Agenda**:\n\n* 17h30-18h20: Welcome and refreshments\n* 18h20-18h30: **OWASP Update**\n18h30-19h30: **User Privacy in Online Location-Based Services** (by Victor LePochat and Karel Dhondt, KU Leuven-Distrinet)\n19h30-19h45: Break\n19:45-20h45: **SS7 Security** (by Jeremy Schmidt, Proximus ADA)\n21:00: Close\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BE Chapter Meeting (02/05/2024, Antwerp)",
        "date": "2024-05-02",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/300566321",
        "timezone": "Europe/Brussels",
        "description": "On May 2nd, we organize our next OWASP Belgium chapter meeting at [Karel de Grote](https://www.kdg.be/) University of Applied Sciences and Arts (Antwerp).\n\n**Agenda**:\n\n* 17h30-18h20: Welcome and refreshments\n18h20-18h30: **OWASP Update**\n18h30-19h30: **Navigating the Evolving Landscape of Cyber Security Legislation as an IoT Device Manufacturer** (by Joris Gorinsek, NIKO)\n19h30-19h45: Break\n19:45-20h45: **OWASP Cornucopia and Scrum: A strategic approach to introduce threat modeling in an Agile development process** (by Ive Verstappen & Jev Meijvis, DotNET lab)\n21:00: Close\n\nMore info can be found on the Belgium OWASP chapter page at [https://owasp.org/www-chapter-belgium/#div-meetings](https://owasp.org/www-chapter-belgium/#div-meetings) .\nOur chapter meetings are open for everyone, and attendance is free of charge. We ask you to register on Meetup in order to provide you with last-minute updates, if needed."
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Web Security 101: Safeguarding Your Digital Footprint",
        "date": "2024-04-28",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/300502194",
        "timezone": "Asia/Kolkata",
        "description": "Welcome to \"Web Security 101: Safeguarding Your Digital Footprint,\" a comprehensive beginner-level event designed to equip you with the essential knowledge and skills to protect yourself online.\n\nIn today's digital age, our online presence is more significant than ever. From personal information to financial data, we entrust a plethora of sensitive details to the web. However, with the increasing prevalence of cyber threats and malicious actors, it's crucial to fortify our defenses and ensure the safety of our digital footprint.\n\nJoin us for an enlightening journey into the realm of web security, where you'll learn:\n\\- Foundations of Web Security: Understand the basic concepts and principles of web security\\, including common vulnerabilities and attack vectors\\.\n\n* Protecting Your Digital Assets: Discover practical tips and best practices for safeguarding your personal and professional information online.\n* Securing Your Devices and Networks: Learn how to secure your devices, networks, and online accounts against cyber threats, malware, and phishing attacks.\n* Navigating the Cyber Landscape: Gain insights into the evolving cybersecurity landscape and emerging trends, empowering you to stay ahead of potential threats.\n* Interactive Workshops and Demos: Engage in hands-on workshops and live demonstrations that reinforce your learning and provide practical guidance for implementing security measures effectively.\n* Community Engagement: Connect with like-minded individuals, share experiences, and collaborate on strategies for enhancing web security awareness and resilience.\n\nWhether you're a student, professional, or simply a concerned internet user, \"Web Security 101: Safeguarding Your Digital Footprint\" offers a welcoming environment where everyone can learn and thrive.\n\nDon't miss this opportunity to take control of your online security and protect what matters most. Reserve your spot today and embark on a journey towards a safer digital future!"
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Bham Chapter Meetup May 2024!",
        "date": "2024-05-23",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/300370233",
        "timezone": "Europe/London",
        "description": "Welcome from OWASP Birmingham our first Meetup of 2024\n\nOnce again we'll be @Hays at One Colmore Square Thursday 23rd May for two great Infosec talks\n\nWatch this space, more details to come! Looking forward to another oppotunity to connect around Cybersecurity with lots of interesting folks from all over the Midlands"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "OWASP Top 10 for Large Language Model Applications",
        "date": "2024-05-16",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295530895",
        "timezone": "America/New_York",
        "description": "The OWASP Top 10 for Large Language Model Applications project aims to educate developers, designers, architects, managers, and organizations about the potential security risks when deploying and managing Large Language Models (LLMs). The project provides a list of the top 10 most critical vulnerabilities often seen in LLM applications, highlighting their potential impact, ease of exploitation, and prevalence in real-world applications. Examples of vulnerabilities include prompt injections, data leakage, inadequate sandboxing, and unauthorized code execution, among others. The goal is to raise awareness of these vulnerabilities, suggest remediation strategies, and ultimately improve the security posture of LLM applications."
    },
    {
        "group": "Israel",
        "repo": "www-chapter-israel",
        "name": "OWASP IL Meetup - May 2024",
        "date": "2024-05-08",
        "time": "18:00+03:00",
        "link": "https://www.meetup.com/owasp-israel/events/300284832",
        "timezone": "Asia/Jerusalem",
        "description": " OWASP IL  is excited to welcome you to our latest Meetup event! \nPrepare to dive into the world of AppSec with an evening filled with engaging security topics, networking, and of course, plenty of food and drinks.\n\nThis time, we're delighted to have Playtika host our gathering!\n\n====================================================================\n\n**Agenda**:\n 18:00 - 18:30 - gathering and food - We will gather at Playtika's Cafe for drinks, great treats, and mingling.\n\n 18:30 - 18:45 - Keynote + Microphone tuning\n\n 18:45 to 19:30 - Surviving The Jungle of SCA\nRaz Rosh - Product Security Engineer and DevSecOps Expert @ Playtika\nThis presentation is tailored for developers, security professionals, and anyone interested in advancing the security and efficiency of integrating open-source and third-party components into software projects. It will delve into the vital practices of identifying, analyzing, and managing third-party dependencies to mitigate risks and ensure compliance. Attendees will discover how to integrate Software Composition Analysis (SCA) tools into the CI/CD pipeline, address common challenges such as false positives and performance overhead, and deploy strategies to minimize alert noise and prioritize vulnerabilities efficiently. The aim is to streamline the SCA process, making it a seamless component of the development lifecycle and empowering participants to significantly bolster their software security posture. Join us to transform SCA from a daunting task into a manageable and integral part of your DevSecOps practices.\n\n 19:30 to 20:15 \\- Malvertising \\| tactics\\, techniques\\, and procedures \\(TTP\\) implemented in auto redirect attack\nLiran Lavi - Security Research Team Leader @ GeoEdge\nMalvertising, a fresh cyberattack tactic, entails embedding malicious code into digital advertisements. This insidious technique poses challenges for both internet users and publishers, as the infected ads are often spread through reputable advertising networks. Given that ads are visible to all website visitors and often contain many security misconfigurations, virtually every page viewer faces the threat of infection.\n\n 20:15 - 20:45 - Understanding Prompt Injection Attacks in Generative AI\nAviv Avraham Levy - Senior Security Researcher @ F5 Networks\nThis presentation provides an in-depth look at Generative AI and Large Language Models (LLMs), focusing on the mechanics of prompt injection attacks. It highlights various types of prompt injections and showcases real-world scenarios to illustrate how these vulnerabilities can be exploited. The session includes demonstrations of prompt injection attacks in action and concludes with an overview of potential mitigation strategies.\n\n=====================================================================\n\nThis event is hosted by Playtika in collaboration with OWASP Israel.\n\nJoin us at the event physically as we will not include Zoom or remote participation this time."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-05-20",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/299878996",
        "timezone": "America/New_York",
        "description": "An introduction to OWASP's Juice Shop. A vulnerable website built for CTF practice."
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "OWASP KC May Meetup",
        "date": "2024-05-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-kansas-city/events/300496496",
        "timezone": "America/Chicago",
        "description": "TBD"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAY 22, 2024",
        "date": "2024-05-22",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300022938",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Securing Generative AI Applications using the OWASP Top 10 for Large Language Models\nJoin us for dinner+drinks, networking, and see a presentation by **Steve Wilson**, OWASP project leader and Chief Product Officer at **Exabeam**\n\n**ABSTRACT**: What are the new risks that generative AI brings to your environment? In this cutting-edge session, we uncover the potential hazards that Large Language Models (LLMs) introduce to modern application ecosystems. Drawing on the expertise distilled in the OWASP Top 10 for LLMs, we offer a comprehensive roadmap for mitigating these risks. Attendees will gain insights into securing generative AI applications, recognizing the nuances of LLM vulnerabilities, and deploying defenses. This talk is a call to action for developers and security professionals to foster a culture of secure, responsible AI development. Equip yourself with the knowledge to anticipate threats, apply best practices, and build AI systems that are not only intelligent but also resilient in the face of cybersecurity challenges.\n\n**THANKS to OUR SPONSOR**: *[Kodem](https://www.kodemsecurity.com/)*\n*Kodem means “first” or “early” in Hebrew. A priority. We believe in helping appsec teams make security a priority by spotlighting risks that truly matter. We believe in helping developers improve code quality by shifting left and catching issues early. And we believe in making people a priority: our customers, our team, and our partners.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Los Angeles Joint Cyber Mixer",
        "date": "2024-04-30",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/299453895",
        "timezone": "America/Los_Angeles",
        "description": "Join us for our 2nd mixer with participating cybersecurity communities in Southern California, enjoy the beautiful weather, amazing sunset, great conversations, network with your peers, make new friends!\nYou **don'**t have to be a member of any group to participate. Mark your calendars; see you there!!\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring OWASP LA events please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "OWASP Maine: May Meetup (Speaker TBA)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Mark your calendars, for our next meetup! We will be editing this shortly with the speaker info and topic!"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Supply Chain Security with Dan Lorenc, CEO Chainguard",
        "date": "2024-05-22",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/298689779",
        "timezone": "America/Chicago",
        "description": "Join us for an informative and hands-on workshop on securing your software supply-chain. In this event, we will be joined by Dan Lorenc, CEO and founder of Chainguard Inc. We will have food, learning, swag and, of course, networking with other like-minded folks in the area.\n\nNote: This event is organized by the OWASP Nashville Chapter and is open to both OWASP members and non-members. Whether you are already a member or interested in becoming one, we encourage you to attend this event and learn more about the benefits of being part of the OWASP community."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Understanding the Cyber Kill Chain with Elizabeth Stephens",
        "date": "2024-05-01",
        "time": "12:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300316300",
        "timezone": "America/Chicago",
        "description": "This session will delve into the Cyber Kill Chain, a foundational framework for comprehending cyberattacks. We'll explore how attackers operate and empower ourselves to build targeted defenses. While a valuable tool, we'll also discuss the Kill Chain's limitations and the evolving nature of attacker tactics."
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "Meetup OWASP Natal - Análise de um incidente envolvendo o LockBit builder",
        "date": "2024-04-29",
        "time": "21:00-03:00",
        "link": "https://www.meetup.com/owasp-natal-chapter/events/300638055",
        "timezone": "America/Fortaleza",
        "description": "Você está preparado para mergulhar no mundo da cibersegurança e desvendar os segredos por trás de um incidente envolvendo o LockBit Builder? Não perca o evento imperdível do chapter da OWASP Natal!\n\nData: 29 de maio\nHorário: 21h\n\nAprenda com um dos melhores! Junte-se a nós para uma sessão online envolvente e informativa, onde o especialista Cristian Souza irá compartilhar insights valiosos sobre a análise de um incidente envolvendo o LockBit Builder. Esta é uma oportunidade única para expandir seu conhecimento e aprimorar suas habilidades no campo da cibersegurança.\n\nMarque esta data em sua agenda e convide seus colegas e amigos para se juntarem a nós nesta jornada fascinante!\n\nNão perca esta chance de aprimorar suas habilidades e ficar um passo à frente no mundo da segurança cibernética. Esperamos vê-lo lá!"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-05-21",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297780385",
        "timezone": "Pacific/Auckland",
        "description": "We've resumed our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for May will be **A02:2021 - Cryptographic Failures**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "Oslo",
        "repo": "www-chapter-oslo",
        "name": "OWASP Oslo Chapter meetup",
        "date": "2024-04-29",
        "time": "17:00+02:00",
        "link": "https://www.meetup.com/owasp-oslo/events/300368216",
        "timezone": "Europe/Oslo",
        "description": "Big thanks to NAV for sponsoring this event!\n\n* **17:00-17:15 Food**\n* **17:15-18:00 Finding a three 0-day exploit chain in Ivanti EPMM and Ivanti Sentry,** Tor E. Bjørstad and Erlend Leiknes, mnemonic\n* **18:15-19:00 Testing race conditions has never been faster,** Sofia Lindqvist, Binary Security\n\n**Finding a three 0-day exploit chain in Ivanti EPMM and Ivanti Sentry**\nDuring the summer of 2023, a team at mnemonic discovered three 0-day vulnerabilities in Ivanti Endpoint Protection Manager Mobile (EPMM, formerly known as Mobileiron Core) and Ivanti Sentry.\n\n* CVE-2023-35078: authentication bypass in Ivanti EPMM, CVSS 9.8\n* CVE-2023-35081: path traversal / arbitrary file write in Ivanti EPMM, CVSS 7.2\n* CVE-2023-38035: authentication bypass in Ivanti Sentry, CVSS 9.8, allowing command execution as root.\n\nAll three vulnerabilities are listed in CISA's Known Exploited Vulnerabilities catalog, as they are known to have been exploited by threat actors in the wild. Ivanti has also confirmed that the vulnerabilities can be combined in an exploit chain.\nIn this talk we'll take a closer look at what actually happened.\n\n**Speakers**\n\n* **Tor E. Bjørstad** has spent his entire career in security and privacy. For the last decade he has worked as a principal security consultant at mnemonic, based in Oslo. He has mainly focused on software security and security architecture, with a particular interest in society-critical infrastructure. Tor holds a Ph.d. in cryptography from the University of Bergen.\n* **Erlend Leiknes**, a security consultant at mnemonic as, Oslo, spends his days as a penetration tester. His professional motto is that most vulnerabilities are obvious, the endeavor is to look at the right places. Erlend holds a master's degree in technical societal safety from University of Stavanger.\n\n**TESTING RACE CONDITIONS HAS NEVER BEEN FASTER**\n\nHistorically, testing for race condition vulnerabilities in web apps has been a painful ordeal, likely making race conditions an under-explored attack vector. In the summer of 2023, groundbreaking research by James Kettle completely changed the game, suddenly making it much easier for pentesters (and attackers) to test for this type of vulnerability. In this talk I will show how race conditions work, how to test for them and how to protect against them, based off an example vulnerability I found during a recent pentest.\n\n**Speaker**\n\n**Sofia Lindqvist**, security specialist, Binary Security\n\nSofia works as a security specialist at Binary Security. She started her career with a PhD in pure maths, followed by three years at Cisco developing one of their networking OSs. She eventually made her way into security testing, which she has been doing for a year and a half."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "May 2024 Meeting",
        "date": "2024-05-07",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/300506523",
        "timezone": "America/Phoenix",
        "description": "**Topic #1 - GitHub Supply Chain Attack Overview** \\- 5 Minutes\n*In March, Dark Reading reported a [GitHub Supply Chain Attack](https://www.darkreading.com/application-security/github-developers-hit-in-complex-supply-chain-cyberattack). Learn about the GitHub platform, software package dependencies, and the attack techniques in this high level overview.*\n\n**Topic #2 - OWASP Top 10 Web Application Risks Quiz -** 20 Minutes\n*Test your knowledge of the [OWASP Top 10 web application security risks](https://owasp.org/www-project-top-ten)! Compete for a chance to win fabulous prizes (aka candy bars).*\n\n**Cost**\n\nFree!\n\n**OWASP Info**\n\nOWASP is a non-profit dedicated to **application security**. Our meetings are free to attend and you do not need to be a member, nor have any experience with application security. All are welcome!\n\n**Meetings Every Month!**\n\nMeetings occur the first Tuesday of every month. Be sure to join our Meetup page to be notified of future meetings and topics.\n\n**Free Parking**\n\nFree Parking Lot:\n1 N Macdonald St, Mesa, AZ 85201\n[https://downtownmesa.com/parking/green-lot](https://downtownmesa.com/parking/green-lot)\n\nNote that this parking lot is across the street from HeatSync Labs. There are other nearby lots and street parking as well."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "OWASP Maine: May Meetup (Speaker TBA)",
        "date": "2024-05-22",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/300520813",
        "timezone": "America/New_York",
        "description": "Mark your calendars, for our next meetup! We will be editing this shortly with the speaker info and topic!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-05-08",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300238774",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Zero Trust in API Security",
        "date": "2024-05-08",
        "time": "19:00+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/300531477",
        "timezone": "Asia/Singapore",
        "description": "The ultimate goal of Zero-Trust Architecture is to protect an organization’s critical data against advanced threats. However, the current market focus is overly focused on network architecture, overlooking the elephant in the room.\n\nIn a modern application architecture, APIs are the backbone of interconnecting microservices. This means APIs are the most closely related ‘services’ to an organization’s data, which explains why advanced attackers target APIs. In this session, we will explain how the zero-trust concept protects APIs."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - The EU Cyber Resilience Act and why the SBOM is so important",
        "date": "2024-05-21",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/300469641",
        "timezone": "Europe/Stockholm",
        "description": "EU is about to become a market leader in software cybersecurity regulation. With a large set of proposed and active laws, software development will be regulated like never before.\n\nWith the coming EU Cyber Resilience Act (CRA) all software and embedded systems will have to get a CE mark, which is now expanded to include cybersecurity aspects. It’s going to be a huge change and will mean that the manufacturers (and in some cases importers) will get responsibility for the user’s security and will have to provide free security patches for the lifetime of the product. Software developers will have to learn secure coding and the need for cyber security professionals will be very high.\n\nOne of the focus areas is vulnerability management. To keep a product secure during its lifetime, all 3rd party components will have to be monitored and up to date. At the heart of this process is the Software Bill of Materials, SBOM, which is used to monitor for known vulnerabilities in both Open Source and commercial components. The OWASP CycloneDX project fits right in and have been working with various kinds of bill-of-materials for a long time. CycloneDX is in the process of becoming an ECMA standard and thus fits better in to the EU regulation.\n\nIn this talk Olle E. Johansson will introduce the proposed EU CRA legislation and talk about the SBOM with a focus on the toolchain needed to manage vulnerabilities.\n\nWe will start the evening with a mingle at 17:30 followed by a presentation that will start at 18:00. The talk will be around 1 hour long followed by a further mingle/time for questions and answers.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcoming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - Security Game Night @ Detectify",
        "date": "2024-05-02",
        "time": "17:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/300467215",
        "timezone": "Europe/Stockholm",
        "description": "It's board game night, for anyone interested in both board games & security!\n\nThe meetup will start with a mingle with snacks and refreshments at 17:30. The actual gaming will begin at 19:00 and the main presentation will begin at 18:00.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nJoin OWASP Stockholm mailing list to get notified of upcoming events [https://groups.google.com/a/owasp.org/g/stockholm-chapter ](https://groups.google.com/a/owasp.org/g/stockholm-chapter)\n\nJoin our Slack channel on OWASP Slack *[#chapter-stockholm](https://owasp.slack.com/)*"
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "Threat Modelling with Reliable Data",
        "date": "2024-05-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owaspswitzerland/events/299507519",
        "timezone": "Europe/Zurich",
        "description": "Reliable data is inherently critical for application threat models. As threat modelling continues to proliferate across security programs, bad habits in feeding threat models with relevant data is becoming prevalent. This session will explore top 3 mistakes of \"data starvation/ gluttony\" with respect to application threat models and how to achieve a contextualized, balanced data diet.\n\nJoin this OWASP Switzerland event to learn more from Tony about threat modelling and how to make sure you use quality data in doing so."
    },
    {
        "group": "Tunisia",
        "repo": "www-chapter-tunisia",
        "name": "AI: The New Attack Surface and Strategies for Securing It",
        "date": "2024-04-26",
        "time": "20:00+01:00",
        "link": "https://www.meetup.com/owasp-tunis-meetup-group/events/300270789",
        "timezone": "Africa/Tunis",
        "description": "Welcome to OWASP Tunisia\n\nFollow us and Subscribe to our channel https://www.youtube.com/@owasptunisiachapter4108/streams\n\nJoin our OWASP Tunisia Community via Meetup : https://www.meetup.com/owasp-tunis-meetup-group/\n\nAn Exceptional episode with our Honorable guest Speaker ***Jeff Crume*** !\nSave the date 26 April 2024 at 8 pm(UTC+1) !\n\n***Jeff Crume*** *is an IBM Distinguished Engineer and Master Inventor with more than 40 years’ experience in the IT industry. He has a PhD in Cybersecurity and also serves as an Adjunct Professor at NC State University. Jeff’s YouTube videos have been viewed more than 3 million times and he is the author of a book entitled \"Inside Internet Security: What Hackers Don't Want You To Know” as well as a contributing author to the \"Information Security Management Handbook.” He is a member of the inaugural class of the NC State University Computer Science Alumni Hall of Fame and serves on the editorial board for the “Information and Computer Security” research journal. Jeff lived in Beijing on assignment in 2006 and has worked with clients in 50 countries.*\n\n**Topic: *AI: The New Attack Surface and Strategies for Securing It***\n\n**Description:**\nArtificial Intelligence (AI) introduces novel security challenges, including adversarial attacks and model vulnerabilities. This session discusses proactive measures for bolstering AI by securing the data, the model, the usage and the infrastructure. In addition, six different types of AI attacks will be covered in order to provide a better understanding of the threatscape."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Ensuring Application Security Excellence in the Age of AI",
        "date": "2024-05-16",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516396",
        "timezone": "America/Vancouver",
        "description": "**Ensuring Application Security Excellence in the Age of AI** with Michael Argast\n\nIn a time where artificial intelligence (AI) permeates every facet of digital existence, the imperative to ensure application security has reached unprecedented heights. In this talk, Michael Argast, Co-founder and CEO of Kobalt.io will delve into the essential strategies for ensuring application security excellence amidst the pervasive influence of AI. By exploring the intricate interplay between AI and cybersecurity, you will gain insights into how AI augments defensive strategies, mitigates vulnerabilities, and addresses emerging threats within application environments. Through real-world case studies and practical recommendations, this session equips you with the knowledge and tools needed to leverage AI effectively in the face of evolving challenges.\n\n**Michael** is an experienced cybersecurity professional with over 20 years of industry experience. He is the co-founder and CEO of Kobalt.io, a rapidly growing cloud-focused security services provider. Kobalt.io works with over 200 cloud-focused technology companies to help develop their cyber security programs and ensure the security of their organization.\n\nWe would like to thank **Microsoft** for sponsoring this event."
    }
]