[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - Virtual - March",
        "date": "2023-03-28",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/288772567",
        "timezone": "Europe/Copenhagen",
        "description": "More information to come!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - March 2023 (Online)",
        "date": "2023-03-28",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705720",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- Coming Soon\\!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "March Meetup",
        "date": "2023-03-15",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/291777163",
        "timezone": "America/Los_Angeles",
        "description": "Host needs first name, last name and email address to sign you into the building. Please use the link below to register:\nhttps://www.eventbrite.com/e/owasp-march-meetup-tickets-559081837827\n\nSecurity time, The March OWASP Bay Area chapter meetup is sponsored by Atlassian. It will be a great occasion to connect with other security researchers, developers and managers, by discussing all things security, sharing tips and tricks and networking. Enjoy tasty food and great drinks\n\nThe host require everyone to be pre-registered and have to sign a NDA at the event. Your full name and email address will be shared with Atlassian. Please use the link below to register:\n\nhttps://www.eventbrite.com/e/owasp-march-meetup-tickets-559081837827\n\nAgenda\n\n* 5:00 - Check in, grab some food/drinks and network\n* 5:45 - 6.30 - Scoring vulnerabilities with SSVC\n* 6:30 - 7:15 - The 7 Habits of Highly Effective AppSec Programs\n* 7:15 - 8.00 - Mobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project\n* 8:00 - Doors close\n\n**Title**: Scoring vulnerabilities with SSVC\n**Abstract**: Vulnerability scoring at Atlassian. They journey to introduce SSVC (Stakeholder Specific Vulnerability Categorization)\n**Speaker**: Mitchell Johnson has been working as a security engineer at Atlassian for about 3 years. During that time he’s been focusing on vulnerability management and automation. Outside of work he enjoys video games with friends, staying active and listening to music!\n\n**Title:** The 7 Habits of Highly Effective AppSec Programs\n**Description:**\n“Your Habits Determine Your Destiny”\nFor over 30 years the original book, The 7 Habits of Highly Effective People, has helped millions of individuals increase effectiveness in achieving their goals through a series of habits. In this namesake talk, we will discuss the 7 habits of truly effective Application Security teams that help them achieve the desired consequences and accelerate remediation of risks. By following these practical habits, AppSec teams have been able to increase their program’s maturity, achieve higher productivity and execute on critical priorities with laser-like focus.\n\nThis talk is for you if you constantly feel overwhelmed in your AppSec program with too many priorities and unable to make enough progress on remediating critical risks that matter.\n**Speaker:-** Harshil Parikh is a seasoned security leader with experience in building and scaling security teams from the ground up. Having been a CISO and AppSec leader before, recently Harshil switched to the dark side of entrepreneurship and founded Tromzo to solve some of the most painful problems for AppSec / Product Security teams. Additionally, he has been a speaker at AppSec USA, RSA Conference and CSX Europe so this talk should be pretty interesting.\n\n**Title**:\nMobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project\n\n**Abstract**:\nMobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. The Web Rocks… but Mobile Rules - Come join us!\n\n**Presenter**: Brian Reed, Chief Mobility Officer, NowSecure Mobile\nBrian Reed leads the mobile innovation and DevSecOps charge at NowSecure helping orgs deliver high quality secure mobile apps faster. He brings decades of experience in mobile, apps, security, dev, testing and operations helping Fortune 2000 global customers, federal agencies and mobile innovators. Brian is a compelling storyteller, speaker and writer including Droidcon, AllDayDevOps, OWASP, DevOpsWorld, DevOps Days, RSA, Mobile World Congress, FS-ISAC, and more. Brian is a graduate of Duke University."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston March 2023 Meetup - Hybrid Attendance",
        "date": "2023-03-01",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owaspboston/events/291465528",
        "timezone": "America/New_York",
        "description": "This month OWASP Boston will be welcoming Pete Morgan, CSO & Co-founder of Phylum, as our presenter. Pete will be presenting to the group on defending the complete attack surface of the software supply chain. The presentation will include research findings from the Phylum team and their insights on how to counteract them. For more details about Pete and the talk please see the details below.\n\nThis month’s meetup with be a hybrid meeting, feel free to join us in person at the Broad Institute in Cambridge or via Zoom (link provided to all registered attendees ahead of the event).\n\n**Title:** Defending the complete attack surface of the software supply chain\n\n**Abstract:** As attacks have shown, soft targets in the software supply chain are now the path of least resistance for attackers. This session will review the TTPs of recent attacks and areas of software supply chain risk to focus on.\n\n**Speaker:** Pete Morgan, CSO & Co-Founder at Phylum (photo attached)\n\n**Bio:** Pete Morgan is a co-founder and CSO of Phylum. He is a recognized security researcher and entrepreneur with more than 20 years of experience in information security, software development and executive leadership. Pete’s background in offensive security drives his passion for creating and sharing the best defenses against the growing number of software supply chain attacks originating in the open-source ecosystem."
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "OWASP Brisbane - March",
        "date": "2023-03-30",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/291605626",
        "timezone": "Australia/Brisbane",
        "description": "Hi All!\n\nWe are excited to announce the details for our March event, at Thoughtworks Brisbane on the 30th of March!\n\n**Speaker:** Paul McCarty\n\n**Title:** The DevSecOps Playbook - a step-by-step open source guide to building a DevSecOps program for any sized org\n\n**Talk Description:** What is DevSecOps? How do I \"do\" it?\nThere's a lot of hype around DevSecOps right now, and getting two people to agree on exactly what it means can be challenging. Unfortunately, a lot of vendor narrative says it's CI/CD with some security thrown in for good measure, but DevSecOps is a lot more than that!\n\nMy career was changed by the DevOps movement, and I believe that DevSecOps should be built on top of DevOps. What does that mean? Well, what made DevOps so powerful for me in the late 2000s was that it brought together people from different departments to work together. Developers learned more about how to manage the underlying infrastructure, and ops teams learned how to use code to build and manage automation. This was powerful, and I believe we can do the same with DevSecOps: bring security teams into the processes and workflows that DevOps built. At the same time, those security teams will evolve to understand how operations and development teams work.\n\nThis talk will cover my DevSecOps Playbook, which is a step-by-step open-source guide to implementing DevSecOps for any organisation.\nThis Playbook is broken down into 5 distinct areas of domain expertise:\n\n1\\. Development Environment\n2\\. Source Code Management\n3\\. Continuous Integration / Deployment and other Automation\n4\\. Deployment Environments\n5\\. Organisational Functions\n\nThe DevSecOps Playbooks spreads the controls evenly across these 5 domains and highlights that this is a group responsibility. There is also an addendum for compliance frameworks and how they can map to the tasks and controls listed in the Playbook.\n\nIn this talk, I will outline these 5 areas and talk about the different controls and tasks in each. I will also give examples of how to implement a subset of these controls."
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "Can forensic processes thwart the use of portable programmable devices?",
        "date": "2023-03-23",
        "time": "7:30Z",
        "link": "https://www.meetup.com/owasp-cambridge-meetup/events/291932118",
        "timezone": "Europe/London",
        "description": "Hosted by the Cyber Security & Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, & BCS Cybercrime Forensics SG\n\n**Background**\n\nThe BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.\n\nOWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.\n\nThe **Cyber Security and Networking** (**CSN**) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP & the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment. These will be achieved through the investigation of threats posed to information systems and understanding the impact of attacks and creation of cyber-based warning systems which gathering threat intelligence, automate threat detection, alert users and neutralising attacks. For network security we are researching securing the next generation of software defined infrastructures from the application API and control/data plane attacks. Other key work includes Computer forensic analysis, digital evidence crime scenes and evidence visualisation as well as Cyber educational approaches such as developing Capture the Flag (CTF) resources and application security programs.\n\n**Abstract : “How reliable are current forensic processes in combatting the illegal use of portable programmable devices?**\n\nThe teaching of digital forensics must be restricted, by its very nature, as we can’t teach students everything. There is a new threat to best practice that we have encountered in our research, which could lead to a miscarriage of justice, where an innocent person is falsely accused of a crime. In our research, we have found that hardware devices, such as the Rubber Ducky, Bash Bunny and the O.MG cable can be used to commit or facilitate a crime. These devices leave very little forensics evidence on the target device, other than showing that a file was accessed or that an illegal picture was downloaded and viewed.\n\nThe user of the victim machine could easily be wrongly accused of a crime that they know nothing about, and they will not easily be able to prove their innocence. Forensics investigators might look no further than the access times of the file that was altered or the picture that was downloaded and viewed and would not even look for clues that might point to a hardware attack. This paper highlights the difficulties of proving that a hardware attack even took place and shows the lack of awareness amongst digital forensics investigators to this possibility.\n\n**Provisional Agenda**\n\n17:15 - Webinar waiting lobby opens\n17:30 - Start of Presentation\n18:20 – Questions & Answers\n18:30 – Estimated Finish"
    },
    {
        "group": "Curitiba",
        "repo": "www-chapter-curitiba",
        "name": " Visión táctica de las amenazas en América Latina  ",
        "date": "2023-03-03",
        "time": "0:00-03:00",
        "link": "https://www.meetup.com/owasp-curitiba-chapter/events/291774275",
        "timezone": "America/Sao_Paulo",
        "description": "Conocer el modus operandi llevado a cabo por amenazas que ejecutan operaciones en América Latina es vital si tu negocio está allí. Existen muchos grupos que realizan intrusiones de manera indiscriminada contra múltiples sectores. Por ello, ahondaremos a nivel táctico sobre cómo estos grupos (ya sean avanzados o cibercriminales) ejecutan sus operaciones para conseguir sus objetivos finales y cómo podemos detectar algunos de esos comportamientos más repetidos."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP SNOWFROC Conference",
        "date": "2023-03-02",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/denver-owasp/events/290702464",
        "timezone": "America/Denver",
        "description": "SnowFROC 23 is on Thursday March 2nd - all day long. While billed as, \"Denver's premier application security conference\", SnowFROC's presentations and workshops focus on many facets of cybersecurity and over the years, SnowFROC has come to be known for its exceptional value: Hands-on training, excellent food, spectacular networking, great location/venue and professional orchestration.\n\nThis year, our Keynote will be given by Kevin Johnson!\n\nSnowFROC includes breakfast, lunch, presentations, vendor giveaways, a panel discussion and optional hands on training and workshops.\n\nThe location of this event is The Cable Center on the University of Denver campus near I-25 and University.\n\n**YOU MUST REGISTER AT** [https://www.eventbrite.com/e/owasp-2023-snowfroc-tickets-487925687867](https://www.eventbrite.com/e/owasp-2023-snowfroc-tickets-487925687867)\n\n**Our regular meetups are free, but this one-day only event/conference is not free:** Only $75 for the conference which includes breakfast, lunch, afternoon snacks and happy hour. Additional $30 for the hands-on track if desired.\n\nBY FAR THE BEST VALUE for any conference you will attend this year - Start 2023 off right and invest in yourself and your company!\n\nStay up-to-date with the latest information on speakers, sponsors, workshops and more: [https://snowfroc.com](https://snowfroc.com)"
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "Thinking like a Hacker",
        "date": "2023-03-21",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/291889147",
        "timezone": "Europe/London",
        "description": "Hosted by OWASP Suffolk\n\nOver the past few years OWASP Suffolk has been bringing you free events to show you cyber security best practices. We discussed creating strong passwords, patching and backing up, OSINT, API Security, SCA and RASP, and many other subjects. In this event we hope to cement that knowledge by showing you the view from the other side of the fence.\nIn this live interactive demonstration we will show you what a web target looks like from the perspective of an attacker. With the use of a vulnerable target that has not followed security best practices we will show you just how easy it is for an attacker to gain access to your computer, it's data and resources. With each step of the attack we will demonstrate techniques and tools while discussing what could of been done to mitigate each step of the attack.\nBy thinking like a Hacker and seeing your \"defences\" from their point of view we hope to show you how important following cyber security best practices really is.\nAttendees of the OWASP Suffolk Fight Club events will be familiar with the format of this event, except that this will be scripted with interactive Q&A. The vulnerable target will be a virtual machine created for the purpose of learning.\nAgenda:\n\n* OWASP updates\n* Live interactive demonstration of a web attack with Q&A throughout\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\nThis talk will not be recorded."
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Suffolk Fight Club - March 2022",
        "date": "2023-03-14",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/291889105",
        "timezone": "Europe/London",
        "description": "Hosted by OWASP Suffolk\n\nFight Club has no agenda, no slides, no recording, and is 100% unscripted.\nThis month a live attempt of a HTB machine or challenge."
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "Social Engineering & Physical Penetration Testing",
        "date": "2023-03-08",
        "time": "8:30Z",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/291888992",
        "timezone": "Europe/London",
        "description": "OWASP Dorset is delighted to be hosting our first in-person event since January 2020!\n\nTwo seasoned Penetration Testers will walk us through some real life physical penetration test case studies; discussing the vulnerabilities, exploits and possible mitigations and resolutions.\n\nThis will be an in person event and will not be recorded."
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "OWASP IoT Top 10",
        "date": "2023-03-20",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/291802446",
        "timezone": "Asia/Dubai",
        "description": "OWASP Dubai Chapter is announcing an upcoming event about \"OWASP IoT Top 10\"\n\nEveryday, technology gets more helpful yet more complex\nEveryday, we relay more and more on technology and software solutions\nEveryday, new cyber threats and attacks are created and activated.\n\nIn this session, we will discuss:\n\\- The new Era of IoT and how it is changing the daily life of people around the globe\n\\- The top 10 security risks associated with IoT and how IoT is expanding the attack surface according to OWASP guide\n\\- How to mitigate IoT associated security risks to design and build more resilient IoT products\n\nEvent Speaker is [Mahmoud Hussein](https://www.linkedin.com/company/90810901/admin/#), OWASP Dubai Chapter Leader.\n\nEvent is online and Free on Monday, 20th March 2023 @ 9:00am - 11:00am Dubai time.\n\nRegistration is now open on the link below\n\nJoin our meetup group to keep up with all updates and events.\n\n**#IoT** **#security** **#design** **#events** **#software** **#cybersecurity** **#technology** **#cyber** **#business** **#business** **#dubai** **#safety** **#event**"
    },
    {
        "group": "Dublin",
        "repo": "www-chapter-dublin",
        "name": "OWASP Dublin Chapter Meetup - Threats, Tracking and Tools",
        "date": "2023-03-09",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-dublin/events/291823310",
        "timezone": "Europe/Dublin",
        "description": "**OWASP Dublin is happy to announce our next meetup hosted by Workday.**\n\nThis meetup promises to cover some interesting topics about how to detect, respond and mitigate active cyber attacks in warzones and we will also cover the power of automated malware analysis. Further details can be found below.\n\nThere will be refreshments available on the night.\n\n**Speaker One:** Gavin O'Gorman - Microsoft's Threat Intelligence Center (MSTIC) & The war in Ukraine\n\nGavin is a principal intelligence analyst in the Signals team, a part of Microsoft's Threat Intelligence Center (MSTIC). His current role is to work with intelligence analysts in MSTIC, and engineers on the Signals team, to help build systems and automation that enable analysts to track more malicious actors, faster. Prior to working in Microsoft, Gavin spent 13 years in Symantec, working as a reverse engineer, incident handler, intelligence analyst and manager of the Attack Investigations Team. He has tracked and authored reports on actors operating across the world, including both government and corporate espionage, and e-crime. Gavin also lectures the Advanced Malware course in UCD's MSc in Forensic Computing and Cybercrime.\"\n\n**Topic: MSTIC & The war in Ukraine**\n\nPrior to and during the war in Ukraine, MSTIC tracked multiple Russian actors engaging in offensive cyber operations against Ukraine. MSTIC has attributed these actors back to Russian entities such as the SVR, GRU and FSB.\nIn this talk, we'll review the types of attacks that MSTIC identified being performed against Ukraine. How does one identify the right person to prevent a cyber attack against an organisation physically located in an active warzone? We'll show how Microsoft worked with Ukrainian individuals and organisations to help mitigate attacks, including techniques that Microsoft would apply for the first time.\n\n**Speaker Two:** Oliver Ciappara- Automating Malware Analysis\n\nOliver is a Senior Malware Analysis Developer at Microsoft's Threat Intelligence Center (MSTIC). Oliver's primary focus is to automate and streamline file analysis within Microsoft.\n\nThe tools that Oliver is putting in place enable rapid analysis and triage of malware. This rapid analysis allows threat intelligence teams to track actor activity by extracting relevant indicators and context, as well as help protect Microsoft's customers.\n\nBefore joining Microsoft, Oliver developed software for embedded systems as well as cybersecurity products. Having recently completed a Master's in Law from UCC, specialising in Cybercrime and E-Law, he has a unique combination of technical and legal expertise.\"\n\n**Topic: Automating Malware Analysis**\n\nDiscover the power of Automated Malware Analysis with Assemblyline. Developed by the Canadian Centre for Cyber Security, Assemblyline is a cutting-edge open-source solution for automating malware analysis. With its modular and scalable architecture, Assemblyline efficiently processes and aggregates information from various analysers, while also centralizing analysis tools used by different teams. Automated malware analysis lowers the bar and enables TIs to continue their work as quickly as possible, while also freeing up REs to do the more important work. Join us and get a first-hand look at assemblyline and its capabilities.\n\n**Thank you to our speakers for the evening and also to Workday for hosting us. Without the support of the community we would not be able to run these meetups.**"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Mars 2023",
        "date": "2023-03-15",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/291931623",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **Le Bon Coin** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\nLightning Talks:\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\nWorkshop:\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Istanbul",
        "repo": "www-chapter-istanbul",
        "name": "OWASP - Hacking Meeting",
        "date": "2023-03-04",
        "time": "2:00+03:00",
        "link": "https://www.meetup.com/owaspistanbul/events/291863208",
        "timezone": "Europe/Istanbul",
        "description": "Merhaba,\nprogramda hacking üzerine konuşacağız. Sizlerin neler yaptığı, hangi alanlara ilgi duyduğu güvenli yazılım veya hacking anlamında neleri kovaladığınızı konuşacağımız, kahve içip keyifli vakit geçireceğimiz bir etkinlik olacaktır. Bilgisayarınızı getirirseniz daha verimli geçecektir.\nGörüşmek üzere."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-03-13",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/291093616",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "OWASP March Event",
        "date": "2023-03-17",
        "time": "9:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/291537674",
        "timezone": "Asia/Karachi",
        "description": "TBD"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - MAR 22, 2023",
        "date": "2023-03-22",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/291304796",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Mobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project\nJoin us for great networking, dinner and drinks, and see a presentation by Brian Reed, Chief Mobility Officer, NowSecure Mobile\n\n**ABSTRACT**: Mobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. The Web Rocks… but Mobile Rules - Come join us!\n\n**Thanks to our Sponsor**: NowSecure\n\n*Vendors interested in sponsoring send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Manchester",
        "repo": "www-chapter-manchester",
        "name": "Proactive Security - How do you prevent vulnerabilities",
        "date": "2023-03-07",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-manchester-uk-chapter/events/291657572",
        "timezone": "Europe/London",
        "description": "Hello & Welcome\n\nIn this session we'll be discussing Proactive Security. Meaning, how do you empower and enable engineering teams to own their own security to prevent the release of vulnerable code... what would secure coding practices look like, what is security by design, what security testing can teams do during the test & release process. More importantly, what can we put in place to really make the security teams work for their money\n\n**6:00 - Open doors**\n**6:45 - Robin Fewster: Threat modelling**\nDrawing on some client experiences, Robin will discuss different threat modelling approaches and tools available, and how they went down with development teams.\n\n**7:30 - Refreshments**\n**8:00 - Second talk**\n\n**8:45 - Networking**\n**9:00 - Vacate venue -> to the pub for more socialising**\n\n**Robin Fewster**\nRobin has 20 years experience in cyber security, and is particularly interested in helping companies to improve their security posture. A current area of focus is to assist software development teams with improving their secure software development practices. This includes work ranging from implementing security strategy, security champions programmes and threat modeling. Robin is also a former OWASP Newcastle chapter leader\n\nWe'd like to say THANK YOU to the companies who helped make this event possible\nBarlcays DiSH - Thank you so much for sponsoring the venue\nBeyondTrust - Thank you so much for sponsoring the food & drink\nCytix - Special thanks for making introductions\n\nAre you passionate about a security topic?\nDo you want to speak at a future event?\nSubmit your interest here - https://forms.gle/zcm9bVNhgDixe8Gq5\n\nDoes your company want to sponsor a venue and/or refreshments?\nEmail Paul - paul.johnston@owasp.org"
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "March virtual meet: Application Security Considerations in Offensive Operations",
        "date": "2023-03-17",
        "time": "4:00-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/291851101",
        "timezone": "America/Chicago",
        "description": "**Application Security Considerations in Offensive Operations**\n\nThis technical talk will be about Tactics, Techniques, and Procedures (TTPs) employed during Red Team engagements. Special focus will be given to lateral movement and persistence tactics. May also include some observations about different schools of red teaming behavior/philosophy. As always, come with your questions!\n\n*Due to the potentially sensitive nature of red teaming, the speaker will remain anonymous by request, and the talk will not be recorded.*\n\nApproximate agenda (U.S. Central Time):\n2:00 - Socializing/connecting, OWASP announcements\n2:15 - Presentation:\n\n* Employing OSint\n* Breaching the perimeter\n* Moving/pivoting around\n* Finding interesting things\n* Covering footprints"
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai Online Meetup | 18th March 2023",
        "date": "2023-03-18",
        "time": "2:00+05:30",
        "link": "https://www.meetup.com/owasp-mumbai-chapter/events/291680287",
        "timezone": "Asia/Kolkata",
        "description": "Session Details:\nIntroduction to OWASP Mumbai\n\nHow to build an efficient security automation strategy and teams for your organization? **With Prashasth Baliga**\n\nQnA and FeedBack\n\n**Synopsis:**\nThe focus of a security automation strategy is on implementing automated tools and processes to enhance the effectiveness and efficiency of an organization's security operations. The strategy covers several key steps, including identifying security risks and vulnerabilities, evaluating current security operations, setting clear automation goals, selecting the appropriate tools, implementing and testing them, continuously monitoring and improving, training the team, and ensuring compliance with regulations. With security automation, organizations have seen benefits such as improved efficiency and scalability, faster threat detection and response, cost savings, and better decision-making."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "March 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-03-16",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/291470656",
        "timezone": "Europe/Amsterdam",
        "description": "**Delegates may be asked to provide a valid proof of photo ID (such as a driving licence or passport) to enter the venue.**\n\nThis meetup's sponsor, Adyen - a financial services institution - works within a highly regulated environment, so we kindly ask for your understanding if you are asked to provide ID during your visit.\n\n**Location:** Adyen\n**Address:** Rokin 49, Amsterdam\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Crash course on the OWASP API Security Top 10** by **Colin Domoney**\n20:00 - 20:15- **Break with drinks**\n20:15 - 21:00 - **Managing APIs securely** by **Rob Blaauboer**\n\n**Crash course on the OWASP API Security Top 10**\n*Abstract:*\nWith the recent breaches to Optus, Twitter, and T-Mobile, 2023 is destined to become the year API security becomes the number one concern for organizations, both at the board level and within security and development teams. API security poses unique challenges to builders and defenders, and many of your existing detection and protection measures may prove to be ineffective.\n\nJoin Colin as he draws on his experience from curating the industry's biggest API security resource (APISecurity.io) in exploring the following:\nCrash course on the OWASP API Security Top 10 (and how it differs from the OWASP Top 10)\nA whistle-stop tour of some of the biggest API breaches over the past 18 months, taking a look at what went wrong, the impact, and most importantly, how to prevent such attacks.\nFinally, he will present the top techniques for protecting your APIs from attack, starting with secure development practices through to API protection and threat detection.\n\nThe content will be technical, with demos and code samples, and based on real-world breaches. By the end of the session, you will have an understanding of the API Security Top 10, and have a working knowledge of how to protect your APIs, either at a code level or using runtime protections.\n*Bio:*\nColin has a long and varied career in producing secure, rugged, and trustable software and hardware products covering a range of industries from military, consumer, medical, automotive to financial services. In the last decade, he has become a sought-after evangelist and consultant in building AppSec programs, and the latest developments in DevSecOps. His greatest passion is for teaching and inspiring others to produce software we can trust, either delivering webinars, in-person events or speaking to the C-level.\n\nCurrently, he is the Chief Technology Evangelist with 42Crunch, the curator of the APISecurity.io newsletter, and is writing the industry’s first book on defending APIs.\n\n**Managing APIs securely**\n*Abstract:*\nWhen an organization offers an API, the API needs to become a Managed API. This means that lifecycle management, security, and throttling resources become an important aspect of API Management, as well as the ability of developers to find, explore and subscribe to the API to use them.\n\nDuring the presentation, Rob will zoom into these aspects and how an API Manager can help you with security and throttling (including schema validation and advanced scenarios) while at the same time making the API easily available to your target developers (inside or outside the organization).\n\nIn the second part, he will elaborate on the “shiny frontend / dirty backend”. This is an API frontend that accesses legacy systems, databases, but also the integration of a set of APIs etc., thus enabling services that use older technology or proprietary interfaces to have a modern appearance to the outside world, e.g. exposing a legacy insurance policy administration system as an API.\n\nThirdly, we will look at the way you can implement the Mastodon API. Since Elon Musk acquired Twitter l ast year, alternative platforms like Mastodon have become more popular. It might be that this becomes a viable channel to communicate with clients for some organizations.\n*Bio:*\nRob has 30 years of experience in IT in such roles as developer, analyst, project manager, business consultant, and management consultant. He is currently Head of Training Services and Integration Consultant at Yenlo, responsible for the development and the actual training of Yenlo’s clients and consultants.\n\nNext to these responsibilities, Rob is also an avid blogger with almost 200 blogs on innovation on Frankwatching, more than 150 blogs on WSO2 on Yenlo’s website and many other blogs on various other sites. Rob is also a regular contributor to BNR Zaken Doen radio show on the area of technology and innovation.\n\n**Delegates may be asked to provide a valid proof of photo ID (such as a driving licence or passport) to enter the venue.**"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-03-14",
        "time": "8:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291645592",
        "timezone": "Pacific/Auckland",
        "description": "The Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for March will be **A06:2021 - Vulnerable and Outdated Components.**\n\n**Technical Topic Speaker:** Ruskin Dantra, AWS\n**Talk Title:** Networking Security for Application Developers\n**Synopsis:**\nMicroservices are an integral part of modern application development. As we increasingly adopt distributed services, securing communication between them is crucial.\nIn this talk, you will discover how to strengthen your application network security at multiple layers and achieve continuous compliance visibility. By implementing these practices, you can mitigate potential security risks and ensure the safety and privacy of your users' data.\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Mobile Rules the World - Jump into Mobile AppSec with the OWASP MAS Project",
        "date": "2023-03-23",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-oc/events/291353134",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: IN-PERSON EVENT**\n\n**Abstract:**\nMobile apps dominate all digital time spent online - but mobile AppSec programs often lag. Jumpstart your team and skills by stepping inside the OWASP Mobile AppSec Project (MAS) to learn about the fundamentals of mobile app security and the latest updates just released in OWASP MASVS V2 launched at OWASP Global AppSec in Dublin. Learn the differences in Mobile AppSec vs Web AppSec and how to put OWASP MAS project, tools and resources to work.\n\nIn this session we will drill down into the top 5 most frequent security issues found in testing thousands of mobile apps. Learn how to test for them, and how to teach your dev teams to prevent them with code examples, test examples, links to additional resources and how to build your own toolkit. Along the way we will hit the latest privacy and security updates with iOS and Android. The Web Rocks… but Mobile Rules - Come join us!\n\n### **Code of Conduct**\n\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n### **Sponsorship**\n\nVendors who are interested in sponsoring OWASP OC monthly meetings, please send an email to [orange-county-leaders@owasp.org](http://orange-county-leaders@owasp.org)"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa March 2023: Building Security Champions with Tanya Janca",
        "date": "2023-03-15",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/291889562",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\n**Health Notice:**\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/channel/UCxSU-KvNmYusZEq6v4YK5Lw). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\nYouTube Live Stream Link:\nhttps://www.youtube.com/watch?v=WqzWVkCAhcQ\n\n**6:00 PM EDT** Arrival, setup, mingle\n**6:30 PM EDT** Technical Talks\n\n**Building Security Champions: How to make a security champions program work.**\nAbstract:\nWith security teams being vastly outnumbered many organizations have responded to this challenge with different program scaling methods, including building security champions programs. Which leads us to questions; How does a security champions program work? How do you select your champions? And once you have them, what do you DO with them?\n\nRecipe for success; recruit, engage, teach, recognize, reward, don’t stop.\n\nSpeaker Bio:\nTanya Janca, also known as [SheHacksPurple](https://shehackspurple.ca/), is the best-selling author of ‘[Alice and Bob Learn Application Security](https://aliceandboblearn.com/)’. She is also the founder of We Hack Purple, an online learning community that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years, won countless awards, and has been everywhere from public service to tech giants, writing software, leading communities, founding companies and ‘securing all the things’. She is an award-winning public speaker, active blogger & podcaster and has delivered hundreds of talks on 6 continents. She values diversity, inclusion, and kindness, which shines through in her countless initiatives.\n\nAdvisor: [Nord VPN](https://nordvpn.com/), Cloud Defense, Aiya Corp\nFaculty: IANs Research\nFounder: [We Hack Purple](https://wehackpurple.com/), [OWASP DevSlop](https://www.youtube.com/owasp_devslop), [#CyberMentoringMonday](https://twitter.com/search?q=%23cybermentoringmonday&src=typed_query&f=live), [WoSEC](https://www.womenofsecurity.com)"
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Meeting in Krakow - 1 Mar 2023",
        "date": "2023-03-01",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-poland/events/291510346",
        "timezone": "Europe/Warsaw",
        "description": "Hi,\n[OWASP](https://owasp.org/) is a worldwide, non-profit organisation focused on application security issues and we are Polish chapter of this initiative.\n\nStarting from this meeting, we are changing our usual agenda a little bit, to give an opportunity to raise more subjects and to have more diverse discussions.\nWe will have one bigger (30 min) presentation and 3-4 shorter \"lightning talks\" with discussion. **If you want to have lightning talk** please let us know in advance by [filling the form](https://forms.gle/7JFiD3z2tKifogvs5). This will help us to plan the meeting.\n\nAgenda:\n\n1. [OWASP Cheat Sheets Series Project](https://cheatsheetseries.owasp.org/). Kuba Maćkowski - project co-leader will introduce you to the project idea and how security cheat sheets could be useful for your daily work - no mater if you are developer, architect or security tester. (about 30 min + discussion)\n2. After the break we will have series of short lightning talks with discussion (typical format is 5-10 minute talk followed by 5-10 minute discussion). [Please submit your proposals](https://forms.gle/7JFiD3z2tKifogvs5)!\nCurrent queue:\n\n* Web3, Authentication and Search Engine Optimization (Szymon Chadam)\n* Obfuscating C&C servers with redirectors (Bartosz Klinowski)\n* BSides Krakow announcement\n* OWASP Poland Day announcement\n* **(a place for you )**\n\n3. Job announcements. If you are an employer, there will be a chance to present who you are looking for.\n\nPlease RSVP and save the date!\nIf you have a minute, **please share this link** with friends and in social media."
    },
    {
        "group": "Recife",
        "repo": "www-chapter-recife",
        "name": "OWASP Tempest Tech Sessions",
        "date": "2023-03-16",
        "time": "9:30-03:00",
        "link": "https://www.meetup.com/owasp-recife-meetup-group/events/291617162",
        "timezone": "America/Recife",
        "description": "O OWASP Recife em conjunto com a Tempest Security Intelligence tem muita alegria em divulgar o terceiro OWASP Tempest Tech Sessions!\n\nO evento é híbrido (presencial + remoto). Corram porque as vagas presenciais são limitadas. Contudo, quem não puder participar presencialmente haverá a opção de participar na modalidade remota através da plataforma Zoom, as vagas para essa modalidade serão ilimitadas.\n\n**TODAS AS INSCRIÇÕES DEVEM SE REALIZADAS ATRAVÉS DA PLATAFORMA EVENT3:**\n[https://www.even3.com.br/tempest-tech-sessions-pos-exploracao/](https://www.even3.com.br/tempest-tech-sessions-pos-exploracao/)\n\nVocê deverá escolher se sua participação será **presencial** ou **remota**.\n\n**Palestra:** Do Cobalt Strike ao Sliver: um panorama sobre as principais ferramentas de pós-exploração usadas por cibercriminosos\n\n**Resumo:** O que os adversários fazem depois de invadir e explorar um sistema? Nessa palestra vamos discutir sobre as principais ferramentas de pós exploração usadas atualmente, abordando também as fases de um ataque com base em frameworks como Cyber Kill Chain e Mitre ATT&CK, o funcionamento de um servidor de comando e controle e as principais estratégias de defesa e detecção.\n\n**Palestrantes:** Wanessa Souza\n**Shortbio:** Wanessa é Analista de Segurança Senior na Tempest, atuando no time de Cyber Threat Intelligence há 5 anos. Com uma paixão a parte pela escrita criativa, Wanessa também é poetisa, astrônoma amadora e ama trocar uma idéia sobre tecnologia, robótica e viagens no tempo.\n**Formato da palestra:** Híbridro - Presencial (com apenas 30 vagas limitadas) e Online, através da plataforma Zoom. O link de acesso à palestra constará aqui na plataforma Even3 e também será enviado para o seu e-mail cadastrado no momento da inscrição.\n\n**Certificado de Participação:** A palestra confere certificado de 2 horas.\nEnviaremos para o seu e-mail em até 48h úteis após a palestra. Para que o certificado seja aceito como horas complementares em sua Instituição de Ensino, é importante que preencha o seu nome completo no momento da inscrição.\n\nEsperamos você na nossa palestra! Até lá!"
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Proactive vs. Reactive AppSec",
        "date": "2023-03-02",
        "time": "7:30-08:00",
        "link": "https://www.meetup.com/santa-barbara-owasp-chapter/events/291688284",
        "timezone": "America/Los_Angeles",
        "description": "OWASP SB and GitHub have joined forces to bring you the first security meetup of the year in beautiful Santa Barbara. Come join the local AppSec/InfoSec community for a great evening of technical talks and mindful networking. Dinner will be provided.\n\n**Event Agenda**\n05.30pm -- Event kickoff, with dinner and networking.\n06.00pm -- Announcements, by W. Martín Villalba (OWASP SB).\n06.15pm -- Intro to GitHub Advanced Security, by Levy Forchheimer (GitHub).\n06.30pm -- Proactive vs. Reactive AppSec, by Ravi Gadhia (GitHub).\n07.30pm -- BYOT / Networking.\n08.30pm -- Event end.\n\n**Proactive vs. Reactive AppSec - Abstract**\nMost security findings are discovered after the code has been committed to your main branch. Meaning they will be part of your security tech debt that often takes months to fix. In this talk, learn how you can shift your security approach from reactive to proactive and prevent security weaknesses from ever making it into your code.\n\n**Ravi Gadhia - Bio**\nRavi Gadhia is a technologist who began his career as a chip designer and found his way to customer-facing roles in the software industry. His primary areas of expertise are in software development, collaboration tools, and cloud native platforms. Ravi is currently Director of a Solutions Engineering at GitHub where he leads a technical sales team in the Western US.\n\n**Levy Forchheimer - Bio**\nLevy Forchheimer is an Enterprise Account Executive at GitHub. He's been in AppSec for nearly a decade and his expertise spans DevOps, SCA and Secret Management.\n\n**BYOT: Bring Your Own Topic**\nThis meeting is a great chance to ask for technical help, career advice, share new ideas, look for feedback, and discuss anything related to AppSec/InfoSec.\n\n**Location**\nKiva Cowork - Funk Zone, 10 E Yanonali St, Santa Barbara, CA. The front door will be kept open for the duration of the event. If you have any trouble getting in, please do not leave, just knock on the front/side doors and/or message us through this platform.\n\nLooking forward to seeing you all!\n\nMartín\nOWASP SB Leader"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-03-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/291660918",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "OWASP South Florida Chapter Meeting March 2023",
        "date": "2023-03-22",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/291822447",
        "timezone": "America/New_York",
        "description": "We will be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.\n\nPlease join us virtually for our March 2023 Meeting. Once again we are starting the year with the Owasp Top 10!\n\nBYOB - Bring Your Own Beverage\n\nAgenda\n===\n\n+Chapter updates/announcements, etc.\n\n* The Owasp Top 10 2021 Demystified\n\nThis is a fast paced and and hands-on security training session to go over the 2021 Owasp Top 10. This will cover the following:\n\n* Understand the latest OWASP Top 10 and the differences between the 2021 and the 2017 Top 10\n* Find and fix security issues\n* Understand how to defend against these risks\n* Think defensively while developing applications\n* Demos of attacks and defense techniques will be provided.\n\nMake sure you don’t miss this session!\n\nBio: Rohini Sulatycki is a passionate and innovative security leader with a proven track record in setting up application and network security programs. Is considered a thought leader in the field and has presented on topics related to application security, cloud security and automation at conferences including Blackhat, AppSec EU and BSides. Strong leadership skills are combined with an extensive background in application design and development, cloud security, IaC security, container security, Blockchain security, DAPP development, penetration testing (application, network, mobile, client-server), security assessments of systems, mobile devices, networks, virtualization platforms, middleware platforms, databases, and applications. Expertise in security code reviews and secure development training. Serves as the current chapter lead for OWASP South Florida and founder of a South Florida based Blockchain/DAPP meetup."
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "DDoS attacks against Sweden - what happened and what we can do about it",
        "date": "2023-03-02",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/291849850",
        "timezone": "Europe/Stockholm",
        "description": "During the month of February social media accounts have repeatedly threatened Sweden with cyberattacks. The threats realized in the form of Distributed Denial-of-service attacks, a type of attack aiming at disrupting normal operations and availability of online services and websites. As a result, several Swedish websites were affected, but thankfully not nation-critical services.\n\nDDoS attacks are on the rise on a global scale. They are used by organized crime to blackmail organizations, as well as nation state actors to attack infrastructure of other countries, often opportunistically under the cover of political events.\n\nFor this event we get together to discuss what happened, but more importantly what we can do to protect the organizations we work for against DDoS attacks.\n\nThe event will be held using huddle in Slack so make sure to join the channel “chapter-stockholm”."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "Thinking like a Hacker",
        "date": "2023-03-21",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291864159",
        "timezone": "Europe/London",
        "description": "Over the past few years OWASP Suffolk has been bringing you free events to show you cyber security best practices. We discussed creating strong passwords, patching and backing up, OSINT, API Security, SCA and RASP, and many other subjects. In this event we hope to cement that knowledge by showing you the view from the other side of the fence.\n\nIn this live interactive demonstration we will show you what a web target looks like from the perspective of an attacker. With the use of a vulnerable target that has not followed security best practices we will show you just how easy it is for an attacker to gain access to your computer, it's data and resources. With each step of the attack we will demonstrate techniques and tools while discussing what could of been done to mitigate each step of the attack.\n\nBy thinking like a Hacker and seeing your \"defences\" from their point of view we hope to show you how important following cyber security best practices really is.\n\nAttendees of the OWASP Suffolk Fight Club events will be familiar with the format of this event, except that this will be scripted with interactive Q&A. The vulnerable target will be a virtual machine created for the purpose of learning.\n\nAgenda:\n\n* OWASP updates\n* Live interactive demonstration of a web attack with Q&A throughout\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nThis talk will not be recorded."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - March 2023",
        "date": "2023-03-14",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291863652",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Threathunting Okta with Elastic",
        "date": "2023-03-15",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/291841528",
        "timezone": "America/New_York",
        "description": "Event details to follow."
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Chapter Re-organizational Meeting",
        "date": "2023-03-08",
        "time": "0:00-05:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/291793005",
        "timezone": "America/New_York",
        "description": "We are re-organizing the SYR OWASP Chapter and have an open position for a co-leader.\n\nPlease come if you want to learn more about our chapter and set the direction for 2023!"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Introducing the OWASP Top Ten for Kubernetes",
        "date": "2023-03-23",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/291842782",
        "timezone": "America/New_York",
        "description": "Given the growth and adoption of Kubernetes, a number of projects have been published in the OWASP community to help practitioners assess and secure the security of their containerized infrastructure including the recently released Top Ten for Kubernetes ([https://owasp.org/www-project-kubernetes-top-ten/](https://owasp.org/www-project-kubernetes-top-ten/)). This OSS project is a community-curated list of the most common Kubernetes risks backed by data collected from organizations varying in maturity and complexity. This session will discuss the project in detail, examples for each of the risks in the list, and how you can get involved."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Tracing webapp exploitability through code review and taint analysis",
        "date": "2023-03-16",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248491",
        "timezone": "America/Vancouver",
        "description": "**Title**: Tracing webapp exploitability through code review and taint analysis\n**Speaker**: Dana Epp\n\nCome learn how to look at your web apps and APIs more offensively to discover the exploitability of your code before your adversaries do.\n\nThis event is sponsored by **Forward Security** \\- thanks for providing us space and food\\."
    },
    {
        "group": "Waterloo",
        "repo": "www-chapter-waterloo",
        "name": "OWASP Waterloo - An Invalid JWT Test Case",
        "date": "2023-03-03",
        "time": "0:30-05:00",
        "link": "https://www.meetup.com/owasp-waterloo-meetup-group/events/291912145",
        "timezone": "America/Toronto",
        "description": "Welcome to OWASP Waterloo\n\nWe are excited to meet everyone for our first OWASP waterloo meetup of 2023; we will begin with an introduction, a presentation, and a discussion.\n\n**Topic:** An invalid JWT test case.\n\n**Summary:** While testing for JWT tokens-related vulnerability, Ashutosh stumbled upon a strange behavior that pushed him to dive deeper and understand how it was happening. The ideal established flow says that if we changed even a single character in our JWT, the request should not pass through, which it doesn't. But it passes through if the change is done at a specific position in the token.\n\nConceptually it appears to be a valid test case because it's a tampering of the token. But the catch is it's not valid test case, and this talk is about that why this is not a valid test case.\n\n**Where:** https://us06web.zoom.us/j/87352968700?pwd=YmE0cWdhQWNxNmo4cEZrbHpidmlhdz09"
    }
]