[
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Detox - Second Session",
        "date": "2021-06-19",
        "time": "18:00",
        "link": "https://www.meetup.com/Morocco-OWASP-Meetup-Group/events/278232659/",
        "timezone": "Africa/Casablanca",
        "description": "<p>DevSecOps detox - Second Session</p> <p>C'est la suite de la session du 15 mai 2021.</p> <p>Je vais terminer la présentation des axes nécessaires pour mettre en œuvre une démarche de sécurité applicative, en mettant en œuvre une pipe-line DevSecOps, et vous montrer une démo DevSecOps.</p> <p>La conférence durera deux heures le samedi 19 juin 2021 de 18h00 à 20h00 heure GMT.</p> <p>Le lien est :</p> <p><a href=\"https://meet.google.com/qcy-pewf-tzq\" class=\"linkified\">https://meet.google.com/qcy-pewf-tzq</a></p> <p>Plus de détail dans notre site www.owasp.org, Morocco Chapter : <a href=\"https://owasp.org/www-chapter-morocco/\" class=\"linkified\">https://owasp.org/www-chapter-morocco/</a></p> <p>#devsecops #appsec #africa #morocco #owasp #cybersecurity</p> "
    },
    {
        "group": "Bolivia",
        "repo": "www-chapter-bolivia",
        "name": "OWASP DAY ONLINE NRO - 2 - 2021",
        "date": "2021-05-29",
        "time": "17:00",
        "link": "https://www.meetup.com/OWASP-Bolivia-Meetup-Group/events/278176082/",
        "timezone": "America/La_Paz",
        "description": "<p>El capítulo OWASP CHAPTER BOLIVIA, invita a todos los entusiastas, investigadores y analistas de ciberseguridad, a la segunda reunión para trata temas sobre lineamientos enfocados al OWASP TOP 10.</p> "
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "EXPLIoT - Internet of Things Security Testing and Exploitation framework",
        "date": "2021-06-04",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/278148208/",
        "timezone": "Asia/Jakarta",
        "description": "<p>Topic : EXPLIoT - Internet of Things Security Testing and Exploitation framework</p> <p>Abtract ;<br/>A Framework for security testing and exploiting IoT products and IoT infrastructure. It provides a set of plugins (test cases) which are used to perform the assessment and can be extended easily with new ones.</p> <p>The name EXPLIoT (pronounced expl-aa-yo-tee) is a pun on the word exploit and explains the purpose of the framework i.e. IoT exploitation.</p> <p>Short Bio :<br/>Aseem Jakhar</p> <p>Aseem Jakhar is the Director, research at Payatu Software Labs <a href=\"http://payatu.com\" class=\"linkified\">http://payatu.com</a> a boutique security testing company specializing in IoT, Embedded, cloud, mobile security testing. He is the founder of null-The open security community, registered not-for-profit organization <a href=\"http://null.co.in\" class=\"linkified\">http://null.co.in</a> and also the founder of nullcon security conference <a href=\"http://nullcon.net\" class=\"linkified\">http://nullcon.net</a> and hardwear.io security conference. He has worked on various security software including UTM appliances, messaging/security appliances, anti-spam engine, anti-virus software, bayesian engine to name a few. He currently spends his time researching on IoT security and hacking things. He is an active speaker and trainer at security conferences like AusCERT, Black Hat, Brucon, Defcon, Hack.lu, Hack in Paris, Hack In The Box, PHDays and many more. He has authored various open source security software including - ExplIoT - IoT Exploitation Framework - DIVA (Damn Insecure and Vulnerable App) for Android - Jugaad/Indroid - Linux Thread injection kit for x86 and ARM - Dexfuzzer - Dex file format fuzzer</p> <p>Linkedin :<br/><a href=\"https://www.linkedin.com/in/aseemjakhar\" class=\"linkified\">https://www.linkedin.com/in/aseemjakhar</a></p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/96763684021?pwd=YVN1TkcwMm50RndZOVZHV1NPYjVDZz09\" class=\"linkified\">https://zoom.us/j/96763684021?pwd=YVN1TkcwMm50RndZOVZHV1NPYjVDZz09</a></p> <p>Meeting ID: 967 6368 4021<br/>Passcode: OWASPJkt21</p> "
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Scale Your Security by Embracing Secure Defaults & Eliminating Bug Classes\n",
        "date": "2021-05-29",
        "time": "13:00",
        "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/278172874/",
        "timezone": "Asia/Jakarta",
        "description": "<p>Title: Scale Your Security by Embracing Secure Defaults &amp; Eliminating Bug Classes</p> <p>Abstract:<br/>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time. Historically, as an industry, we’ve focused on building tools to identify vulnerabilities. While we’ve built impressive tools, these approaches have failed to address the challenges of modern engineering teams. Specifically, these tools often are too slow, require a prohibitive amount of security engineer time and domain expertise to tune, overwhelm users with false positives, and most importantly, do not ultimately raise a company’s security bar. But there’s another way. Rather than investing in finding more bugs, some modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks that enforce invariants (properties that must always hold), organizations can solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole. In this talk, we’ll present a practical step-by-step methodology for:</p> <p>Choosing what to focus your AppSec resources on</p> <p>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes</p> <p>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers</p> <p>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>Speaker bio:</p> <p>Vasilii Ermilov is a security researcher at r2c (<a href=\"http://r2c.dev/\" class=\"linkified\">http://r2c.dev/</a>) and a bug hunter. Having a decade of experience in web application development for enterprises, governments and startups he now uses his knowledge for identifying weak and vulnerable parts in other people's code.</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/92675914315?pwd=ZVlIamMyVG9oMTNrOUFMQXhycU9Jdz09\" class=\"linkified\">https://zoom.us/j/92675914315?pwd=ZVlIamMyVG9oMTNrOUFMQXhycU9Jdz09</a></p> <p>Meeting ID: 926 7591 4315<br/>Passcode: owaspjkt21</p> "
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2021",
        "date": "2021-05-25",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/277867382/",
        "timezone": "US/Central",
        "description": "<p>Chapter information and a presentation --</p> <p>Scale Your Security by Embracing Secure Defaults &amp; Eliminating Bug Classes</p> <p>\"We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time.</p> <p>Historically, as an industry, we’ve focused on building tools to identify vulnerabilities. While we’ve built impressive tools, these approaches have failed to address the challenges of modern engineering teams.</p> <p>Specifically, these tools often are too slow, require a prohibitive amount of security engineer time and domain expertise to tune, overwhelm users with false positives, and most importantly, do not ultimately raise a company’s security bar.</p> <p>But there’s another way.</p> <p>Rather than investing in finding more bugs, some modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks that enforce invariants (properties that must always hold), organizations can solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole.</p> <p>In this talk, we’ll present a practical step-by-step methodology for:<br/>Choosing what to focus your AppSec resources on<br/>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes<br/>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers<br/>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company\".</p> <p>Speaker:<br/>Emma Jin is a software engineer at r2c, the company that maintains Semgrep, an open-source syntax-aware code search tool. At r2c, she has added features to Semgrep, such as typed metavariables. Emma recently received her B.S. in Computer Science from Carnegie Mellon University, where she picked up her belief in code guarantees. In her free time, she likes to read, write, and relearn her abandoned childhood skills. She is perpetually working on a novel.</p> "
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "Zero Trust Cryptography for Healthcare and Industrial Control Systems",
        "date": "2021-05-28",
        "time": "19:00",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/278031511/",
        "timezone": "US/Eastern",
        "description": "<p>In the first of a three part series, Princeton Brooke will review his research on Zero Trust Cryptography for Healthcare and Industrial Control Systems. Princeton will also lay foundations for taking a proactive approach to securing medical and patient data that can also be adapted to SCADA supervisory for increased security posture in ICS.</p> <p>An optional YouTube live-stream link will be provided at time of meeting for attendees who are unable to join via Zoom.</p> <p>OWASP 2021 with the Cleveland Chapter - May Meeting<br/>Please join our chapter member roster by becoming a member of OWASP today at <a href=\"https://owasp.org/membership/\" class=\"linkified\">https://owasp.org/membership/</a></p> "
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Health: The Most Important Tech Tool",
        "date": "2021-05-27",
        "time": "12:00",
        "link": "https://www.meetup.com/Columbus-OWASP/events/277444023/",
        "timezone": "US/Eastern",
        "description": "<p>This needed to be rescheduled. See you next month!</p> <p>Hi everyone! We will start out with news and notes (virtually) and then talk about health and IT. Working in the tech industry often involves spending long hours sitting down, staring at a screen, consuming copious amounts of pizza and caffeine. The work is mentally demanding and can be stressful. In the rush to get everything done, it can be easy to neglect our health. But a healthy body and mind are necessary for effective performance. Based on HR training, research, and personal experience, this session provides realistic suggestions for managing your well-being at work. It covers the connection between physical and mental health, as well as how to discuss these topics with your employer. You’ll leave with a better idea of how to take care of yourself and be a happier, healthier, and more productive person.</p> <p>Bio: Cassandra Faris is passionate about the human side of technology. She is the Tech Community Manager for the Rocket Technology division of Quicken Loans. Her career has focused on supporting tech professionals through training, community outreach, open source initiatives, marketing, hiring, mentoring, and employee engagement. She is an international speaker who specializes in teaching people how to communicate, be more effective team members, and advance their careers. She is President of the Stir Scholarship for women pursuing technology degrees and President Emeritus of the DogFoodCon tech conference. She has an MBA in Organizational Leadership. When she's not busy with the tech community, she is an avid tabletop gamer, corgi lover, and soccer fan who travels as much as possible.</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP Dallas May Meeting",
        "date": "2021-05-25",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/278098641/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>Almost Intractable Application Security Problems and Solutions</p> <p>Description:</p> <p>There are many security challenges that face software development teams. When considered as a whole, these challenges can seem intractable. This talk discusses some of the common, recurring application security challenges encountered in a variety of organizations that develop different kinds of software. The good news is that despite the challenges, there are real, workable solutions. The challenges and solutions covered in this talk are from a people, process, and technology perspective. Topics are based on the presenter’s experience helping organizations in a variety of industries improve their application security programs and build secure software.</p> <p>Bio:</p> <p>Danny Harris is an accomplished cyber security professional with a specialization in software security. As Security Innovation’s Secure SDLC Center of Excellence (CoE) Lead, Danny conducts ongoing research on software security best practices to deliver world-class security assessments and expert training for the company’s diverse client base. He also leads the company’s Secure Development Practices Assessment Certification (SD-PAC) Program that verifies that technology providers for HP JetAdvantage Solutions incorporate security throughout their entire software development lifecycle. Danny helps organizations develop and grow security champion programs to engage and involve people in the security at their organizations. He has trained and presented to thousands on topics that range from software security metrics to the future of cyber security. Topics of expertise include web application and information security, security policy, application and network vulnerability assessments, intrusion detection, and incident response.</p> "
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "OWASP Delaware + Secure Coding Tournament",
        "date": "2021-06-09",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Delaware-Chapter/events/277977809/",
        "timezone": "US/Eastern",
        "description": "<p>Secure Code Warrior brings you a defensive security-based tournament from a developer's perspective. The tournament allows you to test your skill against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability. You don’t need extensive programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but is also secure.</p> <p>You can find tournament step-by-step guide here: <a href=\"https://youtu.be/o8XhKK_eOOs\" class=\"embedded\">https://youtu.be/o8XhKK_eOOs</a></p> <p>The tournament is run virtually so you can join through your laptop from the most convenient location and time. It should take only a few hours, drop-in as you see fit during the duration of the event to complete all the challenges and win prizes!</p> <p>Instructions for playing:<br/>1) Register for the Secure Code Warrior platform here: <a href=\"https://discover.securecodewarrior.com/OWASPDelaware-tournament.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPDelaware-tournament.html</a><br/>2) Check your email for the confirmation and access the unique link to create your profile.<br/>3) Once logged in: click “Tournaments”<br/>4) Join the OWASP Delaware Secure Coding Tournament</p> <p>The Secure Code Warrior platform will be open before and after the tournament, so feel free to practice in the “Training” tab.</p> <p>Monitor the live leaderboard to see how you're performing!</p> <p>If you have any questions, concerns, or just want to have ad-hoc conversations with your fellow security enthuisiasts, please join the OWASP Delaware Discord Server at <a href=\"https://discord.gg/ukGMuEgFzt\" class=\"linkified\">https://discord.gg/ukGMuEgFzt</a></p> <p>If you (also) RSVP here in Meetup we will be able to communicate updates to you directly.</p> "
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly Online meeting ",
        "date": "2021-06-14",
        "time": "18:45",
        "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/nnccjsyccjbsb/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-05-24",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjrycchbgc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Threat Modeling: A Manifesto And Some Code",
        "date": "2021-06-15",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-OC/events/278167249/",
        "timezone": "US/Pacific",
        "description": "<p>Speakers:<br/>Izar Tarandach, Principal Security Engineer at Squarespace<br/>Matthew Coles, Senior Principal Product Security Engineer at Dell Technologies</p> <p>Topic: Threat Modeling: A Manifesto And Some Code</p> <p>Abstract:<br/>Threat Modeling: why we think it matters for you, and why we wrote a book about it.</p> <p>We will look at:</p> <p>Modeling: how to model your system in an expressive way<br/>Eliciting threats: what are some of the major approaches in use? How can it be done closer to the developer and at Agile speed?<br/>The Threat Modeling Manifesto: the distilled wisdom of dozens of collected years of threat modeling, in an easily consumable format - why it was written, what it is, and how can you benefit from it?<br/>Evolution: Automated threat analysis using an open source tool(pytm). We will talk through the making of pytm and then do a demo.</p> <p>Speaker Bios:<br/>Matthew Coles (he/him) is a security professional focused on the security of physical devices and the ecosystems and processes that enable them to operate. He has an advanced degree in Computer Science from WPI, and maintains a CSSLP certification.</p> <p>Izar Tarandach (he/him) has peeked and poked at security from various sides over the last couple of decades, currently focusing on modern SDLC's and how AppSec extrapolates onto the larger scheme of Security. He has a MSc in Computer Science/Security from Boston U.</p> <p>Izar and Matt have collaborated on security techniques and training for the past 10 years, co-authoring a book on Threat Modeling, and an open source threat modeling automation system, pytm.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/izartarandach/\" class=\"linkified\">https://www.linkedin.com/in/izartarandach/</a><br/>Twitter: <a href=\"https://twitter.com/izar_t\" class=\"linkified\">https://twitter.com/izar_t</a></p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/matthew-coles-4330652/\" class=\"linkified\">https://www.linkedin.com/in/matthew-coles-4330652/</a><br/>Twitter: <a href=\"https://twitter.com/coles_matthewj\" class=\"linkified\">https://twitter.com/coles_matthewj</a></p> <p>pytm: <a href=\"https://github.com/izar/pytm\" class=\"linkified\">https://github.com/izar/pytm</a></p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Managing Open Source Associated Risk",
        "date": "2021-05-27",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-OC/events/277552711/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Matthew H. Jacobs, Director, Legal Counsel at Synopsys, Inc.</p> <p>Topic: Managing Open Source Associated Risk</p> <p>Abstract:<br/>In the 1 hour session, Matt will begin with general observations about the current state of open source reuse in software development today, calling on data from recent Synopsys studies concerning how open source is used, where it is used, why, and in what amounts. Next, general observations about the most popular open source license and compliance challenges will be addressed. Specific focus will be made on the key permissive and “copyleft” licenses such as the MIT/BSD and GPL/AGPL respectively and touch on the emergence of source available licenses (MongoDB). This will include license interpretation and compliance challenges and enforcement actions.</p> <p>The conversation will then shift to open source and security. The unique challenges posed by open source will be discussed along with some ideas on how to address these challenges. We’ll also spend a few moments analyzing the security breach at Equifax and exploring how mismanaged open source components were the root cause of that breach.</p> <p>Speaker Bio:<br/>Matthew Jacobs was Vice President and General Counsel at Black Duck Software, Inc., recently acquired by Synopsys, Inc. He is now a director with the legal group at Synopsys. Organizations worldwide use Synopsys’s industry-leading products to secure and manage open source software, eliminating the pain related to security vulnerabilities, compliance and operational risk. Matt’s work at Synopsys includes managing licensing and contract negotiation and advising senior management on day-to-day legal affairs. In addition to being a frequent speaker on open source–related topics, Matt routinely advises Synopsys’s customers with respect to leading-edge open source adoption, use and compliance matters.</p> <p>Prior to joining Black Duck in 2009, Matt was with Bernstein Shur, where he counseled companies on a variety of intellectual property matters, including open source compliance. Before that, he held in-house positions with Cabletron Systems and Standex International.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/matthew-h-jacobs-jd-mba-671147/\" class=\"linkified\">https://www.linkedin.com/in/matthew-h-jacobs-jd-mba-671147/</a><br/>Blog: <a href=\"https://synopsys.com/blogs/software-security/author/matt-jacobs/\" class=\"linkified\">https://synopsys.com/blogs/software-security/author/matt-jacobs/</a></p> <p>Schedule:<br/>5:30pm: Presentation &amp; Q&amp;A<br/>6:30pm: Raffle (gift certificates sponsored by Synopsys)</p> <p>Our meeting sponsor, Synopsys, will provide 2 gift cards for $50 each to raffle at the end of the meeting, and $25 Grubhub gift certificates for meeting attendees.</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Using the Threat Modeling Manifesto to Build an Enterprise Program",
        "date": "2021-05-27",
        "time": "12:00",
        "link": "https://www.meetup.com/owasptriangle/events/pqfzhsycchbkc/",
        "timezone": "US/Eastern",
        "description": "<p>The concept of threat modeling, while not new, is more imperative today than ever before. It's a foundational part of building a security culture and uncovers potential security issues before they slip into production.</p> <p>Proactively protecting data from the app to the API requires modeling potential attacks to mitigate weak points before bad actors find them.</p> <p>A team of 15 security veterans and experts, including Chris Romeo, CEO of Security journey, created the Threat Modeling Manifesto. Chris is a veteran security expert focused on developing a security culture through training and education.</p> <p>During this session, he will discuss why a manifesto, how you can use it as a foundational piece of your threat modeling program, and practical application tips for building an Enterprise-class threat modeling program.</p> "
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "May 2021 Chapter Meeting",
        "date": "2021-05-27",
        "time": "12:00",
        "link": "https://www.meetup.com/owasp-slc/events/278109538/",
        "timezone": "US/Mountain",
        "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-nw4d0iq9-bBMKHrFITzJMMsDye6FNYg\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-nw4d0iq9-bBMKHrFITzJMMsDye6FNYg</a>) to suggest any additional topics.</p> <p>Agenda:<br/>- TBD</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC May 2021 Chapter Meeting<br/>Time: May 27, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/92529129834?pwd=RVNETnpnMkpkMGxReWZzdExQUTRtUT09\" class=\"linkified\">https://zoom.us/j/92529129834?pwd=RVNETnpnMkpkMGxReWZzdExQUTRtUT09</a></p> <p>Meeting ID: 925 2912 9834<br/>Passcode: 422075<br/>One tap mobile<br/>+12532158782,,92529129834#,,,,*422075# US (Tacoma)<br/>+13462487799,,92529129834#,,,,*422075# US (Houston)</p> <p>Dial by your location<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 301 715 8592 US (Washington DC)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 925 2912 9834<br/>Passcode: 422075<br/>Find your local number: <a href=\"https://zoom.us/u/adjXbBDTCP\" class=\"linkified\">https://zoom.us/u/adjXbBDTCP</a></p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "Monthly Meeting",
        "date": "2021-06-17",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccjbwb/",
        "timezone": "US/Pacific",
        "description": "<p>Monthly OWASP meeting</p> "
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Chapter - Securing SDLC - SCA Tools",
        "date": "2021-05-25",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/278042982/",
        "timezone": "Europe/London",
        "description": "<p>AGENDA:<br/>* Introduction<br/>* Securing SDLC - SCA Tools by Wojciech Cichon<br/>* Networking<br/>* Open discussion<br/>* Virtual Beer</p> <p>More details coming shortly..</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "
    },
    {
        "group": "Norway",
        "repo": "www-chapter-norway",
        "name": "Generalforsamling + valg av ledere",
        "date": "2021-05-27",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Norway/events/277717277/",
        "timezone": "Europe/Oslo",
        "description": "<p>Dette blir ingen vanlig meetup, men et todelt møte hvor vi først har generalforsamling i OWASP Norway Chapter (org nr. [masked]). Deretter foretar vi valg av ledere og eventuelt en programkomité.</p> <p>--------------------------------------------------------------------------------------------<br/>Del 1: Generalforsamling OWASP Norway Chapter (org nr. [masked])</p> <p>Sak 1: Valg av ordstyrer<br/>Sak 2: Valg av referent<br/>Sak 3: Godkjenning av innkalling<br/>Sak 4: Sletting av OWASP Norway Chapter fra Brønnøysundregisteret<br/>Bakgrunn: OWASP Norway Chapter er i dag registrert i Brønnøysundregisteret med organisasjonsnummer[masked]. Lokale chapters skal i følge OWASP Chapter Policy [1] ikke være egne juridiske enheter. Vi ønsker derfor å slette enheten fra Brønnøysundregisteret i henhold til gjeldene vedtekter[2], vedtatt 28. april 2008. Dette vil ikke ha noen påvirking på møteaktivitet eller den daglige driften av OWASP Norway Chapter, da vi fortsetter å eksistere som før under OWASP Foundation. I henhold til vedtektene krever en oppløsning 2/3 flertall på ordinær generalforsamling.<br/>Forslag til vedtak: OWASP Norway Chapter (org nr:[masked]) oppløses i henhold til vedtektene, og slettes fra Brønnøysundregisteret</p> <p>[1] <a href=\"https://owasp.org/www-policy/operational/chapters\" class=\"linkified\">https://owasp.org/www-policy/operational/chapters</a><br/>[2] <a href=\"https://owasp.org/www-chapter-norway/assets/files/20080428_Norway_chapter_vedtekter.pdf\" class=\"linkified\">https://owasp.org/www-chapter-norway/assets/files/20080428_Norway_chapter_vedtekter.pdf</a></p> <p>--------------------------------------------------------------------------------------------<br/>Del 2: Valg av ledere til OWASP Norway Chapter</p> <p>OWASP Norway Chapter skal ha 2-5 ledere og eventuelt en egen programkomité. Dersom du ønsker å engasjere deg i OWASP Norway Chapter, så ta kontakt med [masked] på forhånd av møtet, så vi har en oversikt over hvor mange som ønsker å være med.<br/>Det er en forventning om at man har hovedansvaret for å arrangere minst én meetup per år. I praksis betyr det å skaffe dyktige foredragsholdere, finne egnet lokale og eventuelt skaffe en matsponsor til meetupen. Du vil få hjelp av mer erfarne ledere om det trengs.</p> <p>Om du ønsker å bidra, anbefales det å lese gjennom Chapter Handbook [1] og Chapters Policy [2].</p> <p>[1] <a href=\"https://owasp.org/www-policy/operational/chapter-handbook-existing.html\" class=\"linkified\">https://owasp.org/www-policy/operational/chapter-handbook-existing.html</a><br/>[2] <a href=\"https://owasp.org/www-policy/operational/chapters.html\" class=\"linkified\">https://owasp.org/www-policy/operational/chapters.html</a></p> "
    },
    {
        "group": "Norway",
        "repo": "www-chapter-norway",
        "name": "Security+Ambidexterity+Devops = FUN / Dependency Confusion",
        "date": "2021-05-27",
        "time": "17:00",
        "link": "https://www.meetup.com/OWASP-Norway/events/277959854/",
        "timezone": "Europe/Oslo",
        "description": "<p>Welcome to another online OWASP Norway Chapter meetup. Today we will have two talks, presented by Espen Johansen from Visma and Ståle Pettersen from Schibsted.</p> <p>I hope we soon will be able to meet again at Teknologihuset to enjoy a slice of pizza. But for now we will continue to host online meetups.</p> <p>See you!</p> <p>------------------------<br/>Security+Ambidexterity+Devops = FUN - Espen Johansen (Visma)</p> <p>I dette foredraget vil Espen snakke dypere om de tekniske valgene som er gjort hos Visma fra starten av DevOps transformasjonen fram til i dag. Han vil også demonstrere hvordan noen av systemene virker i praksis og gi salen mulighet til å styre han :-) Interaktivt foredrag med store muligheter til å få innsyn.</p> <p>Experience sharing and storytelling from Visma`s work with integrating security into DevOps by means of Ambidexterity as method. Practical examples on choice of leaders, board composition, spices with technical choices made along the way.</p> <p>Espen is a passionate Security DevOps-er with a flair for midlifecrisemanagement and enjoying life to it’s fullest. He serves as the Director of Security in Visma but is secretly passionate about gamification, UX, Democracy and Security. He loves difficult words and like to apply their meaning in agile teams.</p> <p>------------------------<br/>Dependency Confusion - Ståle Pettersen (Schibsted)</p> <p>Are you confused about the Dependency Confusion attack? We will explain the bug class that compromised Apple, Microsoft and Tesla, and how you can defend yourself against it in the different package manager systems (npm, python, Java, Ruby and more). We will go through how the Product &amp; Application Security team in Schibsted worked to mitigate this bug class in JFrog Artifactory. One part of our solution was the tool Artishock (<a href=\"https://github.com/schibsted/artishock\" class=\"linkified\">https://github.com/schibsted/artishock</a>).</p> <p>Ståle Pettersen (@kozmic) is leading the Product &amp; Application Security team within Schibsted. He has 10+ years experience as a developer and a security enthusiast and is a big fan of OWASP and doesn’t like to brag about himself :)</p> "
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #19 - Threat Modeling, Iterative Securit (Online)",
        "date": "2021-06-17",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Timisoara-Chapter/events/278281346/",
        "timezone": "Europe/Bucharest",
        "description": "<p>The next OWASP Timisoara Chapter Meeting will be online.</p> <p>&gt; Summer sessions - Theme: Threat Modeling &amp; Iterative Security</p> <p>&gt; Schedule:<br/>Introduction, OWASP News &amp; Updates - Catalin Curelaru</p> <p>Challenges and Experiences with Threat Modeling in Agile Development Projects - Monica Iovan (Visma) &amp; Daniela S. Cruzes (NTNU)</p> <p>Security through an iterative process - Dario Cavallaro (Cisco)</p> <p>Time: 18:00 to 20:00</p> <p>&gt;&gt;Abstract - Challenges and Experiences with Threat Modeling in Agile Development Projects:<br/>The goal of secure software engineering is to create software that keeps performing as intended even when exposed to attacks. Threat modeling is considered to be a key activity, but can be challenging to perform for developers, and even more so in agile software development. Hence, threat modeling has not seen widespread use in agile software projects. The goal of the presentation is to show some of these challenges and approaches that the teams are working on.</p> <p>Bio:<br/>Dr. Monica Iovan, Head of Security Development, Visma; In her free time, Monica enjoys peaceful moments in nature and the company of a good book. She is a passionate researcher having the goal of simplifying the use of security services within Agile development. She leads the security development team in Visma and conducts research on security in agile software development.<br/>Dr. Daniela S. Cruzes is a Professor at the Norwegian University of Science and Technology (NTNU). Previously, she worked as a senior research scientist at SINTEF in Norway. She has also been a researcher fellow at the University of Maryland and Fraunhofer Center for Experimental Software Engineering-Maryland. Dr. Daniela Cruzes received her PhD in experimental software engineering from the University of Campinas - UNICAMP in Brazil in 2007. Her research interests are empirical software engineering, research methods and theory development, synthesis of SE studies, software security, software testing and agile and DevOps.</p> <p>&gt;&gt;Abstract - Security through an iterative process<br/>Security through an iterative process is a collection of notes collected in 15+ years’ experience. We will go through what has worked for most companies, some myths and some of the common things that are typically missing, but that everybody wants.</p> <p>Bio:</p> "
    },
    {
        "group": "Cork",
        "repo": "www-chapter-cork",
        "name": "Shift Left DevSecOps Paradigm",
        "date": "2021-06-01",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Cork/events/277885990/",
        "timezone": "Europe/Dublin",
        "description": "<p>**** Meeting link will be added closer to the date and accessible to those who RSVP only ****</p> <p>Talk 1: Shift Security Left<br/>Speaker: Andrew Byrne, Principal CyberSecurity Consultant, Dell Technologies.</p> <p>A modern approach to software development is to shift security left a developer first approach. This talk will focus the approach Dell Technologies have recently introduced. The talk will answer questions such as how security can be pushed left in the software development lifecycle.</p> "
    },
    {
        "group": "Manchester Nh",
        "repo": "www-chapter-manchester-nh",
        "name": "The Five Ws of Threat Modeling",
        "date": "2021-05-26",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Manchester-NH/events/278286939/",
        "timezone": "US/Eastern",
        "description": "<p>Join the Manchester, New Hampshire OWASP Chapter for an introduction to Application Security Threat Modeling.</p> <p>A well-defined and active Threat Modeling practice is an essential element of a mature application security (AppSec) program, providing the means for understanding and documenting security requirements arising as a consequence of developing software. Despite the benefits threat modeling provides, most development teams don't know how to get started in this practice. This evening's presentation will provide high-level answers to your \"Five Ws\" questions about threat modeling, including: What is a Threat Model? Who should be involved in creating the model? What should the model contain? and, most importantly, How do I create the model?</p> <p>Speaker Bio:<br/>Dr. John DiLeo is the Auckland-area leader of the OWASP New Zealand Chapter. As a founding member of Datacom’s AppSec Division, John heads up a consulting team that helps enterprises develop and mature their software assurance programs, with emphasis on governance, threat modelling and risk-based requirements, secure development practices, and security training.</p> <p>In his “free time,” John does a few things in the global OWASP community - he’s a co-author of the OWASP Software Assurance Maturity Model (SAMM) v2.0, Co-Leader of the OWASP Application Security Curriculum Project, and Vice-Chair of OWASP’s Training and Education Committee.</p> "
    },
    {
        "group": "Wia",
        "repo": "www-committee-wia",
        "name": "Kellina, Deveeshree and Veronica",
        "date": "2021-06-12",
        "time": "13:00",
        "link": "https://www.meetup.com/womeninappsec/events/277188366/",
        "timezone": "US/Eastern",
        "description": "<p>Speaker #1)</p> <p>Kellina (@cutiekellina) will discuss how to be inclusive for the deaf community. Her presentation will cover the following topics:</p> <p>- How to communicate with the deaf community<br/>- How can we improve?<br/>- What are the resources?</p> <p>Kellina is a young entrepreneur who loves to help people with their personal growth and educate others about the deaf community.</p> <p>Speaker #2)</p> <p>Deveeshree Nayak ( <a href=\"https://www.linkedin.com/in/deveeshree\" class=\"linkified\">https://www.linkedin.com/in/deveeshree</a> ) will discuss getting started with penetration testing, introduction to open source intelligence (OSINT) and creating a diversity and inclusion cybersecurity team.</p> <p>Speaker #3)</p> <p>Veronica Schmitt (@Po1Zon_P1x13) will discuss the five philosophies to building better logs.</p> <p>This talk focusses on the five philosophies to building better logs. Logs are so much more than just for debugging, mapping system performance or error finding. They tell the tales of what has occurred in a system at any given time. When things never go right I believe one should push left. This means if we do not have logs in Application Development we can use for when a breach occurs we should build them. These philosophies focusses on five things that will help your application logs become more than just there for debugging and performance, they build in forensic readiness for future breaches, it also deals with sensitive data disclosure.</p> <p>Veronica started her forensic career in 2008. She is the Director of Incident Response within DFIRLABS. Veronica is also an Assistant Professor at Noroff University. Veronica holds a Master in Science at Rhodes University in Information Security with specialisation in the forensic analysis of malware. She prides herself in keeping patients safe as this is something which is near to her heart. She is also a cyborg sporting an embedded medical device herself. She also is a DEF CON Goon and she is the founder of DC2751.<br/>Her particular research interests include research into security vulnerabilities in medical devices forming part of the Internet of Things, and how these could be exploited by malicious attackers, as well as what types of forensic artefacts could be identified from any attacks. She is extremely passionate about protecting people whose lives depend on these medical devices, and her passion saw her becoming a researcher within an MDM. She is also developing a digital forensics and incident response approach dealing specifically with implanted medical devices and medical devices installed within a healthcare setting. At her core Veronica is a forensicator and hacker and in love with every bit, byte and nibble of knowledge she has obtained. She recently launched an OWASP project and infiltrated development teams to learn to be green. She is passionate about when things do not go right you push left.</p> "
    },
    {
        "group": "Istanbul",
        "repo": "www-chapter-istanbul",
        "name": "OWASP - Burp Suite İle Brute Force Attack",
        "date": "2021-05-26",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASPistanbul/events/278208217/",
        "timezone": "Europe/Istanbul",
        "description": "<p>OWASP İstanbul olarak, Rumeysa Bozdemir liderliğinde, dördüncü etkinlik tarihimizi 26.05.2021 olarak planlamış bulunmaktayız.</p> <p>Etkinlikte Rumeysa Bozdemir tarafından, Burp Suite kullanılarak Brute Force Attack gerçekleştirme konusu anlatılacaktır.</p> <p>Etkinlik OWASP İstanbul grubuna dahil olan herkesin katılımına açık ve ücretsizdir.</p> "
    },
    {
        "group": "Aligarh",
        "repo": "www-chapter-aligarh",
        "name": "Security Issues in Financial World & Handling First in OWASP Top 10 - Injection",
        "date": "2021-06-06",
        "time": "14:00",
        "link": "https://www.meetup.com/OWASP-Aligarh-Meetup-Group/events/277499602/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Security Issues in Financial World &amp; Handling First in OWASP Top 10 - Injection</p> <p>Speakers from Leading Banking Domain, Security researchers, Pen Test specialists</p> <p>Real Time demo</p> <p>OWASP Chapter Meeting</p> "
    },
    {
        "group": "University Of Washington",
        "repo": "www-chapter-university-of-washington",
        "name": "How to make 100K + in Cyber Security",
        "date": "2021-05-25",
        "time": "17:00",
        "link": "https://www.meetup.com/owasp-university-of-washington-meetup-group/events/277779661/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Otha Mabry, a Security professional<br/>Please register!</p> "
    }
]