[
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP/Null Combine Monthly meetup on October 14th.",
        "date": "2023-10-14",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/296317536",
        "timezone": "Asia/Kolkata",
        "description": "\\| **Name** \\| **Speaker** \\| **Start Time** \\| **End Time** \\|\n\n\\| \\-\\-\\-\\- \\| \\-\\-\\-\\-\\-\\-\\- \\| \\-\\-\\-\\-\\-\\-\\-\\-\\-\\- \\| \\-\\-\\-\\-\\-\\-\\-\\- \\|\n\n\\| **Welcome Note / Registrations** \\| 09:30 AM \\| 09:40 AM \\|\n\n\\| TBD\\| 09:40 AM \\| 10:10 AM \\|\n\n\\| **Intoductions** \\| 10:10 AM \\| 10:25 AM \\|\n\n\\| TBD\\| 09:40 AM \\| 10:10 AM \\|"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter October 2023 Meetup",
        "date": "2023-10-11",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/295661579",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person at 5:30pm or online at 6:30pm (link to be provided to attendees).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nPresentation and speaker update coming soon!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "CSRF and CORS: $num.toString() Facts and a Lie.",
        "date": "2023-10-25",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/296322658",
        "timezone": "Australia/Brisbane",
        "description": "Watch Colin’s gradual decent into insanity as he attempts to unpack all the idiosyncratic behaviours of web that lead to Cross-Site Request Forgery and Cross-Origin Resource Sharing vulnerabilities within modern Web Applications.\nDon’t know CSRF and CORS? After this talk, you’ll understand the fundamentals.\nThink you know CSRF and CORS? By the end of the talk, you’ll probably conclude that nobody \\*knows\\* CSRF and CORS."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "October Meetup",
        "date": "2023-10-17",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/295904341",
        "timezone": "Europe/London",
        "description": "We're back, on Tuesday 17th October, at Sage Bristol (near Queen Square).\n\nChris Goff will talk about \"**Secure by Design and by Default**\", and Daniel Billing has a talk on \"**Exploring Security**\".\n\nMore details to be confirmed Soon™."
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "Le métier de l’auditeur informatique: Défis et Opportunités",
        "date": "2023-10-19",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/295924258",
        "timezone": "Africa/Porto-Novo",
        "description": "**Les normes et standards d’audit de la fonction informatique au sein d’une organisation: Valeurs pratiques.** Après avoir présenté l’importance des normes et standards pour l’audit de la fonction informatique au sein d’une organisation, le conférencier fera la genèse des normes et standards propres au Bénin. Il mettra l’accent sur comment les entreprises béninoises pourront s’approprier ces normes pour leur permettre d’aligner la fonction informatique\navec les besoins métiers. Quelles sont les normes et standards qui s’imposent à une entreprise béninoise? Comment s’approprier ces normes et standards? En quoi la mise en œuvre de normes et standards sont bénéfiques pour une organisation?\n\n**L’importance de l’audit dans la vie d’une organisation: Leçons apprises.**\nLe conférencier de part son expérience d’auditeur au sein des structures publiques et privées de finance présentera les leçons apprises de l’audit. Quelles leçons peut-on apprendre après plus de 10 années d’audit de structures financières? Quels sont les défis? Quelles sont les opportunités?"
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "CSA Colorado  Fall Summit 2023",
        "date": "2023-10-25",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/denver-owasp/events/296253810",
        "timezone": "America/Denver",
        "description": "OWASP Denver wanted to help promote a great upcoming conference put on by our sister organization in Denver on October 25:\n\n**The Cloud Security Alliance (CSA) - Colorado Chapter** is holding a unique event this year\n\n**AI and Cybersecurity: Revolution and Risks**\n\nAll sessions, speakers and content are dedicated to exploring AI's impact on the future of cybersecurity.\n\nCome be part of this all-day conversation. Registration includes:- Access to all sessions\n\n\\- Breakfast\n\\- Lunch\n\\- Networking happy hour\n\\- 6 Continuing education Credits\n**\\- An \"All\\-AI Panel\"\\, where the audience will be able to interact and ask questions of AI personalities representing experts in various fields\\.**\n\nThe full agenda is available now, including information about our keynote, speakers and topics:\n\nRegister now: [https://iplanit.swoogo.com/csacofall2023/](https://iplanit.swoogo.com/csacofall2023/)"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Octobre 2023",
        "date": "2023-10-19",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/296429946",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **GitGuardian** que nous remercions chaleureusement de leur soutien.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Hong Kong",
        "repo": "www-chapter-hong-kong",
        "name": "DevSecOps Lab",
        "date": "2023-10-13",
        "time": "6:00+08:00",
        "link": "https://www.meetup.com/owasp-hong-kong-chapter/events/296247917",
        "timezone": "Asia/Shanghai",
        "description": "DevSecOps Lab - Security in the CI/CD pipeline as code.\nPrerequisite: GitHub account, AWS account."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-10-09",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/296020744",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Kathmandu",
        "repo": "www-chapter-kathmandu",
        "name": "OWASP Kathmandu Meetup - 0x05",
        "date": "2023-10-07",
        "time": "0:30+05:45",
        "link": "https://www.meetup.com/owasp-kathmandu-chapter/events/296492055",
        "timezone": "Asia/Kathmandu",
        "description": "The 0x05 Meetup for OWASP Kathmandu is ecstatically set to take place on the **7th of October, 2023.** We are deeply honored to have the illustrious **Cedar Gate Nepal** as our esteemed sponsor.\n\nTalks will encompass a diverse range of topics including Organizational Cybersecurity, Bug Bounties, Network Security, Compliance, DevSecOps, and much more. Please note that this time we have implemented a strict RSVP policy, so ensure to confirm your attendance in advance."
    },
    {
        "group": "Lahore",
        "repo": "www-chapter-lahore",
        "name": "Workshop | Kubernates community Day Lahore ",
        "date": "2023-10-04",
        "time": "1:00+05:00",
        "link": "https://www.meetup.com/owasp-lahore-chapter/events/296473097",
        "timezone": "Asia/Karachi",
        "description": "A hand-on workshop on this KCD event Lahore, we are proud to announce that our one of organizer is hosting this workshop at Kubernates community Day event,\n\n**speaker name :** Syed Asad Raza\n**workshop :** implement OWASP security rules on K8s.\n\nhttps://pk.linkedin.com/in/syedasadrazadevops\n\nbe ready for this upcoming event, you can register on [Kcdlahore.com](https://kcdlahore.com/) as an owasp community member and get *free ticket*."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on API Security Workshop w/ OWASP API Security Top 10",
        "date": "2023-10-27",
        "time": "7:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/296440656",
        "timezone": "America/Los_Angeles",
        "description": "**Hands on API Security Workshop: Integrating API Security Checks into the CI/CD Pipeline**\n\nHello AppSec teams and tech enthusiasts! We're thrilled to roll out an exceptional DevSecOps workshop in collaboration with OWASP LA and offered by [Akto](https://akto.io). This workshop will equip participants with the knowledge and hands-on skills to integrate API Security Testing into their GitHub DevSecOps pipelines, using [OWASP API Security Top 10](https://owasp.org/API-Security/).\n\n## **Pre-requisites:**\n\n· A GitHub account.\n· Basic understanding of application security.\n· Attendees are required to bring their laptops with internet connectivity\n\n## **Agenda:**\n\n### Introduction (15 minutes)\n\n1. The DevSecOps paradigm and its importance.\n2. Understanding GitHub Actions.\n3. The relevance of API Security testing in the CI/CD pipeline.\n\n### Overview of GitHub Actions for CI/CD (10 minutes)\n\n1. Basic components: workflows, runners, actions.\n2. Demonstration: A simple CI pipeline with GitHub Actions.\n\n### Hands-on: Integrating API Security testing with GitHub Actions (60 minutes)\n\n1. Introduction to API Security Testing.\n2. Overview of OWASP Top 10 for API Security\n3. Hands-on activity:\n4. a) Setting up a test environment (ideally a deployed version of the app)\nb) Configuring the API Security tool to scan the deployed application\nc) Writing a GitHub Actions workflow to trigger API Security scans post-deployment\nd) Analyzing and responding to API Security findings within GitHub\n\n## **What's in it for Participants?**\n\n1. **Skill Enhancement:** Mastery of integrating API Security checks within the popular GitHub Actions CI/CD framework.\n2. **Hands-on Experience:** Directly apply workshop teachings to real-world scenarios.\n3. **Collaboration:** Network and collaborate with peers facing similar challenges.\n\n**Food and drinks** will be provided and there's a free 90 minute **parking** available across the street.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - OCT 25, 2023",
        "date": "2023-10-25",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/294467794",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: How Can DevSecOps Improve Security?\n\nJoin us for dinner, drinks, networking and a great talk by **Mary Wang**, Software Engineering Manager at Northrop Grumman Space Systems\n\n**NOTE**: New Location!! \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n**ABSTRACT**: DevSecOps is the new buzzword that has been around for a while now. DevOps, DevSecOps, Agile, CI/CD pipeline, etc., and chances are you have heard these terms when discussing the software development life cycle. What do those terms mean? With the recent increasing cyber-attacks on software such as in-house developed code or software supply chain (open source software), the traditional ways of decreasing the attack surface on software applications no longer work effectively. Moreover, organizations are pressured to develop code faster and cheaper to meet customer demands. Mary will explain what DevSecOps is and how this practice is better than DevOps in security. In addition, how CI/CD fits in DevSecOps. Lastly, the popular tools are used in DevSecOps practices. She will provide the real-world experience challenges that she encountered.\n\n**Thanks to our Sponsor**: *[SAFEBASE](https://safebase.io/)*\n*SafeBase is the customer-facing Trust Center that automates B2B security reviews. Companies like LinkedIn, Asana, OpenAI, and Snyk use SafeBase to reduce security questionnaires, create a better buying experience, accelerate sales velocity, and position security as a revenue driver.*\n\n**SPONSORSHIP Opportunities Available** *Vendors interested in sponsoring please send an email to* *sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Madison",
        "repo": "www-chapter-madison",
        "name": "October Meeting",
        "date": "2023-10-24",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-madison/events/296510809",
        "timezone": "America/Chicago",
        "description": "https://guidedconversations.org/\n\nDiscussion Topics\n\n1. [LLM Top 10](https://www.llmtop10.com/)\n2. “The Bogus CVE Problem”: [https://lwn.net/Articles/944209/](https://lwn.net/Articles/944209/)\n3. (your topic here)\n\nTool Spotlights\n\n1. [Checkmarx KICS](https://docs.kics.io/)\n2. https://github.com/guacsec/guac"
    },
    {
        "group": "Maribor",
        "repo": "www-chapter-maribor",
        "name": "Cyber Night 2023",
        "date": "2023-10-13",
        "time": "6:00+02:00",
        "link": "https://www.meetup.com/maribor-owasp-meetup-group/events/296432858",
        "timezone": "Europe/Belgrade",
        "description": "# Cyber Night 2023\n\n**Cyber Night je dogodek namenjen navdušencem informacijske varnosti in vsem ostalim, ki bi se na tem področju radi preizkusili.**\n\nPrijava je obvezna na [eventbrite](https://www.eventbrite.com/e/cyber-night-2023-tickets-717651493937?aff=oddtdtcreator)."
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "(Hybrid) Gamifying Tabletop Exercises",
        "date": "2023-10-24",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/296499717",
        "timezone": "America/Chicago",
        "description": "**Andrew Carlson -- Gamifying Tabletop Exercises**\n\nHave you wondered whether there is a fun way to examine how prepared teams are for an incident?\n\nAndrew will give an overview of a game he developed and uses to do tabletop exercises for incident response at his company. He will walk through the set up of the game and walk attendees through a round of the game.\n\nThe game doesn't require deep security knowledge from the teams going through the exercise.\n\nHors d'oeuvres will be available.\n\nAgenda:\n6:00 - Socializing/connecting\n6:10 - OWASP announcements\n6:15 - Presentation\nThere will be time for socializing after the presentation/game as well.\n\nIf needed, the code for the on-line portion will be 972403."
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "October 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-10-19",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/296179697",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Radboud University, Huygens building\n**Address:** Heyendaalseweg 135, Nijmegen\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n18:15 - 19:00 - **Pizza**\n19:00 - 19:15 - **Welcome and OWASP updates**\n19:15 - 20:00 - **Hacking CI/CD pipelines: a few considerations when attacking a CI/CD orchestrator** by **Mauricio Cano**\n20.00 - 20:15 - **Break with drinks**\n20:15 - 21:00 - **Unveiling the secrets in your code: Detecting and Triaging exposed credentials at scale** by **Ingmar Vis**\n\n**Unveiling the secrets in your code: Detecting and Triaging exposed credentials at scale**\n*Abstract:*\nSecurity misconfigurations are often easy to exploit but also easy to avoid. How can we raise security awareness and at the same time prevent security misconfigurations (such as leaked credentials) from reaching production? Is there an easy way to scan, triage and follow-up on exposed secrets at enterprise scale? ABN Amro open sourced Repository Scanner and runs Repository Scanner internally at scale, exposing secrets in source code repositories and thereby raising security awareness while at the same time improving the security posture by remediating security misconfigurations.\n\n*Bio:*\nIngmar Vis has been working in CICD for 7 years. In his current role, Ingmar acts as a Product Owner for 2 teams at ABN Amro. 1 team is responsible for delivering the Secure Coding capability for all developers, the 2nd team is responsible for the infrastructure and automation of CICD tooling. Ingmar works on aspects such as Static Analysis, Software Composition Analysis, Container Security, and Secret Detection."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Global AppSec - DC",
        "date": "2023-10-30",
        "time": "0:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721118",
        "timezone": "Pacific/Auckland",
        "description": "**Global AppSec DC returns October 30 - November 3!**\n\nDesigned for private- and public-sector InfoSec professionals, the two-day OWASP conferences equip developers, defenders, and advocates to build a more secure web.\nWe are offering educational 1-day, 2-day, and 3-day training courses immediately following the conference.\n\n**Conference dates:** Monday and Tuesday, October 30-31\n**Training dates:** Wednesday to Friday, November 1-3.\n\nJoin us for leading application security technologies, speakers, prospects, and community, in a unique event that will build on everything you already know to expect from an OWASP Global Conference.\n\nConference Site: [https://dc.globalappsec.org/](https://dc.globalappsec.org/)\nRegistration: [EventBrite](https://www.eventbrite.com/e/owasp-global-appsec-washington-dc-2023-tickets-519195877847)"
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Contextual Security Analysis - The next step for AppSec",
        "date": "2023-10-12",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-northern-virginia-chapter/events/296357704",
        "timezone": "America/New_York",
        "description": "Our current primary industry standard for detecting security issues in a software application is the use of either a DAST or SAST security tool which is then typically intertwined into the development pipeline. The hope being, as software changes, this data point helps us prevent some classes of vulnerabilities. The higher the risk associated with this data point, the more likely we are to intervene. As practitioners we accept that this singular data point has wildly varying levels of accuracy and we also accept that it will only find a subset of the vulnerability classes. Furthermore, we often rely upon this inaccurate signal and acknowledge that anything else is going to be caught by an attacker, a researcher or, our own appsec team. Ideally, not in that order.\n\nSome organizations have beefed up their approach and have begun using a second data point which is typically a dependency style scan tool. The bleeding edge appsec teams have begun also incorporating docker image CVE results as well as their own custom rules for their scanner tool. The fact remains though that these data points are not enough and that we have so much more available to us that can help us truly assess the risk that software changes introduce into our applications.\n\nDuring an almost six year tenure at GitHub, it became crystal clear not just how much data is available to defenders but also just how little of it is actually used to prevent vulnerabilities from being introduced on a daily basis and finally, what those reliable signals are. If we know that scan tools have such huge limitations, why is the primary and sometimes only data point we rely on?\n\nEnter Contextual Security Analysis (CSA) which utilizes a S.L.I.D.E. methodology and incorporates many data points to contextualize code changes and ultimately detect risk. CSA synthesizes many markers and bits of information to produce contextually relevant risk scores.\n\nJoin us to learn how you can leverage CSA in your organization!"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter 3: Cyber Peterborough MeetUp",
        "date": "2023-11-01",
        "time": "9:30Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/295240302",
        "timezone": "Europe/London",
        "description": "**We're evolving!**\n\nListening to our member feedback, we've moved towards '**Cyber Peterborough**', have a new lick of paint and are still focussing on all things cyber security.\n\n**'Powered by OWASP'** means we still practice, share and discuss content amongst peers in our global network, now with a local feel closer to our community.\n\n**Making Cyber Security Accessible.**\n\nCyber Peterborough is for everyone. Come along, bring a friend, share with your colleagues. You don't need to be a security professional, each session will break down topics to ensure everybody can take something away.\n\n**Agenda**\n\n1. **Ben Mackereth** \\| A working title of a mysterious nature\n2. **Speaker TBC**\n3. **Sign up to Cyber Peterborough's first ever Capture the Flag!** Suitable for all experiences and abilities, join us over food and drink and learn whilst doing in our CTF event.\n\n**When is it?**\n\n* Wednesday 1st November\n* **Start** from 7:30PM\n* **Finish** around 11:00PM\n\n**Where is it?**\n\n* The Brewery Tap, Peterborough\n\n**How can you get involved?**\n\n* Respond \"I'm Coming!\" to this group\n\nWe look forward to seeing you!"
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "OWASP Poland Day 2023 - The truly underground IT security conference",
        "date": "2023-10-04",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-poland/events/295385092",
        "timezone": "Europe/Warsaw",
        "description": "OWASP Poland Day 2023 - Guido Coal Mine - Zabrze\n\n**[Register using this link](https://owasp-poland-day-2023.eventbrite.com/?aff=meetup)**\n\n(event is paid, but we are doing our best to keep it as low as possible)\n\nOWASP Poland Day is the largest annual security conference in Poland focused on topics related to application security. The conference brings together developers, penetration testers and CISOs responsible for ensuring application security. Apart from great presentations delivered by leading application security professionals and researchers the conference will be fantastic networking opportunity.\n\nAfter the pandemic we are back with an even better conference. Since we organize it in Silesia, it will be very unique – probably the only one in the world application security conference:\n\n* 320 meters under the ground\n\n* Held in coal mine and museum\n\n* 2 tracks, 17 presentations. 300+ attendees.\n\nIf you want to attend, you have to use Eventbrite for registration. Please do not RSVP using Meetup. It's a paid event but we are doing our best to keep entrance fee as low as possible, just to cover venue, coffee and lunch, speakers expenses, evening networking event etc.\n\n**Register at: [https://owasp-poland-day-2023.eventbrite.com/?aff=meetup ](https://owasp-poland-day-2023.eventbrite.com/?aff=meetup)**\n\nAgenda and speaker list at: [https://owasp-poland.day/](https://owasp-poland.day/)\n\nPlease spread the word!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-10-11",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296259961",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Stockholm",
        "repo": "www-chapter-stockholm",
        "name": "OWASP Stockholm - API Security and Resilient Websites",
        "date": "2023-10-18",
        "time": "7:30+02:00",
        "link": "https://www.meetup.com/owasp-stockholm/events/296510766",
        "timezone": "Europe/Stockholm",
        "description": "Join us for an exciting in-person event at **Akamai**, **Solna Gate**! This meetup is all about **API Security** and building **Resilient Websites**. Discover the latest techniques and best practices to protect your APIs from vulnerabilities and ensure your websites can withstand any challenges. Network with like-minded professionals, share experiences, and learn from industry experts while enjoying some food and drinks.\n\n**NOTE:** Registration required through Eventbrite [Register link](https://www.eventbrite.com/e/owasp-meetup-api-security-and-resilient-websites-tickets-730436113077)\n\n**Agenda:**\n\n* **17:30 - 18:15** Join us for food & drinks\n* **18:15 - 18:45** Why API Security is a hot topic, recent attacks and examples\n* **18:45 - 19:15** Architecting web applications to achieve DDoS resiliency\n* **19:15 - 20:30** Networking and discussions\n\n**Why API Security is a hot topic, recent attacks and examples by Menachem Perlman, Director of API Security**\nWhy API Security become a hot topic and what you need to know about it, join Menachem Perlman Director of API Security to learn more about API Security types of attacks, why authenticated users are posing risk for organizations and hear about real stories and examples.\n\n**Architecting web applications to achieve DDoS resiliency by Johan Aldor, Senior SE Akamai**\nIn this session, Johan Aldor, Senior Solutions Engineer from Akamai will cover how to architect web applications to achieve DDoS resiliency. DDoS attacks are getting more common and also bigger, if you don’t architecture your web application correctly, coping with attacks can be a hassle. Akamai has over 25 years of experience in running distributed systems and overlay networks. Join us in this session where we share the benefits of using a distributed architecture for DNS, Web Application Firewalls and datacenter protection that will make you ready for any attack.\n\n**Location**: Hemvärnsgatan 9, 171 54 Solna\nTime: October 18th, 17:30 – 20:30\nLighter food & drinks will be served. The talks will begin at 18:15.\n\nRegistration required on Eventbrite [https://www.eventbrite.com/e/owasp-meetup-api-security-and-resilient-websites-tickets-730436113077](https://www.eventbrite.com/e/owasp-meetup-api-security-and-resilient-websites-tickets-730436113077?aff=oddtdtcreator)"
    },
    {
        "group": "Syracuse",
        "repo": "www-chapter-syracuse",
        "name": "Unlocking Cybersecurity Insights: New Open Source Tools for Defense Modeling",
        "date": "2023-10-13",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/syracuse-owasp-chapter/events/296273644",
        "timezone": "America/New_York",
        "description": "Join us for an OWASP chapter meeting that delves deep into the world of cybersecurity defense modeling! In this enlightening session, we'll explore the art of attack path mapping and unveil a dynamic duo of innovative open-source tools designed to bolster your security posture. Our first tool, ADM, is a powerful command-line interface (CLI) solution engineered to effortlessly process .adm files structured in accordance with the attack-defense model. As we dive further, you'll discover ADSM, an ingenious tool that can seamlessly associate attack and defense specifications, all elegantly composed in the ADM language, with each entity and flow within your security model.\nThese cutting-edge tools promise to revolutionize your approach to cybersecurity by providing clearer insights into vulnerabilities and defense strategies. Whether you're a seasoned security professional or just starting your journey in the field, this meeting is a must-attend to stay ahead of the game in today's ever-evolving threat landscape. Don't miss out on the opportunity to strengthen your defenses and enhance your understanding of cyber threats – secure your spot today!"
    },
    {
        "group": "Timisoara",
        "repo": "www-chapter-timisoara",
        "name": "OWASP Timisoara #23: Secure Coding Tournament [IN-PERSON]",
        "date": "2023-10-26",
        "time": "8:00+03:00",
        "link": "https://www.meetup.com/owasp-timisoara-chapter/events/296120016",
        "timezone": "Europe/Bucharest",
        "description": "## Details\n\nThe next OWASP Timisoara Chapter Meetup will be ***in person***.\n\nSee https://owasp.org/www-chapter-timisoara/ for more information about the OWASP Timisoara chapter.\nTheme sessions - Theme: Secure Coding Tournament\n\n\\`Schedule\\` **\\`Time:\\`**\\` 18:00 to 21:00\\`\n\n18:00 - 18:20 - Welcome participants - Lucian Patian (Haufe)\n18:20 - 18:30 - Introduction, OWASP News & Updates - Catalin Curelaru\nSecure code\n18:30 - 19:45 - Secure Coding Tournament\n19:45 - 20:00 - Prizes\n\nLocation of the event: UBC0, et 15, Sediu Haufe.Group, Piața Consiliul Europei 2 · Timișoara\n\nEvent powered by **Haufe**.Group & **Secure Code Warrior**\n\nMore about the event:\n[Secure Code Warrior](https://www.securecodewarrior.com/) brings you a defensive security-based tournament from a developer's perspective. *The tournament allows you to test your skill in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability.*\n\n*You don’t need extensive programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but is also secure.*\n\nYou can find the tournament step-by-step guide here: [https://youtu.be/o8XhKK_eOOs](https://youtu.be/o8XhKK_eOOs)\n\nThe tournament is hosted physically by **Haufe**.Group and you can join through your laptop. The tournament it should take only a 1.5 hours, drop-in as you see fit during the duration of the event to complete all the challenges and win prizes!"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "OWASP Toronto | Developers like Carrots not sticks",
        "date": "2023-10-12",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/296515557",
        "timezone": "America/Toronto",
        "description": "TALK\n\nDevs like Carrots not sticks\n\nSummary:\n\nIn this talk, we will delve into several crucial concepts that are pivotal in the realm of modern software development. We'll explore the intricate intersection of language, DevSecOps tools, Git strategies, CI pipelines, and self-governance frameworks, shedding light on how they come together to form a cohesive whole..\nWe will follow an IAC dev story, but also point out where application code checks are also pertinent. Daniel will share lessons learnt while helping clients implement IAC with security scanning and manage of security bugs.\nBy the end of this talk, you will have a better understanding of how to protect your IAC from security failures, how CI/CD pipelines can save the day and how to manage the security bugs.\n\nPresenter:\n\nDaniel Oates-Lee\n\nDirector/ Senior DevSecOps Consultant\n\nDaniel is one of the co-founders and directors of Punk Security Ltd. He has over 23 years of commercial IT experience, with 17 years focused on cyber security. He has worked with some of the largest global financial companies, the UK government and the British military on various projects ranging from penetration testing and security policy writing to technical implementations and red teaming. Over the last 6 years, Daniel’s focus has been on DevSecOps and automating security testing. In his spare time, Daniel volunteers to help run and deliver talks at cyber security conferences, whilst also carrying out his own personal research."
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2023-10-26",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/296265774",
        "timezone": "America/New_York",
        "description": "TBA"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Rating API Business Risks based on OWASP Top-10 API Security Vulnerabilities",
        "date": "2023-10-19",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248518",
        "timezone": "America/Vancouver",
        "description": "Web APIs are a common glue that connect people and processes with digital systems all across the globe. Not surprisingly, Web APIs contribute more than 80% of the Internet traffic today. Given the importance of APIs, OWASP has recommended top-10 API specific security vulnerabilities (such as Broken Authentication/Authorization and Excessive Data Exposure problems) that organizations must address to strengthen their security posture. Albeit useful, these API specific vulnerabilities do not necessarily translate to the same business risks. For instance, two APIs from an organization with Broken Object Level Authorization (BOLA) may pose very different business risks to that organization.\n\nIn this session, we'll talk about API Risk Rating System (ARRS) that maps API specific vulnerabilities to business risks such as Legal/Contractual, Operational, Financial, Reputational and Regulatory. Similar in-principle yet different than Common Vulnerability Scoring System (CVSS), the main objective of ARRS is to prioritize API specific vulnerabilities based on their business risks. We'll describe the methodology behind the system developed using thousands of APIs that are being tracked at a global scale. We’ll also share some hands-on practical scenarios.\n\nThe work presented was done by Samantha Sanchez, Jun Hee Lee, Alberto Ciconi and Baljeet Malhotra. Samantha, Jun Hee and Alberto are MSc Cybersecurity students at NYIT. Baljeet is an Adjunct Professor at NYIT, UBC, UVic, UNBC, and CEO of TeejLab Inc."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-10-11",
        "time": "5:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889799",
        "timezone": "America/New_York",
        "description": "Welcome to our monthly SAMM community call Wednesday 11th October, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EDT/EST.\n\nJoin Zoom Meeting:"
    }
]