[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2023 (Online)",
        "date": "2023-08-29",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705760",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI. **Please do not pull both an online and in-person ticket as we purchase food for every in-person ticket.***\n\nWhile the speakers presentation will be online, please feel free to attend in-person at NI. Lunch is sponsored for those who pull tickets via ***https://owasp-austin-2023-august.eventbrite.com***\n\nOnline meeting will be opened at 11:30. The chapter presentation will be starting around 11:55 then the Presentation!\n\nPresentation:\n\n***Undercover Agent in Chinese Card Shop Ecosystem: Become a Phishing Master***\n\nPersonal Identifiable Information (PII) leaks have become more frequent in recent years, and losses from credit card fraud in 2022 have set records respectively in the USA. Where did this information get leaked and sold in the first place?\n\nThe term \"Dark web\" refers to websites inaccessible without the use of Tor protocol, and given added privacy and anonymity while using Tor, and marketplaces in it are proven to be very attractive to criminals.\n\nAn anonymous researcher will share experiences of dealing with vendors from card shops on marketplaces among dark web, focused on insights of shops selling American PIIs, and therefore, TTPs of hackers from these card shops."
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combine Monthly meetup on September 16th.",
        "date": "2023-09-16",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/295604606",
        "timezone": "Asia/Kolkata",
        "description": "| **Name** | **Speaker** | **Start Time** | **End Time** |\n\n| ---- | ------- | ---------- | -------- |\n\n| **Welcome Note / Registrations** | 09:30 AM | 09:40 AM |\n\n| [Supply Chain Security](https://null.community/event_sessions/3841-supply-chain-security) | [nk vijay](https://null.community/profile/11622-nk-vijay) | 09:40 AM | 10:10 AM |\n\n| **Intoductions** | 10:10 AM | 10:25 AM |\n\n| [Bug Hunting For Everyone](https://null.community/event_sessions/3843-bug-hunting-for-everyone) | [Pawan Chhabria](https://null.community/profile/18434-pawan-chhabria) | 10:25 AM | 11:10 AM |\n\n| **Networking Session + Break** | 11:10 AM | 11:35 AM |\n\n| [DataSource & XSS Scanner (Open Source Tool Demo)](https://null.community/event_sessions/3845-datasource-xss-scanner-open-source-tool-demo) | [Rohit Kumar](https://null.community/profile/37808-rohit-kumar) | 11:35 AM | 12:20 PM |\n\n| [Securing CI/CD using Github Actions](https://null.community/event_sessions/3846-securing-ci-cd-using-github-actions) | [Bharath Kumar N](https://null.community/profile/11361-bharath-kumar-n) | 12:55 PM | 01:40 PM |\n\n| [Reverse Engineering: Ghidra or IDA](https://null.community/event_sessions/3847-reverse-engineering-ghidra-or-ida) | [Manish](https://null.community/profile/20729-manish) | 01:40 PM | 02:10 PM |\n\n| **Feedback + Next Month’s Planning** | 02:10 PM | 02:30 PM |"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter September 2023 Meetup",
        "date": "2023-09-13",
        "time": "7:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/295661566",
        "timezone": "America/New_York",
        "description": "Hybrid Attendance: Join us in person at 5:30pm or online at 6:30pm (link to be provided to attendees).\n\nJoin us for discussion, food, appsec news, and an OWASP-related talk.\n\nPresentation and speaker update coming soon!"
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "Dependable dependency systems and supply chain risk",
        "date": "2023-09-06",
        "time": "8:00+10:00",
        "link": "https://www.meetup.com/brisbane-owasp-meetup-group/events/295108131",
        "timezone": "Australia/Brisbane",
        "description": "In this talk, Haoxi will be covering the threat landscape of dependency systems (package managers) and why central package registries are not a good model for dependency management. He will then cover open-source tools and data feeds you can use to detect malicious packages in your source code repositories and CICD pipeline, as well as his own open-source experiments in detecting malicious packages in NPM and PyPi."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Self XSS, but Useful",
        "date": "2023-09-21",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295118453",
        "timezone": "America/New_York",
        "description": "Ben says: 'While testing a web app used by multiple groups, the question came up \"can members of group A attack members of group B?\" It took some serious tinkering, but by chaining the otherwise useless (but widespread) exploits of self-xss and login-csrf, an attack was found. This talk (and demo!) details the necessary components, how they work, and how they come together to cross \"group boundaries\" on websites. While the talk will be highly technical, terms and techniques will be explained and should be approachable by anyone who has logged into a website before.'\n\nAnd Tracy from Checkpoint will be bringing some snax, so come hungry and ready to learn."
    },
    {
        "group": "Edmonton",
        "repo": "www-chapter-edmonton",
        "name": "CyberSecure Insights: Decoding Bill C-26 - Sponsored by Fortinet",
        "date": "2023-08-31",
        "time": "7:00-06:00",
        "link": "https://www.meetup.com/meetup-group-opbybwve/events/295497528",
        "timezone": "America/Edmonton",
        "description": "  \n\n**RSVP to attend** – **limited space available.** This assists in fire code compliance and planning CATERING and DOOR PRIZES for everyone's enjoyment.\n\n  \n\n**Event Description:**\n\nEmbark on a transformative journey into Canada's cybersecurity landscape, at the OWASP Edmonton chapter event on August 31st. Proudly sponsored by **[Fortinet](https://www.fortinet.com/)**. Delve into the groundbreaking Bill C-26, which lays the foundation for safeguarding critical infrastructure. From dissecting amendments to the telecommunications act to navigating the powers granted to the government under the Critical Cyber Systems Protection Act. This event is made possible with **[Fortinet's](https://www.fortinet.com/)** support. We will unravel the core requirements and demonstrate how evolving security operations lead to compliance. Join us for insightful discussions, network with **[Fortinet](https://www.fortinet.com/)** experts, and savour a delightful array of appetizers as we decode the future of cybersecurity together. Admission is free, however you must RSVP to attend the event. The knowledge gained is priceless. Secure your spot today and be part of the cybersecurity evolution with **[Fortinet](https://www.fortinet.com/)**.\n\n**Culinary Note:**\n\n**[Fortinet](https://www.fortinet.com/)**, a leading name in cybersecurity, will be treating attendees to a selection of delicious appetizers and finger foods. Featuring options to accommodate various dietary preferences. Please your palate with anticipated delights such as gyoza, sliders, wings, and more. All thoughtfully provided by **[Fortinet](https://www.fortinet.com/)**. While exact items may change, you're in for a gastronomic treat. Reserve your spot now to experience the event, expert insights, and our caterer's culinary excellence firsthand!\n\n**Date & Time:**\n\nAugust 31st, 5:00 PM - 6:30 PM\n\n**Location**\n\nNorquest College\n\n*10215 108 St NW, Edmonton, AB T5J 1L6*\n\n*Room 2-013 - SCFL - Downtown*\n\n*Directions and parking information are located in the photos section at the bottom of this page.*"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Septembre 2023",
        "date": "2023-09-12",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-france/events/295629230",
        "timezone": "Europe/Paris",
        "description": "Le prochain meetup aura lieu en physique. Nous serons accueilli par notre sponsor **Zenika** que nous remercions chaleureusement de leur soutien.\n\n**Date limite d'inscription: dimanche 10 septembre au soir**\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\n\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\n\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\n\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\n*--*\n\n*Pour des raisons de sécurité d'accès aux locaux de notre sponsor, il est nécessaire de fournir votre nom et prénom pour ce meetup. **Une pièce d'identité sera demandée** pour l'obtention d'un badge d'accès. Nous vous remercions de votre compréhension.*\n\n*--*\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Hartford",
        "repo": "www-chapter-hartford",
        "name": "OWASP Hartford Meetup",
        "date": "2023-09-14",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/ct-cyber-security-meetup-owasp-hartford/events/295568205",
        "timezone": "America/New_York",
        "description": "Hello esteemed members and web security enthusiasts!\n\nWe are thrilled to announce our next meetup scheduled for September 2023, and we'd love for you to be there!\n\n**Details of the Event:**\n\n* **Host:** Connecticut OWASP (Open Web Application Security Project) Chapter\n\n* **Date:** Thursday September 14th 2023\n\n* **Time:** 6:00 PM to 9:00 PM\n\n* **Location:** Thomas Hooker Brewery\n\n* **Address:** 16 Tobey Rd, Bloomfield, CT 06002-3522\n\n**Highlights of the Meetup:**\n\n* Engage with fellow web security professionals and enthusiasts.\n\n* Network and share insights over some of the finest brews offered by Thomas Hooker Brewery.\n\n* This event is free and open to the public\n\n**RSVP:**\n\nYour participation is important to us! Kindly let us know if you'll be attending by 9/7/23. This will help us in making appropriate arrangements.\n\n**About OWASP:**\n\nFor those who are new, the Open Web Application Security Project (OWASP) is an open community dedicated to enabling organizations to develop, purchase, and maintain software applications that can be trusted.\n\nOur local Connecticut Chapter regularly hosts meetups and events to bring together professionals and students interested in web application security.\n\nWe're looking forward to an evening of learning, networking, and fun. Hope to see you there!\n\nBest Regards,\n\n[Bill Reyor/OWASP Connecticut Chapter Team]"
    },
    {
        "group": "Hyderabad",
        "repo": "www-chapter-hyderabad",
        "name": "OWASP Hyderabad Chapter Meetup",
        "date": "2023-08-26",
        "time": "0:30+05:30",
        "link": "https://www.meetup.com/hyderabad-owasp-meetup-group/events/295554693",
        "timezone": "Asia/Kolkata",
        "description": "Dear OWASPIANS & Cybersecurity Enthusiasts,\n\nWe are excited to invite you to the upcoming OWASP Hyderabad Local Chapter Meeting in collaboration with CyberSecurist Technologies and Altimetrik India.\n\nThis event is going to be an on-campus event bringing together cybersecurity enthusiasts, professionals, and experts to discuss the latest trends, best practices, and advancements in web application security.\n\nEvent Details: Date: 26th Aug 2023\n\nTime: Starts at 10:30 am IST\n\nLocation:\n\nAltimetrik India Pvt Ltd CoWrks, 1st Floor, SKYVIEW 10, The Skyview,\n\nSy no 83/1 Raidurgam, Hitech City Main Rd,\n\nHyderabad,\n\nTelangana,\n\nIndia - 500081\n\nAgenda Highlights:\n\n1. Welcome and Introduction\n\n2. Presentation 1:\n\n\"Preparation of an automated web API Regression test suite\" By Rushab Desarda\n\nHe is a speaker with comprehensive knowledge in conducting DAST, SAST, VAPT for Web ,Mobile applications (Android), Web Security reviews and Threat Modelling\n\nOpen Discussion: Q&A and Knowledge Sharing\n\n3. Presentation 2:\n\n4. \"Automating API Security Testing\" by Rohit Sarmalkar\n\nOpen Discussion: Q&A and Knowledge Sharing\n\n5. Closing Remarks and Future Events\n\n6. Networking Break: Engage with fellow attendees and speakers\n\nOur guest speakers and facilitators are industry specialists who will share their insights, experiences, and knowledge to help you stay updated on the latest security practices and vulnerabilities.\n\nPlease confirm your attendance via Meetup\n\nDon't miss out on this valuable opportunity to connect with fellow security enthusiasts and enhance your understanding of web application security. We look forward to your presence at the OWASP Hyderabad Chapter Meeting.\n\nNOTE: Please ensure to carry your government-issued ID so as to register and get into the premises.\n\nBest regards,\n\nOWASP Hyderabad Chapter"
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2023",
        "date": "2023-09-11",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/294083412",
        "timezone": "Europe/Rome",
        "description": "In collaboration with Politecnico di Milano (Polimi) University, we are excited to announce the upcoming OWASP Italy Day 2023 on September 11th. It will be a full-day event dedicated to application security (AppSec)!\n\nThe Open Worldwide Application Security Project (OWASP) stands as a well known international non-profit organization dedicated to the crucial field of web and application security.\n\nAt its core, OWASP operates as a vibrant online community, diligently producing a wealth of freely-available resources. These include insightful articles, comprehensive methodologies, extensive documentation, cutting-edge tools, and advanced technologies, all focused on bolstering web application security.\n\nThe impact of OWASP's work extends far and wide, with numerous standards, books, tools, and organizations drawing upon the invaluable insights provided by the Top OWASP 10 project. Esteemed entities such as MITRE, PCI DSS, the Defense Information Systems Agency (DISA-STIG), and the United States Federal Trade Commission (FTC) all recognize and reference OWASP's contributions.\n\nAn eagerly anticipated event in the OWASP calendar is the OWASP Italy Day 2023. This captivating one-day conference is exclusively dedicated to web application and software security, as well as application security testing tools and technologies.\n\nIt presents a golden opportunity for attendees to expand their knowledge on critical application security topics and to network with esteemed professionals and experts. Participants include application security professionals/managers, software engineers, software quality engineers/testers, and computer science students.\n\nFor further details regarding the OWASP Italy Day 2023, please refer to the following link:\n\n[https://owasp.org/www-chapter-italy/events/OWASPItalyDay2023](https://owasp.org/www-chapter-italy/events/OWASPItalyDay2023)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-09-11",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/295620096",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "OWASP Jakarta Night x Fastly.com (Offline Meetup)",
        "date": "2023-09-15",
        "time": "8:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/295313578",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n\n• Tool dan standar keamanan aplikasi\n\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n\n• Kendali keamanan dan pustaka standar\n\n• Cabang lokal di seluruh dunia\n\n• Riset terkini\n\n• Konferensi lengkap di seluruh dunia\n\n• Mailing list\n\n• Dan banyak lagi … di www.owasp.org\n\nKali ini OWASP Jakarta Meetup akan membahas:\n\nJadwal Acara\n\n6:00PM: Registrasi Peserta\n\n6:30PM: Topic Terkini dari OWASP\n\n7:00PM: Presentasi topik khusus:\n\n‘Evolusi Bot dan Penipuan’ oleh Fastly (30mins)\n\n‘Keamanan Aplikasi Modern’ oleh Fastly partner A10 (30mins)\n\n8:00PM: TBD\n\n8:30PM: Foto session and networking\n\nHosts / Speakers :\n\nHos: Flo\n\nOWASP JKT Chairman & CEO Appsec.asia : Ade Yoseman Putra\n\nPembicara Fastly: Guy Brown\n\nPembicara A10: untuk di konfirmasi(TBC)\n\nVenue :\n\nWework Revenue Tower\n\nScbd, Jl. Jenderal Sudirman No.52-53, RT.5/RW.3, Senayan, Jakarta, Kota Jakarta Selatan, Daerah Khusus Ibukota Jakarta 12190\n\nthank you sponsor this event - Fastly.com"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Os ataques XSS e sua mitigação com o OWASP Java Encoder",
        "date": "2023-09-18",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/295631047",
        "timezone": "America/Fortaleza",
        "description": "Os ataques XSS (Cross-Site Scripting) são brechas comuns em sites, onde o explorador insere código malicioso para atacar usuários. Isso pode levar ao roubo de informações ou controle da sessão. Existem tipos como armazenados, refletidos e DOM-based. Prevenir requer validação rigorosa e práticas seguras de codificação, como CSP. A conscientização é fundamental.\n\nO Java Encoder é uma ferramenta chave contra ataques XSS. Ele converte os dados para um formato seguro, bloqueando códigos maliciosos, auxiliando na proteção do site em questão."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#04 - The Room",
        "date": "2023-09-19",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/295466709",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Lisboa chapter meetup on Sep 19th, 2023, at 18:00, **supported by [BNP Paribas](https://www.bnpparibas.pt).**\n\nThe schedule is the following:\n\n**18:00** \\- Welcome notes by the OWASP Lisboa chapter leadership team\n\n**18:15** \\- How to test and compare SAST solutions\n\n**19:00** \\- Unmasking Azure Kubernetes Service \\- Unveiling Inherent Security Risks in K8S Environments\n\n**20:00** \\- Snacks & Drinks sponsored by BNP Paribas\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n**Talks**:\n\nTitle: **How to test and compare SAST solutions**\n\nSpeaker:\n\nGuillaume Montard\n\nAbstract:\n\nOver the past two decades, many of us have had negative experiences with SAST. In this talk, I will explain SAST, its significance, and introduce a framework that allows you to test and compare the latest SAST solutions. By the end, I hope to change your perspective on SAST.\n\nBio:\n\nGuillaume, co-founder of Bearer, developer-first security solution. Previously CTO and VP of Engineering at Skillsoft.\n\nLinkedIn: [https://www.linkedin.com/in/guillaumemontard/](https://www.linkedin.com/in/guillaumemontard/)\n\nTwitter: [https://twitter.com/g_montard]( https://twitter.com/g_montard)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Unmasking Azure Kubernetes Service - Unveiling Inherent Security Risks in K8S Environments**\n\nSpeaker:\n\nSadi Zane\n\nAbstract:\n\nThis talk delves into the security risks associated with Azure Kubernetes Service (AKS). Specifically, it focuses on a deep dive into key security controls like Role-Based Access Control (RBAC) and explores associated risks with service accounts. Additionally, the talk presents a novel approach highlighting how an attacker could exploit Node authorization certificate keys to achieve long-term persistence within AKS environments and their underlying containers. Furthermore, the presentation describes and demonstrates an attack against a vulnerable Grafana enterprise application by leveraging directory traversal techniques to steal privileged tokens. These tokens serve as a stepping stone for further pivoting into the container environment. The talk also addresses the inherent shortcomings of default Azure Kubernetes deployments, including vulnerabilities related to secrets management, pod security admission, and underlying networks. By shedding light on these deficiencies, attendees gain a comprehensive understanding of the security challenges and potential avenues for improvement in AKS environments.\n\nBio:\n\nSadi Zane is a Principal Cyber Security Consultant specialising in offensive security, Red Team/Purple Team exercises, and extensive experience in Orchestration technologies e.g., Cloud on premise Kubernetes container security systems.\n\nLinkedIn: [https://www.linkedin.com/in/sadi-zane-bb6430206/](https://www.linkedin.com/in/sadi-zane-bb6430206/)"
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation on Microsoft Azure and Amazon AWS",
        "date": "2023-09-23",
        "time": "0:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n\n* Prioritizing Security\n\n* Auomation\n\n* Operational Insights and Threat Intelligence\n\n* Holistic Security\n\n* Proactive Threat Monitoring\n\n* Security-as-a-Code\n\n* Infrastructure-as-a-Code\n\n* Improved Collaboration\n\n* Developers as Security Proponents\n\n* Continuous Monitoring and Auditing\n\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\n\nLook to the DevOps community to help close your critical knowledge gaps.\n\n2. 2\\. Start With Your Container Security\n\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n\n3. Institute Continuous Compliance\n\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n\n4. Double Down on Automation\n\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n\n5. Improve Your Monitoring and Analytics\n\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n\n6. Implement Accessibility Assurance\n\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\n\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "September 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-09-21",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/295296523",
        "timezone": "Europe/Amsterdam",
        "description": "**Location:** Hogeschool van Utrecht\n\n**Address:** Heidelberglaan 15, 3584CS Utrecht\n\nSee [https://owasp.org/www-chapter-netherlands/upcomingevents](https://owasp.org/www-chapter-netherlands/upcomingevents) for more information about the OWASP Netherlands chapter.\n\n18:00 - 18:15 - **Reception of attendees**\n\n18:15 - 19:00 - **Pizza**\n\n19:00 - 19:15 - **Welcome and OWASP updates**\n\n19:15 - 20:00 - **SAST, DAST, IAST… xAST de-mystified** by **Martin Knobloch**\n\n20:00 - 20:15- **Break with drinks**\n\n20:15 - 21:00 - **DAST in the world of DevSecOps** by **Amit Sharma**\n\n**SAST, DAST, IAST… xAST de-mystified**\n\n*Abstract:*\n\nDev[Sec]Ops has embraced CI/CD’s build, test and deployment approach, now pushing secure test automation into the dev’s build pipelines.\n\nNow with SCA added to the xAST security verification in your pipeline, as more is better, right?\n\nBut, without clear expectation what to expect from your tool (usage), how to choose the right tool?\n\nDuring this presentation, you will be guided to define the problem first, in order to choose the tools to solve it. Let’s grow maturity and not push on security test automation in the development pipelines but adding useful quality assurance in your production line!\n\n*Bio:*\n\nMartin Knobloch, Global AppSec Strategist with Fortify, part of OpenText, is a long-time security leader with more than 25 years of experience in the field of IT and +15 in Cyber security.\n\nWith a background in software development and architecture, his focus is on software security. Martin is actively involved in OWASP where he is a frequent contributor to various projects and initiatives. Martin is taking part in the organizing of local and global OWASP conferences and served more than 5 years as a member of the Board of Directors, two of them as Chairmen of the board.\n\nDuring his career, Martin has been a recognized teacher, guest lecturer at various universities and invited speaker and trainer at local and international software development, testing and security conferences throughout the world.\n\n**DAST in the world of DevSecOps**\n\n*Abstract:*\n\nDuring this session, we will delve into the intricate details of dynamic testing as a cutting-edge technology. We aim to uncover the finer nuances that define this approach and shed light on the experiences that illuminate the path to harnessing its full potential. Particularly, we will focus on navigating the transition from conventional software development life cycle (SDLC) methodologies towards embracing novel processes in software development. By sharing valuable insights, we aspire to guide you through the journey of effectively integrating dynamic testing into your evolving strategies, ensuring optimal outcomes and enriched decision-making as you embark on this transformative expedition.\n\n*Bio:*\n\nAmit Kumar Sharma is a Security Evangelist with more than a decade of experience in Application Security and Fuzz testing. He has worked in various roles including but not limited to Penetration Testing and Red Teaming. During his career he got a chance to work with various technologies in the domain of Telecom, Medical, ICS and Automotive Security. He works as a Security Specialist with Synopsys Inc , an organization which provides Products and Consultation on how security fits in the SDLC and evangelizing technologies like IAST, Open Source Security, Binary Analysis and Fuzz testing to uncover security issues. Currently his areas of research includes DevSecOps, Security in SDLC, Kubernetes Security and Secrets Management."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-09-12",
        "time": "8:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721023",
        "timezone": "Pacific/Auckland",
        "description": "For our September Meetup, our friends at SMX ([smxemail.com](https://smxemail.com/)) have kindly agreed to be our hosts. SMX's office is located in the B:HIVE shared workspace, in Takapuna, and we'll be meeting in one of the ground-level conference rooms.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n\n* 6:30 p.m. - Introductions, Top 10 Topic\n\n* 7:15 p.m. - Pizza and more networking\n\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for September will be **A09:2021 - Security Logging and Monitoring Failures.**\n\n**Technical Topic Speaker:** TBC - **This could be you!**\n\n**Talk Title:** TBC\n\nThe Auckland-area OWASP Meetup takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays.\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make."
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP x D.O.N.E.",
        "date": "2023-09-21",
        "time": "8:00+01:00",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/294887196",
        "timezone": "Europe/London",
        "description": "After the success of our last joint meetup we're back for another. It's September which means CyberFest. We're delighted to be joining up with the wonderful Dev.Ops.North.East for an evening about all things Dev**Sec**Ops.\n\nWe’ll be doing our usual two talks and pizza format.\n\nRough schedule:\n\n1800 - 1815 Arrival and networking\n\n1815 - 1820 OWASP Newcastle and D.O.N.E. Welcome\n\n1820 - 1830 Andrew Pounder on CyberNorth and CyberFirst\n\n1830 - 1920 Talk one\n\n1920 - 2000 Pizza and networking\n\n2000 - 2045 Talk two\n\n2045 - onwards Pub?\n\nTalk overviews:\n\nTalk 1\n\n**Title:** Driving the most out of DAST\n\n**Speaker:** Simon Gurney\n\n**Speaker Bio:** Simon is one of the Punk Security Co-Founders and has over 15 years experience working within IT, primarily focused on automation and InfoSec.\n\nSimon has a wealth of experience and approaches DevOps from an infrastructure background, but is a keen Python and .NET CORE developer. He has authored two open source projects, pwnSpoof and SMBeagle.\n\n**Talk Synopsis:** Unlike SAST and IAST, DAST can be a difficult tool to implement and configure in DevSecOps pipelines. In this session, we will explore why this is and what the real prerequisites are to getting meaningful results from DAST tooling.\n\nSimon will explore a few different DAST tools, including ZAP, and discuss how using functional testing scripts can help navigate your apps and drive out DAST findings.\n\nTalk 2\n\n**Title:** Securing your software supply chain\n\n**Speaker:** Jonny Brodie\n\n**Speaker Bio:** Jonny Brodie is Cloud Security Engineer, currently working in DevSecOps.\n\n**Talk Synopsis:** The ability to reuse opened sourced libraries and packages has given rise to rapid software development. This talk will discuss what we defined in code as part of DevOps and how we can secure that code. The talk will cover Application Code, Infrastructure as Code and Dockerfile configuration.\n\nAs always, tickets aren’t required but help us gauge how much food to order.\n\nYou can also join our Google Group which is how we'll be sending out emails to events and is also going to be used as a forum for discussion.\n\nhttps://groups.google.com/a/owasp.org/forum/#!forum/newcastle-chapter"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Chapter Meeting",
        "date": "2023-09-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/295595923",
        "timezone": "America/New_York",
        "description": "This is an In-Person Event\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nSpeaker 1: **TBD**\n\nTopic: **TBD**\n\nSpeaker 2: **TBD**\n\nTopic 2: **TBD**"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa September 20th 2023: Vulkan Unveiled-Tools of the Trade",
        "date": "2023-09-20",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/295676016",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n\n150 Louis-Pasteur Private, Ottawa,\n\nUniversity of Ottawa\n\nRoom 117\n\n**Health Notice:**\n\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=PDU9_aooRRU\n\n**6:00 PM EDT** Arrival, setup, mingle\n\n**6:30 PM EDT** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n\n2. **Vulkan Unveiled-Tools of the Trade.**\n\n**Abstract:**\n\nThe Vulkan files have exposed a clandestine world of state-sponsored cyberwarfare, revealing the collaboration between NTC Vulkan, a private defence contractor, and Russian intelligence agencies. This presentation delves into the significance of the leaked files, shedding light on the role of private contractors in cyber warfare and the implications for global cybersecurity. It explores the capabilities of Amezit, Skan, and Krystal2V, three prominent tools mentioned in the leaked documents, providing insights into their functionality and potential impact. By examining the authenticity of the files, assessing their usage, and analyzing the broader implications, this research aims to deepen our understanding of Russia's cyber capabilities and the challenges they pose for international security. The findings underscore the need for stronger regulations, international cooperation, and enhanced defence strategies to counter the evolving threats in the cyber domain.\n\n**Speaker Bio:**\n\nBy day, Julian works as a penetration tester hunting vulnerabilities to exploit. By night, Julian is a researcher and journalist focused on Russian cyberspace. Using his OSINT skills, Julian uncovers emerging threats to the Western world\n\nPavle is a cybersecurity analyst with an academic background in political science. He is fluent in English, French, Russian, Serbian, and Bulgarian, with a keen interest in understanding the implications of the evolving threat landscape on human and civil rights.\n\nDriven by a deep curiosity about the intersection between cybersecurity and global politics, Pavle focuses on the motivations behind state-sponsored cyberattacks, cyberwarfare domains, and emerging cyber governance.."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-08-31",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/295048332",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "Wasatch AppSec / OWASP-SLC - August (virtual meetup)",
        "date": "2023-08-30",
        "time": "2:00-06:00",
        "link": "https://www.meetup.com/owasp-slc/events/295598154",
        "timezone": "America/Denver",
        "description": "We will have two Lightning talks presented during our virtual AppSec meetup this month.\n\n**Agenda:**\n\n1. Introductions / Chapter Announcements\n\n2. Presentation: Nuclei Scanner (Justin Larson)\n\nQ&A\n\n3. Presentation: Risk Assessments (Mark Christensen)\n\nQ&A"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-09-13",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/295662087",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "Conoce OWASP | El Proyecto de Seguridad de Aplicaciones Mundiales Abiertas",
        "date": "2023-08-31",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-tegucigalpa-chapter/events/295366243",
        "timezone": "America/Tegucigalpa",
        "description": "Charla virtual para dar a conocer el Conoce El Proyecto de Seguridad de Aplicaciones Mundiales Abiertas (OWASP), Explorando el mundo de la ciberseguridad, con profesionales y estudiantes del área tecnológica en Honduras.\n\n**[Registro Requerido](https://us06web.zoom.us/meeting/register/tZArf--qpzguHtPg_arEuV7WD2L8Btp2pcgE)**: [https://us06web.zoom.us/meeting/register/tZArf--qpzguHtPg_arEuV7WD2L8Btp2pcgE ](https://us06web.zoom.us/meeting/register/tZArf--qpzguHtPg_arEuV7WD2L8Btp2pcgE)"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Speaker TBA - Contact us if interested",
        "date": "2023-08-31",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/295075768",
        "timezone": "America/New_York",
        "description": "TBA"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "Introducción a la seguridad de aplicaciones - Edición Agosto 2023",
        "date": "2023-08-29",
        "time": "8:30-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/295521802",
        "timezone": "America/Montevideo",
        "description": "Esta será la reunión de agosto de una serie de reuniones **presenciales**, enfocadas en lo **práctico** y en inspirar a nuevas generaciones y a personas que no están involucradas aún con la comunidad. Se llevará a cabo en el espacio provisto por GeneXus Consulting: [Parque tecnológico del LATU](https://goo.gl/maps/MKpCgvcP6rsWpZ9u6) (Avenida Italia 6201), edificio Los Abetos (cowork), Sala 2. **Ver en los detalles de cómo encontrarnos y la foto con el mapa**.\n\nEs importante destacar que **no se requieren** conocimientos previos en seguridad de aplicaciones para participar. Si bien tener conocimientos de web/frontend/backend ayuda, la idea es aprender en la marcha, así que sin timidez :)\n\nLa dinámica de *esta jornada* será la siguiente:\n\n* Pueden armarse grupos para compartir ideas y ayudarse en los ejercicios.\n\n* Los grupos tendrán desafíos/objetivos comunes basados en el proyecto [OWASP Juice Shop](https://owasp.org/www-project-juice-shop/).\n\n* Cada grupo tendrá **al menos un** **referente/facilitador** disponible, colaborador de la comunidad con experiencia para apoyar en cualquier duda y generar conocimiento, mano a mano.\n\nEl requerimiento para poder participar es **traer tu notebook**, cada asistente tendrá su ambiente de trabajo. Se proporciona a los asistentes una imagen virtual de Kali Linux preconfigurada con las herramientas necesarias para realizar el taller. Se necesita Virtualbox o VMWare para ejecutarla. Si tus recursos no son suficientes tendrás que seguir tutoriales para instalar un proxy de ataque (Burp Suite Community o ZAP Proxy) y Juice Shop (servidor local o con Docker).\n\nLa imagen se puede descargar de acá: [https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/](https://drive.google.com/file/d/1qjXU4Ea8KB0MTc3WRQ7eVDNMOXaxawB9/)\n\nPara quienes usen MacOS con chip M1-M2 y VMWare está esta máquina virtual con Kali Linux, OWASP ZAP y Juice Shop en Docker:\n\n[https://drive.google.com/file/d/1MKrx8efu0L4Bg71Rw8XUUxjqBiVigb8m/](https://drive.google.com/file/d/1MKrx8efu0L4Bg71Rw8XUUxjqBiVigb8m/)\n\nEl usuario y contraseña es \"kali\". En la imagen para MacOS se levanta Juice Shop con el comando \"sudo docker start juice-shop\".\n\nPara aprovechar mejor el tiempo y el ancho de banda se recomienda asistir con todo pronto. Para verificar la estabilidad y acceso al ambiente local se compartirá una presentación (que se mostrará el día del evento) con algunas instrucciones.\n\nA registrarse, **los cupos son limitados** (se pedirá confirmación para dar lugar a quienes estén en lista de espera). ¡Los esperamos!\n\n***NOTA***:\n\n* *Para quienes hayan asistido a jornadas anteriores, pueden seguir con desafíos más complejos.*"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Attacking Android applications",
        "date": "2023-09-21",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248516",
        "timezone": "America/Vancouver",
        "description": "**Attacking Android applications** with **Harsh Modi**\n\nThis talk will cover in depth on how attackers attack android applications in the wild, and earn bounties from it. Modern methodologies, tools and techniques with live demonstration will be covered. The viewers will dive into basic understanding of android applications to advance techniques used in the modern world. Finally, some core devsecops concepts will be introduced and how the vulns are mitigated at an organizational level.\n\n**Speaker**\n\nWith over 7 years of dedicated experience as an Offensive Security Engineer and Penetration Tester, Harsh Modi has honed an exceptional skill set in identifying and mitigating security vulnerabilities. His relentless pursuit of knowledge and mastery in the field has propelled him to become a respected figure in the cybersecurity landscape. Alongside his dynamic role, he has played a pivotal part in shaping the security domain as an Entrepreneur and Lead Security Architect at Bell. His influence extends beyond corporate boundaries, as he also serves as the Director of the ISACA Mentorship Program, nurturing the next generation of security professionals. A sought-after speaker, Harsh Modi has graced prestigious platforms such as VIPSS, BSides Vancouver, OWASP Vancouver, BSides Edmonton, and BSides Calgary, where he shares invaluable insights and contributes to the industry's advancement. With an unwavering commitment to excellence, Harsh Modi continues to champion a more secure digital realm."
    },
    {
        "group": "Yerevan",
        "repo": "www-chapter-yerevan",
        "name": "OWASP August meetup - Samvel Martirosyan, Artur Papyan",
        "date": "2023-08-30",
        "time": "9:00+04:00",
        "link": "https://www.meetup.com/owasp-yerevan/events/295461329",
        "timezone": "Asia/Yerevan",
        "description": "OWASP Yerevan August meetup agenda:\n\n1. Introduction of new chapter leaders: Samvel Martirosyan, Samvel Harutyunyan\n\n2. Samvel Martirosyan - Spyware in Armenia. General steps to be protected.\n\n3. Artur Papyan - Pegasus/Predator and other spyware detection with free and paid programs, including MVT, iMazing, iVerify."
    }
]