[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - August",
        "date": "2024-08-27",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460613",
        "timezone": "Europe/Copenhagen",
        "description": "Join the August OWASP Aarhus meet with Cryptomathic!\n\nAgenda:\n\n19:00 – 19:10 Welcome by Cryptomathic and OWASP Aarhus\n\n19:10 – 20:00 Using fuzzing to detect program errors by Jan and Anna.Jan and Anna: Software engineers; working with C, C++, and Java on a daily basis while attempting to avoid introducing new critical bugs. We will talk about how fuzzing can be used to detect program errors unrelated to project requirements. The main focus will be fuzzing functions, with known source code, that receive input from untrusted sources.\n\n20:00 – 20:30 Networking break\n\n20:30 – 21:25 \"Secure SDLC with a DevOps Flavor!\" by Jim Manico\n\nJoin Jim Manico for an enlightening session on \"Secure SDLC with a DevOps Flavor!\" where he merges cutting-edge DevOps practices with robust security measures. In this talk, Jim will delve into automating security within the CI/CD pipeline to ensure continuous security integration, advocate for a shift-left approach to catch vulnerabilities early, and discuss implementing Security as Code to maintain consistent security configurations. He will also emphasize the importance of fostering a DevSecOps culture where security is a shared responsibility across all teams. Additionally, Jim will outline essential tools and technologies that enhance security in DevOps environments, and stress the significance of monitoring security metrics for continuous improvement. This session is a must-attend for professionals seeking to integrate effective security practices into their development cycles without sacrificing speed or efficiency."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Hack-Proof Your Code:  Exploring Mobile App Weaknesses with OWASP MAS",
        "date": "2024-08-22",
        "time": "11:30-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/302022462",
        "timezone": "America/New_York",
        "description": "In this talk, we will take a hands-on look at some of the latest OWASP MAS developments, in particular the new MASWE (Mobile Application Security Weakness Enumeration). This talk will introduce the concepts of \"weaknesses\", \"atomic tests\" and \"demos\" that are the basis of the upcoming MASTG v2. Attendees will gain practical knowledge through detailed examples that show the journey from definition to implementation using both static and dynamic analysis techniques available in MASTG. In addition, discover the newly developed MAS test apps designed to streamline research and improve the development of robust MAS tests.\n\nDon't miss this opportunity to improve your mobile app security skills and make your apps hack-proof. Whether you're looking to bolster your defenses or learn how to uncover vulnerabilities, this session will provide you with the cutting-edge resources you need to stay ahead in mobile security!"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2024 (Online)",
        "date": "2024-08-27",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207020",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nIf you would like to attend in-person, please pull a ticket from Eventbrite, but please only pull a ticket from Eventbrite if you are attending as we purchase lunch for all in-person tickets pulled and we don't want to waste money and food.\n\\- Group1 [https://www.eventbrite.com/e/980779516937](https://www.eventbrite.com/e/980779516937)\nor\n\\- Group2 [https://www.eventbrite.com/e/980854350767](https://www.eventbrite.com/e/980854350767)\n\n*Presentation: **How to protect WordPress or other CMS websites***\n\nIn this presentation, we will walk through different types of real anonymized attacked WordPress and other CMS frameworks in how those sites were attacked and how the sites were then protected from future attacks.\nEveryone attending should leave the presentation able to:\n\\- Understand how these sites are attacked\n\\- Protects that may have already been in place that didn't work\n\\- What measures were then put in place that worked"
    },
    {
        "group": "Bogota",
        "repo": "www-chapter-bogota",
        "name": "Introducción al hacking en Azure",
        "date": "2024-08-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-bogota-meetup-group/events/302668013",
        "timezone": "America/Bogota",
        "description": "¡Únete al capítulo de Bogotá de OWASP para una emocionante sesión sobre ciberseguridad en aplicaciones web!\n\nEn este evento, Gerardo Eliasib nos explicará lo necesario para empezar en el mundo de hacking en infraestructuras y servicios en la nube, en esta ocación en Azure.\n\nPor politica del edificio donde se realizará el evento se requiere que se envíe previamente el número de la cédula del asistente, por favor remitir esta información a los correos :\n\nluis.hernandez@owasp.org\ngiovanni_cruz.forero@owasp.org\n\nVen a participar en discusiones enriquecedoras, compartir tus experiencias y ampliar tus conocimientos en un ambiente colaborativo con otros entusiastas de la seguridad de la información. No te pierdas esta oportunidad de mejorar tus habilidades en seguridad web y aprender de las mejores prácticas del sector. Asegura tu lugar en este evento y prepárate para sumergirte en el apasionante mundo de la ciberseguridad en aplicaciones web. ¡Te esperamos!"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter Meeting - August 2024",
        "date": "2024-08-14",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/302570037",
        "timezone": "America/New_York",
        "description": "This month we will be welcoming Dick Brooks, co-founder and lead software engineer at Business Cyber Guardian.\n\nDick will describe and demonstrate the CISA RSAA portal that is used by the US Federal Government to collect secure software attestations, SBOM's and other relevant artifacts that government SCRM teams will use during software risk assessments, now required under Executive Order 14028 and OMB M-22-18.\n\nDick Brooks is a contributor to the CISA ICT_SCRM Task Force responsible for developing the CISA Secure Software Acquisition Buyers Guide this is used by both software producers and federal procurement teams working to approve software products as \"Secure by Design\". Dick also serves on the CISA Sector Risk Management Agency (SRMA) Coordinating Councils for the Critical Manufacturing (CMSCC) and Healthcare (HSCC) Sectors as a C-SCRM subject matter expert."
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Papá, tengo un romance con la IA",
        "date": "2024-08-27",
        "time": "20:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/302317399",
        "timezone": "America/Santiago",
        "description": "En esta era de revolución tecnológica, las interacciones entre humanos e inteligencias artificiales están alcanzando niveles de complejidad sin precedentes.\n\nEste podcast abordará un fenómeno emergente:\n\n* Individualismo y soledad en el mundo real.\n* El desarrollo de vínculos emocionales profundos con entidades de IA.\n* Implicaciones Éticas y Psicológicas en niños, niñas y adolescentes."
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "API Security Blunders: Tales from the Cyber Trenches",
        "date": "2024-09-05",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/302687611",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nIn this session, we dive into API Security by dissecting real-world API vulnerabilities that have caused security breaches. We'll guide you through the process of hunting for such vulnerabilities, and provide insights to effectively defend against such attacks.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS August 2024",
        "date": "2024-08-29",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/302639003",
        "timezone": "America/Denver",
        "description": "Speaker: John Mocuta; \"Finding and Submitting a Zero day\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "Meaningful Audits - More than Just a Checklist",
        "date": "2024-08-21",
        "time": "12:30-05:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/302673435",
        "timezone": "America/Chicago",
        "description": "Instead of just filling out a spreadsheet and checking off the boxes, audits can actually help in meaningful ways. When done right, you have a better understanding of your environment, security gaps, and just how prepared you are.\n\nPlease come listen to Mark as he shares his insight on making audits meaningful."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-08-19",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/300686443",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Emerging Threats for the Mobile Application",
        "date": "2024-08-28",
        "time": "16:30+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/302680928",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n• Tool dan standar keamanan aplikasi\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n• Kendali keamanan dan pustaka standar\n• Cabang lokal di seluruh dunia\n• Riset terkini\n• Konferensi lengkap di seluruh dunia\n• Mailing list\n• Dan banyak lagi … di www.owasp.org\n\nKali ini di OWASP Jakarta akan membahas :\n1. Emerging Threats for the Mobile Application\n\nAbstract:\nVulnerability and Threats in the Era of Mobile Applications\n\nMobile app security involves safeguarding applications on mobile devices, such as smartphones and tablets, from a variety of security threats. As mobile apps become increasingly vital to both personal and business activities, ensuring their security is essential to protect sensitive data, maintain user privacy, and build trust. With the rapid growth of mobile usage, attackers are constantly finding new ways to exploit vulnerabilities in mobile applications.\nIn this session, we will delve into some of the most common and emerging methods used to attack mobile applications, including:\n• Repackaging apps: Modifying legitimate apps to include malicious code and redistributing them.\n• Hooking frameworks: Using tools to intercept and manipulate app behavior for malicious purposes.\n• Mobile bots: Leveraging automated scripts to perform various malicious activities such as credential stuffing and spamming.\n• Man-in-the-Middle (MitM) attacks: Intercepting communication between the app and the server to steal data or inject malicious content.\nBy understanding these threats and learning about best practices for mobile app security, you can better protect your applications and users from potential attacks.\nJoin us for this interactive session to gain valuable insights and practical knowledge on securing mobile apps effectively!\n\nSpeaker : Shahnawaz Backer / Senior Solutions Architect, Asia Pacific, China and Japan\n\nShort Bio :\nShahn Backer is an ever inquisitive cyber security professional, who is intrigued by modern applications and its challenges. He has a keen interest in modern application security, digital identity, multi-cloud security and edge compute. He is currently a Senior Solutions Architects and focusses on application agility and security .\n\nHe frequently writes on IT security at f5labs.com and has co-authored a Redbook on access management deployment patterns. His works pivots on boosting security with visibility, intelligence, and automation. Shahn has designed identity systems for major financial institutions and government bodies and has released a gamified learning platform for Application Programming Interfaces security.\n\nLinkedin : https://www.linkedin.com/in/backers\n\nTopic:\nsupported by appsec.co.id also f5 networks indonesia"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - AUG 28, 2024",
        "date": "2024-08-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300687355",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Integrating Security Best Practices with Shift-Left and Shift-Right in Agile SDLC\nJoin us for great networking, dinner and drinks, and see a presentation by **Liliya Frye**, Director of QA Engineering\n\n**ABSTRACT**: Comprehensive overview of continuous integration and continuous web application security testing with utilization of Shift-Left and Shift-Right methodologies within Agile SDLC. What are the best DAST/IAST/SAST tools? Explore practical strategies, automated testing and penetration testing within CI/CD pipelines to maintain robust security and quality from inception to deployment. Discover how to address common challenges, mitigate security risks, enhancing both product quality and operational efficiency. Elevate your security measures and ensure continuous quality in software development life cycle.\n\n**Thanks to our Sponsor**: *[Checkmarx](https://checkmarx.com/)*\n*Checkmarx's* mission is to provide the technology, expertise, and intelligence that enable developers and enterprises to secure the world’s applications. We help companies deliver secure software faster, making the world safer for all of us. *Checkmarx is the enterprise application security leader, helping security and development teams build DevSecTrust by securing every phase of development with our cloud-native platform. We proudly serve 1,800 customers, including 60% of Fortune 100.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - August 2024 Meetup",
        "date": "2024-08-28",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/302627913",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nIt was great to see new faces last month. Thank you to those that attended.\n\nIn our last meetup, attendees voted for [Spicy Korea](https://g.co/kgs/FnXwKAr) as our location this month. On 28th August 2024 6PM, there we shall meet.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic. )*\n\n**Please remember to update your RSVP if you can no longer attend.** Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get.\n\nWe're looking forward to the discussions we had once again.\n\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is[ inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics.\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there.\n\nSee you there.\nThank you."
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Capture The Flag Event - SHRED with Security Innovation",
        "date": "2024-08-14",
        "time": "17:00-05:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/300354016",
        "timezone": "America/Chicago",
        "description": "Join us in-person for an exciting day of hacking a cyber range! Thanks to the folks at Security Innovation, we'll host attackers of all skill levels and background to have some fun networking and learning about the mindset, skills and methodologies used in the seemingly growing number of breaches we hear about in the news."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand Day - 2024",
        "date": "2024-09-05",
        "time": "08:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/300323362",
        "timezone": "Pacific/Auckland",
        "description": "We are proud to present the 14th OWASP New Zealand Day conference, to be held at the Auckland University of Technology (AUT) City Campus on Thursday and Friday, September 5th and 6th, 2024. OWASP New Zealand Day is a two-day conference dedicated to web and application security, with an emphasis on secure architecture and development techniques to help Kiwi developers build more secure applications. The conference is presented by the [OWASP New Zealand Chapter](https://owasp.org/www-chapter-new-zealand/) and organised by [AppSec New Zealand Incorporated](https://appsec.org.nz/).\n\nThere will be two presentation streams throughout the conference. The first stream will include introductory talks on application and information security topics, as well as on policy, compliance, and risk management. The second stream will primarily address deeper technical topics. Talks featuring OWASP projects and tools are particularly encouraged, as are talks by members of under-represented communities.\n\nIn addition to these principal streams, there will be a third, smaller “stream,” supporting sponsor presentations, demos of OWASP tools, and interest/user group meetings. Diamond, Platinum, and Gold Sponsors will be given priority for time slots in this “stream.” Further details will be published closer to the date, regarding opportunities for other groups to present.\n\nWho is the Conference for?\n\n* Web Developers\n* Security Professionals and Enthusiasts\n* Program and Project Managers\n* Business Analysts\n* Requirements Analysts\n* Software Testers\n\n## Conference Live Stream\n\nAll three streams of the conference (Track 1, Track 2, and the Sponsor Demos) will be live streamed on the day. Access information for the conference live-stream will be provided to registered delegates, as details are finalised.\n\n## Conference Structure\n\n**Date:** Thursday and Friday, 5-6 September 2024\n**Time:** 9:15 a.m. - 5:00 p.m., Thursday; 10:00 a.m. - 5:00 p.m., Friday\nThe main conference on Thursday and Friday will have two streams throughout both days:\n**Stream One:**\n\n* Introductory Topics\n* Program Management, Policy, Compliance, Risk Management\n\n**Stream Two:**\n\n* Technical Topics\n\nThroughout the conference, an exhibition area will be open in the main atrium. Representatives from many of our Premier Sponsors will be on hand throughout the event, to answer your questions about their products and services, or to discuss employment opportunities they may have available. There will be door prize drawings at the Closing Session on Friday. To qualify for the drawings, you will need to visit with each exhibiting sponsor during the conference, and have them stamp your entry card.\n\n## Registration\n\nRegistration is now open on Humanitix: [https://events.humanitix.com/owaspnz2024](https://events.humanitix.com/owaspnz2024)\n\nEarly registration (on or before 15 August):\n\n* $30, standard registration\n* **FREE**, for students and unwaged attendees\n* From 16 August, a late registration surcharge applies to all registrations ($20 Regular, $15 Student/Unwaged)"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa August 21st 2024: API: Always Prone to Injections",
        "date": "2024-08-21",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/302579838",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 564\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: TBD\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **API: Always Prone to Injections**\n\n**Abstract:**\nWhen pushing left goes past the developer: To the documentation! Simple documentation errors are a big contributor to injection vulnerabilities of all kinds, especially the way many cloud APIs are documented. In this presentation I’ll walk through several examples, and then get hands on with a demo vulnerability (and hopefully some laughs). We’ll highlight how to spot these kinds of problems in documentation as a developer, and avoid making them yourselves when providing an API.\n\n**Speakers:**\n**Chris Shepherd** is a pentesting lead, privacy advocate, and avid homelabber. With over 20 years of experience in roles from systems & network administration to software development to pentesting, he's worked on all facets of application development, deployment, and use. With a lifelong passion for security, Chris turned that jack of all trades experience towards pentesting, with a focus on education. For the past four years he has volunteered as a key challenge developer and overall challenge development co-ordinator for the CyberSCI CTF."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-08-29",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/302438652",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "OWASP Open Forum",
        "date": "2024-08-15",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-portland-chapter/events/302500810",
        "timezone": "America/Los_Angeles",
        "description": "Join us for a new event this month: the OWASP Open Forum. This open discussion format allows you to bring your own questions and experiences in information security to the table. Whether you're solving problems, sharing success stories, or looking for advice, this is the perfect opportunity to engage with a diverse audience, including several long-time OWASP members and other attendees. This forum offers a chance to network, gain insights, and connect with peers who may have similar questions or perspectives. Let's learn from each other and strengthen our community together.\n\nDoors open at 5:30. The forum will run from roughly 6 to 7. We'll need to be out of the space by 7:30.\n\nWe thank NedSpace for hosting us again this month. NedSpace is a co-working space with 15,000 of 11th-floor views, in the heart of downtown Portland, 2 blocks away from Pioneer Square."
    },
    {
        "group": "Porto Alegre",
        "repo": "www-chapter-porto-alegre",
        "name": "OWASP Chapter POA - Encontro #16 [PRESENCIAL]",
        "date": "2024-08-15",
        "time": "18:30-03:00",
        "link": "https://www.meetup.com/owasp-porto-alegre-chapter/events/302429958",
        "timezone": "America/Sao_Paulo",
        "description": "Em agosto voltaremos com nossos encontros PRESENCIAIS, com apoio da **AZION** cedendo o espaço para nossa a comunidade, teremos um encontro presencial na sede da empresa.\n\n* VAGAS **LIMITADAS**, por favor só confirme se você ter a certeza de sua participação\n* Brindes especiais de empresas que apoiam a comunidade da OWASP POA: **AXUR**, **AZION**, **KINGHOST** e **LOCAWEB**\n* Emissão de certificado de participação\n\n**Confira nossa agenda:**\n 18:30 - Credenciamento e wellcome coffee\n\n 19:00 - \"Hackers a favor: Como Programas de Bug Bounty Protegem Empresas” - Raphael Estima\n[https://www.linkedin.com/in/raphael-e-m/](https://www.linkedin.com/in/raphael-e-m/)\n\n 19:45 - \"Segurança digital no contexto da Indústria 4.0” - Marcos Rodrigues de Carvalho\n[https://www.linkedin.com/in/marcos-rodrigues-de-carvalho-8ab2381b7/](https://www.linkedin.com/in/marcos-rodrigues-de-carvalho-8ab2381b7/)\n\nPara este encontro iremos emitir certificado de participação, esperamos vocês na Praça Dr. Maurício Cardoso, 71 - 4º andar - Porto Alegre - RS."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-09-11",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539098",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-08-14",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539097",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Uruguay",
        "repo": "www-chapter-uruguay",
        "name": "OWASP Meetup - Agosto",
        "date": "2024-08-14",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-uruguay-chapter/events/302636627",
        "timezone": "America/Montevideo",
        "description": "**¡OWASP UY te invita a su próximo Meetup!**\n\n**Hector \"Chiche\" Pardiñas** : Como hackearan a tu familia.\nEsta charla presenta una visión del mundo digital desde la perspectiva de un sexagenario tecnólogo, enfocándose en por qué los adultos mayores son blanco fácil para los ciberdelincuentes.\n\n**Mateo Martínez:** Polyfill y Openssh, ¿qué hacemos?\n\n**¿Cuándo?** Míercoles 14/7, 19:00.\n**¿Dónde?** WTC Free Zone. Luis Bonavita 1294 Torre 1 Sala 3 PB\n**¿Cómo participar?** Simplemente te registras al evento. Los cupos son limitados por capacidad del lugar. Si estás en lista de espera serás notificado cuando se liberen lugares.\n\n**¡Te esperamos!**"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "September community call - OWASP SAMM",
        "date": "2024-09-11",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/302806897",
        "timezone": "America/New_York",
        "description": "During our next community call we will cover:\n\n1. Welcome new community members\n2. SAMM project updates\n3. Q&A"
    }
]