[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - January",
        "date": "2025-01-28",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299786143",
        "timezone": "Europe/Copenhagen",
        "description": "This OWASP Aarhus meetup is co-hosted with Norlys.\n\nAgenda:\n**19:00 – 19:10** Welcome by Norlys and OWASP Aarhus\n**19:10 – 20:00** ”Hybridwar, critical infrastructure and resilience…” by Ken Bonefeld Nielsen\n\nGet an insight into how vulnerable modern societies are when it comes to hybrid warfare. What can we do to make critical infrastructure more resilient…\n\nKen Bonefeld Nielsen – Senior Cyber Security and Resilience Advisor at Norlys shares his many years of experience from the military and international work for organizations like Sony, Tele2, Lundbeck and Norlys\n\n**20:00 – 20:30** Networking break\n\n**20:30 – 21:25** \"The Journey of Cyber Entrepreneurship, Community Building, and Open Source Opportunities\" by Bjarke Petersen\n\nDiscover how true innovation emerges in entrepreneurial environments, the challenges it faces, and what it takes to succeed. Explore the vision behind Cybersikker.dk, a community designed to become Denmark's leading self-help hub for IT security. The session concludes with a collaborative exploration of impactful and affordable technological solutions, emphasizing the transformative potential of open-source tools.\n\nBjarke Petersen – Serial Cyber Entrepreneur and Community Enthusiast with experience in creating businesses. Now dedicated to building a free, self-help Cyber Community to support Danish SMEs in navigating and resolving their IT security challenges."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "The Menace of Mobile Malware",
        "date": "2025-01-16",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/305244493",
        "timezone": "America/New_York",
        "description": "As mobile devices become indispensable, they have also become prime targets for malicious actors. \"The Menace of Mobile Malware\" is a live-action presentation designed to expose attendees to the real-world dangers of mobile malware. From trojan horses to full-scale ransomware attacks targeting mobile platforms, this session will explore how these threats operate, their tactics, and how to detect and mitigate them."
    },
    {
        "group": "Augsburg",
        "repo": "www-chapter-augsburg",
        "name": "8. OWASP Augsburg Stammtisch",
        "date": "2025-01-22",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-augsburg-chapter/events/305388800",
        "timezone": "Europe/Berlin",
        "description": "In der Fuggerstadt wird IT-SECURITY groß geschrieben. Egal ob IT-Security-Interessent\\*in, CISO, Hacker/Haeckse, Pentester\\*in, Entwickler\\*in, Netzi, Endanwender\\*in oder whatever - alle sind willkommen. Eine OWASP-Mitgliedschaft ist (natürlich wünschenswert, aber) nicht notwendig!\n\n**Wir freuen uns auf neue Gesichter, Stammgäste und sporadische Teilnehmer\\*innen :-)**\n\n**Agenda - tbd**\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n Es werden noch Speaker\\*innen gesucht!! \n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n**Bitte gebt Bescheid**, wenn ihr kommt und ggf. wie viele Leute ihr mitbringt, damit wir auch genug Platz haben.\n\nDu hast eine Idee oder willst auch einen Talk halten? Super, wir sind immer auf der Suche nach interessanten Inhalten. Egal ob Vortrag, Diskussion, Idee, Lightning-Talk, etc. Wir dienen auch gerne als Probepublikum :-) Melde dich einfach!\nWichtiges für Talks in aller Kürze:\n\n* Verwende einen neutralen Foliensatz - ohne Logo, ohne Werbung\n* Auf einer Folie kannst du dich und deinen Arbeitgeber vorstellen - hier auch mit Logo\n* Gib kurz Bescheid, ob du den Vortrag auch auf Englisch halten könntest\n* Vertriebler, die eine Verkaufsveranstaltung durchführen wollen, werden ausgebuht und müssen diverse Runden Bier ausgeben"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - January 2025 (Online)",
        "date": "2025-01-28",
        "time": "11:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305488934",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nJoin us for the OWASP Austin Cryptoparty and discover practical ways to protect your privacy and enhance your digital security in a fun, interactive setting! Whether you're a tech enthusiast, a professional, or just starting your journey in cybersecurity, this event offers something for everyone. Gain hands-on experience with tools and techniques, hear from engaging speakers, and connect with a community passionate about building a safer online world. Don’t miss this opportunity to level up your security know-how—mark your calendar and **bring a friend**!\n\nFeaturing:\n\n* James Wickett\n* Mark Spears\n* Rafal Los\n* Josh Sokol\n\nIf you would like to attend in person, please pull a ticket for a free lunch at Emerson/NI location in Austin --\n[https://owasp-austin-2025-january.eventbrite.com](https://owasp-austin-2025-january.eventbrite.com)"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "January 2025 OWASP Happy Hour sponsored by Cequence",
        "date": "2025-01-16",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/304571321",
        "timezone": "America/Chicago",
        "description": "\\*\\*\\* ***This was previously scheduled for January 9th but has been rescheduled for following week due to forecasted freezing temperatures and rain \\****\\*\\*\n\n**When:** Thursday, January 16th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Cequence](https://www.cequence.ai)\n*Cequence, a pioneer in API Security, is the only vendor with a comprehensive Unified API Protection solution offering discovery, compliance, and protection across all internal and external APIs to defend against attacks, targeted abuse, and fraud. Onboard APIs in less than 15 minutes, without needing any instrumentation, SDK, or JavaScript deployments. Cequence solutions scale to handle the most demanding government, Fortune and Global 2000 organizations, securing more than 8 billion daily API calls and protecting more than 3 billion user accounts across these customers. Its flexible deployment model supports passive/inline, on-premises, SaaS, and hybrid deployments.*"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "January Meet",
        "date": "2025-01-22",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/305583898",
        "timezone": "America/Los_Angeles",
        "description": "Join us on **Wed, Jan 22, 2025** at **5:30 PM** at **Blackhawk Network** for an evening of networking and learning. This in-person event is a great opportunity to connect with fellow professionals in the cybersecurity field. Don't miss out on the chance to engage with industry experts and expand your knowledge. See you there! This meetup is in collaboration with CSA-SF\n\n5.30 PM :- Gates open\n6 PM- 6.45 PM :- In a GenAI World, Only Identity Matters.\n6.45PM-7.15 PM :- Significance of IAM in Application Security\n\n**Talk#1** In a GenAI World, Only Identity Matters.\nSpeaker :- Caleb Sima\n\n**Talk#2 :** Significance of IAM in Application Security\n**Description:** The Significance of IAM in Application Security\nExplore how attack paths have evolved, highlighting common factors that contribute to identity-related risks.Understand the unique security challenges posed by evolving attacks, and discover new strategies to safeguard your workforce, IT administrators, developers, and machines.best practices to safeguard sensitive information.\n\nSpeaker :- Rohan Singla CISO Chargepoint\nMahantesh W , Staff Security Engineer, Chargepoint"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "Hacker Days:- Exploiting OWASP API Top-10 Vulnerabilities in Action",
        "date": "2025-01-16",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/305415077",
        "timezone": "America/Los_Angeles",
        "description": "Happy New Year! We're thrilled to announce our upcoming workshop: **\"Exploiting OWASP API Top-10 Vulnerabilities in Action: A Juice Shop Adventure.\"**\n\nThis meetup is in partnership with Pacific Hackers Group(www.phack.org)\n\nA big thank you to **Appsentinels**, A Full Life-cycleAPI Security Platform for sponsoring this meetup.\n\n5.30-6 PM :- Food drinks and Networking.\n6-8PM :- workshop\n\n**Agenda:**\n1\\. Introduction \\(10 minutes\\)\n2\\. Juice Shop Setup & Overview \\(10 minutes\\)\n3\\. Hands\\-on guided exercise: Exploiting OWASP API Top\\-10 \\(90 min\\)\n1\\. Broken Object Level Authorization \\(BOLA\\)\n2\\. Broken Authentication\n3\\. Broken Object Property Level Authorization \\(BOPLA\\)\n4\\. Unrestricted Resource Consumption\n5\\. Broken Function Level Authorization \\(BFLA\\)\n6\\. Unrestricted Access to Sensitive Business Flows\n7\\. Server\\-Side Request Forgery \\(SSRF\\)\n8\\. Security Misconfiguration\n9\\. Improper Inventory Management\n10\\. Unsafe Consumption of APIs\n4\\. Mitigations & Best Practices \\(30 minutes\\)\n\n* Discussing mitigation strategies\n\n5\\. Wrap\\-up \\(15 minutes\\)\n\nNote:\n\n* Hands-on activities will be the core focus of this workshop\n* Participants are required to bring their own laptops\n\nBy the end of this workshop, participants will have a better understanding of OWASP API Top-10 vulnerabilities and the ability to identify and mitigate these risks in real-world applications."
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém Açai com Dados.",
        "date": "2025-01-25",
        "time": "09:00-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/305591726",
        "timezone": "America/Boa_Vista",
        "description": "No dia 25 de janeiro, a **OWASP Belém** que é um dos capítulos brasileiros entre os mais de 200 capítulos ativos em todo o mundo.\n\nRealizara o primeiro meetup em conjunto com Açai com Dados , onde o tema será Dados e Inteligência Artificial, onde exploraremos insights, desafios e inovações no mundo da tecnologia. Será uma oportunidade incrível para conhecer os desafios e oportunidades no uso de dados no universo da IA, com muita troca de conhecimento, conexões e networking.\n\nNosso objetivo é disseminar a missão da OWASP, tornando a segurança das aplicações visível, para que as pessoas e organizações possam tomar decisões conscientes sobre os verdadeiros riscos de segurança das aplicações.\n\n**Data:** 25/01/2025\n\n* **Horário:** 8h30m.\n* **Local:** Estácio FAP\n* **Endereço**: R. Municipalidade, 839, Belém, PA.\n\nConfira a programação:\n**08h30m:** Abertura\n**09h00:** Apresentação OWASP\n**09h15 - 09h45:** Em breve.\n**10h - 10h45:** Em breve\\*\\*.\\*\\*\n**10h45 - 11h00:** Intervalo / Networking\n**11h15 - 11h45:** Em breve."
    },
    {
        "group": "Boulder",
        "repo": "www-chapter-boulder",
        "name": "Boulder OWASP January 2025 Meetup: A Web CTF for Everyone",
        "date": "2025-01-22",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-boulder/events/305589815",
        "timezone": "America/Denver",
        "description": "Boulder OWASP is back for 2025 and looking forward to welcoming everyone! We’ll be changing our format this month to a more hands-on approach to Application Security with a Capture the Flag event. Whether you’re an experienced Application Penetration Tester or brand new for the AppSec world, there will be something for everyone.\n\nOWASP Boulder’s own Mark Hoopes has found a truly insecure CRM application ready to be exploited. Entry level participants can explore a poorly designed authorization system and mid-level hackers will have plenty of opportunities to run SQL and JavaScript Injection attacks. For the experts, there is even a pathway to shell, but it will take some real dedication to get there.\n\nTo ensure everyone has a good time, we'll be encouraging experienced participants to team up with those who are new to web exploitation. On top of that, a walkthrough document will be available and exploit demos will be given gradually throughout the evening.\n\nBring your own laptop with an intercepting proxy (Burp, ZAP, etc.) installed to participate as an attacker, but if you’re not comfortable at that level, feel free to just bring yourself and plan to shadow, watch, and learn.\n\nInstallation instructions can be found here:\n[https://www.meristeminfosec.com/resources/boulder-ctf](https://www.meristeminfosec.com/resources/boulder-ctf)\n\nTo make sure everyone comes prepared, a Q&A session will be held on the Monday before the event at 7pm: [https://meet.google.com/ddn-zozh-ysv](https://meet.google.com/ddn-zozh-ysv)\n\nSpecial thanks to the Rule4 Team for hosting and sponsoring, we couldn't do these events without our sponsors. If you're interested in sponsoring the #1 AppSec organization and our Boulder Chapter meetings, please reach out to alex.brown@owasp.org.\n\nPlease follow us on LinkedIn: https://www.linkedin.com/company/owasp-boulder\n\nAnd join our Slack: https://join.slack.com/t/boulder-owasp/shared_invite/zt-2qnxnmmts-IQDaobNC1rcUbpaH1ip8Lg\n\n**AGENDA**\n6:00 - 6:30 Food, Drinks, Networking\n6:30 - 7:30ish CTF Time\n7:30 - 8:00 More Networking"
    },
    {
        "group": "Cairo",
        "repo": "www-chapter-cairo",
        "name": "AI/LLM Applications and Security Event - Arabic",
        "date": "2025-01-18",
        "time": "10:00+02:00",
        "link": "https://www.meetup.com/owasp-cairo-chapter/events/305542919",
        "timezone": "Africa/Cairo",
        "description": "Considering the enormous acceleration in the AI field, OWASP Chapters in Cairo, Dubai and Kuwait are holding the first of kind joint event about AI and LLM Applications and Security.\nJoin us in the first event of 2025 to learn more about the new Era of AI and LLM based Applications and how you can utilize these capabilities.\n\nAgenda\n\\- Online via Zoom\n\\- Saturday 18th January\\, 2025 \\- 10:00am to 1:00pm\nSession #1:\nTitle: Introduction to AI and LLM based Applications\nDescription: In this session, you will learn the main concepts, terms and terminologies about the AI and LLM applications and you will learn the about the main technologies and frameworks to get started with this kind of applications.\nTime: Saturday, 18th January - 10:00 am\nSpeaker: [Ahmed Abdallah](https://linkedin.com/in/ayossef) \\- OWASP Dubai Chapter Leader\n\nSession #2:\nTitle: OWASP Top 10 LLM\nDescription: In this session, you will learn the top 10 security risks according to OWASP in the LLM based Applications and the relevant mitigation techniques.\nTime: Saturday, 18th January - 11:30 am\nSpeaker: [George Fahmy](https://www.linkedin.com/in/george-fahmy-b0978212a) \\- Founder & CEO of Stakpak"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "OWASP Meetup JAN 2025",
        "date": "2025-01-18",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/305358664",
        "timezone": "Asia/Kolkata",
        "description": "* Demystifying Zero Trust Network Architecture by **Ezekiel Jebaraj Solomon**\n* Impact of AI in Cybersecurity by **Kavitha Karunakaran**\n* Drone Forensics: Hack Those Flying Things !! by **Sriram Kesavan**\n\nFor registration:\n[Enroll here](https://docs.google.com/forms/d/1jFcASMbo5wWD1lL4RT_KYsEhr74OZBvUNF-Y2IUroRo/edit)"
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "Former Hacker and Zero Day Developer's Perspective on Why AppSec Matters",
        "date": "2025-01-21",
        "time": "16:00-05:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/305476221",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nFormer \"World’s Most Wanted\" hacker and exploit developer known as Hackah Jak from the Hackweiser group, brings his unique expertise to the forefront of application security. With a career spanning software reverse engineering, zero-day development, hacking, cyberwarfare, and web application engineering. Jesse offers a rare and unique perspective.\n\nJesse will challenge you to see the true value of application security beyond mere financial metrics. Drawing from his firsthand experiences combating scams and human trafficking, he will offer insights that inspire a deeper understanding of the real-world impact of vulnerabilities.\n\nJoining Jesse for this talk is his daughter, Reesë, a talented teenage girl. Accepted to collage at 13 years old, Reesë earned her Bachelor in Computer Science, with honors, at the age of 17, and then became the first student in Ohio to pursue a Master’s degree while in high school. Before graduating high school she completed 4 more Associate Degrees in various areas of technology. Her academic accomplishments are complemented by a remarkable professional journey, including internships at GE Core Tech and Kroger IT. Reese is the founder of a startup building a cutting-edge Cyber Threat Research and Training Platform, backed by an investment and bolstered by her innovative research, which has already led to her first patent filing. In addition she now services as the secretary for the IEEE SA P1947 Standards for Quantum Cybersecurity Framework group.\n\nLearn more about Jesse’s journey by listening to Modem Mischief Podcast, Hackweiser:\n[https://www.youtube.com/watch?v=iyKSkubzxKo](https://www.youtube.com/watch?v=iyKSkubzxKo)\n[https://podcasts.apple.com/us/podcast/hackweiser/id1585249019?i=1000651055244](https://podcasts.apple.com/us/podcast/hackweiser/id1585249019?i=1000651055244)\n[https://open.spotify.com/episode/04kQiWFkxhyWqOZwYYwsA0?si=1d52bb8b48e248ac](https://open.spotify.com/episode/04kQiWFkxhyWqOZwYYwsA0?si=1d52bb8b48e248ac)\n[https://music.amazon.com/podcasts/b458729d-02d0-42d3-b043-5fc1ba8a10db/episodes/84648a83-5e3b-47f5-a4f8-91a7cb596d30/modem-mischief-hackweiser](https://music.amazon.com/podcasts/b458729d-02d0-42d3-b043-5fc1ba8a10db/episodes/84648a83-5e3b-47f5-a4f8-91a7cb596d30/modem-mischief-hackweiser)\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments!\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Dubai",
        "repo": "www-chapter-dubai",
        "name": "AI/LLM Applications and Security Event - Arabic",
        "date": "2025-01-18",
        "time": "12:00+04:00",
        "link": "https://www.meetup.com/meetup-group-svgchist/events/305542875",
        "timezone": "Asia/Dubai",
        "description": "Considering the enormous acceleration in the AI field, OWASP Chapters in Cairo, Dubai and Kuwait are holding the first of kind joint event about AI and LLM Applications and Security.\nJoin us in the first event of 2025 to learn more about the new Era of AI and LLM based Applications and how you can utilize these capabilities.\n\nAgenda\n\\- Online via Zoom\n\\- Saturday 18th January\\, 2025 \\- 10:00am to 1:00pm\nSession #1:\nTitle: Introduction to AI and LLM based Applications\nDescription: In this session, you will learn the main concepts, terms and terminologies about the AI and LLM applications and you will learn the about the main technologies and frameworks to get started with this kind of applications.\nTime: Saturday, 18th January - 10:00 am\nSpeaker: [Ahmed Abdallah](https://linkedin.com/in/ayossef) \\- OWASP Dubai Chapter Leader\n\nSession #2:\nTitle: OWASP Top 10 LLM\nDescription: In this session, you will learn the top 10 security risks according to OWASP in the LLM based Applications and the relevant mitigation techniques.\nTime: Saturday, 18th January - 11:30 am\nSpeaker: [George Fahmy](https://www.linkedin.com/in/george-fahmy-b0978212a) \\- Founder & CEO of Stakpak"
    },
    {
        "group": "France",
        "repo": "www-chapter-france",
        "name": "Meetup OWASP - Paris - Janvier 2025",
        "date": "2025-01-23",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-france/events/305516216",
        "timezone": "Europe/Paris",
        "description": "Ce meetup se deroulera chez **Renault Digital** que nous remercions chaleureusement de leur soutien.\n\nPour des raisons de sécurité, une ***pièce d'identité*** vous sera demandée pour accéder à l'évènement.\n\nOWASP Paris est le meetup dédié à la sécurité applicative. Pour rappel, le meetup se veut non commercial. Il réunit toutes personnes désireuses de concevoir et maintenir des logiciels plus sûrs. Si vous êtes intéressé par le sujet, que vous soyez débutant ou expert, n'hésitez pas à nous rejoindre pour partager vos expériences ou vos problématiques.\nCe meetup propose des sessions organisées en mode \"forum ouvert\". Les sujets sont proposés par les participants lors de la séance. Partages de connaissances, retour d'expériences, exercices de type CTF, bonnes pratiques, gouvernance et organisation, ... sont au programme!\n\n**Lightning Talks:**\nLa soirée commence par de courtes présentations. Chacun peut s'il le veut proposer une présentation, ce n'est pas obligatoire. Si vous avez envie de partager une technique, une opinion, une démo ou un retour d'expérience, alors vous pouvez préparer un lightning talk, entre une simple phrase et 10 minutes maxi et venez le présenter au début de la soirée. Si vous n'avez jamais fait de présentation avant, c'est l'occasion de commencer dans une ambiance sympa.\n\n**Workshop:**\nLa soirée se poursuit avec des activités menées en groupes. Chacun peut s'il le veut proposer un sujet, ce n'est pas obligatoire. Vous avez 30 secondes au début de la session pour en donner envie aux autres participants, puis tout le monde vote pour son sujet favori. Les sujets préférés donnent lieu à des activités en groupes pendant un peu plus d'une heure. Des écrans seront disponibles\n\nLe format se veut bienveillant. Pas besoin d'être expert pour parler d'un sujet. Vous trouverez certainement d'autres personnes pour vous aider! L'accent est mis sur l'échange et le partage.\n\nL'agenda et le compte-rendu des précédents meetups est accessible ici: https://owasp.org/www-chapter-france/"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2025-01-20",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/303242793",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Um hacker no seu bolso",
        "date": "2025-01-29",
        "time": "19:30-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/305527548",
        "timezone": "America/Fortaleza",
        "description": "Marcos Tulio e Anderson Peixoto irão apresentar uma análise detalhada do OWASP Top 10 Mobile, explorando os principais riscos associados a aplicações móveis. Durante a exposição, farão uma abordagem mais aprofundada em tópicos específicos, destacando os cenários mais críticos. Ao final, realizarão uma demonstração prática de análise de segurança em aplicações móveis, ilustrando como atacantes exploram vulnerabilidades para obter privilégios na aplicação e até mesmo no sistema operacional. Por fim, compartilharão as melhores práticas e recomendações para mitigar as vulnerabilidades identificadas, promovendo a segurança no desenvolvimento de aplicativos móveis."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#08 The Passenger",
        "date": "2025-01-15",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/305279929",
        "timezone": "Europe/Lisbon",
        "description": "We are back!\nAfter a long break following the Global AppSec Lisbon, we want to start 2025 with an OWASP Lisboa Meetup right in January.\n\nThe meetup takes place on January 15th, 2025, at 18:00, at the OLX office, and is **sponsored by OLX and AP2SI**.\n\nThe schedule is the following:\n18:00 - **Quick intro** by the OWASP Lisboa chapter leadership team\n18:10 - **AI for Next-Gen Security: OpenAI and Security Copilot Synergy** by Sergey Chubarov\n19:10 - **Practical Security Guard Rails for LLM** by Nick Vinson\n20:00 - **Drinks & Dinner** by OLX\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **AI for Next-Gen Security: OpenAI and Security Copilot Synergy**\n\nSpeaker: **Sergey Chubarov**\n\nAbstract:\nThis demo-based session explores the potent collaboration between OpenAI and Copilot for Security.\n\nDiscover how the fusion of artificial intelligence is revolutionizing threat detection, response strategies, and proactive risk mitigation.\n\nThe session contains following topics:\n\\- Start free: Microsoft Copilot for SOC Operations\n\\- Security Copilot: Extra helping hand of Analyst\n\\- Azure OpenAI: How AI\\-driven incident response leverages intelligent automation\n\nBio:\nSergey Chubarov is a Security and Cloud Expert, Instructor with 15+ years' experience on Microsoft technologies.\n\nHis day-to-day job is to help companies securely embrace cloud technologies.\n\nHe has certifications and recognitions such as Microsoft MVP: Security, OSCP, OSEP, eCPPT, eCPTX, Microsoft Certified Trainer, MCT Regional Lead, EC Council CEH, CPENT, LPT, CCSE, CEI, CREST CPSA, CRT and more.\n\nFrequent speaker at local and international conferences like Global Azure, DEF CON, Black Hat Europe, Wild West Hackin' Fest, Security BSides, Workplace Ninja, Midwest Management Summit, Hack in the Box, Hack in Paris etc.\n\nPrefers live demos and cyberattacks simulations.\n\n[https://www.linkedin.com/in/schubarov](https://www.linkedin.com/in/schubarov)\n[https://www.sessionize.com/schubarov](https://www.sessionize.com/schubarov)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Practical Security Guard Rails for LLM**\n\nSpeaker: **Nick Vinson**\n\nAbstract:\nLLM based systems are being built and deployed at a rapid pace and new security threats are being introduced as a consequence. In this talk we'll discuss the nature of these threats and what security controls can be implemented to protect against them.\n\nBio:\nNick has 14 years in the tech industry spanning across both security and engineering roles. In his current role Nick leads the Product Security function at Snyk, a cybersecurity company that builds developer-first security products.\n\n[https://www.linkedin.com/in/nick-vinson-a147971bb/](https://www.linkedin.com/in/nick-vinson-a147971bb/)"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup [IN-PERSON]",
        "date": "2025-01-15",
        "time": "18:00Z",
        "link": "https://www.meetup.com/owasp-london/events/305137055",
        "timezone": "Europe/London",
        "description": "**THIS EVENT IS NOW SOLD-OUT AND WE CANNOT RELEASE ANY MORE TICKETS DUE TO THE LIMITED SPACE IN THE VENUE. You can watch the event online here: [https://www.youtube.com/live/KQglFw5AgcM](https://www.youtube.com/live/KQglFw5AgcM) and ask questions live at: https://sli.do/OWASP**\n\n**This event is kindly hosted by JustEat and sponsored by Smithy.Security**\n\n**There is limited seating available for in-person attendees. Registration required.**\n\n**This event will be live-streamed on YouTube. The live-stream URL is: https://www.youtube.com/live/KQglFw5AgcM**\n\n**Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: JustEat, Fleet Place House, 2 Fleet Pl, London, EC4M 7RF (note: the entrance is directly opposite Starbucks front doors)\n**Nearest Tube Station:** St. Pauls (Central Line) - 6 mins walk\n**Doors Open at 6pm** for registration, food, drinks and networking. The talks start at **6:30pm** (we start on time).\n\n**TALKS**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Sherif Mansour and Andra Lezza\n\nWelcome and a brief update on OWASP Projects & upcoming OWASP Conferences from the OWASP London Chapter Leaders\n\n**\"Go Hack Yourself: API Hacking for Beginners\"** \\- Dr Katie Paxton\\-Fear\nOver the past few years, we've really seen API hacking take off as a field of its own, diverging from typical web app security, but yet parallel to it. Often we point to the amorphous blob that is web security and go: \"here you go, now you can be a hacker too\", with top 10 lists, write-ups, conference talks and whitepapers smiling as we do. This creates a major challenge for developers who want to test their APIs for security or just people who want to get into API hacking, how on earth do you wade through all the general web security to get to the meat of API hacking, what do you even need to know?\nThis talk is going to break down API hacking from a developer point of view, teaching you everything you need to know about API hacking, from the bugs you can find and to the impact you can cause, to how you can easily test your own work or review your peers.\n\n**\"Maturing Your Application Security Program\"** \\- Tanya Janca\nAfter working with over 300 companies on their application security programs the most common question I receive is “what’s next?”. They want to know how to mature their programs, and when they look at the maturity models available, they find them intimidating and so far beyond their current maturity level that they feel impossible. In this talk I will take you through 3 common AppSec program maturity levels I have encountered over the years, with practical and actionable next steps you could take immediately to improve your security posture.\n\n**\"The news is that 2025 is the year of Agentic AI, but what IS Agentic AI?**\" - Spyros Gasteratos (Lightning Talk)\nIn this lighting talk we’ll start the new year with a small primer on what are agents and how they’re used. We’ll briefly discuss use cases and how we’ve seen people use them. We’ll close with security considerations we’ve seen and an obligatory list of getting started resources\n\n**SPEAKERS**\n\n**Dr Katie Paxton-Fear ([@insiderPhD](https://x.com/@insiderPhD))**\nDr Katie Paxton-Fear is an API hacker and content creator at Traceable. She has a PhD in cyber security and artificial intelligence, but if you know her it’s not for her academic work.\nShe’s a hacker and YouTuber who's found bugs in over 30 companies. She wants to show that anyone can be a hacker, and share her passion and knowledge with others. She has hacked everything from the military to social media, reporting her findings promptly and making sure the attackers don't get their first! In her free time she makes videos, teaching her audience of 80k+ how to get into ethical hacking. You can\nfind her all over the internet as InsiderPhD.\n\n**Tanya Janca ([@shehackspurple](https://twitter.com/shehackspurple))**\nTanya Janca, also known as SheHacksPurple, is the best-selling author of ‘Alice and Bob Learn Application Security’. She is also the founder of \"We Hack Purple\", an online learning community that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty five years, won countless awards, and has been everywhere from public service to tech giants, writing software, leading communities, founding companies and ‘securing all the things’. She is an award-winning public speaker, active blogger & podcaster and has delivered hundreds of talks on 6 continents. Tanya values diversity, inclusion, and kindness, which shines through in her countless initiatives. Advisor: Nord VPN, Aiya Corp Faculty: IANs ResearchFounder: We Hack Purple, OWASP DevSlop, #CyberMentoringMonday, WoSEC\n\n**Spyros Gasteratos**\nSpyros is a seasoned security leader with nearly two decades of experience, from analyst to CISO. As the founder of Smithy.security, he develops open-core products to democratize and simplify product security for all. He maintains Smithy, a security workflow automation engine, and OpenCRE.org, the world's largest security knowledge graph. Passionate about open source, Spyros focuses on harmonizing security tools to empower teams of all sizes.\n\n**TICKETS**\nThis event is free to attend for both members and non-members of OWASP and is open to anyone interested in web application and cyber security. Please note that you MUST book your place to be admitted to the event by the building security - your name will be checked against the guest list.\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: https://owasp.org/www-policy/operational/code-of-conduct"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - JAN 22, 2025",
        "date": "2025-01-22",
        "time": "17:30-08:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/305489048",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: TBA\nJoin us for great networking, dinner and drinks, and see a presentation by\n\n**ABSTRACT**:\nTBA\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Secure Coding Tournament with Security Journey",
        "date": "2025-01-22",
        "time": "16:30-06:00",
        "link": "https://www.meetup.com/owasp-nashville-chapter/events/299885971",
        "timezone": "America/Chicago",
        "description": "TBD"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "The State of Secure Coding: Talk + Hands-On Tournament",
        "date": "2025-01-30",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/305300856",
        "timezone": "America/Los_Angeles",
        "description": "**NOTE: The following will be in effect and mandatory for this meeting venue.**\n\n* **RSVPs will close at 11:59 PM PT on Monday, January 27th, so kindly submit your RSVP by then. Walk-ins will not be permitted.**\n* **Google Security mandates that RSVPs include your full name (in Meetup settings) and that you bring your ID, which will be checked at the entrance to match your RSVP.**\n* If your first and last name do not appear in our admin view, we will contact you.\n* Alternatively, feel free to reach out directly or email us at orange-county-leaders@owasp.org to provide that information or any questions you may have regarding the event.\n\n**Parking**\nPark in the public garage structure next to the building. We will be providing paid tickets for exiting the garage.\n\n**Live Stream**\nStream us live on Twitch: http://twitch.tv/owaspoc\n*Please change your RSVP to \"No\" if you can't make it and/or will join via livestream instead.*\n\n**The State of Secure Coding: Talk + Hands-On Tournament**\nIn this talk, we will explore the current state of secure coding, focusing on common vulnerabilities and pitfalls developers face today. Drawing from the OWASP Top 10, the session highlights real-world examples of flawed code and their potential risks. Attendees will gain practical insights into better coding standards and participate in a hands-on workshop to learn how to identify and fix these issues effectively. By the end, participants will be equipped with actionable techniques to create more secure and resilient applications.\n\n**Thanks to our Sponsor Cycode!**\nCycode enables companies to deliver software fast without compromising on security. Cycode delivers a complete Application Security Posture Management (ASPM) platform that can replace existing testing tools or integrate with them while providing visibility, prioritization, and remediation of vulnerabilities at scale.\n\nCheck them out at: https://cycode.com"
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-02-06",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181943",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASPOttawa January 15th 2025:  The fragile security of deep learning models",
        "date": "2025-01-15",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/305516182",
        "timezone": "America/Toronto",
        "description": "**Welcome to our in-Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/@OWASP_Ottawa). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=HG8YL1ad_bY\n\n**6:00 PM EST** Arrival, setup, mingle, PIZZA!!!\n\n**6:30 PM EST** Technical Talks\n\n1. Introduction to OWASP Ottawa, Public Announcements.\n2. **The fragile security of deep learning models with Guy-Vincent Jourdan Ph.D. and William Aiken**\n\n**Abstract:**\n*The fragile security of deep learning models* with Guy-Vincent Jourdan Ph.D. and William Aiken.\nUse of deep learning models and generative AI has exploded. ChatGPT and similar technologies have taken the world by storm, showing an astonishing ability to create text, images and even videos that are barely distinguishable from human produced content. Many businesses have jumped in the bandwagon and countless companies are integrating these models into their product lines as fast as they possibly can. They certainly do produce excellent results in many situations and save time and money. But how secure are they really? In this talk, we will discuss two examples of models that are heavily adopted and, while very effective, are also easily compromised, and are much more insecure than previously understood. With no fix on the horizon, wild adoption of these models is shown to be problematic.\n\n**Speakers:**\n**Guy-Vincent Jourdan Ph.D.**\nDr. Guy-Vincent Jourdan is a professor at the University of Ottawa's School of Electrical Engineering and Computer Science, where he has been a key contributor since 2004. He holds a Ph.D. from l'Université de Rennes/INRIA in France, earned in 1995, with a specialization in distributed systems analysis. Prior to his academic career, Dr. Jourdan gained extensive industry experience as C.T.O. and later C.E.O. of Decision Academic Graphics, an Ottawa-based company.\nHis research at the University of Ottawa spans critical areas such as software verification, validation, testing, software security, and cybercrime protection. An accomplished scholar, Dr. Jourdan has co-authored more than a hundred scientific publications and holds 15 patents. He also serves as co-director of the uOttawa-IBM Cyber Range, a cutting-edge facility dedicated to cybersecurity research and training.\nDr. Jourdan’s work focuses on developing proactive strategies to detect, prevent, and recover from cyber threats, with particular expertise in early detection of phishing sites and cybercrime mitigation.\n\n**William Aiken**\nWilliam Aiken is a PhD student at the University of Ottawa. He majored in Security and Risk Analysis at Penn State University under the cybersecurity track, and received his Master’s in Electronic and Computer Engineering from Sungkyunkwan University, South Korea. His current research work lies at the intersection of many fields including synthetic data generation (such as diffusion models!), federated learning, and augmented reality. His research also emphasizes security and vulnerability assessments on deep learning models and bringing tangible DL applications to a variety of domains."
    },
    {
        "group": "Patna",
        "repo": "www-chapter-patna",
        "name": "Session 11 - Bugs, Bounties, and Beginners: Insights for Aspiring Hunters",
        "date": "2025-01-18",
        "time": "12:00+05:30",
        "link": "https://www.meetup.com/owasp-patna-chapter/events/305583910",
        "timezone": "Asia/Kolkata",
        "description": "This session on **\"Bugs, Bounties, and Beginners: Insights for Aspiring Hunters\"** by **Jayesh**, will cover the fundamentals of bug bounty programs, selecting the right platforms, and effectively identifying and reporting vulnerabilities. Through real-world examples, practical tips, and actionable insights, participants will learn how to navigate challenges, and adopt the right mindset for success. Whether you're just starting or looking to refine your approach, this session offers a clear roadmap to kickstart your bug bounty journey."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2025-01-30",
        "time": "19:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/304844725",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "OWASP-SLC/Wasatch AppSec - In-person Meetup (@HealthEquity)",
        "date": "2025-01-22",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-slc/events/305384600",
        "timezone": "America/Denver",
        "description": "Hi All, first Wasatch AppSec/ OWASP-SLC event of the year!\n\nWe'll be meeting in person at the **HealthEquity** Office building in Draper for lunch. We'll discuss one of the great books on the topic of Application Security.\n\nHelp us plan for food via RSVP.\nSee you there!\n\n**Agenda**:\n\n1. Introductions/Admin\n2. Discussion Topic: Alice and Bob Learn Application Security, By: Tanya Janca -- Discussion Lead: [@Derek McGhie](https://wasatchappsec.slack.com/team/U05G9FYQ415)\n\n**Location:**\nHealthEquity\n[121 W Scenic Pointe Dr](https://www.google.com/maps/search/?api=1&query=40.479885%2C%20-111.89508)\nHow to find us\nThe building closest to the freeway. Come to the front desk and let them know you're attending the OWASP Meetup. They'll direct you to the conference room."
    },
    {
        "group": "San Antonio",
        "repo": "www-chapter-san-antonio",
        "name": "Shift Left  - A discussion of AppSec Best Practices",
        "date": "2025-01-17",
        "time": "11:00-06:00",
        "link": "https://www.meetup.com/owasp-sanantonio/events/305152881",
        "timezone": "America/Chicago",
        "description": "**Shift Left - A discussion of AppSec Best Practices**\n11am-2pm for session\n2pm-3pm for happy hour\n\n**Details**\nTopics- See abstracts below\n\n* **Strategies for Aligning Programs with Modern Expectations-Frost Bank**\n* **Cultivating Developer Adoption in the era of Artificial Intelligence-Snyk**\n* **The radical future of app and API security is in production-Contrast Security**\n* **Shift Left: Design for Security and Quality**-**CheckMarx**\n\n**Lunch Provided**\nScuzzi’s Italian Restaurant - 4035 N Loop 1604 W #102, San Antonio, TX 78257\n\n**HAPPY HOUR** networking after session!!\n\n**ZOOM** link provided below for remote attendees\n**https://optiv.zoom.us/j/91529424588?pwd=bgMmGiqvaLkEn9GeX8tISW9lcmPoFc.1&from=addon**\n\nWe encourage everyone to attend in person. We will have door prizes and excellent food for all to enjoy, as you take advantage of this excellent networking opportunity!\nPlease feel free to pass this information on to your peers and team members.\n\nPlease reply **“ONSITE”** if you plan on attending in person so we can finalize headcount for food and room attendance \n**Presentations will include:**\n\n***I. Strategies for Aligning Programs with Modern Expectations***\n***Vipul Gupta-SVP Frost Bank***\nIn this talk, Vipul plans to share his experience with building and scaling an Application Security program. He will share why engaging with development and business teams is essential for the Shift Left journey.\n\n***II. Cultivating Developer Adoption in the era of Artificial Intelligence-Snyk***\nIn today’s fast-paced, AI-driven development landscape, securing developer adoption is key to integrating security seamlessly into workflows. This presentation explores practical strategies to overcome challenges like trust, tooling complexity, and unclear ownership. By focusing on people, processes, and tools, we demonstrate how to empower developers, reduce friction, and scale security effectively. Attendees will gain actionable insights to foster a collaborative culture where security becomes a natural part of development.\nOne of the biggest challenges that organizations face when shifting left is getting developers to actually adopt the “shift left\" tools. This presentation speaks to how to overcome that.\n\n***III.*** **Development Team Transformation -Contrast Security**\nThe lines between proactive and reactive cyber defenses are somewhat arbitrary. If you blur those lines, you can some serious advantages. A SAST or SCA tool finding is a theoretical vulnerability that may or may not be exploitable, but if you can see that a vulnerability is within the blast radius of active probes or attacks, it suddenly becomes real. What might have been labeled as \"critical\" in pre-prod suddenly becomes \"super-critical\". On the other hand, things that are not exploitable in a production context due to compensating control, can be deprioritized preserving the limited attention of development for things that really matter. Join DevSecOps pioneer, Larry Maccherone, for this thought-provoking discussion on going right to shift left\n\n***IV.*** **Shift Left: Design for Security and Quality**-**CheckMarx**\nThis presentation will discuss the elements of design phase security, highlighting the critical role of design decisions in achieving a secure and high-quality software product."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2025-02-12",
        "time": "12:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/303349991",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "Jan 2025 Meetup: Safeguarding the Future of Artificial Intelligence",
        "date": "2025-01-15",
        "time": "18:30+08:00",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/305359308",
        "timezone": "Asia/Singapore",
        "description": "The evening will kick off with a thought-provoking presentations by our line up of speakers, setting the stage for an intellectual journey into the heart of AI vulnerabilities and defenses. Attendees will gain insights into the latest adversarial attacks on AI models, delve into the nuances of privacy preservation in AI systems, and explore ethical considerations in AI development and deployment.\n\nThe event will culminate in an interactive Q&A session, encouraging attendees to engage directly with our speakers and fostering the collaborative spirit that both AiSP and OWASP hold dear. This open dialogue will not only address current challenges but also spark discussions on future trends and potential solutions in AI security. Join us for an evening of enlightenment, engagement, and empowerment as we collectively work towards a more secure AI-driven world. Together, we’ll explore how to build unassailable fortresses in the cognitive realm, ensuring that as AI advances, our defenses evolve in tandem.\n\n**Synopsis**:\nIn the rapidly evolving landscape of artificial intelligence, where Large Language Models (LLMs) and advanced AI systems are reshaping our digital world, the need for robust security measures has never been more critical. The Association of Information Security Professionals (AiSP) and the Open Web Application Security Project (OWASP) proudly present “Safeguarding the Future of Artificial Intelligence” an enlightening evening session that bridges the gap between AI innovation and cybersecurity. This event embodies the shared values of AiSP and OWASP – fostering knowledge sharing, promoting best practices, and nurturing a vibrant community of security-conscious professionals.\n\n**Securing AI systems: An overview and the lifecycle approach**\nSpeaker: Mr Loh Chee Keong, Lead Consultant for AI Security, Cybersecurity Engineering Centre, Cyber Security Agency of Singapore\n\n**OWASP Top 10 for LLMs**\nSpeaker: Mr Wong Onn Chee, OWASP SG Chapter Co-Leads & AiSP Data & Privacy SIG EXCO Lead\n\nPlease RSVP your attendance at [Eventbrite page](https://www.eventbrite.sg/e/aisp-ai-sig-meetup-tickets-1076265552239?aff=oddtdtcreator) by 14 January 2024 7pm SGT."
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "4th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-02-11",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584148",
        "timezone": "Europe/Berlin",
        "description": "**TBD**\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-Jan Lunch and Learn",
        "date": "2025-01-24",
        "time": "11:00-05:00",
        "link": "https://www.meetup.com/owasp-tampa/events/305346191",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-Jan Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\\- 11:00am \\- Registration and Lunch\n\\- 12:00pm \\- Speaker \\- Eaton Zveare \\- API Security Blunders: Tales from the Cyber Trenches\n\\- 1:00pm \\- Depart\n\n**Speaker**:\nEaton is a security researcher at Traceable. As a member of Traceable's ASPEN Labs team, he has contributed to the security of some of the world's largest organizations by finding and responsibly disclosing many critical vulnerabilities. He is best known for his high-profile security disclosures in the automotive space.\n\n**Abstract**:\n**API Security Blunders: Tales from the Cyber Trenches**\nDive into API Security by dissecting real-world API vulnerabilities that have caused security breaches. We'll guide you through the process of hunting for such vulnerabilities, and provide insights to effectively defend against such attacks.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W,\nSTE 600\nTampa, FL\n33607\n\n**Sponsors**:\nTraceable - [https://www.traceable.ai/](https://www.traceable.ai/)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "Modern AppSec Requires a Modern Approach",
        "date": "2025-01-22",
        "time": "18:30-05:00",
        "link": "https://www.meetup.com/owasp-toronto/events/305601912",
        "timezone": "America/Toronto",
        "description": "**Format**:\nHybrid (in-person and online)\n\n**In-person location**:\n123 Edward St, Suite 205 (2nd Floor), Toronto, ON, Toronto, ON M5G 1E2\n\n**Talk**:\n**Modern AppSec Requires a Modern Approach**\n\nAs organizations increasingly adopt microservices and serverless architectures, understanding and securing their environments becomes more complex. AppSec teams navigating distributed environments often are dealing with disjointed efforts—developers rushing to patch but not knowing where to start, detection teams crafting exploit rules that could be passed, and threat hunters investigating past compromises—potentially leaving current critical vulnerabilities unaddressed. Teams need a way to connect the dots from when an application is launched to when it’s being attacked. Enter tracing. Tracing requests, enables organizations to quickly identify the source of an attack, mitigate its impact, and enforce necessary measures to prevent additional impact, and provide the needed context to patch. Incorporating tracing can remove the challenges found in distributed applications. In this session, you'll learn:\n\n* What application traces are and how to use them\n* How tracing can be used to investigate and detect attacks\n* Why tracing enhances application security efforts"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver: Strengthening Defenses Against CI/CD Security Threats",
        "date": "2025-01-16",
        "time": "18:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510156",
        "timezone": "America/Vancouver",
        "description": "**Untapped Territory: Strengthening Defenses Against CI/CD Security Threats** with **Farshad Abasi**\n\nAs modern software development practices evolve, CI/CD pipelines have emerged as a potent, yet under-secured frontier. This has resulted in a shift in focus from attackers, who are exploiting the traditionally overlooked vulnerabilities in the development pipelines. In this presentation, we'll dive into the top CI/CD security risks as identified by OWASP. We'll look at how each attack can be performed, explore potential impacts, and the motives of bad actors. This talk will provide you with pragmatic strategies to strengthen your CI/CD security posture. Join us to transform your CI/CD pipeline from a potential vulnerability into a cornerstone of your security infrastructure.\n\n**This event is sponsored by [Forward Security](https://forwardsecurity.com/).**"
    }
]