[
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2023 (Online)",
        "date": "2023-04-25",
        "time": "1:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/290705726",
        "timezone": "America/Chicago",
        "description": "*Due to supplying lunch for attendees so we have sufficient foods, if you would like to attend in-person at NI, please see* \\-\\- Coming Soon\\!\n\n30 minutes of meet-and-greet and Chapter information, then the Presentation!"
    },
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "Null/OWASP Combined monthly meet-up ",
        "date": "2023-04-22",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/292584332",
        "timezone": "Asia/Kolkata",
        "description": "Exploiting Android Activities by UJJAYANI PRADHAN\n\nSecurity Testing on login pages by srinivas\n\nCloud Pentesting by Mukesh kumar Rao\n\nCyber Threat intel and mitre attack by Tarun Sai"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "April Meetup",
        "date": "2023-04-12",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/292582745",
        "timezone": "America/Los_Angeles",
        "description": "Our April Meetup is hosted by Check Point at their San Carlos location.\n\nPlease note: You will be required to show picture ID to enter the building.\n\n**Location**\nCheck Point Software Technologies 959 Skyway Rd #300, San Carlos, CA 94070\n\n**Agenda**\n5:30 - Doors open\n5:30 - 6:00 Food and drinks, networking\n6:00 - 6:45 Ryan Rasmuss - Leveraging ML/AI to advance Application Security\n6:45 - 7:30 Kiran Kamit - Reducing Alert Fatigue with Container Scans: Correlate, Prioritize and Filter Based on Usage\n7:30 - 8:15 Jim Downey - topic TBA\n8:15 - Close\n\n**We will have three talks this month**\n\n**Talk 1:**\n*Leveraging ML/AI to advance Application Security*\n\nDescription:\nWeb Applications and APIs are always vulnerable to new CVEs and victim to constant probing of threat actors. When a new vulnerability is released, we have to identify if our application is susceptible and then build a rule(s) to protect against these exploits. Pair this with applications and APIs that change with every release and we are left feeling uncertain.\n\nIn today's session we will deploy open source tools that leverage machine learning for web applications and APIs. These tools will help us learn about our applications and automatically apply the relevant protections. We can also learn about new exploits in the wild before an official CVE is released.\n\nSpeaker:\nRyan Rasmuss has been working as a security engineer for Check Point Software Ltd for about 5 years. During that time he’s focused on Application Security and Threat Intelligence. Outside of work he’s a big fan of local CTFs, golf, and camping!\n\n**Talk 2:**\n*Reducing Alert Fatigue with Container Scans: Correlate, Prioritize and Filter Based on Usage*\n\nDescription:\nToday, developers and devops engineers are being asked to address vulnerabilities and apply chain risks in container images. However, the volume of noisy security alerts often leads to developers ignoring them entirely or wasting valuable sprint time researching “false positives.”\nThis session will focus on how engineering teams can correlate vulnerabilities with runtime information, prioritize alerts based on usage, and filter out false positives that don’t represent a true exposure of a vulnerability. Prioritizing security updates to only used packages in your container image is a highly effective approach to reducing alert fatigue with your container scans. In addition, your DevOps team can even consider removing some of the unused packages and shrink your container images. As an example, this session will include a demonstration of a typical SCA static container scan of a sample open-source test application and then show how an engineering team can filter alerts to reduce the number of vulnerable and used alerts that actually need to be fixed by developers by up to 90%.\n\nSpeaker:\nKiran Kamity is the Founder & CEO of Deepfactor. He is a serial Silicon Valley entrepreneur with a passion for building products that meet a need and make a business impact—with Deepfactor that’s empowering engineering teams to create secure cloud native applications. Prior to Deepfactor, Kiran was the Head of Product at Cisco Cloud BU, Founder/CEO at ContainerX (acquired by Cisco), and the Founder/VP at RingCube (acquired by Citrix). Kiran is a TEDx speaker and loves nature, travel, and food\n\n**Talk 3:**\n*Details to follow*"
    },
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "Zed Attack Proxy",
        "date": "2023-04-04",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-bonita-springs-chapter/events/292201291",
        "timezone": "America/New_York",
        "description": "Join us online, Tuesday, April 4, at 6:30PM to learn about Zed Attack Proxy (ZAP) from the co-author of 'Zed Attack Proxy Cookbook: Hacking tactics, techniques, and procedures for testing web applications and APIs', Ryan Soper! Ryan will discuss his book as well as walk us through some examples of using ZAP."
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "BASC - Boston Application Security Conference",
        "date": "2023-04-01",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owaspboston/events/292282690",
        "timezone": "America/New_York",
        "description": "**Join us for [BASC 2023](basconf.org) on April 1.**\n\n**See [conference website](https://www.basconf.org/home) for details and [register at eventbrite](https://www.eventbrite.com/e/boston-application-security-conference-basc-2023-tickets-542873247497)**\n\n(There is no conference registration or RSVP here on meetup.)"
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk - ZAP and Burp the Walkthrough",
        "date": "2023-04-25",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044037",
        "timezone": "Europe/London",
        "description": "For the past two years I've been using OWASP ZAP and PortSwigger's Burp Suite (Community Edition), switching between the two as I learned hacking techniques and took part in CTFs. Each has their own pros and cons, features I like, quirks, and even room for improvement.\nFor this event we will be taking a slow walk through the interfaces and features of both tools side-by-side with both pointed at a vulnerable target.\nThis will be an interactive session where you can ask questions throughout. This event is aimed at the beginner who wishes to know more about these two popular tools. This is an unbiased demonstration and both tools will be in an out-of-the-box state with no optional extras / add-ons / plugins installed.\n\n**Agenda:**\n\n* OWASP updates\n* Live interactive demonstration of ZAP and Burp Suite CE\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nThis talk will not be recorded."
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "OWASP Suffolk Fight Club - April 2023",
        "date": "2023-04-11",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-bristol/events/292044025",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Cotonou",
        "repo": "www-chapter-cotonou",
        "name": "Les applications web: Amélioration ou mise en danger de la vie des utilisateurs",
        "date": "2023-04-20",
        "time": "6:00+01:00",
        "link": "https://www.meetup.com/owasp-cotonou-chapter/events/292382900",
        "timezone": "Africa/Porto-Novo",
        "description": "Ce meeting du chapitre OWASP-Cotonou a pour thème général: \"Les applications web: amélioration ou mise en danger de la vie des utilisateurs ?\" Il s'articulera autours des deux thèmes suivants:\n\n**Impacts de la digitalisation sur les internautes,** par **Orace KPAKPO**, Ing Réseaux et Systèmes, Analyst Cybersécurité à EMES SARL, leader du chapitre OWASP Cotonou\n\n**Digitalisation et sécurité au Bénin,** par **Victor OYETOLA**, Expert TIC, responsable du SPTIC à l'UAC"
    },
    {
        "group": "Dorset",
        "repo": "www-chapter-dorset",
        "name": "OWASP Suffolk Fight Club - April 2022",
        "date": "2023-04-11",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-dorset-chapter/events/291889114",
        "timezone": "Europe/London",
        "description": "Hosted by OWASP Suffolk\n\nFight Club has no agenda, no slides, no recording, and is 100% unscripted.\nThis month a live attempt of a HTB machine or challenge."
    },
    {
        "group": "Frankfurt",
        "repo": "www-chapter-frankfurt",
        "name": "OWASP Frankfurt #60 - Security Revolution: Women Leading the Way in AppSec",
        "date": "2023-04-26",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291521942",
        "timezone": "Europe/Berlin",
        "description": "Hi all, for our last OWASP Frankfurt Chapter event before the upcoming [German OWASP Day 2023](https://god.owasp.de/2023/) edition, join us for our **Women in AppSec Special**, where we'll be tackling two of the most pressing topics in the industry today: enhancing security culture through security champions, and offensive security beyond the checkbox. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **CHECK24 Frankfurt.**\n\n_What are we going to talk about?\n\n* _Talk 1 - \\*\"\\***Enhancing security culture through security champions**\" by **Diana Waithanji**, Cybersecurity engineer at SAP.\nAs software development becomes increasingly fast-paced, the need for secure development practices has never been more urgent. Enter the security champion - an individual who advocates for security within their team and takes ownership of all security issues. In this talk, Diana will delve into the principles of success in advocacy through security champions, and explore methods for training software developers to become security champions themselves. Drawing on real-world examples, Diana will also showcase a partnership model in AppSec that has proven to be effective in enhancing security culture within development teams. If you want to learn how to foster a culture of secure development in your team, this talk is not to be missed!\n\n* _Talk 2 - \"**Beyond the Checkbox: Breaking out of Testing Frameworks**\" by **Jiska Classen**, As mobile applications handle sensitive data, ensuring their security is crucial. However, simply securing individual apps is not enough to stop real-world attackers who exploit devices through other avenues. This talk will explore unconventional security testing approaches that can help improve app security by addressing vulnerabilities in the operating system, hardware, and third-party libraries. Discover how attackers can exploit wireless interfaces, sandboxing, privilege checking bypasses, and more. Let's explore why these attack vectors are relevant in practice and how to address them beyond standard security testing checklists.\n\n_Afterwards? We will pre- and conclude the evening with the possibility to **socialize** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24 Frankfurt**.\n\n_When\nOur Meetup takes place on the last Wednesday of the month in April, namely on 26.04.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    },
    {
        "group": "Hong Kong",
        "repo": "www-chapter-hong-kong",
        "name": "Smart Contract Hacking Lab",
        "date": "2023-04-04",
        "time": "6:00+08:00",
        "link": "https://www.meetup.com/owasp-hong-kong-chapter/events/292483522",
        "timezone": "Asia/Shanghai",
        "description": "Smart Contract Hacking self practice and idea exchange"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-04-10",
        "time": "8:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/291605618",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "Reconnaissance like a cyber scout.",
        "date": "2023-04-10",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/292411394",
        "timezone": "America/Fortaleza",
        "description": "Por que e de que maneira é levantado informações do perímetro de uma empresa durante uma operação? Como diria o provérbio chinês: \"Para cortar uma árvore bem rápido, gaste o dobro do tempo afiando o machado\". Trazendo para nossa interpretação: \"Consiga o máximo de informações e melhor será o seu resultado da invasão\". Esta palestra irá abordar o fundamento de uma enumeração de perímetro, seguindo para a exibição da notória ferramenta ReconFTW que automatiza todo o processo e será concluído detalhando a contribuição do palestrante para o projeto, que é open-source e foi idealizado pelo \"Six2dez\"."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - APR 26, 2023",
        "date": "2023-04-26",
        "time": "7:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/291490081",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: TBA\n\n**ABSTRACT**: TBA\n\n**Thanks to our Sponsor**: [IriusRisk](https://www.iriusrisk.com/)\n*When it comes to application development, security is paramount. With **IriusRisk**’s automated, scalable and easy-to-use threat modeling platform, your engineers can iron out architectural security flaws before writing code, helping you avoid costly re-design and get to market faster with secure products your customers can rely on.*\n\n*Vendors interested in sponsoring send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Maine",
        "repo": "www-chapter-maine",
        "name": "1st Annual 2023 OWASP Maine Secure Coding Tournament",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/292101163",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 1st annual OWASP Maine Secure Coding Tournament! This will be an in person meetup where we welcome all software developers and appsec professionals from entry level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2023!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* $500 VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* $100 VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* $50 VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Wednesday April 19th 2023 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:** [https://discover.securecodewarrior.com/tournament-maine23.html](https://discover.securecodewarrior.com/tournament-maine23.html)\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "April 2023 OWASP Chapter Netherlands Meetup",
        "date": "2023-04-20",
        "time": "9:00+02:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/292323208",
        "timezone": "Europe/Amsterdam",
        "description": "This is an online meeting and will be streamed on YouTube.\n\n19:00 - 19:10 - **Welcome and OWASP updates**\n19:10 - 19:55 - **The Rise of the Security Verification Standard** by **Josh Grossman**\n19:55 - 20:05 - **Questions and** **Break**\n20:05 - 20:50 - **OWASP Juice Shop** by **Björn Kimminich**\n\n**The Rise of the Security Verification Standard**\n*Abstract:*\nWe are currently seeing a big uptick in the progression of the OWASP Application Security Verification Standard (ASVS) as well as the Mobile version (MASVS). Not only are two major releases in the pipeline (5.0 and 2.0 respectively) but we are now seeing industry stand up, take notice and start expecting more from applications, based on these standards. In this talk, Josh Grossman (one of the ASVS project leaders) will take you through these key developments including our vision for the upcoming version 5.0 of the ASVS and how you and your employer can be involved in the final release.\nThis will also be a chance to hear first-hand about a couple of new programmes where you will see the SVSs being more widely used and required and how you can prepare your organizations for this significant impact this will have, whether you are developing applications or you are assessing them.\n\n*Bio:*\nJosh Grossman has worked as a consultant in IT and Application Security and Risk for 15 years now, as well as a Software Developer. This has given him an in-depth understanding of how to manage the balance between business needs, developer needs and security needs which goes into a successful software security programme.\n\nJosh is currently CTO for Bounce Security where he helps clients improve and get better value from their application security processes and provides specialist application security advice. His consultancy work has led him to work, speak and deliver training both locally and worldwide including privately for ISACA and Manicode and publicly for OWASP's Global AppSec conferences. In his spare time, he co-leads the OWASP Application Security Verification Standard project and is on the OWASP Israel chapter board.\n\nHe was also recognized as a Key Contributor for the OWASP Proactive Controls project and has also contributed to the OWASP Top 10 Risks project and the OWASP JuiceShop project.\n\n**OWASP Juice Shop**\n*Abstract:*\nOWASP Juice Shop is probably the most modern and sophisticated insecure web application! It can be used in security training, awareness demos, CTFs and as a guinea pig for security tools!\n\nJuice Shop encompasses vulnerabilities from the entire OWASP Top Ten along with many other security flaws found in real-world applications!\n\nAt this event, we will take a tour through the application, hack it live on screen, learn about Coding Challenges, CTF mode, cheat detection, custom theming, and more!\n\n*Bio:*\nBjoern Kimminich works as Product Group Lead Application Ecosystem at Kuehne + Nagel, responsible – among other things – for the Application Security program in corporate IT. He is an OWASP Lifetime Member, the project leader of the OWASP Juice Shop, and a co-chapter leader for the OWASP Germany Chapter. Björn also currently chairs the OWASP Project Committee."
    },
    {
        "group": "Oakland County",
        "repo": "www-chapter-oakland-county",
        "name": "Kubernetes – “containers aren't just for leftovers”",
        "date": "2023-04-13",
        "time": "9:00-04:00",
        "link": "https://www.meetup.com/owasp-oakland-county-chapter/events/292303253",
        "timezone": "America/New_York",
        "description": "An exploratory look at what Kubernetes is, how it works, and how it can be implemented to provide modern solutions to dated problems.\n\n5:30pm - Socializing (Towne Square Food and Spirits)\n7:00pm - Announcements followed by this month's speaker presentation starts\n8:00pm - presentation ends, socializing\n\nTowne Square Food and Spirits entrance:\nPark in the East parking lot of 1 Town center and look for the awning to the right of the main entrance of the 1 town center building. That is the restaurant. We meet in the main dinning center to the right of the restaurant's entrance. The presentation is given in the room to the left of the Bar you face once you enter. It's advised first time attendees show up before to socialize but also follow the group into the presentation area."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa April 19th 2023:Passing Compliance with DevSecOps,GraphQL with Burp",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/292471760",
        "timezone": "America/Toronto",
        "description": "This is the second of two events for OWASP Ottawa in the month of April.\n\n**Welcome to our in Person Meetup at the University of Ottawa**\n\nIn-Person Location:\n150 Louis-Pasteur Private, Ottawa,\nUniversity of Ottawa\nRoom 117\n\n**Health Notice:**\nBased on the [Ottawa Public Health Guidelines](https://www.ottawapublichealth.ca/en/public-health-topics/masks.aspx) we strongly recommend that attendees wear a mask while not presenting. This will reduce the risk of transmission and protect members who may have compromised immune systems.\n\n**Live Stream**:\nWe will continue to Live Stream on our YouTube channel. (https://www.youtube.com/channel/UCxSU-KvNmYusZEq6v4YK5Lw). Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!\n\n**YouTube Live Stream Link**: https://www.youtube.com/watch?v=mf3-pPYpnr0\n\n**6:00 PM EDT** Arrival, setup, mingle\n**6:30 PM EDT** Technical Talks\n\n1. **Introduction to OWASP Ottawa, Public Announcements.**\n2. **Passing Compliance Audit with DevSecOps is Easier than You Think. Here’s How.**\n***Abstract:***\nBusiness people may not always understand all the technicalities of cyber threats and vulnerabilities, but rest assured they know what will happen if they don’t comply with applicable laws and regulations which can easily result in hefty fines, revoked licences, losing customers, or even going to jail.\nThe challenge that many small, medium and even large companies that practice DevOps face is how to pass a compliance audit quickly and painlessly without breaking the bank on manual labour or spending months ferociously fighting auditors. It took almost a decade for IT to meld Dev and Ops into one cohesive consonance, but getting compliance, risk and audit folks to understand and accept DevOps as a new and unavoidable way of developing and running software sometimes creates an even greater challenge.\nIn this presentation, Simon Sulyma will explain where traditional compliance audits fell short in today’s modern environments and explore how DevOps processes and tools can be used to effectively audit controls.\n***Bio:***\nSimon is a network administrator turned cyber security and risk professional, an avid hiker and mountain biker, a self-made chef, and a recovering ice cream addict. Simon is also raising two teenage kids, so you can't scare him. Simon spent his last 17 years designing, building, securing and auditing complex IT systems and networks, mostly at big banks. Simon is currently leading a team of eight amazing folks who do threat risk assessments at a large insurance company. He is a big fan of vendor-neutral certifications that start with \"C\" and holds a number of them as he thinks they look good in his resume.\n3. **We Taught Burp to Speak GraphQL: Automated Security Scanning of Your GraphQL API With Burp**\n***Abstract:***\nRest APIs have been the backbone of webapps for over a decade now, and it’s treated us well. Inevitably, a challenger has approached and is gradually becoming the new industry standard. That is GraphQL, a query a language for your API. But shifts in tech trends also bring another inevitability, new and interesting ways to hack stuff. GraphQL is a growing target, and the pentesting tools have yet to keep up, leaving the criminals with more time and opportunity to probe and exploit vulnerabilities in your web apps.\nBurp Suite has been the defacto tool for Application Security professionals running DAST scans and penetration tests against web apps, and it’s amazing Active Scan feature badly needed to be able to parse GraphQL. Our new plugin for Burp Suite allows the Active Scanner to competently point it’s library of payloads at a GraphQL API, giving the defenders a chance to detect vulnerabilities before the criminals do.\n**Bio**:\nJared Meit, OSWE, has always had a passion for taking things apart, learning how they work, and forgetting how to put them back together. He was a professional software developer for 12 years before shifting his focus to Application Security 5 years ago. His dev experience allows him to create tools that developer's will actually want to use."
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa April 12th 2023: Kanata, Github Actions, 3 Friends of OWASP Top10",
        "date": "2023-04-12",
        "time": "5:00-04:00",
        "link": "https://www.meetup.com/owasp-ottawa/events/292502745",
        "timezone": "America/Toronto",
        "description": "This page described the first of two OWASP Ottawa Meetups in April. The first, at the Trend office in Kanata. The second will be at our regular location at the University of Ottawa.\n\n**Welcome to our in Person Meetup at the Trend Office in Kanata**\nBefore the pandemic we use to meetup every so often in Kanata at lunch in the Trend offices amongst others. Now, we are restarting this tradition this April at the newly renovated Trend office in Kanata.\n\nTrend has renovated their Ottawa location and keen to show it off so they have a tour, refreshments (as in beer), and talks.\n\n**Trend office Location**:\n40 Hines Rd.\n**Trend Signup Page**: [https://resources.trendmicro.com/owasp-ottawa.html](https://resources.trendmicro.com/owasp-ottawa.html)\n\n**Live Stream**:\nWe will continue to Live Stream on our YouTube channel. Details to follow.\n\n**YouTube Live Stream Link**:\n\nNote that talks start at 5.\n\n| 3:00 - 3:30 | Reception Coffee |\n| ----------- | ---------------- |\n| 3:30 - 4:30 | Welcome & Office Tour |\n| 4:30 - 5:00 | Refreshments |\n| 5:00 - 5:15 | Trend Micro Welcome and Introductions |\n| 5:15 - 5:30 | How to get more from a Cloud-native application protection from One Platform |\n| 5:30 - 6:00 | Garth Boyd: Three Friends from the OWASP Top 10 |\n| 6:00 - 6:30 | Magno Logan: Github Actions 101: Creating a DevSecOps Pipeline |\n| 6:30 - 8:00 | Q&A & Networking |\n\n**Garth Boyd: Three Friends from the OWASP Top 10**\nThe OWASP Foundation is best known for its flagship project, the \"OWASP Top 10\". First released in 2003, the project has had several reorganizations and updates as it has reached a global audience. This presentation will briefly talk about OWASP the foundation, and OWASP Top 10 the project. But one hour is insufficient to talk about each element of the top 10. Instead, this presentation focuses on the investigation, lessons learned, and thrills and chills associated with The Three Friends that keep Garth up at night.\n\n**Speaker Bio**:\nGarth Boyd is a Senior Application Security Architect/Cloud Security Architect specializing in Secure Software Architecture and Ethical Hacking. He supports organizations wishing a designer, creator, and breaker to help them on their security path. A lifelong learner who enjoys crafting solutions to interesting and tough problems through architecture, threat modelling, mitigation design, and penetration testing. Researching new ideas, troubleshooting, communication, and thinking of six impossible things before breakfast are part of the journey. Currently, Garth is the OWASP Ottawa Chapter Leader and an independent consultant currently working with Mirai.\n\n**Magno Logan: Github Actions 101: Creating a DevSecOps Pipeline**\nOne of the main tools used in this process is a continuous integration (CI) tool that automates code changes from multiple developers working on the same project. In 2019, GitHub released its own CI tool called GitHub Actions. According to GitHub, GitHub Actions help you automate tasks within your software development life cycle, and it has been gaining a lot of adoption from developers.\nThis talk will demonstrate how GitHub Actions work and show security tools to protect your applications from attackers. First, we’ll dive deeply into the Actions, the language, and the runners, the servers provided by GitHub to run your Actions. Then, we’ll show how to run SAST, DAST, and SCA using open source or free tools into your pipeline just using GitHub Actions. We’ll set up Actions for each tool to scan our application for security vulnerabilities at every pull request. We’ll leverage CodeQL and Semgrep for SAST, OWASP ZAP and Nuclei for DAST, and Dependabot and OWASP Dependency Check for SCA.\n\n**Speaker Bio:**\nMagno Logan works as an Information Security Specialist for Trend Micro. He specializes in Cloud, Container, and Application Security Research, Threat Modelling, and DevSecOps. In addition, he has been tapped as a resource speaker for numerous security conferences around the globe."
    },
    {
        "group": "Portland Me",
        "repo": "www-chapter-portland-me",
        "name": "1st Annual 2023 OWASP Maine Secure Coding Tournament",
        "date": "2023-04-19",
        "time": "8:00-04:00",
        "link": "https://www.meetup.com/owasp-maine/events/292101163",
        "timezone": "America/New_York",
        "description": "Are you an appsec guru and pride yourself in secure coding? Are you a developer and know you write **THE MOST** secure code out of your peers? Well here is your chance to come out and prove it and win **$CASH!$**\n\nOWASP Maine partnered with Secure Code Warrior will be hosting the 1st annual OWASP Maine Secure Coding Tournament! This will be an in person meetup where we welcome all software developers and appsec professionals from entry level to principal. Bring your laptop and your secure coding wits and compete against your peers to be crowned the most secure coder in the state of Maine for 2023!\n\n**Prizes will be as follows:**\n\n**1st Place**\n\n* Crowned most secure coder in the state of Maine\n* Pretty cool trophy (pics to come)\n* $500 VISA giftcard!\n\n**2nd Place**\n\n* Second place trophy\n* Some cool Secure Code Warrior Swag\n* $100 VISA giftcard!\n\n**3rd Place**\n\n* Third place trophy\n* Some slightly less cool swag\n* $50 VISA giftcard!\n\nFor everyone else? You will gain new skills in secure coding, network with your peers, and also get free pizza and drinks!\n\nParticipating in the tournament is not required, feel free to join us either way for networking and learning something new!\n\n**When:** Wednesday April 19th 2023 6:00pm - 8:00pm est\n**Where:** IDEXX Laboratories 1 Idexx Dr. Westbrook, ME 04092\n**Who:** Security and Development leadership and practitioners from Maine and all of northern New England\n\n**REQUIREMENTS:**\n\n**\\*You must also register for the Secure Code Warrior tournament here:** [https://discover.securecodewarrior.com/tournament-maine23.html](https://discover.securecodewarrior.com/tournament-maine23.html)\n**\\*You must bring your own laptop/machine to participate**\n**\\*You must be onsite and in person to participate**\n\n**OWASP Maine Linkedin Page:** [https://www.linkedin.com/company/owasp-maine/](https://www.linkedin.com/company/owasp-maine/)"
    },
    {
        "group": "Sacramento",
        "repo": "www-chapter-sacramento",
        "name": "April Meetups",
        "date": "2023-04-19",
        "time": "9:00-07:00",
        "link": "https://www.meetup.com/owasp-sacramento-chapter/events/292421031",
        "timezone": "America/Los_Angeles",
        "description": "OWASP Sacramento will meet the third Wednesday of the month. We will announce topics 2-3 weeks in advanced of our meetups.\n\nPlease join our [Slack](https://owasp.org/slack/invite) @ #chapter-sacramento\n\nAgenda\n\n* Food and Beverages\n* Intro to the chapter\n* Desired outcome from the community\n* Brief Threat Model of AWS Security"
    },
    {
        "group": "Sastra University",
        "repo": "www-chapter-sastra-university",
        "name": "From Student to Cybersecurity Intern: Insights and Learning Curve",
        "date": "2023-04-01",
        "time": "9:00+05:30",
        "link": "https://www.meetup.com/owasp-sastra-university-meetup-group/events/292492224",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an insightful webinar with Abisheik Magesh, as he shares his journey and learning curve from a student to a cybersecurity intern.\nDon't miss out on this opportunity to learn from a SecDevOps Intern at Synchroy and a Synack Red Teamer, and the Lead of OWASP Thiruvallur."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-04-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292263676",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-04-12",
        "time": "2:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/292263675",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "ZAP and Burp the Walkthrough",
        "date": "2023-04-25",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291848350",
        "timezone": "Europe/London",
        "description": "For the past two years I've been using OWASP ZAP and PortSwigger's Burp Suite (Community Edition), switching between the two as I learned hacking techniques and took part in CTFs. Each has their own pros and cons, features I like, quirks, and even room for improvement.\n\nFor this event we will be taking a slow walk through the interfaces and features of both tools side-by-side with both pointed at a vulnerable target.\n\nThis will be an interactive session where you can ask questions throughout. This event is aimed at the beginner who wishes to know more about these two popular tools. This is an unbiased demonstration and both tools will be in an out-of-the-box state with no optional extras / add-ons / plugins installed.\n\nAgenda:\n\n* OWASP updates\n* Live interactive demonstration of ZAP and Burp Suite CE\n\nDisclaimer: As always our events are designed to educate. Any tools and techniques demonstrated are for informative purposes only. We do not endorse their use for malicious purposes.\n\nThis talk will not be recorded."
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "OWASP Suffolk Fight Club - April 2023",
        "date": "2023-04-11",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-suffolk-chapter/events/291864839",
        "timezone": "Europe/London",
        "description": "No agenda, no slides, no recording, 100% unscripted.\n\nPractical learning: Live ethical hacking challenges, workshops, CTFs and sharing of knowledge."
    },
    {
        "group": "Taiwan",
        "repo": "www-chapter-taiwan",
        "name": "OWASP Taiwan Meetup (APR, 2023)",
        "date": "2023-04-07",
        "time": "3:20+08:00",
        "link": "https://www.meetup.com/taipei-owasp-meetup-group/events/292383519",
        "timezone": "Asia/Taipei",
        "description": "OWASP Taiwan Chapter Meetup  OWASP \n\n\n\n [KKTIX](https://csa.kktix.cc/events/owasp202304-copy-1)\n 200/()"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "AppSec Roundtable, hosted by Chris Romeo",
        "date": "2023-04-27",
        "time": "2:00-04:00",
        "link": "https://www.meetup.com/owasptriangle/events/291207489",
        "timezone": "America/New_York",
        "description": "Following up on the success of our first AppSec round table in January, we'll continue the format for our April meeting. The host will present questions to get the conversation going, and the group will share insights and wisdom!"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Tracing webapp exploitability through code review and taint analysis",
        "date": "2023-04-20",
        "time": "8:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248498",
        "timezone": "America/Vancouver",
        "description": "**Title**: Tracing web application exploitability through code review and taint analysis\n**Speaker**: Dana Epp\n\nCome learn how to look at your web apps and APIs more offensively to discover the exploitability of your code before your adversaries do.\n\nThis event is sponsored by **Microsoft** \\- thanks for providing us space and food\\."
    },
    {
        "group": "Waterloo",
        "repo": "www-chapter-waterloo",
        "name": "OWASP Waterloo - Enhancing the security of your Kubernetes cluster",
        "date": "2023-04-04",
        "time": "8:30-04:00",
        "link": "https://www.meetup.com/owasp-waterloo-meetup-group/events/292294645",
        "timezone": "America/Toronto",
        "description": "Dear OWASP Waterloo Community Members,\n\nWe are excited to announce our upcoming OWASP chapter meetup on \"Enhancing the security of your Kubernetes cluster.\" Join us virtually for an engaging and informative session on securing Kubernetes clusters using best practices and cutting-edge security tools.\n\nDuring this meetup, our expert speakers will cover the following topics:\n\n1. Running CIS Benchmarks against Kubernetes Clusters: Learn how to assess the security configuration of your K8s cluster using the Center for Internet Security (CIS) benchmarks to ensure compliance with industry best practices.\n2. Seccomp and AppArmor in Kubernetes: Discover the importance of implementing Linux security features like Seccomp and AppArmor in your K8s environment to limit system calls and resource access, minimizing the attack surface.\n3. Using Falco to Identify a Breach in Cluster: Explore how to deploy and use Falco, an open-source cloud-native runtime security project, for monitoring K8s cluster security, identifying potential breaches, and generating alerts for security incidents.\n\nThis meetup is a fantastic opportunity for security professionals, developers, and Kubernetes enthusiasts to network, share knowledge and stay up-to-date on the latest security trends and best practices in Kubernetes.\n\nEvent Details:\nDate: March 30, 2023\nTime: 6:30 PM - 7.30 PM EST\nLocation: https://us06web.zoom.us/j/85253024263?pwd=ckdtRE5XTmlBUFpNUTc3YXFtRlVhdz09\n\nWe look forward to seeing you!"
    },
    {
        "group": "Wrongsecrets",
        "repo": "www-project-wrongsecrets",
        "name": "OWASP Frankfurt #60 - Security Revolution: Women Leading the Way in AppSec",
        "date": "2023-04-26",
        "time": "8:00+02:00",
        "link": "https://www.meetup.com/owasp-frankfurt/events/291521942",
        "timezone": "Europe/Berlin",
        "description": "Hi all, for our last OWASP Frankfurt Chapter event before the upcoming [German OWASP Day 2023](https://god.owasp.de/2023/) edition, join us for our **Women in AppSec Special**, where we'll be tackling two of the most pressing topics in the industry today: enhancing security culture through security champions, and offensive security beyond the checkbox. There will also be plenty of time to socialize before and after the event at the venue.\n\n_What's going to happen?\nWe look forward to welcoming you to our OWASP Frankfurt Meetup hosted by **CHECK24 Frankfurt.**\n\n_What are we going to talk about?\n\n* _Talk 1 - \\*\"\\***Enhancing security culture through security champions**\" by **Diana Waithanji**, Cybersecurity engineer at SAP.\nAs software development becomes increasingly fast-paced, the need for secure development practices has never been more urgent. Enter the security champion - an individual who advocates for security within their team and takes ownership of all security issues. In this talk, Diana will delve into the principles of success in advocacy through security champions, and explore methods for training software developers to become security champions themselves. Drawing on real-world examples, Diana will also showcase a partnership model in AppSec that has proven to be effective in enhancing security culture within development teams. If you want to learn how to foster a culture of secure development in your team, this talk is not to be missed!\n\n* _Talk 2 - \"**Beyond the Checkbox: Breaking out of Testing Frameworks**\" by **Jiska Classen**, As mobile applications handle sensitive data, ensuring their security is crucial. However, simply securing individual apps is not enough to stop real-world attackers who exploit devices through other avenues. This talk will explore unconventional security testing approaches that can help improve app security by addressing vulnerabilities in the operating system, hardware, and third-party libraries. Discover how attackers can exploit wireless interfaces, sandboxing, privilege checking bypasses, and more. Let's explore why these attack vectors are relevant in practice and how to address them beyond standard security testing checklists.\n\n_Afterwards? We will pre- and conclude the evening with the possibility to **socialize** at the venue with **free food and cold & hot drinks** kindly provided by **CHECK24 Frankfurt**.\n\n_When\nOur Meetup takes place on the last Wednesday of the month in April, namely on 26.04.2023 from 18:00 to 21.00 o'clock CEST.\n\n_Where?\nCHECK24 Frankfurt is located at Speicherstraße 55 in Frankfurt am Main, ca. 15min within walking distance of Frankfurt Hauptbahnhof.\n\n_Interested in **giving a talk** yourself?\nGet in touch with the Frankfurt Chapter Leads (Dan Gora or Jonas Becker)\n\n_And now?\nSave the date, **spread the word** and bring your friends and colleagues along to our event.\n\n_Follow Us!\nAlso, follow us on **[Twitter #owasp_frankfurt](https://twitter.com/owasp_frankfurt)**[ ](https://twitter.com/owasp_frankfurt)and refer to our [OWASP Frankfurt site](https://owasp.org/www-chapter-germany/stammtische/frankfurt/) for information including slides and recordings of previous presentations\n\nWe're looking forward to seeing you for this in-person event!"
    }
]