[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - May",
        "date": "2025-05-27",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/303407314",
        "timezone": "Europe/Copenhagen",
        "description": "This event will be hosted by and at Systematic.\n\nMore info coming but reach out if you would like to be a host or do a presentation"
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "Hacking AWS IAM: Live Walkthrough",
        "date": "2025-05-29",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/307356952",
        "timezone": "America/New_York",
        "description": "Identity and access management in the cloud remains the most fertile ground for high-value exploitations. So why is it still the least understood part of AWS? For starters, the way RBAC was implemented in the public cloud created a series of unintended consequences (role proliferation, etc) that confound security. Add to that how confusing the interconnecting IAM policy logic tree is. Then consider most are trying to understand ‘identity’ in the cloud as something akin to human credentials… when it’s far from that. Add it all together, and you have the beautiful mess we’re trying to manage today.\n\nJeff Moncrief’s been puzzling through the how and why of cloud IAM for the past few years. He found the best way to learn IAM is to just break it. Join Jeff as he deploys his ‘IAM walker’ script and shows the holes in a typical AWS environment, moves laterally from a typically ec2 exploit, abuses privilege escalation, steals data, and exfiltrates successfully without detection. Along the way, he’ll discuss:\n\n* Why we misunderstand the purpose of IAM in AWS\n* Rethinking IAM responsibilities of devs vs. security without breaking workloads\n* Different control points in AWS, like implementing service-level security and designating ‘sensitive permissions’"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - May 2025 (Online)",
        "date": "2025-05-27",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/305489299",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\n(To Be updated)"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "May 2025 OWASP Happy Hour sponsored by Levo.ai",
        "date": "2025-05-08",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/307410856",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, May 8th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** Levo.ai\n*Levo.ai is an API Security Platform that automatically and continuously discovers, documents, tests, and monitors APIs—essential practices endorsed by OWASP and compliance frameworks like PCI.*\n\n*Founded by an Engineering Leader Buchi Reddy Busi Reddy, tackles the root cause of security incidents—insecure code— by integrating visibility and security testing early in the development cycle.*"
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": " OWASP Bhopal CTF: Hack, Learn, Secure! ",
        "date": "2025-05-11",
        "time": "12:00+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/306875181",
        "timezone": "Asia/Kolkata",
        "description": "Get ready for an exhilarating **Capture The Flag (CTF)** competition hosted by **OWASP Bhopal**! Whether you're a **cybersecurity enthusiast, ethical hacker, or a beginner**, this event is designed to **test your skills, enhance your knowledge, and challenge your problem-solving abilities**.\nExpect **real-world security challenges** covering **web exploitation, cryptography, forensics, reverse engineering, and more**. Compete with some of the best minds in security, **solve exciting puzzles, and climb the leaderboard** to prove your expertise.\n\n **Who Can Participate?** – Open to all security enthusiasts, students, professionals, and CTF lovers!\n **What’s in it for You?** – Hands-on experience, recognition, and bragging rights as a top ethical hacker!\nStay tuned for more details on **registration, format, and prizes!** Are you ready to **Hack, Learn, and Secure**? "
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "Ask a Developer",
        "date": "2025-05-21",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/307444258",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [WWT](https://www.wwt.com/)**\n\nCome join us for an insightful session where you can learn more about security from the perspective of your developers.\n\nSecurity professionals have different priorities than developers, and this can lead to friction between the two groups. In this session, we will discuss how to see things from a developer's perspective, which can help you communicate more effectively and even empathize with them, leading to a more productive (and maybe even enjoyable) relationship.\n\nBring your questions and be ready to share your own experiences!\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments!\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Vectors: The building block of ML/AI",
        "date": "2025-05-15",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/307357762",
        "timezone": "America/New_York",
        "description": "Vectors are the lego brick of the current ML/AI hype cycle. The problem is, MANY people misunderstand what vectors are, and without this foundational footing everything crumbles. AI projects have an astonishing 80% failure rate and many vendor products might not function properly. If they wish, attendees of this talk can play along with Mick with interactive demos\\*. You can take these demos after the talk with you too.\n\n\\* if you want to do the demos live you will need a tablet or laptop computer and a Google account."
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "MetaCTF May 2025 Flash CTF",
        "date": "2025-05-22",
        "time": "17:00-04:00",
        "link": "https://www.meetup.com/owasp-delaware-chapter/events/307573765",
        "timezone": "America/New_York",
        "description": "This free capture the flag (CTF) event is hosted by MetaCTF.com, and will cover challenges in Web Exploitation, Forensics, and more.\n\nThere will be 5 challenges, and you will have 2 hours to solve as many as you can.\n\nParticipation is individual and free to enter. Although participation is individual, OWASP Delaware will have a **private scoreboard.** #fancy\n\nStep 0) To join the private scoreboard **RSVP at Meetup** (a.k.a. \"Attend\") this event. You will see the scoreboard key upon RSVP.\nStep 1) Then **register for the CTF** at [https://mctf.io/may2025](https://mctf.io/may2025)\nStep 2) From the MetaCTF Dashboard, click \"**Compete**\" next to the May 2025 event to access the CTF site.\nStep 3) Go to the \"Scoreboard\" page and click \"**+ Join a Scoreboard**\". You will be able to enter the private scoreboard key (from Step 0).\nStep 4) During the event join the **OWASP Delaware Discord** (below) to boast of p0wnage, or to ask for help.\n\nFor practice, check out the challenges **and solutions** from a previous Flash CTF at [https://mctf.io/practice](https://mctf.io/practice). #TheMoreYouKnow\n\nBTW - I was told the private scoreboard key will also work for the (past) April Flash CTF.\n\nDuring the event we can chat on the **OWASP Delaware Discord**. Don't know where that is? DM me or another OWASP Delaware chapter co-lead for details.\n\nDisclaimer I saw on the MetaCTF practice CTF: \"*By signing up for this CTF, you consent to be contacted by MetaCTF or sponsors about their services.*\" ¯\\\\_()_/¯\n\nPS: This event **might** get an **optional physical location** for those that want to collab IRL. Standby for emails via Meetup for more details (sent to those that RSVP here at Meetup for this event)."
    },
    {
        "group": "Fortaleza",
        "repo": "www-chapter-fortaleza",
        "name": "OWASP Fortaleza - Chapter Meetup 2025.1",
        "date": "2025-05-10",
        "time": "09:00-03:00",
        "link": "https://www.meetup.com/owasp-fortaleza/events/307083615",
        "timezone": "America/Fortaleza",
        "description": "Anunciamos oficialmente nosso primeiro encontro em 2025 da comunidade OWASP Fortaleza.\n\nGaranta sua vaga.\n\n**Teremos:**\nPalestras,\nSorteios\n\nEm breve mais informações."
    },
    {
        "group": "Harrisburg",
        "repo": "www-chapter-harrisburg",
        "name": "OWASP Harrisburg - Hello, World!",
        "date": "2025-05-28",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-harrisburg/events/306908330",
        "timezone": "America/New_York",
        "description": "*print(\"Hello, World!\")*\n\nJoin us for our inaugural OWASP Harrisburg chapter meetup as we connect, outline our goals, and brainstorm upcoming topics and activities. Help shape the direction of this new community from day one and be part of building a stronger, more secure future!\n\n*Our events are free and open to everyone. You don't have to be an OWASP member or hold a cybersecurity or software development role to* *attend!*"
    },
    {
        "group": "Heilbronn",
        "repo": "www-chapter-heilbronn",
        "name": "OWASP Stammtisch Heilbronn – Wir sind zurück!",
        "date": "2025-05-08",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-heilbronn-chapter/events/307177537",
        "timezone": "Europe/Berlin",
        "description": "Nach einer längeren Pause melden wir uns mit neuem Schwung zurück und laden herzlich zum **Reboot des OWASP Stammtischs Heilbronn** ein!\n\n Termin: 8. Mai 2025\n Einlass: ab 18:00 Uhr\n Programmstart: 18:30 Uhr\n Ort: Restaurant Cäcilie, Heilbronn\n [https://restaurants.schwarz/restaurant-caecilie](https://restaurants.schwarz/restaurant-caecilie)\n\n Unsere Vortrags-Highlights zum Reboot:\n\n* **Tobias Glemser**: \"OWASP ist so viel mehr als die Top 10\"\n* **Benjamin Häublein**: \"OAuth sicher mit Single-Page-Applications nutzen: Architektur-Pattern und Best Practices\"\n\nIm Anschluss laden wir zum gemütlichen Austausch bei Snacks ein – ideal zum Netzwerken, Fachsimpeln und Wiedersehen \n\n Voranmeldung erbeten – entweder über:\n Meetup: [https://www.meetup.com/owasp-heilbronn-chapter/events/307177537/](https://www.meetup.com/owasp-heilbronn-chapter/events/307177537/)\n DFN Terminplaner: [https://terminplaner6.dfn.de/de/b/0c4d54ba94959fae375841a1abef14d3-1179298](https://terminplaner6.dfn.de/de/b/0c4d54ba94959fae375841a1abef14d3-1179298)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "APIs & The Undocumented Attack Surface",
        "date": "2025-05-19",
        "time": "18:30-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville/events/306968954",
        "timezone": "America/New_York",
        "description": "With 84% of all internet traffic being API driven, with 64% of APIs being a breach vector, with only 4% of organizations really securing those APIs, how much of the attack surface is going undocumented & unsecured. Zombies, ghost, shadow or orphan APIs, what is getting by? Now, introduce AI generated code, AI generated code review where and how do you address it at the enterprise level?"
    },
    {
        "group": "London",
        "repo": "www-chapter-london",
        "name": "OWASP London Chapter Meetup",
        "date": "2025-05-19",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-london/events/307603231",
        "timezone": "Europe/London",
        "description": "**This event is kindly hosted by Civo Tech Junction and sponsored by Endor Labs . There is limited seating available for in-person attendees. Registration required.**\n**This event will be live-streamed on YouTube.**\n**Recordings will be available on the OWASP London YouTube channel.**\n\n**Venue Location**: Civo Tech Junction, First Floor, 32-37 Cowper Street, London, EC2A 4AW\n**Nearest Tube:** Old Street (Northern Line), Cowper Street exit - 1 min walk\n**Doors Open at 6pm** for registration, pizza, drinks and networking. The talks start at 6:30pm (we start on time!).\n\n**TALKS:**\n\n**OWASP Introduction, Welcome and News** \\- Sam Stepanyan\\, Andra Lezza\\, Sherif Mansour \\- OWASP London Chapter Leaders\n\n\"**Attacks on Open Source Supply Chains: How Hackers Poison the Well**\" - **Henrik Plate**\n\nThe ubiquitous use of open source during software development makes it an interesting and valuable target for software supply chain attacks, where\nattackers inject malicious code in upstream open source projects such that it is executed by software developers or end users down the line. This talk provides an overview about common attack vectors, illustrated by real-world examples, and sheds some light on countermeasures.\n\n**\"Introducing the OWASP SocialOSINTLM Project\" - Brenden Miller**\n\n**SocialOSINTLM** is a powerful Python-based tool designed for Open Source Intelligence (OSINT) gathering and analysis. It aggregates and analyzes user activity across multiple social media platforms, including Twitter / X, Reddit, Hacker News (via Algolia), Mastadon and Bluesky. Leveraging AI through the OpenRouter API, it provides comprehensive insights into user engagement, content themes, behavioral patterns, and media content analysis.\n\n**Talk - TBA**\n\n**RAFFLE - win a prize kindly donated by our sponsors!**\n\n**SPEAKERS**\n\n**Henrik Plate**\n\nHenrik Plate is the principal security researcher at Endor Labs. He formerly worked for SAP Security Research, where he established and led the focus topic “Open Source Security” starting 2014. He co-authored academic papers on this topic, presented at academic and industry conferences like the RSA, and started several open source projects in this space. He earned his PhD in 2024 from the University of Rennes, France, with a thesis titled “On the Security Risks of Open Source Consumption”, and holds a CISSP certification\n\n**Brenden Miller**\n\nBrenden Miller is a Cyber Security Consultant at Accenture UK & Ireland, bringing a wealth of experience in cloud engineering, site reliability, and systems administration to his role\n\n**Speaker 3 - To Be Announced**\n\n**TICKETS:**\nOWASP meetups are free and open to anyone interested in application security. Please note that you MUST book your place to be admitted to the event by the building security.\n\n**CODE OF CONDUCT:**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. OWASP Code Of Conduct: [https://owasp.org/www-policy/operational/code-of-conduct](https://owasp.org/www-policy/operational/code-of-conduct)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - May 28, 2025",
        "date": "2025-05-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306589704",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Adversarial Intelligence: Redefining Application\nJoin us for great networking, dinner and drinks, and see a presentation by **Roy Talyosef,** Founding Engineer, **Kodem Security**\n\n**ABSTRACT:**\nThis presentation explores Adversarial Intelligence - an approach that views application security from an attacker’s perspective. Drawing from vulnerability research experience at the NSO Group and building Pegasus, the speaker will highlight how overlooked low and medium vulnerabilities can be combined to execute successful attacks. By examining attack chains and application runtime behavior, attendees will see how gaps often missed by traditional methods are exposed. Attendees will learn about effective tools and techniques for detecting and mitigating these threats, especially in cloud-native and distributed systems. Designed for security practitioners and academics, this session provides a deeper understanding of defending against sophisticated attackers by adopting their mindset.\n\n**Thanks to our SPONSOR**: *[Kodem Security](https://www.kodemsecurity.com/)*\n*The AppSec chase is over.*\n*Swap endless alerts with focused action. Simplify the remediation of your most exploitable issues through runtime security.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "LayerOne Security Conference - Pasadena, CA",
        "date": "2025-05-24",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306677485",
        "timezone": "America/Los_Angeles",
        "description": "**OWASP LA** will be hosting a table at the **LayerOne 2025** Security Conference coming up in a little over two weeks, Memorial Day weekend, May 24-25, 2025 at the Pasadena Hilton Hotel!\n\nBe sure to stop by and say hi! See you there.\n\nHead over to the [registration page](https://www.universe.com/events/layerone-2025-information-security-conference-tickets-DXK36S?unii-trigger-open=DXK36S&unii-discount-code=L12025OWASPLA10) and secure your tickets now! Use promo code **L12025OWASPLA10** for 10% off registration courtesy of OWASP Los Angeles.\n\nPre-registration gets you full access to the event, all presentations, contests, villages, and the Saturday Night party.\n\nInterested in **sponsoring** this year’s event, hosting a vendor booth in the main hall, or contributing an awesome contest or event to this year’s conference? Reach out to L1 team at contact@layerone.org and tell them what you’re interested in!\n\nJoin the **Discord** and come hang out with us! Make some new friends and catch up at [https://discord.gg/layeroneconference](https://discord.gg/layeroneconference)."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "Hands-on Workshop OWASP LA - May 13, 2025",
        "date": "2025-05-13",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/306091949",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC:** Hands-on Application Security Workshop with Runtime Security IAST Technology and Secure Code Training\nJoin us for an action-packed hands-on workshop event led by **Will Derksen**, Sr. Solutions Engineer, **Contrast Security**.\nEarn 2 hours of CPE credit!\\*\n\n**ABSTRACT:**\nTogether, we will...\n\n* Unify around a precise definition of a vulnerability, as well as understand the challenges current application testing methodologies have in detecting vulnerabilities, and how to change the way we interact with them\n* Get hands-on-keyboard experience leveraging Contrast training to find a vulnerability in code, learn how to fix said vulnerability, and proactively go and remediate the vulnerability\n\nWho should attend?\n\n* AppSec professionals\n* Security engineers\n* Software engineers\n* DevOps/DevSecOps professionals\n* Anyone wanting to learn more about identifying and fixing code vulnerabilities, discover the most efficient ways to execute on a DevSecOps program, and become proactively more knowledgeable around secure coding techniques.\n\nPLEASE NOTE - for the lab portion of this event, you must bring a laptop (phones or other personal devices will NOT work for the lab).\n\\*This workshop qualifies for 2 hours of hands-on training for Continuing Professional Credits (CPE). For CISSP holders this would be in the Application Security Discipline and you will receive a certificate of completion after the workshop.\n\n**Thanks to our SPONSOR**: *[Contrast Security](https://www.contrastsecurity.com/)*\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)"
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "ZeroTrust [VIRTUAL] Conference Southern California",
        "date": "2025-05-13",
        "time": "09:00-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/307229106",
        "timezone": "America/Los_Angeles",
        "description": "Proliferation of SaaS, remote work, and global reliance on digital systems for critical operations have forced organizations to abandon traditional security models in favor of Zero Trust.\n\n**Register now** at https://summit25.ztjourney.com/\n\nAt this summit, participants will explore official CSA CCZT training modules and gain practical insights from industry experts—gaining the knowledge needed to fortify their infrastructures and stay ahead in an ever-evolving threat landscape.\n\nThe summit is designed for IT and security professionals, managers, and decision-makers who want practical insights and frameworks related to Zero Trust cybersecurity"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - May 2025 Meetup",
        "date": "2025-05-07",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/307400170",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nIt was great to see new faces last month. Thank you to those that attended.\n\nIn our last meetup, attendees voted for [Belles Hot Chicken Melbourne CBD](https://maps.app.goo.gl/xZCbuCRXHYPysqmcA) as our location for next month. On 7th May 2025 6PM, there we shall meet.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic. )*\n\n**Please remember to update your RSVP if you can no longer attend.** Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get. We will take note of no-shows, and to make sure we've got space for those that do actually attend, your RSVP may be deprioritised for future events.\n\n**If you're having trouble finding us**, send a message to [Dan on Signal](https://signal.me/#eu/4yti0PmJCFvXhLH_vmLcxO7Xy3VAM_yY9wRhOQCA1qn7UqWh1nFBa4rNCccfHyhW).\n\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is[ inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics. *You are expected to participate in the AppSec/ProdSec conversations constructively if you attend*. This isn't the place for BizDev focused conversations.\n\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there."
    },
    {
        "group": "Orlando",
        "repo": "www-chapter-orlando",
        "name": "OWASP Orlando - Application Security",
        "date": "2025-05-08",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-orlando/events/302181950",
        "timezone": "America/New_York",
        "description": "This is an In-Person OWASP Orlando Chapter Meeting\n\nFood to be provided (Typically pizza or sandwiches)\n\nIntroductions\n\nMore details to be provided soon!\n\nSpeaker 1: **TBD**\nTopic: TBD\n\nSpeaker 2: **TBD**\nTopic: TBD"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social: Bowling! ",
        "date": "2025-05-29",
        "time": "18:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/305916111",
        "timezone": "Europe/London",
        "description": "**What & Where?**\n\n* Bowling @ Peterborough Bowl!\n\n**When?**\n\n* \\- Thursday 29th May\n\nEverybody welcome! For this event, please respond on Whatsapp and update your MeetUp attendance as pre-payment may be required.\n\nThank you,\nRyan & Mark"
    },
    {
        "group": "Philadelphia",
        "repo": "www-chapter-philadelphia",
        "name": "Philly Tech Week CTF w/ BlackDuck",
        "date": "2025-05-07",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-philadelphia-chapter/events/307591058",
        "timezone": "America/New_York",
        "description": "To be announcing this as our Second Annual Philly Tech Week Capture The Flag fills me with a certain amount of pride and excitement. So please let me announce Our Second Annual Capture The Flag Event, with Philly Tech Week!\n\nCapture The Flags are competitive events designed to challenge and engage participants as security exercises, with an added benefit of learning while you go. This years CTF comes with a slight twist from the traditional hack-em-up, as we have partnered with BlackDuck to approach this from a defensive perspective.\n\nSo please come join us at our Second Annual Philly Tech Week Capture The Flag... haha, yes, please come say hello, learn about OWASP, our chapter, have some snacks and a pint, and take on this years CTF Challenge!!\n\nP.S. This is an official Philly Tech Week event!\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSeGmemb39sbDEY_JR1yqkLjx-Ih3Q9CkpMC35UUr9kPHpTMng/viewform\n\nP.P.S. I made a clerical error on the PTW side - the event starts at 6pm.\n\nTo our regulars: Please note the time change and the fact we are hacking in the basement this year ;)"
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "May 2025 Meeting",
        "date": "2025-05-06",
        "time": "19:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/306633472",
        "timezone": "America/Phoenix",
        "description": "**Beyond LLMs: Securing the AI/ML Pipeline and Analyzing CVEs in Modern AI Tools**\n\n* Security challenges across the ML lifecycle (data collection, model training, deployment, inference).\n* Evolving threats beyond LLMs, including traditional ML models and autonomous agents.\n* Insights from CVE analysis of real-world AI/ML tools."
    },
    {
        "group": "Sofia",
        "repo": "www-chapter-sofia",
        "name": "OWASP Sofia - May 2025 Meetup",
        "date": "2025-05-28",
        "time": "19:00+03:00",
        "link": "https://www.meetup.com/owasp-sofia-chapter/events/307509140",
        "timezone": "Europe/Sofia",
        "description": "Добре дошли в месечната ни сбирка на OWASP Sofia!\n\nС пролетно настроение влизаме в майското събитие на OWASP Sofia Chapter. Отново сме подготвили страхотни теми свързани с threat modeling, CVSS и .NET Reflection.\n\nЛюбезен домакини на събитието ще бъде [Progress](https://www.progress.com/) ‍\n\n**Програма за 28 Май 2025**\n\n* 19:00 - Начало и въведение - [Тодор Тодоров](https://todorov.bg) & @ [Payhawk](payhawk.com)\n* 19:15 - Иван Иванов @ [Progress](https://www.progress.com/) - **\"How to fail with .NET reflection 101\"**\n* 20:00 - [Йордан Попов (Dan Ny)](https://www.linkedin.com/in/dan-ny/) @ [Scalefocus](https://www.scalefocus.com/) - **\"Effective Threat Modelling\"**\n* 20:45 - [Мартин Георгиев](https://www.linkedin.com/in/martin-georgiev/) @ [VMWare Carbon Black](https://www.broadcom.com/products/carbon-black) - **\"Scoring Vulnerabilities using CVSS\"**\n* 21:30 - Q&A / Networking\n* 22:00 - Закриване\n\nСъбитието ще се проведе на живо в офиса на [Progress](https://maps.app.goo.gl/unHVZspnrL83gLq79). Ако желаете да споделите нещо интересно свързани с Уеб Сигурност, моля изпратете ни вашата сесия на [https://sessionize.com/owasp-sofia/](https://sessionize.com/owasp-sofia/)\n\nОчакваме ви!"
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "6th OWASP Stuttgart Chapter Stammtisch",
        "date": "2025-06-03",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/305584778",
        "timezone": "Europe/Berlin",
        "description": "**TBD**\n\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Tampa",
        "repo": "www-chapter-tampa",
        "name": "OWASP Tampa Chapter 2025-May Lunch and Learn",
        "date": "2025-05-16",
        "time": "11:15-04:00",
        "link": "https://www.meetup.com/owasp-tampa/events/307289782",
        "timezone": "America/New_York",
        "description": "**Welcome to our OWASP Tampa 2025-May Lunch and Learn!**\nWe invite you to join us and members of our local Tampa Bay community to hear from industry experts in cybersecurity. This lunch and learn will bring topics that influence discussion among your peers and provide a venue to meet others that share your passions.\n\n**Agenda**:\n\n* 11:15am - Registration and Lunch\n* 12:00pm - Speaker - Jason Mueller - Crowdsourced Security in Practice: Lessons from the Frontlines\n* 1:15pm - Depart\n\n**Speaker**:\nJason Mueller is a cybersecurity professional and former U.S. Navy cryptologist with over 20yrs of hands-on experience in cyber operations. Having worked across government, defense, and commercial sectors, Jason brings a unique perspective on the evolving threat landscape and how organizations can stay ahead of it. At Bugcrowd, he helps security teams harness the power of crowdsourced security to identify and remediate risk at scale. With a background rooted in operational security and a deep appreciation for the hacker mindset, Jason is passionate about helping organizations adopt modern, proactive approaches to cybersecurity that are both practical and impactful.\n\n**Abstract**:\nAs threats evolve faster than ever, traditional security models struggle to keep pace. Enter crowdsourced security—a model that taps into the global hacker community to uncover vulnerabilities before adversaries do. In this session, we’ll explore how Bugcrowd is helping organizations—from startups to the federal government—scale their security programs through managed bug bounty, vulnerability disclosure, and penetration testing. We’ll walk through real-world lessons learned, common pitfalls, and how aligning with frameworks like OWASP Top 10 enhances outcomes. Whether you’re an AppSec professional, pentester, or just curious about the power of ethical hacking at scale, this session will provide insights you can take back to your own environment.\n\n**Location**:\nGuidePoint Security\n3030 N Rocky Point Dr W\nSTE 600\nTampa, FL 33607\n\n**Sponsors**:\nBugcrowd - [https://www.bugcrowd.com/](https://www.bugcrowd.com/)"
    },
    {
        "group": "Toronto",
        "repo": "www-chapter-toronto",
        "name": "The Dark Side of AI: Developing unsecure applications in minutes!",
        "date": "2025-05-08",
        "time": "17:30-04:00",
        "link": "https://www.meetup.com/owasp-toronto/events/307305805",
        "timezone": "America/Toronto",
        "description": "**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n**Note for IN-PERSON attendance:**\n\nYou **MUST** register using the [Microsoft Reactor event page](https://aka.ms/May8OWASPxMicrosoftReactor). At doors open time, registered attendees will receive a personalized QR code allowing them to enter. Sorry, **NO walk-ins** for this event.\n\nThe registration will close Tuesday **May 6 at 4:00 PM**.\n\n**Note for ONLINE livestream:**\n\nIf you cannot attend in-person, please join us virtually via the livestream! Details to be announced shortly.\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\n**Schedule:**\n\n* 5:30 PM: Doors Open\n* 6:00 PM Talk Begins\n* 7:00 PM Q/A & Networking\n\n**Talk Description:**\n\nAI is the ultimate accelerant for application development—its power unmatched—but without balance and control, it can quickly ignite new risks, turning potential into destruction. Explore the tangible impact of AI-generated code in this session by playing with fire – Using GPT-driven prompts, we’ll build a fully functional application, and in real time, we’ll uncover how common security flaws like SQL injection, cross-site scripting, and weak authentication can manifest in AI-generated code.\nThrough hands-on exploration, we’ll walk through the potential impact of these vulnerabilities and how these risks could be avoided with secure coding practices, defined policies, developer guardrails, and thorough security audits and code reviews.\n\nBy the end of the session, you'll have a deep understanding of how to:\n\n* Recognize and assess the risks AI introduces in your code.\n* Implement secure coding practices and enforce security policies.\n* Integrate security audits, code reviews, and testing into your development workflow to ensure AI-generated code is safe for production.\n\nThis session is vendor agnostic and designed to empower you to reap the benefits of AI without sacrificing security."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Blocking with Confidence",
        "date": "2025-05-15",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/305510286",
        "timezone": "America/Vancouver",
        "description": "**Blocking with Confidence** with **Raphael Theberge**\n\nWe know that security can be cumbersome for parts of an organization. How can we lower the existing friction white maintaining our high standards?\n\nLearn how Relativity approached this question and reduced developer burden without sacrificing our security posture.\n\n**About the speaker**\nRaphael is Director of Security Enablement at Relativity, where he owns all of Application Security, Vulnerability Management, AI Security and secure M&As. Previously spent time at Salesforce, Demonware, Booking.com and otherwise travelling the world.\n\n**This event is sponsored by [EndorLabs](https://www.endorlabs.com/) and [Forward Security](https://forwardsecurity.com/).**"
    },
    {
        "group": "Virtual",
        "repo": "www-chapter-virtual",
        "name": "Codename Singapore -- Adopting the Three Ways of Effective AppSec",
        "date": "2025-05-21",
        "time": "12:00-04:00",
        "link": "https://www.meetup.com/owasp-virtual-chapter/events/307219856",
        "timezone": "America/New_York",
        "description": "Four teammates walked into a bar—a developer, an AppSec engineer, a SecOps lead, and a compliance officer. It sounds like the start of a terrible joke, but no one was laughing. They were too busy drowning in alerts, blaming each other, and wondering if their security program had secretly been designed by their worst enemies. Sound painfully familiar?\n\nIn this talk, I'll share the surprisingly entertaining story of how these burned-out heroes discovered The Three Ways of Effective AppSec. Using the metaphor of a modern city (complete with bank robberies, construction projects, and government bureaucracy), they unlocked the power of context, collaboration, and culture—transforming a chaotic security circus into a highly cost-effective (and even enjoyable) program that keeps their software safe from vulnerabilities and attacks.\n\nIf you’ve ever felt trapped in AppSec Groundhog Day, facing endless firefighting, alert fatigue, and compliance busywork, come laugh (and maybe cry) your way toward a practical blueprint for building an AppSec program that actually works."
    },
    {
        "group": "Warwick",
        "repo": "www-chapter-warwick",
        "name": "OWASP Warwick Chapter - Capture The Flag ",
        "date": "2025-05-14",
        "time": "18:30+01:00",
        "link": "https://www.meetup.com/owasp-warwick/events/306642042",
        "timezone": "Europe/London",
        "description": "OWASP Warwick is hosting a capture the flag. At Warwick iniversity. Thanks to our sponsor SecureFlag, who will be running the excercise on their platform.\n\nPlease come and join this should be an exciting event"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "OWASP SAMM Community Call (Europe-Asia)",
        "date": "2025-05-16",
        "time": "08:00-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/305752944",
        "timezone": "America/New_York",
        "description": "The SAMM Core team is happy to host a community call during a more friendly time for users in EU and Asia. This is not a replacement of the regular community call.\n\nWe will share any project news and updates during the call.\nWe also encourage bringing your SAMM questions and we are happy to discuss them."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "May community call - OWASP SAMM",
        "date": "2025-05-14",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/306053400",
        "timezone": "America/New_York",
        "description": "During our next community call we'll share project updates and, as always, we'll have time for Q&A. See you there!"
    }
]