[
    {
        "group": "Bangalore",
        "repo": "www-chapter-bangalore",
        "name": "OWASP Bangalore Meet 16 December 2023 ",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/owasp-bangalore-chapter/events/297751648",
        "timezone": "Asia/Kolkata",
        "description": "Bangalore Meet 16 Dcember 2023 Null/OWASP Combined Meet\n\nOWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.\n\n#### Proposed sessions for this event:\n\n* Hacker's Perspective by **Abhishek Kumar**\n* Defense in Docker by **Aditya Gupta**\n* Ways to get into Kubernetes Cluster by **Manoj Deshmukh**\n* RE for windows P files by **Ananthakrishna**"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Securing kubernetes and misconfigurations - OWASP MEETUP DEC 2023",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/297865090",
        "timezone": "Asia/Kolkata",
        "description": "Embark on a journey into the realm of Kubernetes security with our engaging talk on \"Securing Kubernetes and Misconfigurations.\" As the adoption of Kubernetes accelerates, ensuring the robust security of your containerized applications becomes paramount. Join us for an in-depth exploration of best practices, tools, and strategies to fortify your Kubernetes clusters against potential threats, with a specific focus on mitigating misconfigurations.\n\nFor registration : [https://forms.gle/unMXEbM1ForE4KeN8](https://forms.gle/unMXEbM1ForE4KeN8)"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "AWS Serverless Pentesing & EBS -Defense Strategies - OWASP MEETUP DEC 2023",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/297848202",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an insightful session that delves into the critical realms of AWS security as we explore the dynamic landscapes of serverless architectures and Elastic Block Store (EBS) within the Amazon Web Services ecosystem.\n\nFor registration : [https://forms.gle/unMXEbM1ForE4KeN8](https://forms.gle/unMXEbM1ForE4KeN8)"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Access control vulnerabilities - OWASP MEETUP DEC 2023",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/297733035",
        "timezone": "Asia/Kolkata",
        "description": "Embark on a transformative learning experience as Saravana Priya, a distinguished expert in cybersecurity, unveils the intricate web of Access Control Vulnerabilities. This event is tailor-made for security professionals, IT administrators, and anyone keen on understanding and fortifying against the vulnerabilities that lurk in access control systems.\n\n **What We Cover:**\n\n* **Deep Dive into Access Control Systems:** Saravana Priya will provide a comprehensive exploration of access control systems, dissecting their mechanisms, and shedding light on common vulnerabilities that can compromise security.\n* **Real-world Case Studies:** Through real-world case studies, Saravana Priya will illustrate actual access control vulnerabilities encountered in diverse environments. Attendees will gain invaluable insights into the anatomy of security breaches.\n* **Live Demonstrations:** Experience live demonstrations where Saravana Priya will simulate access control attacks, showcasing potential exploits and vulnerabilities. Witness firsthand how attackers exploit weaknesses and, more importantly, learn how to prevent them.\n* **Best Practices for Mitigation:** Saravana Priya will share a wealth of best practices and strategies to fortify access control systems. From robust authentication methods to authorization pitfalls, attendees will leave armed with actionable steps to enhance security.\n* **Interactive Q&A Session:** Engage directly with Saravana Priya during the Q&A session. Pose your questions, share your experiences, and benefit from personalized insights into access control security.\n\n **Who Should Attend:**\n\n* Cybersecurity Professionals\n* IT Administrators\n* System Architects\n* Security Analysts\n* Anyone Interested in Access Control Security\n\nFor registrations: [https://forms.gle/2NSidpiFGUNUbDdG7](https://forms.gle/2NSidpiFGUNUbDdG7)"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "Hacking containers - OWASP MEETUP DEC 2023",
        "date": "2023-12-16",
        "time": "0:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/297732838",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an exhilarating exploration into the realm of container security as deepali, a renowned expert in cybersecurity, takes the stage to demystify the intricate world of container hacking. This event is tailored for technology enthusiasts, developers, and security professionals eager to enhance their understanding of container security.\n\n **What to Expect:**\n\n* **Live Demonstrations:** Deepali will conduct live hacking demonstrations to showcase real-world vulnerabilities within containerized environments. Gain insights into the latest techniques used by cyber adversaries and learn how to protect your systems effectively.\n* **Tools of the Trade:** Delve into the arsenal of tools utilized by security experts to identify and mitigate container vulnerabilities. Discover open-source and commercial solutions that can bolster your security posture.\n* **Best Practices:** Deepali will share proven best practices for securing containers, offering actionable insights that you can implement immediately within your own projects. From image scanning to runtime protection, learn the critical steps to fortify your containerized applications.\n* **Q&A Session:** Engage directly with deepali during the dedicated Q&A session. Get answers to your burning questions and gain personalized advice on securing your containerized infrastructure.\n\n **Who Should Attend:**\n\n* Developers and DevOps professionals\n* IT and Security Managers\n* System Administrators\n* Cybersecurity Enthusiasts\n\nFor registration : [https://forms.gle/unMXEbM1ForE4KeN8](https://forms.gle/unMXEbM1ForE4KeN8)"
    },
    {
        "group": "Indraprastha Institute Of Information Technology",
        "repo": "www-chapter-indraprastha-institute-of-information-technology",
        "name": "OWASP IIITD: DEFCON 0x06 Special Event (Only for IIITD Students)",
        "date": "2023-12-16",
        "time": "9:30+05:30",
        "link": "https://www.meetup.com/owasp-indraprastha-institute-of-information-technology/events/297926369",
        "timezone": "Asia/Kolkata",
        "description": "**ONLY FOR IIITD STUDENTS**\nOWASP IIITD is collaborating with DEFCON Delhi to bring the conference to the IIITD Campus. Register on this link to get passes for DEFCON Delhi 0x05. Limited seats available! Along with the usual lineup of talks and workshops, OWASP IIITD is proud to announce we will be hosting our first Live offline CTF at the conference!\n\nRegister now before spots run out."
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-01-08",
        "time": "8:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/297721755",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Evaluasi Malware 2023 dan trend Malware 2024",
        "date": "2023-12-21",
        "time": "9:00+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/297555833",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n• Tool dan standar keamanan aplikasi\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n• Kendali keamanan dan pustaka standar\n• Cabang lokal di seluruh dunia\n• Riset terkini\n• Konferensi lengkap di seluruh dunia\n• Mailing list\n• Dan banyak lagi … di www.owasp.org\nKali ini di OWASP ID akan membahas :\n1\\. Evaluasi Malware 2023 dan trend Malware 2024\nSpeaker : Alfon Tanujaya (Security Enthusiast / Pengamat Sekuriti Vaksincom)\n\nLinkedin : https://www.linkedin.com/in/alfonstanujaya\n\nTopic: OWASP Jakarta - Evaluasi Malware 2023 dan trend Malware 2024.\nTime: Dec 21, 2023 07:00 PM Jakarta\n\nBergabung Zoom Rapat\nhttps://zoom.us/j/95692246978?pwd=VzdvL1QzWE9IZzAweFNYZ2tobW5aQT09\n\nID Rapat: 956 9224 6978\nKode Sandi: 652201\n\nsupported by appsec.co.id"
    },
    {
        "group": "Limassol",
        "repo": "www-chapter-limassol",
        "name": "New Year's OWASP Chapter Limassol meetup.",
        "date": "2023-12-15",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-limassol-meetup-group/events/297479557",
        "timezone": "Asia/Nicosia",
        "description": "[Location](https://www.google.com/maps/place/BrainRocket/@34.6979542,33.0460735,20z/data=!4m6!3m5!1s0x14e733f291b01fad:0x5ff57bb6ed3f9838!8m2!3d34.6979152!4d33.0461381!16s%2Fg%2F11q_08mvzb?entry=ttu) is the restaurant at the Brain Rocket office.\n\n**Calling all tech and security enthusiasts!**\n\nWe are thrilled to announce the second meetup of the [OWASP Chapter in Limassol](https://owasp.org/www-chapter-limassol/)! We cordially invite you to join us for an evening of engaging discussions, networking, and knowledge sharing among cybersecurity enthusiasts, professionals, and enthusiasts from various backgrounds.\n\n**Schedule:**\n18:30 — 19:00 — Gathering & Intro\n19-00 — 19:35 \"Happy DDOS to you! Or how we saved the Christmas\" **[Ivan Agarkov](https://www.linkedin.com/in/annmuor)**\n19-35 — 20:05 \"How to find the balance between compliance and real security?\" **[Mariia Erokhina](https://www.linkedin.com/in/mariia-s-erokhina)**\n20:05 — 20:30 A short break\n20-30 — 21:00 \"Observability for security. Deep dive into Osquery\" **[Artem Mishchenko](https://www.linkedin.com/in/artem-mishchenko-155082159/)**\n21:05 — 21:40 \"Beyond IT/Fintech: Between Good and Evil. EA/SA and CSO/ISO: To Hire or To Fire?\" **[Albert Fedoseev](https://www.linkedin.com/in/albert18041986/)**\n21:40 — 22:05 Outro\n22:05 — 23:00 Eat, drink, networking!\n\nWe'll have catering, a cocktail bar, a DJ, and a shisha zone all set up to make the evening unforgettable. \n\n[Don't forget to join us on Telegram (we will send updates there quickly).](https://t.me/+W1hEPzn4BOcwMTNi)"
    },
    {
        "group": "Ljubljana",
        "repo": "www-chapter-ljubljana",
        "name": "Vulnerability Hunting With Static Analysis",
        "date": "2024-01-11",
        "time": "6:30+01:00",
        "link": "https://www.meetup.com/owasp-ljubljana-chapter/events/297258995",
        "timezone": "Europe/Belgrade",
        "description": "Static application security testing (SAST) tooling is commonly used in CI pipelines to catch security issues early. However, I see it used much less often to manually hunt for vulnerabilities. Let's say you found a vulnerable pattern in a million line code base and need to verify that there are no other cases, what do you do? In this talk I will try to convince you that if your answer is grep, then you are missing out. We will talk about SAST tooling, custom rules, custom tools and more."
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation to create secure by design software.",
        "date": "2023-12-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Newcastle Uk",
        "repo": "www-chapter-newcastle-uk",
        "name": "OWASP Newcastle December 2023",
        "date": "2023-12-21",
        "time": "8:30Z",
        "link": "https://www.meetup.com/owasp-newcastle-chapter/events/297903170",
        "timezone": "Europe/London",
        "description": "We're back with a virtual event to round out the year with a bang!\n\nRough schedule:\n\n1830 - 1835 OWASP Newcastle Welcome\n1835 - 1920 Talk one\n1930 - 2030 Talk two\n\nTalk overviews:\n\nTalk 1\n**Title:** TBC\n**Speaker:** John Dellinger\n**Speaker Bio:** John is a Chief Security Advisor working within the Microsoft Cyber Defence Operations Center. John has extensive multi-national experience in both the public and private sectors. Expertise across a variety of functions and disciplines including policy formulation and implementation, training, operations, strategic planning, risk management and cyber security.\nHe is a dual U.S. and Australian citizen with twenty years of military experience as an officer, first in the United States Marine Corps and later in the Royal Australian Navy.\n**Talk Synopsis:** TBC\n\nTalk 2\n**Title:** TBC\n**Speaker:** Ros Grindrod\n**Speaker Bio:** Ros is currently Head of Security Services at Opencast Software and has over 6 years of experience working within information security including experience delivering cyber transformation work across a variety of industries. Ros's previous experience includes ethical hacking, social engineering, incident response preparedness, OSINT/threat modelling and all things GRC.\n**Talk Synopsis:** TBC\n\n**Live Stream Info:** We're hoping to be able to live stream the event on our [playeur channel](https://playeur.com/c/OWASPNewcastle/) if not, the talks will be recorded and uploaded there.\n\nYou can also join our Google Group which is how we'll be sending out emails to events and is also going to be used as a forum for discussion.\n\nhttps://groups.google.com/a/owasp.org/forum/#!forum/newcastle-chapter"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter Social",
        "date": "2023-12-28",
        "time": "9:00Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/297836577",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-01-10",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/297834961",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "Call for Speakers and Venues: Sydney OWASP Chapter Meetup in 2023!",
        "date": "2023-12-31",
        "time": "2:00+11:00",
        "link": "https://www.meetup.com/owasp-sydney-chapter/events/292598127",
        "timezone": "Australia/Sydney",
        "description": "The Sydney OWASP Chapter is dedicated to fostering a thriving community focused on application security and collaboration among industry professionals. With our goals of promoting equality, education, and community, we're excited to announce that we're actively looking for speakers and venue hosts for our upcoming events throughout the year.\n\n**Call for Speakers**\nDo you have a passion for cybersecurity and would like to share your expertise with our growing community? We invite you to submit a talk proposal for our upcoming meetups! This year's theme revolves around diverse applied topics in cybersecurity. We welcome presentations from experienced speakers, as well as those giving their first talk.\n\nTo submit your proposal, please email the following details to [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org):\n\n* Proposed topic\n* Abstract (100-200 words)\n* Brief speaker bio (100-200 words)\n\n**Call for Venues**\nWe're also searching for venue hosts who can accommodate 30-50 attendees and provide a screen for presentations. Hosting an OWASP meetup is a fantastic opportunity to demonstrate your commitment to security excellence while supporting the cybersecurity community. Please note that hosts are expected to cater pizza and beverages for attendees.\nIf you're interested in becoming a venue host, please reach out to us at [sydney-chapter@owasp.org](mailto:sydney-chapter@owasp.org).\n\nBy contributing as a speaker or venue host, you're helping to advance our mission of fostering collaboration, education, and diversity within the cybersecurity field. We look forward to hearing from you and hope to see you at our next event.\n\nDeb, Blair, and Nick\nOWASP Sydney Chapter Committee"
    },
    {
        "group": "Tallinn",
        "repo": "www-chapter-tallinn",
        "name": "OWASP Tallinn - Cybersecurity & AI - Vol. 1",
        "date": "2023-12-15",
        "time": "8:30+02:00",
        "link": "https://www.meetup.com/owasp-tallinn-chapter/events/297697716",
        "timezone": "Europe/Tallinn",
        "description": "** Welcome to the Inaugural Event of OWASP Estonia: Cybersecurity & AI - Vol. 1 **\n\n Get ready to dive into the world of AI technology and cybersecurity at our first-ever event! We are thrilled to present a lineup of distinguished speakers and groundbreaking topics.\n\n **Featuring a Core Member from OWASP Top 10 LLM:** Delve into the depths of cybersecurity with insights from a key figure behind the renowned OWASP Top 10 for large language models. Learn about the latest trends, challenges, and strategies in securing large language models and AI systems.\n\n **TalTech’s Cybersecurity RA for AI-Driven Autonomous Ships:** Join our guest from TalTech, a leading assistant researcher in cybersecurity, specializing in AI-driven autonomous ships. Discover how AI is revolutionizing maritime technology and the critical role of cybersecurity in this innovative domain.\n\n **And That's Not All - More Surprises Await!** Whether you're a cybersecurity professional, a tech enthusiast, or just curious about the future of AI, there's something for everyone.\n\n **Connect, Collaborate, and Create:** This event is more than just talks - it's a platform to connect with like-minded individuals, collaborate on ideas, and contribute to the ever-evolving field of cybersecurity and AI.\n\n **Mark Your Calendars:**\nFriday 15th December at 18:30 - 20:30\nWIP Maakri 19, Tallinn\n\n **Join us at OWASP Estonia's inaugural event, Cybersecurity & AI - Vol. 1!**"
    }
]