[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - Virtual - November",
        "date": "2023-11-21",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/296374615",
        "timezone": "Europe/Copenhagen",
        "description": "Notice that this is a virtual event running on Zoom. Please reach out if the event gets packed, and I will add room for more people.\n\nOWASP Aarhus will be joined by Simon Bennetts, project-lead for ZAP, and Liz Keogh, who will talk about human nature and behaviour and how that impacts software development.\n\nWe will update this event with more details when we get closer to the event."
    },
    {
        "group": "Beja",
        "repo": "www-chapter-beja",
        "name": "0x00 Kickoff",
        "date": "2023-11-08",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-beja-chapter/events/296880579",
        "timezone": "Europe/Lisbon",
        "description": "OWASP Beja chapter kickoff meetup.\n\nJoin us and seize the opportunity to **win** a ticket to the premier technical information security conference in Portugal: BSides Lisbon!\n\n**Schedule**\n\n18:00 - **OWASP Beja: Five Ws and How** by OWASP Beja chapter leadership team\n18:30 - **OWASP API Security Top 10** by Paulo A. Silva\n19:20 - **Snacks & Drinks**\n\n**Talks**\n\n**OWASP Beja: Five Ws and How**\nby OWASP Beja chapter leadership team\n\nA warm welcome message from the OWASP Beja chapter leadership team that aims to provide a comprehensive understanding of the chapter's purpose, inception, and future plans.\n\nYou're invited to join us in this momentous launch event and, together, help establish OWASP Beja as a dynamic community in the realm of application security.\n\n\\-\\-\\-\n\n**OWASP API Security Top 10**\nby Paulo A. Silva, OWASP API Security Project co-Leader\n\nIn today's app-crazy universe, APIs are the secret sauce behind the magic. Think of them as the superheroes of tech, from banking to retail, transport to smart cities, they're the unsung heroes revealing the secrets of business logic and access to the treasure trove of sensitive data. But hold on to your cyberhats because where there's treasure, there are pirates!\n\nAPIs have become the gold mine for attackers. They're the common thread weaving through those notorious data breaches we've all heard about. Now, how do you turn the tables on these cyber scoundrels? Well, the answer is simple: learn their tricks, and you'll become the ultimate API security hero! We're here to take you on a thrilling, rollercoaster ride into the heart of API security: a hands-on deep dive into the OWASP API Security Top 10!\n\n**About the Speaker**\nPaulo is the Principal Security Researcher and Pentester at Char49. Since his first OWASP local event back in 2010, he has been an active community member contributing to several OWASP projects. He has co-authored the OWASP API Security Top 10 and co-leads the OWASP API Security Project."
    },
    {
        "group": "Belgium",
        "repo": "www-chapter-belgium",
        "name": "OWASP BeNeLux Days 2023",
        "date": "2023-11-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/belgium-owasp-meetup-group/events/296033531",
        "timezone": "Europe/Brussels",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2023\" edition on November 23rd-24th in Hasselt, Belgium. \n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "Birmingham Uk",
        "repo": "www-chapter-birmingham-uk",
        "name": "OWASP Bham November Meetup!",
        "date": "2023-11-16",
        "time": "8:00Z",
        "link": "https://www.meetup.com/meetup-group-owasp-birmingham/events/296510816",
        "timezone": "Europe/London",
        "description": "Greetings OWASP Birmingham members!\n\nWe are excited to announce our second Meetup of 2023 on Thursday, November 16th once again at Hays in One Colmore Square.\n\nThis in-person Meetup will feature two fantastic infosec talks from our knowledgeable speakers.\n\n5.45pm - Doors open\n6.15pm - Welcome and Food\n6.30pm - TALK #1 \"Social engineering adventures of a pentester\"\n\nSynopsis : This is about my experience of performing social engineering (SE) assessments as a pentester who is no expert on the subject of performing physical work.\nI volunteered to be pushed in at the deep end on an SE job and had to learn quickly which was a little scary. I hope there will be something useful you take away from the talk, whatever your interest in security relates to.\n\n7.00pm - Break\n7.15pm - TALK #2 TBC\n7.45pm - Questions/Any Other Business\n8.00pm - Close\n\nRSVP when you get a chance so we can plan accordingly. We look forward to catching up with you all next month!"
    },
    {
        "group": "Boston",
        "repo": "www-chapter-boston",
        "name": "OWASP Boston Chapter November 2023 Meetup",
        "date": "2023-11-08",
        "time": "7:30-05:00",
        "link": "https://www.meetup.com/owaspboston/events/295661584",
        "timezone": "America/New_York",
        "description": "Join us at the OWASP Boston Meetup this month to get a hands-on lesson about IAST from Pranoy De and Tony Quadros. During the session Pranoy and Tony, will answer the questions, what is IAST, and how can it make your developer’s lives easier.\n\n**\\*\\*Attendees must bring their own laptop and be in-person to participate in the hands-on workshop portion of this event**\n\n**\\*\\*Attendees must provide their name and email addresses (*please place in \"Current Role\" box*) information at time of registration to participate in the hands-on workshop portion of this event.**\n\nThis session will give you a foundational understanding of IAST (Interactive Application Security Testing), what it is, how it works, and provide you, as a security engineer or software developer, with the knowledge of how it can make your lives easier when it comes to doing security analysis of your applications and code. You will then be able to get **hands on** experience with IAST, using it to find vulnerabilities in a sample application then be able to go in and actually remediate the findings.\n\nAfter attending this session, you will understand the fundamentals of IAST (Interactive Application Security Testing) and have actual hands-on experience with the testing methodology.\n\nTony Quadros based in southern New Hampshire is a 10+ year veteran of the cyber security vendor landscape and specifically focused on the application security side of Cyber Security and software development. Having experience helping numerous enterprises from the largest social media companies in the world to the largest insurance companies with ever improving their application security programs to ensure the software we use every day is as secure as possible. More recently Tony has helped lead and revive OWASP Maine, a OWASP chapter focused on rallying the software development and security community in northern New England with providing great educational talks, networking events, and a safe outlet for sharing new job opportunities for northern New Englanders interested in advancing their software development and security careers.\n\nPranoy De is a 10+ year veteran of software engineering and application security based in Toronto Canada, getting his start as a DB2 Software Developer for IBM, full stack python developer, and more recently working with enterprises worldwide with ever improving their application security programs with a focus on threat modeling and now runtime application security testing. Pranoy has a deep passion for helping with establishing critical integrations for his customers to ensure all solutions work seamlessly within their application security stack and ensuring seamless workflows for software developers looking to ever improve their DevSecOps and appsec processes."
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Every risk is not a CVE - Bolster up against software supply chain attacks",
        "date": "2023-11-16",
        "time": "8:00-05:00",
        "link": "https://www.meetup.com/columbus-owasp/events/295118628",
        "timezone": "America/New_York",
        "description": "3rd party and open source software components are both desired and indispensable ingredients used throughout the development lifecycle, but their consumption comes with considerable security risks, both for the developer herself and her downstream users. The rise of corresponding security incidents demonstrates that adversaries discovered those attack vectors as a viable and scalable attack pattern.\n\nWe will present a comprehensive, comprehensible and technology-agnostic taxonomy of attack vectors, created on the basis of hundreds of real-world incidents, and validated by experts in the domain. An interactive visualization of this taxonomy, available as open source itself, will be demoed throughout the talk to explain different techniques at the disposal of attackers, supported by real-world examples.\n\nMantium AI will be providing snax."
    },
    {
        "group": "Dhaka",
        "repo": "www-chapter-dhaka",
        "name": "OWASP Dhaka Chapter Cyber Awareness Day 2023",
        "date": "2023-10-28",
        "time": "1:00+06:00",
        "link": "https://www.meetup.com/owasp-dhaka-chapter/events/296932137",
        "timezone": "Asia/Dhaka",
        "description": "Welcome to OWASP Dhaka Chapter Cybersecurity Awareness Day 2023.\nWe'll discuss \"**How to Validate the OWASP Top 10 Web Application Security Risks**\" at the event.\nJoin us, and grow the OWASP Dhaka Chapter!"
    },
    {
        "group": "Fortaleza",
        "repo": "www-chapter-fortaleza",
        "name": "OWASP Fortaleza - Meetup da Comunidade",
        "date": "2023-11-18",
        "time": "8:30-03:00",
        "link": "https://www.meetup.com/owasp-fortaleza/events/296988916",
        "timezone": "America/Fortaleza",
        "description": "Este será um encontro de Entusiastas, Profissionais e estudantes da área de Cyber Segurança, o intuito desses encontros é o compartilhamento de conhecimento, fomentar a cultura segurança no estado e fazer networking.\n\nLocal: Digital College Sul\n\nPalestrantes:\n**Marcus Lima:** Coraza WAF + Proxy-WASM: Como manter a compatibilidade de seu WAF independente do seu proxy\n*LinkedIn:* https://www.linkedin.com/in/marcsvll\n\n**Vinicius Fernandes:** Segurança em Pipeline: A importância da segurança a nível de desenvolvimento\n**LinkedIn:** https://www.linkedin.com/in/vinicius-f-a76ba51b5/\n**GitHub:** http://github.com/souzomain\n\n**Inscrição para evento:**\n**Vagas Limitadas: 60 pessoas**\n\nEsperamos sua presença."
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "Security Pub (SäkPub)",
        "date": "2023-11-07",
        "time": "7:30+01:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/296558368",
        "timezone": "Europe/Stockholm",
        "description": "**OWASP Gothenborg Chapter invites you to an evening of security and entertainment!**\n\nCome hang out, grab a beer, and play arcade games with other security minded people!\n\nWhen: Tuesday 7/11 17:30 - 21:30\nWhere: Zamenhof, Esperantoplatsen 5, 411 19 Göteborg"
    },
    {
        "group": "Houston",
        "repo": "www-chapter-houston",
        "name": "OWASP Houston Chapter API Security Study Group - Lab Setup",
        "date": "2023-11-06",
        "time": "8:30-06:00",
        "link": "https://www.meetup.com/owasp-houston-texas-chapter/events/296859686",
        "timezone": "America/Chicago",
        "description": "This session covers lab setup, is aimed for novices, and will be recorded.\n\nWe will setup the following tools\n\n* Kali Linux\n* Postman\n* Burp Suite Community Edition\n* Zed Attack Proxy (ZAP) with Postman Add-On\n* crAPI\n\nWe will be installing and configuring Kali Linux on VMware Workstation Player since it is free for personal, non-commercial use. For full functionality and free training, you will want to create accounts for Postman and PortSwigger. Please review all license agreements and terms of usage for all of the products listed below.\n\n[VMware Workstation Player](https://www.vmware.com/content/vmware/vmware-published-sites/us/products/workstation-player.html.html)\n\n[Get Kali](https://www.kali.org/get-kali/)\n[Kali Virtual Machines](https://www.kali.org/get-kali/#kali-virtual-machines)\n\n[Postman](https://www.postman.com/)\n[Create Postman Account](https://identity.getpostman.com/signup)\n\n[Burp Suite Community Edition](https://portswigger.net/burp/communitydownload)\n[PortSwigger Web Security Academy](https://portswigger.net/web-security)\n\n[Zed Attack Proxy (ZAP)](https://www.zaproxy.org/)\n[ZAP Getting Started](https://www.zaproxy.org/getting-started/)\n\n[completely ridiculous API (crAPI)](https://owasp.org/crAPI/)"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2023-11-13",
        "time": "8:45-05:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/296938204",
        "timezone": "America/New_York",
        "description": "The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org."
    },
    {
        "group": "Lisboa",
        "repo": "www-chapter-lisboa",
        "name": "#05 The Cake",
        "date": "2023-11-15",
        "time": "8:00Z",
        "link": "https://www.meetup.com/owasp-lisboa-chapter/events/296853686",
        "timezone": "Europe/Lisbon",
        "description": "Join us for an evening of celebration and preparation as OWASP Lisbon marks its one-year anniversary! As we reflect on the past year's achievements, we're excited to kick off a series of meetups that will lead us into the highly anticipated OWASP Global AppSec Lisbon Event. This first meetup of the series will set the stage for an incredible journey towards building more secure applications and connecting with fellow appsec enthusiasts.\n\nThe meetup takes place on November 15th, 2023, at 18:00, at the OLX office, and is **sponsored by OLX and AP2SI**.\n\nThe schedule is the following:\n18:00 - **The Cake** by the OWASP Lisboa chapter leadership team\n18:15 - **Seeing What’s Wrong Just Right** by Jasvir Nagra\n19:10 - **Why everyone in your cyber security team needs to be an AI expert** by Dinis Cruz\n20:00 - **Drinks & Dinner** by OLX\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n**Talks**:\n\nTitle: **Seeing What’s Wrong Just Right**\n\nSpeaker: **Jasvir Nagra**\n\nAbstract:\nWriting web applications is hard. Debugging them is harder. Security bugs are even harder because not only does an application have to work, it has to stop working when the input is malicious. One approach web developers have taken to managing the complexity of writing large web programs is to make it harder to write incorrect programs. Static type checkers, linters, tests and testing frameworks have all made it easier to write correct code. Nevertheless, incorrect and vulnerable programs still exist. In fact, the very success of these tools in avoiding common errors has meant developers spend increasing amounts of time debugging only subtle bugs. In distributed systems, the challenge is even harder because debugging tools give you glimpses into the program state—some on the server, some on the client—without giving you a coherent view of the entire system. Not only are web programs inherently distributed between the server and the client, any one web page in the browser is itself made up of different iframes, events and event handlers, and sometimes service workers all communicating asynchronously. In this talk, I will share a few painful distributed web app debugging anecdotes and an alternate approach to get a holistic view of a program to track down elusive bugs. This approach uses virtualization to create complete traces of just those aspects of the program we suspect are buggy without having to model all program state. Virtualization allows us to momentarily ignore incidental bugs discovered while hunting the core one without it getting in the way, and visualization of the collected traces to build up causal diagrams to inform our intuition when our mental models deviate from reality. I will demonstrate how to recognize and tackle debugging problems with this approach and cover pitfalls you may run into with virtualization.\n\nBio:\nJasvir Nagra is widely recognized as a thought leader in software protection. He is co-author of Surreptitious Software, the definitive textbook on software protection, and an early researcher in obfuscation, software watermarking, and fingerprinting. With more than 12 years of experience, his professional path includes companies such as Instart, Dropbox and Google - where he led the Caja project. As an advisor to Jscrambler, he is helping cybersecurity startups address key technological challenges.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nTitle: **Why everyone in your cyber security team needs to be an AI expert**\n\nSpeaker: **Dinis Cruz**\n\nAbstract:\nSimilar to how electricity revolutionised our lives and is now ubiquitous, Gen AI is poised to become an integral part of everything Cyber Security teams do everyday. Therefore, there is an increasing need to deepen our understanding and expertise in this transformative technology. It's time to embrace the opportunities AI presents and equip ourselves with the knowledge to thrive in this rapidly evolving landscape.\n\nBio:\nDinis Cruz is the Chief Scientist of Glasswall and the CISO of Holland & Barrett, who brings a unique blend of Security and Engineering expertise with 20+ years experience in Cyber Security and Software Development. Dinis is focused on creating Gen AI powered teams and environments where engineering and security are enablers and accelerators for the business, with a big focus on the productisation and commercialisation of advanced technologies."
    },
    {
        "group": "Ljubljana",
        "repo": "www-chapter-ljubljana",
        "name": "Opening session OWASP Ljubljana - Post quantum cryptography",
        "date": "2023-11-09",
        "time": "6:30+01:00",
        "link": "https://www.meetup.com/owasp-ljubljana-chapter/events/296853307",
        "timezone": "Europe/Belgrade",
        "description": "Kriptografija je učinkovit način za zaščito zaupnosti in celovitosti informacij ter zaščito informacijskih sistemov pred kibernetskimi grožnjami. Kvantno računalništvo grozi, da bo razbilo večino današnje kriptografske zaščite. Čeprav že prihajajo poročila o prvih poskusih zloma uveljavljenih kriptografskih algoritmov, kvantni računalniki, ki so na voljo ta trenutek, v splošnem še niso dovolj zmogljivi, da bi jih razbili. Vendar bo v prihodnosti možno izkoristiti dovolj zmogljiv kvantni računalnik za dešifriranje, branje ali dostop do občutljivih informacij.\nSpreminjanje miselnosti in načina dela, ki ga zahtevajo kvantni računalniki in algoritmi, je dolgotrajno in zahtevno, saj gre za popolnoma drugačen pristop od klasičnih računalnikov in algoritmov. Prehodi na nove kriptografske algoritme so dragi, motijo poslovanje in običajno trajajo veliko dlje od predvidenega. Prav zdaj je pred nami eden najpomembnejših kriptografskih prehodov: od klasične kriptografije z javnim ključem do kvantno varne, post-kvantne kriptografije (PQC – post quantum cryptography). Pri PQC gre za oblikovanje kriptografskih rešitev, ki jih lahko uporabljajo današnji nekvantni računalniki in za katere smo prepričani, da so odporne tako na klasično kot na prihodnjo kvantno kriptoanalizo."
    },
    {
        "group": "Morocco",
        "repo": "www-chapter-morocco",
        "name": "DevSecOps Toolchain Transformation on Microsoft Azure and Amazon AWS",
        "date": "2023-11-24",
        "time": "5:00+01:00",
        "link": "https://www.meetup.com/morocco-owasp-meetup-group/events/290723926",
        "timezone": "Africa/Casablanca",
        "description": "## DevSecOps Toolchain Transformation Hands-on\n\nThe DevSecOps Mindset and Salient Features\n\n* Shared Objectives\n* Prioritizing Security\n* Auomation\n* Operational Insights and Threat Intelligence\n* Holistic Security\n* Proactive Threat Monitoring\n* Security-as-a-Code\n* Infrastructure-as-a-Code\n* Improved Collaboration\n* Developers as Security Proponents\n* Continuous Monitoring and Auditing\n* Defined Incident Response\n\nHere are some actions you can take to upgrade your DevOps toolchain into a DevSecOps toolchain:\n\n1. Learn From Others in the DevOps and DevSecOps Communities\nLook to the DevOps community to help close your critical knowledge gaps.\n2. 2\\. Start With Your Container Security\nThe first step to building out the security of your DevOps toolchain starts with your container security.\n3. Institute Continuous Compliance\nDevSecOps is a platform for continuous compliance to protect your software supply chains against vulnerable packages and vulnerable configurations.\n4. Double Down on Automation\nWhile you may have already been experimenting with automation during your DevOps phase, it only becomes more integral once you throw the switch in by going DevSecOps. Go into your DevOps to DevSecOps transformation with an automation strategy that focuses on automating common developer and sysadmin tasks.\n5. Improve Your Monitoring and Analytics\nBuilding out a DevSecOps toolchain takes your monitoring and analytics options to a new level. Consider the fact that you should already collect and publish data from your toolchain and deliver reports to your project managers, developers, QA testers, and stakeholders outside your team. Commonly, DevOps reporting is still a work in progress for organizations. Use the introduction of new security tools into your toolchain as a chance to offer more granular and real-time security reporting into all parts of your DevSecOps toolchain.\n6. Implement Accessibility Assurance\nDepending on your organization’s definition of compliance, the option is there to add accessibility compliance or Section 508 to your DevSecOps toolchain.\n\nThis hands-on training is reserver for 70% professional and 30% students.\n\nMandatory:\n\nGeneral Conditions in order to validate your participation to this event:\n\n1\\. Student must send University/Student ID\\, otherwise registration will be rejected\\.\n\n2.Professional must register company emails, otherwise registration will be rejected.\n\nRegistration only via EventBrite. We don't accept answer via meetup.\n\nPlease indicate your firstname, lastname, company name, a valid business email or school email (email like gmai, free, hotmail, outlook, etc are not accepted and registration will be cancelled).\n\nPlease register here:\nhttps://www.eventbrite.com/e/billets-devsecops-toolchain-transformation-374188276207"
    },
    {
        "group": "Natal",
        "repo": "www-chapter-natal",
        "name": "Segurança da Informação no GORN 2023 - OWASP Natal",
        "date": "2023-11-03",
        "time": "9:00-03:00",
        "link": "https://www.meetup.com/owasp-natal-chapter/events/296970783",
        "timezone": "America/Fortaleza",
        "description": "Você é desenvolvedor, analista de segurança, gerente de TI ou simplesmente apaixonado por segurança da informação? Não perca o evento mais aguardado do ano! A OWASP Natal, afiliada à Open Web Application Security Project, tem o prazer de apresentar uma sessão especial de segurança da informação no GORN 2023, o maior evento de inovação, startups, tecnologia e transformação digital do Rio Grande do Norte.\n\n **Data e Hora**: 03 e 04 de novembro de 2023\n **Local**: Centro de Convenções de Natal\nEste é um evento imperdível para quem deseja aprimorar suas habilidades em segurança digital. Reunimos palestrantes renomados e workshops interativos para proporcionar uma experiência educacional única e enriquecedora. Confira nossa programação detalhada:\n\n**Dia 1 - 03 de Novembro**:\n **10:00 - Proteção e Prevenção contra XSS no Front-end**\n\n* Palestrante: Allyne Beatriz Nascimento Ferreira (OWASP)\n\n **11:00 - Introdução ao Firmware Hacking**\n\n* Palestrante: Matheus Cezar (OWASP)\n\n **14:00 - Security Misconfiguration: Pequenos problemas, grandes Impactos**\n\n* Palestrante: Anderson Cirilo (OWASP)\n\n **17:00 - Blue Team: Detecções e ameaças**\n\n* Palestrante: Josué Santos (OWASP)\n\n **18:00 - Conscientização em segurança da informação**\n\n* Palestrantes: Gustavo Marques e Josué Santos (OWASP)\n\n**Dia 2 - 04 de Novembro**:\n **11:00 - Vazando arquivos sensíveis por meio de URLs**\n\n* Palestrante: Eduardo Paixão (OWASP)\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAlém da nossa programação, temos o prazer de apresentar palestras de outras comunidades que enriquecerão sua compreensão da segurança da informação:\n\n **12:00 - Security Implication of ChatGPT**\n\n* Palestrante: Man Filho (DevOpsDays)\n\n **19:00 - Game Hacking: Cheat Engines 101**\n\n* Palestrante: Kali Nathalie (WTM & PyLadies)\n\n **09:00 - Desenvolvimento Seguro: O poder do básico bem feito**\n\n* Palestrante: Matheus Ferraz (PotiLivre)\n\n **13:00 - Jogando com aplicativos financeiros brasileiros para se divertir e lucrar**\n\n* Palestrante: Heitor Gouvêa (GDG NATAL)\n\nEste evento é gratuito e aberto ao público, portanto, não perca a oportunidade de se juntar a nós para aprender, compartilhar conhecimento e fazer networking com profissionais da área. Para garantir sua vaga, inscreva-se em nosso site oficial: [Inscrições](https://gorn.com.br/).\nVenha fazer parte desta experiência educacional e contribuir para a segurança da informação no Rio Grande do Norte!\n\n**Hashtags:** #OWASPNatal #GORN2023 #SegurançaDigital #Inovação #Tecnologia"
    },
    {
        "group": "Netherlands",
        "repo": "www-chapter-netherlands",
        "name": "OWASP BeNeLux Days 2023",
        "date": "2023-11-23",
        "time": "9:00+01:00",
        "link": "https://www.meetup.com/owasp-chapter-netherlands-meetup/events/295925893",
        "timezone": "Europe/Amsterdam",
        "description": "Exciting News!  Join us at the \"OWASP BeNeLux Days 2023\" edition on November 23rd-24th in Hasselt, Belgium. \n\n Explore the latest in security, devops, and cloud with technical talks by industry experts.\n Get hands-on with top security training sessions.\n Gain insights from keynotes by industry leaders.\n Discover cutting-edge security tech at vendor booths.\n\nCheck the link below for more information and registering for the event:\n[https://www.owaspbenelux.eu/](https://www.owaspbenelux.eu/)"
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland-area Meetup",
        "date": "2023-11-21",
        "time": "8:30+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721034",
        "timezone": "Pacific/Auckland",
        "description": "For November, we're shifting our Meetup by one week, to work around several other events going on in the region - the NZITF Conference is taking place in Wellington Monday and Tuesday, 13-14 November; the ISANZ Awards Dinner is on the evening of 14 November; and John will be in Melbourne for the OT Cyber Resilience Summit on the 14th.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10, with the 2021 edition. Our Top 10 topic for November will be **A10:2021 - Server-Side Request Forgery (SSRF).**\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make.\n\nThe Auckland-area OWASP Meetup usually takes place on the second Tuesdays of March, May, July, September, and November. There are no Meetups in January, as our members enjoy their holidays."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Training Day - Dunedin",
        "date": "2023-11-11",
        "time": "8:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/296507998",
        "timezone": "Pacific/Auckland",
        "description": "We're pleased to announce that we'll be holding an OWASP Training Day event in Dunedin, on Saturday, 11th November.\n\nClasses will run 8:45 a.m. - 5:30 p.m. Tea breaks and lunch will be provided.\n\nRegistration Fee: $99 per attendee (plus GST and booking fees)\n\nWe're in the process of confirming our classes and trainers, so we'll update this description with registration information as soon as those are confirmed."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP Global AppSec - DC",
        "date": "2023-10-30",
        "time": "0:00+13:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/291721118",
        "timezone": "Pacific/Auckland",
        "description": "**Global AppSec DC returns October 30 - November 3!**\n\nDesigned for private- and public-sector InfoSec professionals, the two-day OWASP conferences equip developers, defenders, and advocates to build a more secure web.\nWe are offering educational 1-day, 2-day, and 3-day training courses immediately following the conference.\n\n**Conference dates:** Monday and Tuesday, October 30-31\n**Training dates:** Wednesday to Friday, November 1-3.\n\nJoin us for leading application security technologies, speakers, prospects, and community, in a unique event that will build on everything you already know to expect from an OWASP Global Conference.\n\nConference Site: [https://dc.globalappsec.org/](https://dc.globalappsec.org/)\nRegistration: [EventBrite](https://www.eventbrite.com/e/owasp-global-appsec-washington-dc-2023-tickets-519195877847)"
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Orange County Cybersecurity Mixer",
        "date": "2023-11-14",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-oc/events/296965469",
        "timezone": "America/Los_Angeles",
        "description": "Please join us for our first **in-person Cyber Mixer** with Orange County's cybersecurity organizations and groups!\nThe Orange County (OC) cybersecurity organizations and groups that will participate in this event are:\n\n* **OWASP Orange County**\n* **Women's Society of Cyberjutsu SoCal Chapter**\n* **ISACA Orange County**\n* **Cloud Security Alliance Orange County**\n* **ISSA of Orange County**\n* **Irvine Underground**\n\n**Additional details**\nThis is a combined event with other Orange County cybersecurity organizations. It is not a sponsored event and will not be expected to have food and drinks provided. Since this is the first time we're doing this, we will hear from our members what things could be improved or requested for future mixers."
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Chapter 3: Cyber Peterborough MeetUp",
        "date": "2023-11-01",
        "time": "9:30Z",
        "link": "https://www.meetup.com/owasp-peterborough/events/295240302",
        "timezone": "Europe/London",
        "description": "**We're evolving!**\n\nListening to our member feedback, we've moved towards '**Cyber Peterborough**', have a new lick of paint and are still focussing on all things cyber security.\n\n**'Powered by OWASP'** means we still practice, share and discuss content amongst peers in our global network, now with a local feel closer to our community.\n\n**Making Cyber Security Accessible.**\n\nCyber Peterborough is for everyone. Come along, bring a friend, share with your colleagues. You don't need to be a security professional, each session will break down topics to ensure everybody can take something away.\n\n**Agenda**\n\n1. **Ben Mackereth** \\| A working title of a mysterious nature\n2. **Speaker TBC**\n3. **Sign up to Cyber Peterborough's first ever Capture the Flag!** Suitable for all experiences and abilities, join us over food and drink and learn whilst doing in our CTF event.\n\n**When is it?**\n\n* Wednesday 1st November\n* **Start** from 7:30PM\n* **Finish** around 11:00PM\n\n**Where is it?**\n\n* The Brewery Tap, Peterborough\n\n**How can you get involved?**\n\n* Respond \"I'm Coming!\" to this group\n\nWe look forward to seeing you!"
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2023-11-08",
        "time": "2:00-08:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/296626035",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "Tegucigalpa",
        "repo": "www-chapter-tegucigalpa",
        "name": "Charla sobre: Introducción a OWAPS ZAP (Zed Attack Proxy)",
        "date": "2023-11-25",
        "time": "8:00-06:00",
        "link": "https://www.meetup.com/owasp-tegucigalpa-chapter/events/296929802",
        "timezone": "America/Tegucigalpa",
        "description": "Charla sobre: Introducción a OWAPS ZAP (Zed Attack Proxy) El escáner de aplicaciones web más utilizado del mundo. Libre y de código abierto. Mantuvo activamente a un equipo internacional dedicado de voluntarios. Un proyecto de GitHub Top 1000."
    },
    {
        "group": "Tiruvallur",
        "repo": "www-chapter-tiruvallur",
        "name": "Null and OWASP combined meetup",
        "date": "2023-10-28",
        "time": "4:30+05:30",
        "link": "https://www.meetup.com/tiruvallur-owasp-meetup-group/events/296618490",
        "timezone": "Asia/Kolkata",
        "description": "* Hacking Companies on Mails - Deep Dive into Email Security by **Sriram**\n* AI and ML in CyberSecurity by **PradeepKumar P**\n* You can be a Human Decompiler by **Ravi Rajput**\n* Cloud Security 101 by **Chandresh Gupta**"
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Drink Your Own Champagne: How to Threat Model Your Threat Modeling Program",
        "date": "2023-11-15",
        "time": "2:00-05:00",
        "link": "https://www.meetup.com/owasptriangle/events/296265774",
        "timezone": "America/New_York",
        "description": "We threat model our technology to ensure strong, resilient designs. As a critical control, our practice of threat modeling demands the same rigor. Learn to drink your own champagne by threat modeling your program's weaknesses to design better strategies and unlock more business value from your threat models."
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "LLM and NLP APIs: A Journey to Avoiding Data Breaches",
        "date": "2023-11-16",
        "time": "8:00-08:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/290248521",
        "timezone": "America/Vancouver",
        "description": "**Ads Dawson**, v1.1 Technical Release Lead & Entry Lead for the OWASP Top 10 for Large Language Model Applications and a seasoned security engineer at Cohere, will take us on an insightful journey through the challenges and solutions involved in securing large language models and natural language programming APIs. With his extensive experience, Ads will shed light on how to avoid data breaches, fortify against attacks, and enhance the security of these crucial technologies through the use of tools like OWASP Top 10 for LLMs. Don't miss this opportunity to learn from a true expert in the field!"
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "OWASP Victoria | From Basics to Burp: Navigating PortSwigger Academy",
        "date": "2023-11-16",
        "time": "8:30-08:00",
        "link": "https://www.meetup.com/owasp-victoria-chapter/events/296919377",
        "timezone": "America/Vancouver",
        "description": "The OWASP Victoria chapter is pleased to present a workshop hosted by Wyatt Harvey and Sebastian Bethell titled \"From Basics to Burp: Navigating PortSwigger Academy\".\n\nThe event will be held on November 16, 2023 from 6:30 PM to 8:30 PM at Fort Tectoria (doors open at 6 PM).\n\nThe event will feature the workshop including an introduction to PortSwigger Academy as well as working through five of the labs. Snacks, networking, and fun will also be included.\n\nDon't miss out on this valuable opportunity to enhance your knowledge and skills in web application hacking. If you would like to attend, please click the RSVP button to reserve your spot as we have limited seats available.\n\nBring your laptop with BurpSuite installed and join us for a hands-on evening of application security fun!\n\nWe would also like to give a special thanks to First West Credit Union for sponsoring this event."
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "Monthly SAMM community call",
        "date": "2023-11-08",
        "time": "5:30-05:00",
        "link": "https://www.meetup.com/owasp-samm/events/291889868",
        "timezone": "America/New_York",
        "description": "Welcome to our monthly SAMM community call Wednesday 8th November, (each 2nd Wednesday of the month).\n\nAt 21:30 CET, which is 3:30 pm EST.\n\nJoin Zoom Meeting: [Zoom link](https://zoom.us/j/96866048960?pwd=TmZkTSs3ZmlWU09DbHJoSnVZWmdiUT09)."
    }
]