[
    {
        "group": "Aarhus",
        "repo": "www-chapter-aarhus",
        "name": "OWASP Aarhus Chapter Meeting - August",
        "date": "2024-08-27",
        "time": "19:00+02:00",
        "link": "https://www.meetup.com/owasp-aarhus-chapter/events/299460613",
        "timezone": "Europe/Copenhagen",
        "description": "Join the August OWASP Aarhus meet with Cryptomathic!\n\nAgenda:\n\n19:00 – 19:10 Welcome by Cryptomathic and OWASP Aarhus\n\n19:10 – 20:00 Using fuzzing to detect program errors by Jan and Anna.Jan and Anna: Software engineers; working with C, C++, and Java on a daily basis while attempting to avoid introducing new critical bugs. We will talk about how fuzzing can be used to detect program errors unrelated to project requirements. The main focus will be fuzzing functions, with known source code, that receive input from untrusted sources.\n\n20:00 – 20:30 Networking break\n\n20:30 – 21:25 \"Secure SDLC with a DevOps Flavor!\" by Jim Manico\nPlease note, that Jim will join us over Teams.\nJoin Jim Manico for an enlightening session on \"Secure SDLC with a DevOps Flavor!\" where he merges cutting-edge DevOps practices with robust security measures. In this talk, Jim will delve into automating security within the CI/CD pipeline to ensure continuous security integration, advocate for a shift-left approach to catch vulnerabilities early, and discuss implementing Security as Code to maintain consistent security configurations. He will also emphasize the importance of fostering a DevSecOps culture where security is a shared responsibility across all teams. Additionally, Jim will outline essential tools and technologies that enhance security in DevOps environments, and stress the significance of monitoring security metrics for continuous improvement. This session is a must-attend for professionals seeking to integrate effective security practices into their development cycles without sacrificing speed or efficiency."
    },
    {
        "group": "Atlanta",
        "repo": "www-chapter-atlanta",
        "name": "From Noise to Insight: Transforming Vulnerability Data",
        "date": "2024-09-18",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/owasp-atlanta/events/302943013",
        "timezone": "America/New_York",
        "description": "Security and engineering teams everywhere are often overwhelmed by the tens of thousands of new vulnerabilities that are reported each year. But while there are several commonly used prioritization inputs that can help manage CVE noise — like CVSS, EPSS, and KEV — there are additional factors organizations would be wise to consider beyond these frameworks.\nThis talk will provide guidance for using inputs like asset business context, remediation efficiency, and exploitability analysis alongside traditional vulnerability metrics. Additionally, it will cover important outputs (like VEX and VDR statements) that efficient vulnerability management programs can use to communicate outcomes and posture to internal and external audiences.\n\nEvent sponsored by FOSSA: https://fossa.com/\nDinner provided\nPlease arrive on-time as we begin promptly at 5:30."
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "September 2024 OWASP Austin Security Professionals Happy Hour--sponsor Checkmarx",
        "date": "2024-09-12",
        "time": "17:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/302000326",
        "timezone": "America/Chicago",
        "description": "**When:** Thursday, September 12th, 5:30 pm - 7:30 pm\n\n**Where:** Lavaca Street Bar at the Domain Northside (Rock Rose District), 11420 Rock Rose Ave #100, Austin, TX 78758. We will have tables reserved inside the bar, to the right as you enter. Parking: nearest parking in the Red Garage located off of Rock Rose Ave ([map of Domain](https://domainnorthside.com/map/)).\n\n**What:** The Austin Security Professionals Happy Hour is a monthly event coordinated by the OWASP Austin Chapter and sponsored by various companies. We try to meet every second Thursday of the month from January to September (but occasionally we make schedule adjustments when needed). The event is an informal social gathering of local information security professionals. If you're involved with InfoSec or even if you have an interest, come on out for drinks, good food and conversation.\n\n**Sponsor:** [Checkmarx](https://checkmarx.com)\n*Checkmarx is constantly pushing the boundaries of Application Security Testing to make security seamless and simple for the world’s developers and security teams. As the AppSec testing leader, we deliver the unparalleled accuracy, coverage, visibility, and guidance our customers need to build tomorrow’s software securely and at speed.*"
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - August 2024 (Online)",
        "date": "2024-08-27",
        "time": "11:30-05:00",
        "link": "https://www.meetup.com/owasp-austin-chapter/events/298207020",
        "timezone": "America/Chicago",
        "description": "30 minutes of meet-and-greet and Chapter information, then the Presentation!\n\nIf you would like to attend in-person, please pull a ticket from Eventbrite, but please only pull a ticket from Eventbrite if you are attending as we purchase lunch for all in-person tickets pulled and we don't want to waste money and food.\n\\- Group1 [https://www.eventbrite.com/e/980779516937](https://www.eventbrite.com/e/980779516937)\nor\n\\- Group2 [https://www.eventbrite.com/e/980854350767](https://www.eventbrite.com/e/980854350767)\n\n*Presentation: **How to protect WordPress or other CMS websites***\n\nIn this presentation, we will walk through different types of real anonymized attacked WordPress and other CMS frameworks in how those sites were attacked and how the sites were then protected from future attacks.\nEveryone attending should leave the presentation able to:\n\\- Understand how these sites are attacked\n\\- Protects that may have already been in place that didn't work\n\\- What measures were then put in place that worked"
    },
    {
        "group": "Bay Area",
        "repo": "www-chapter-bay-area",
        "name": "OWASP Bay Area August Meetup with Pacific Hackers",
        "date": "2024-08-27",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/bay-area-owasp/events/302963842",
        "timezone": "America/Los_Angeles",
        "description": "## Details\n\nWe're excited to announce our upcoming August meetup in conjunction with **Pacific Hackers**, which will be hosted by the awesome **Snyk** team at **Hacker Dojo in Sunnyvale**. Get ready for insightful discussions and the chance to network with some of the brightest minds in the industry.\n\n**Agenda:**\n5:30 - 6:00: Doors open, networking and food\n6:00 - 6:45: Talk 1: Stranger Danger - Javier Garza\n6:45 - 7:30: Talk 2: Business Applications Governance - Ofer Elzam\n\n**Talk 1:**\nSpeaker: Javier Garza\n\nTitle: Stranger Danger - finding security vulnerabilities before they find you\n\nSpeaker Bio:\nJavier Garza is a Technology evangelist that has written many articles on HTTP/2 and web performance, and is the co-author of the O’Reilly Book “Learning HTTP/2”. In 2018, Javier spoke at more than 25 developer-related events around the world, including well-known conferences like Velocity, AWS Re:Invent, and PerfMatters. His life’s motto is: share what you learn, and learn what you don’t. In his free time he enjoys challenging workouts and volunteering for non-profits in areas like children and education.\n\n**Talk 2:**\nSpeaker: Ofer Elzam\n\nDescription:\nSecOps/GRC spend 25-30% of their time chasing operational teams trying to figure out tech-stacks and business architectures. It is a global pain across market segments and verticals. We will analyze the root-causes for these challenges, dig into use-cases, and explore new approaches for frictionless collaboration between SecOps, GRC, MIS, and functional Ops teams.\n\nSpeaker Bio:\nOfer Elzam is the CEO and co-founder of trustedstack.ai. He has been a product leader and innovator at Check Point, Dome9, Cisco, Firemon, Sophos, SecurityScorecard. Always enthusiastic discussing cybersecurity - from NGFW to CSPM to TPRM and almost anything in between."
    },
    {
        "group": "Belem",
        "repo": "www-chapter-belem",
        "name": "Owasp Belém CTF",
        "date": "2024-08-31",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-belem/events/302959492",
        "timezone": "America/Boa_Vista",
        "description": "Neste sábado, 24 de agosto, a OWASP Belém, um dos capítulos brasileiros entre mais de 200 capítulos ativos em todo o mundo, tem como objetivo disseminar a missão da OWASP: tornar a segurança das aplicações visível, para que pessoas e organizações possam tomar decisões conscientes sobre os verdadeiros riscos de segurança das aplicações.\n\nO tema desta edição é Capture the Flag (CTF), um evento geralmente projetado como um exercício educacional para dar aos participantes experiência na exploração de vulnerabilidades em máquinas, além de conduzir e reagir aos tipos de ataques encontrados no mundo real.\n\nData: 24/08/2024\nHorário: 16h\nOnline: https://www.youtube.com/@owaspbelem"
    },
    {
        "group": "Bhopal",
        "repo": "www-chapter-bhopal",
        "name": "Mastering Secure Coding and Effective Code Review with CTF",
        "date": "2024-09-01",
        "time": "10:30+05:30",
        "link": "https://www.meetup.com/owasp-bhopal-chapter/events/302996702",
        "timezone": "Asia/Kolkata",
        "description": "Join us for an evening dedicated to mastering the art of secure coding and conducting effective code reviews. This event, hosted by the OWASP Bhopal Chapter, is designed to promote collaboration and knowledge sharing in the critical areas of cybersecurity, software security, and secure development practices.\nBuilding on the success of our previous events like \"Revisiting Cyber Security & 101 with ML\" and \"ML Huddle & Cracking the Cybersecurity Puzzle\" this session will delve into the best practices and strategies for writing secure code and performing thorough code reviews to enhance software security.\n\nWe'll explore key principles of secure coding, including how to identify and mitigate common vulnerabilities such as SQL injection, cross-site scripting (XSS), and buffer overflows. The event will also cover effective code review techniques, emphasizing the importance of peer reviews and automated tools in detecting and resolving security issues early in the development process. By integrating these practices into your workflow, you can significantly reduce the risk of security breaches and ensure your applications are resilient against attacks.\n\nWhether you're an experienced cybersecurity professional or a developer eager to improve your secure coding skills, this event offers the perfect platform to connect with peers and deepen your understanding. Join us for an insightful session on the latest techniques in secure development, the importance of rigorous code review processes, and the newest developments within the OWASP community. Let's work together to strengthen the foundations of secure coding and make the digital world a safer place for everyone!"
    },
    {
        "group": "Chennai",
        "repo": "www-chapter-chennai",
        "name": "OWASP Meetup AUG 2024",
        "date": "2024-08-31",
        "time": "10:00+05:30",
        "link": "https://www.meetup.com/chennai-owasp-meetup-group/events/302956438",
        "timezone": "Asia/Kolkata",
        "description": "* LLM Security 101 - Series (OWASP Top 5 to 7) by **Sethu Mathavan**\n* Securing Software Supply Chain by **Anirudh srinivas**\n* Wordpress BugBounty by **nagedoer**\n* Malware Forensics by **Pradhan Vijayakumar**\n\nNote: The session details including schedule are available below.\nKindly use this link to register : [Registration form](https://docs.google.com/forms/d/1PsJ0wllUh0HgRtAW9J8oV-CiAwoyIcwPGd-7apEuM1M/edit)"
    },
    {
        "group": "Chile",
        "repo": "www-chapter-chile",
        "name": "Papá, tengo un romance con la IA",
        "date": "2024-08-27",
        "time": "20:00-04:00",
        "link": "https://www.meetup.com/owasp-chile-meetup-group/events/302317399",
        "timezone": "America/Santiago",
        "description": "En esta era de revolución tecnológica, las interacciones entre humanos e inteligencias artificiales están alcanzando niveles de complejidad sin precedentes.\n\nEste podcast abordará un fenómeno emergente:\n\n* Individualismo y soledad en el mundo real.\n* El desarrollo de vínculos emocionales profundos con entidades de IA.\n* Implicaciones Éticas y Psicológicas en niños, niñas y adolescentes."
    },
    {
        "group": "Cincinnati",
        "repo": "www-chapter-cincinnati",
        "name": "API Security Blunders: Tales from the Cyber Trenches",
        "date": "2024-09-05",
        "time": "16:00-04:00",
        "link": "https://www.meetup.com/owasp-cincinnati-meetup-group/events/302687611",
        "timezone": "America/New_York",
        "description": "**This meeting will be in-person! Thank you to Kroger for hosting at their Kroger Blue Ash Technology Center. For security, RSVP by 2 days prior to the meeting is required.**\n\n**Sponsored by [Traceable](https://www.traceable.ai/)**\n\nIn this session, we dive into API Security by dissecting real-world API vulnerabilities that have caused security breaches. We'll guide you through the process of hunting for such vulnerabilities, and provide insights to effectively defend against such attacks.\n\n**Approximate schedule:**\n4:00 - Doors open. Come for networking and refreshments\n4:15 - Presentation begins.\n5:15 - Networking and refreshments resume!\n6:00 EOE (End of Event)"
    },
    {
        "group": "Colorado Springs",
        "repo": "www-chapter-colorado-springs",
        "name": "OWASP CoS August 2024",
        "date": "2024-08-29",
        "time": "18:00-06:00",
        "link": "https://www.meetup.com/owasp-colorado-springs-meetup/events/302639003",
        "timezone": "America/Denver",
        "description": "Speaker: John Mocuta; \"Finding and Submitting a Zero day\"\n\nAfter / during: Pizza, Beer, Assortment of soft drinks\n\nLocation: National Cyber Center (NCC):\nhttps://cyber-center.org/"
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "All Day All Night API Security Endpoint Analytics",
        "date": "2024-09-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/columbus-owasp/events/301083996",
        "timezone": "America/New_York",
        "description": "APIs are the pipelines to the data within our environments. Attackers want this data. So how can you use the APIs to understand when you are being attacked? How can endpoint analytics help? In this discussion I will break down several attacks that have occurred over the trillions of transactions that have been monitored over time."
    },
    {
        "group": "Denver",
        "repo": "www-chapter-denver",
        "name": "Denver OWASP September Meetup - Join Us!",
        "date": "2024-09-18",
        "time": "17:30-06:00",
        "link": "https://www.meetup.com/owasp-denver-chapter/events/302950884",
        "timezone": "America/Denver",
        "description": "**Everyone is welcome! Bring a friend...**\n\nJoin us on September 18th for food, drinks, networking and an exciting presentation. Networking with your peers starts at 5:00 - food is served at 5:30 and the presentation starts at 6:00.\n\nThis month's meeting is brought to you by SnowFROC! This month's speaker will be Jason Haddix! Jason taught two workshops for us at SnowFROC this year and this was one of them. If you missed them, now's your chance!\n\n**Presentation:**\nRecon Like an Adversary: Uncovering Modern Techniques in Attack Surface Management\n\n**Abstract**:\nJoin our expert, Jason, in a talk designed to demystify the advanced techniques adversaries employ to infiltrate organizations. This session is a deep dive into the world of attack surface management using open-source tools, tailored to emulate both adversaries and professional bug hunters.\n\n* Introduction to Reconnaissance Techniques: Gain insights into the methodologies used by adversaries in their initial approach to an organization.\n* Tool Mastery: Explore a range of common tools and techniques for targeting organizations. This includes:\n* Email Acquisition: Methods and tools for gathering email data.\n* Technology Profiling: Techniques for identifying the technology stack of an organization.\n* External Attack Surface Analysis: A focus on cloud and mobile environments, among others.\n* Historical Data Mining: Strategies for uncovering valuable historical endpoint data.\n* Live Demonstrations: Experience real-time use of each tool in the toolchain. Jason will share personal tips and tricks, enhancing your learning experience.\n* Practical Application: The workshop features live targets, offering a real-world scenario for participants to engage with and learn from.\n* Interactive Learning Experience: Participants are encouraged to actively engage, ask questions, and share experiences throughout the session."
    },
    {
        "group": "Gothenburg",
        "repo": "www-chapter-gothenburg",
        "name": "OWASP Gothenburg Maritime and OT Cybersecurity",
        "date": "2024-09-19",
        "time": "17:15+02:00",
        "link": "https://www.meetup.com/owasp-gothenburg-meetup-group/events/302944829",
        "timezone": "Europe/Stockholm",
        "description": "**Join us at our partner Stena's Danmarksterminalen for an interesting evening with food and drinks, and talks about maritime and OT cybersecurity!**\n\n**Where:** Stena Line Danmarksterminalen, 413 28 Gothenburg\n\n**Agenda:**\n\n**17:15 - 17:30** Doors open\n\n**17:30 - 17:45:** Introduction from the event hosts and presentation of tonight's speakers.\n\n**17:45 - 18:30:** Maritime cybersecurity governance, *Fredrik Pihl*\n\n**Talk outline:** Maritime industry is being regulated since a few years back and is on journey towards a risk-based management approach. Learn about threat landscape, incidents, governance and similarities between industries.\n\n**Speaker’s bio:** Manager Cybersecurity, Risk and Compliance at Stena Group IT and OT Security Officer at Stena Group IT working with vessels, ports and terminals, wind turbines, property and waste management. Fredrik has 15+ years of experience from industrial IT projects and physical security industry working as IT / OT security architect including manufacturing, rail, defense industry, telecom and logistics.\n\n**18:30 - 19:00:** Food & Drinks\n\n**19:00 - 19:45:** Bridging the gap between IT and OT, *Jonathan Björnsson*\n\n**Talk outline:** In his presentation, Jonathan will, in a light-hearted and engaging manner, demonstrate how to bridge the gap between IT and OT. The goal is to build connections between these two areas and show how collaboration can lead to both innovation and stronger security.\n\n**Speaker’s bio:** Jonathan Björnsson is a cybersecurity expert with over 25 years of experience in both IT and OT. With his deep understanding of how these two worlds intersect and are secured, he has helped organizations protect their critical infrastructures. Jonathan is certified in Generative AI and works on AI-based cybersecurity solutions within the EU. He is also known for making complex security issues easy to understand for everyone.\n\n**19:45 - 20:30:** Over-time (optional)\nHang out, grab something to drink, and discuss security, the weather or anything in between!"
    },
    {
        "group": "Jacksonville",
        "repo": "www-chapter-jacksonville",
        "name": "OWASP Monthly meeting ",
        "date": "2024-09-16",
        "time": "18:45-04:00",
        "link": "https://www.meetup.com/owasp-jacksonville-chapter/events/302940703",
        "timezone": "America/New_York",
        "description": "OWASP topic TBA"
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Emerging Threats for the Mobile Application",
        "date": "2024-08-28",
        "time": "16:30+07:00",
        "link": "https://www.meetup.com/owasp-jakarta-chapter/events/302680928",
        "timezone": "Asia/Jakarta",
        "description": "Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…\n• Tool dan standar keamanan aplikasi\n• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan\n• Kendali keamanan dan pustaka standar\n• Cabang lokal di seluruh dunia\n• Riset terkini\n• Konferensi lengkap di seluruh dunia\n• Mailing list\n• Dan banyak lagi … di www.owasp.org\n\nKali ini di OWASP Jakarta akan membahas :\n1. Emerging Threats for the Mobile Application\n\nAbstract:\nVulnerability and Threats in the Era of Mobile Applications\n\nMobile app security involves safeguarding applications on mobile devices, such as smartphones and tablets, from a variety of security threats. As mobile apps become increasingly vital to both personal and business activities, ensuring their security is essential to protect sensitive data, maintain user privacy, and build trust. With the rapid growth of mobile usage, attackers are constantly finding new ways to exploit vulnerabilities in mobile applications.\nIn this session, we will delve into some of the most common and emerging methods used to attack mobile applications, including:\n• Repackaging apps: Modifying legitimate apps to include malicious code and redistributing them.\n• Hooking frameworks: Using tools to intercept and manipulate app behavior for malicious purposes.\n• Mobile bots: Leveraging automated scripts to perform various malicious activities such as credential stuffing and spamming.\n• Man-in-the-Middle (MitM) attacks: Intercepting communication between the app and the server to steal data or inject malicious content.\nBy understanding these threats and learning about best practices for mobile app security, you can better protect your applications and users from potential attacks.\nJoin us for this interactive session to gain valuable insights and practical knowledge on securing mobile apps effectively!\n\nSpeaker : Shahnawaz Backer / Senior Solutions Architect, Asia Pacific, China and Japan\n\nShort Bio :\nShahn Backer is an ever inquisitive cyber security professional, who is intrigued by modern applications and its challenges. He has a keen interest in modern application security, digital identity, multi-cloud security and edge compute. He is currently a Senior Solutions Architects and focusses on application agility and security .\n\nHe frequently writes on IT security at f5labs.com and has co-authored a Redbook on access management deployment patterns. His works pivots on boosting security with visibility, intelligence, and automation. Shahn has designed identity systems for major financial institutions and government bodies and has released a gamified learning platform for Application Programming Interfaces security.\n\nLinkedin : https://www.linkedin.com/in/backers\n\nTopic:\nsupported by appsec.co.id also f5 networks indonesia\n\nregister via zoom :\nhttps://f5networks.zoom.us/webinar/register/WN_A46TytnARaSxJTdWRWk6Qg#/registration"
    },
    {
        "group": "Joao Pessoa",
        "repo": "www-chapter-joao-pessoa",
        "name": "A Arquitetura e a Engenharia da Modelagem de Ameaças segundo a OWASP",
        "date": "2024-08-28",
        "time": "19:00-03:00",
        "link": "https://www.meetup.com/owasp-joao-pessoa-chapter/events/302891134",
        "timezone": "America/Fortaleza",
        "description": "**MEETUP PRESENCIAL**\nA Arquitetura e a Engenharia de Softwares possuem grande participação no desenvolvimento dos projetos e é de suma importância que o Arquiteto e o Engenheiro de Softwares saibam definir e Modelar as Ameaças para o seu projeto na visão de um AppSec, através dos Controles Proativos da OWASP. Venha entender melhor como funciona este processo."
    },
    {
        "group": "Los Angeles",
        "repo": "www-chapter-los-angeles",
        "name": "OWASP LA Monthly In-Person Meeting - AUG 28, 2024",
        "date": "2024-08-28",
        "time": "17:30-07:00",
        "link": "https://www.meetup.com/owasp-los-angeles/events/300687355",
        "timezone": "America/Los_Angeles",
        "description": "**TOPIC**: Integrating Security Best Practices with Shift-Left and Shift-Right in Agile SDLC\nJoin us for great networking, dinner and drinks, and see a presentation by **Liliya Frye**, Director of QA Engineering\n\n**ABSTRACT**: Comprehensive overview of continuous integration and continuous web application security testing with utilization of Shift-Left and Shift-Right methodologies within Agile SDLC. What are the best DAST/IAST/SAST tools? Explore practical strategies, automated testing and penetration testing within CI/CD pipelines to maintain robust security and quality from inception to deployment. Discover how to address common challenges, mitigate security risks, enhancing both product quality and operational efficiency. Elevate your security measures and ensure continuous quality in software development life cycle.\n\n**Thanks to our Sponsor**: *[Checkmarx](https://checkmarx.com/)*\n*Checkmarx's* mission is to provide the technology, expertise, and intelligence that enable developers and enterprises to secure the world’s applications. We help companies deliver secure software faster, making the world safer for all of us. *Checkmarx is the enterprise application security leader, helping security and development teams build DevSecTrust by securing every phase of development with our cloud-native platform. We proudly serve 1,800 customers, including 60% of Fortune 100.*\n\n**CODE OF CONDUCT**\nWe hope you enjoy the event, we care deeply about inclusivity and diversity so that OWASP is a comfortable and welcoming community for everyone. Please reach out to one of our chapter leaders if you have any feedback/concerns or would like to speak to us, we take these matters very seriously. You can find out more about our policies here:\n[https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy](https://owasp.org/www-policy/operational/conferences-events.html#conference-and-event-anti-harassment-policy)\n\n**SPONSORSHIP Opportunities Available**\n*Vendors interested in sponsoring please send an email to sponsorship.la@owasp.org*"
    },
    {
        "group": "Melbourne",
        "repo": "www-chapter-melbourne",
        "name": "OWASP Melbourne - August 2024 Meetup",
        "date": "2024-08-28",
        "time": "18:00+10:00",
        "link": "https://www.meetup.com/application-security-owasp-melbourne/events/302627913",
        "timezone": "Australia/Melbourne",
        "description": "G'day all,\n\nIt was great to see new faces last month. Thank you to those that attended.\n\nIn our last meetup, attendees voted for [Spicy Korea](https://g.co/kgs/FnXwKAr) as our location this month. On 28th August 2024 6PM, there we shall meet.\n\n*There's NO BOOKING. If you're the first to arrive, please grab a table for the group and post a picture of the table's location in the comments of this meetup event. We'll use it to locate each other. (If you don't see a post, you're lucky first. Please grab us a table and post a pic. )*\n\n**Please remember to update your RSVP if you can no longer attend.** Even if it's just 30 minutes prior. It'll help whomever that arrives first know how big a table to get.\n\nWe're looking forward to the discussions we had once again.\n\nSee you there.\n\nMore details on the format, and what to expect below:\n\n**The Practitioner's Roundtable**\nIt's a monthly meetup, for AppSec/ProdSec practitioners to participate discussing AppSec/ProdSec topics and share knowledge. There's no speakers, or sponsors; just a facilitator, with the expectation that you'll join the conversations. Broadly, the idea is that you're swinging by after work, for a regular catch-up with our peers over dinner (with F&B at your own cost) with a known format.\n\\-\\-\\-\n**So, what's happening?**\nThe format:\n\n1. At 6pm all attendees arrive, and order (and pay for) their own meals - we'll do the rest while waiting for the meals to arrive and as we eat.\n2. All attendees write down on a card 1-2 AppSec/ProdSec related topics they'd like to discuss.\n3. We'll all each cast 3 votes on the cards we'd like to discuss.\n4. We'll sort the cards, and discuss the topics with the top 3-4 highest votes. Starting with the topic with the highest votes.\n5. After 5(?) minutes, we all decide if we'd like to continue or move on to the next topic.\n6. If we continue, after 15(?) minutes, we all move on to the next topic of discussion.\n7. At 7pm, we wrap up and officially end. Before everyone leaves, we vote on the next restaurant that we'll meet at.\n\nThis is[ inspired by Lean Coffee](https://agilecoffee.com/leancoffee/), and intended for participants to be collaborators in the conversation focused on AppSec & ProdSec topics.\nFor the location selection, here are the considerations we work with:\n\n1. It must be within 1 \"city block\" of the Melbourne Free Tram Zone.\n2. The typical price for a whole meal (without alcohol) should be under $50 per person.\n3. It must allow individual orders - you'd be ordering and paying for your own meal.\n4. It will need to have seating space for the group to say, just walk-in to the restaurant ( this may change if it grows beyond 10 regular attendees ).\n5. It must be quiet enough for us to have meaningful conversations.\n6. It must not be a restaurant we've been to in the past 6 months. (Just to keep things fresh )\n\nAlso, although we use the word “restaurant” this is used broadly to mean food establishment - if we’re all keen on hitting up a decent kebab place, that works. As a courtesy to the venue, there's an expectation that you'd order something there.\n\nSee you there.\nThank you."
    },
    {
        "group": "Minneapolis St Paul",
        "repo": "www-chapter-minneapolis-st-paul",
        "name": "Sept. meetup: A Zero Trust Journey for Data Security and Enterprise AI",
        "date": "2024-09-12",
        "time": "18:00-05:00",
        "link": "https://www.meetup.com/owasp-msp-meetup/events/302905456",
        "timezone": "America/Chicago",
        "description": "**A Zero Trust Journey for Data Security and Enterprise AI**\n**Wes Kennedy, Lightbeam**\n\nAbstract: As organizations deal with the proliferation of sensitive data, they must be cognizant of the type, classification, and location of sensitive data within their environments, and remediate risks of data exposure in near-real time. In this session, we will review a comprehensive approach to strengthening enterprise data protection posture encompassing security, privacy, and governance. Proactive discovery, classification, access controls, and life-cycle management is the critical first step toward your zero-trust journey.\n\nAudience level: Intermediate (no AI knowledge needed)\n\nApproximate agenda (U.S. Central Time):\n5:30 - Doors open; socializing/connecting, food, OWASP announcements\n6:00 - Presentation\n\nPlease remember to register and keep your registration up-to-date so we know how many to expect."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand - Auckland Meetup",
        "date": "2024-09-17",
        "time": "18:30+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/297786503",
        "timezone": "Pacific/Auckland",
        "description": "We're picking up our regular Meetup schedule in 2024, starting in March.\n\nOur approximate agenda for the evening:\n\n* 6:00 p.m. - Gather and networking\n* 6:30 p.m. - Introductions, Top 10 Topic\n* 7:15 p.m. - Pizza and more networking\n* 7:45 p.m. - Technical Topic\n\nWe restarted our introductory coverage of the OWASP Top 10 (2021 edition) with A01:2021 in March, covering a new item each meeting.\n\nOur Top 10 topic for September will be **A04:2021 - Insecure Design**.\n\n**Technical Topic Speaker:** TBC\n**Talk Title:** TBC\n\nWe're always looking for presenters and topics for future meetings - contact John (john.dileo@owasp.org) if you have an idea for a topic, or a presentation you'd like to make. That way, it won't always be John talking about what he's been working on recently.\n\nThe Auckland-area OWASP Meetup usually takes place on the third Tuesdays of March, May, July, September, and November. There is no Meetup in January, as our members enjoy their holidays."
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "OWASP New Zealand Day - 2024",
        "date": "2024-09-05",
        "time": "08:00+12:00",
        "link": "https://www.meetup.com/owasp-new-zealand-chapter-auckland/events/300323362",
        "timezone": "Pacific/Auckland",
        "description": "We are proud to present the 14th OWASP New Zealand Day conference, to be held at the Auckland University of Technology (AUT) City Campus on Thursday and Friday, September 5th and 6th, 2024. OWASP New Zealand Day is a two-day conference dedicated to web and application security, with an emphasis on secure architecture and development techniques to help Kiwi developers build more secure applications. The conference is presented by the [OWASP New Zealand Chapter](https://owasp.org/www-chapter-new-zealand/) and organised by [AppSec New Zealand Incorporated](https://appsec.org.nz/).\n\nThere will be two presentation streams throughout the conference. The first stream will include introductory talks on application and information security topics, as well as on policy, compliance, and risk management. The second stream will primarily address deeper technical topics. Talks featuring OWASP projects and tools are particularly encouraged, as are talks by members of under-represented communities.\n\nIn addition to these principal streams, there will be a third, smaller “stream,” supporting sponsor presentations, demos of OWASP tools, and interest/user group meetings. Diamond, Platinum, and Gold Sponsors will be given priority for time slots in this “stream.” Further details will be published closer to the date, regarding opportunities for other groups to present.\n\nWho is the Conference for?\n\n* Web Developers\n* Security Professionals and Enthusiasts\n* Program and Project Managers\n* Business Analysts\n* Requirements Analysts\n* Software Testers\n\n## Conference Live Stream\n\nAll three streams of the conference (Track 1, Track 2, and the Sponsor Demos) will be live streamed on the day. Access information for the conference live-stream will be provided to registered delegates, as details are finalised.\n\n## Conference Structure\n\n**Date:** Thursday and Friday, 5-6 September 2024\n**Time:** 9:15 a.m. - 5:00 p.m., Thursday; 10:00 a.m. - 5:00 p.m., Friday\nThe main conference on Thursday and Friday will have two streams throughout both days:\n**Stream One:**\n\n* Introductory Topics\n* Program Management, Policy, Compliance, Risk Management\n\n**Stream Two:**\n\n* Technical Topics\n\nThroughout the conference, an exhibition area will be open in the main atrium. Representatives from many of our Premier Sponsors will be on hand throughout the event, to answer your questions about their products and services, or to discuss employment opportunities they may have available. There will be door prize drawings at the Closing Session on Friday. To qualify for the drawings, you will need to visit with each exhibiting sponsor during the conference, and have them stamp your entry card.\n\n## Registration\n\nRegistration is now open on Humanitix: [https://events.humanitix.com/owaspnz2024](https://events.humanitix.com/owaspnz2024)\n\nEarly registration (on or before 15 August):\n\n* $30, standard registration\n* **FREE**, for students and unwaged attendees\n* From 16 August, a late registration surcharge applies to all registrations ($20 Regular, $15 Student/Unwaged)"
    },
    {
        "group": "Peterborough",
        "repo": "www-chapter-peterborough",
        "name": "Monthly Networking Social",
        "date": "2024-08-29",
        "time": "19:00+01:00",
        "link": "https://www.meetup.com/owasp-peterborough/events/302438652",
        "timezone": "Europe/London",
        "description": "Thirsty Thursdays.\n\nSame time. Same day each month. Differing places. Good chat.\n\n**What?**\n\n* Casual conversation over food & drinks\n\n**Where?**\n\n* It may differ each month, bars, restaurant and eateries around Peterborough\n\n**When?**\n\n* \\~ The last Thursday of each month\n\nEverybody welcome, the next event details will be chosen from the last (and so on!)."
    },
    {
        "group": "Phoenix",
        "repo": "www-chapter-phoenix",
        "name": "September 2024 Meeting",
        "date": "2024-09-03",
        "time": "20:30-07:00",
        "link": "https://www.meetup.com/owasp-phoenix-chapter/events/302887706",
        "timezone": "America/Phoenix",
        "description": "**seL4 - The Ultimate Secure Microkernel** (30 min)\nThis is a presentation on the seL4 microkernel, which is used in projects that absolutely require the most robust security at its core, as a monolithic kernel like Linux is not the right choice in these situations. Join us as we briefly touch on microkernels, the history of the L4 family of microkernels, and why seL4 stands out from the rest."
    },
    {
        "group": "Rewa",
        "repo": "www-chapter-rewa",
        "name": "Introduction to Cyber and Web Security",
        "date": "2024-09-08",
        "time": "18:00+05:30",
        "link": "https://www.meetup.com/owasp-rewa-chapter/events/303020985",
        "timezone": "Asia/Kolkata",
        "description": "In today's digital age, where our lives are increasingly online, understanding the basics of cyber and web security is more important than ever. This session will provide you with an essential overview of the core principles and practices that safeguard our digital world. From common vulnerabilities to best practices in protecting web applications, we will explore the fundamental concepts that every developer, security enthusiast, and tech professional should know.\n\nJoin us as we delve into the world of cyber and web security, equipping you with the knowledge to navigate and protect the digital landscape confidently."
    },
    {
        "group": "Seattle",
        "repo": "www-chapter-seattle",
        "name": "Security Social Lunch Hours",
        "date": "2024-09-11",
        "time": "12:00-07:00",
        "link": "https://www.meetup.com/owasp-seattle-chapter/events/300539098",
        "timezone": "America/Los_Angeles",
        "description": "At noon on the 2nd Wednesday of every month we host a social meeting on Zoom with mini talks and breakout rooms. The main room will always be open for social time but we plan to have 1-2 topic breakouts you can join. If the breakout session topic interests you, join that discussion. Feeling more like a casual chat and exploring other topics? Visit the main room to strike up a conversation.\n\nSuggest topics you’d like to see breakout rooms for and let us know if you’d like to sign up to lead one.\n\nSlack @ #chapter-seattle (https://bit.ly/owasp-seattle-slack)\n\nseattle-chapter@owasp.org (https://groups.google.com/a/owasp.org/g/seattle-chapter)"
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "September 2024 SFOWASP Monthly Meeting - Joint Meeting with SFISSA",
        "date": "2024-09-19",
        "time": "18:00-04:00",
        "link": "https://www.meetup.com/south-florida-owasp-chapter/events/302943630",
        "timezone": "America/New_York",
        "description": "Each September, the OWASP South Florida Chapter (SFOWASP) and South Florida ISSA (SFISSA) come together for a joint meeting. This year, please join us on **September 19, 2024**, at **Palm Beach State College**, **4200 S Congress Ave, Lake Worth, FL**. The meeting will take place in **Room CE119** in the CE building.\n\n**Location: Palm Beach State College - CE building, room 119**\n\n**Agenda**:\n\n* Chapter updates/announcements, upcoming events - SFISSA\n* Chapter updates/announcement, upcoming events - SFOWASP\n* Talk1 - TBA\n* Talk2 - TBA\n* Networking\n\nWe will update this notice for speaker(s) and topic(s)."
    },
    {
        "group": "Stuttgart",
        "repo": "www-chapter-stuttgart",
        "name": "2nd OWASP Stuttgart Chapter Stammtisch",
        "date": "2024-09-17",
        "time": "18:00+02:00",
        "link": "https://www.meetup.com/owasp-stuttgart-chapter/events/301313714",
        "timezone": "Europe/Berlin",
        "description": "**An Introduction to OWASP SAMM (Software Assurance Maturity Model)**\n\nSAMM is an open framework that helps organizations assess, build, and improve their software security practices. It provides a structured model to guide organizations in integrating security into their SDLC, addressing Vulnerabilities, and promoting a culture of software assurance. SAMM offers a maturity model that enables organizations to measure their software security maturity and identify areas for improvement.\n\n**Speaker**:\n**Agenda (Subject to Change):**\n\n* **6:00 PM**: Arrival\n* **6:30 PM - 7:30 PM**: Presentation\n* **7:30 PM - approximately 9:00 PM**: Barbecue, drinks, discussion, and networking"
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "OWASP Vancouver Monthly Meetup",
        "date": "2024-09-19",
        "time": "18:00-07:00",
        "link": "https://www.meetup.com/owasp-vancouver-chapter/events/298516377",
        "timezone": "America/Vancouver",
        "description": "TBD"
    },
    {
        "group": "Samm",
        "repo": "www-project-samm",
        "name": "September community call - OWASP SAMM",
        "date": "2024-09-11",
        "time": "15:30-04:00",
        "link": "https://www.meetup.com/owasp-samm/events/302806897",
        "timezone": "America/New_York",
        "description": "During our next community call we will cover:\n\n1. Welcome new community members\n2. SAMM project updates\n3. Q&A"
    }
]