[
    {
        "group": "Las Vegas",
        "repo": "www-chapter-las-vegas",
        "name": "Let's Catch Up! Current Updates, Trends, Certifications and Open Discussions",
        "date": "2021-05-12",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/277473163/",
        "timezone": "US/Pacific",
        "description": "<p>Welcome Notes from the Chapter Leaders to talk about OWASP udpates, current trends and education/certification tips with Q&amp;A Sessions open for anything under the sun.</p> <p>Everyone is welcome, looking forward to meeting you all.</p> "
    },
    {
        "group": "Ottawa",
        "repo": "www-chapter-ottawa",
        "name": "OWASP Ottawa: Using OWASP Nettacker/5 Shifts to Eliminate Burnout",
        "date": "2021-05-19",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Ottawa/events/277611103/",
        "timezone": "Canada/Eastern",
        "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=jUYig72O37M\" class=\"embedded\">https://www.youtube.com/watch?v=jUYig72O37M</a></p> <p>7:00 PM EDT Technical Talks</p> <p>1. Announcements</p> <p>2. Using OWASP Nettacker For Recon and Vulnerability Scanning</p> <p>Abstract:<br/>This talk is about the OWASP Nettacker Project, one of OWASP's \"Unsung Hero\" projects. Nettacker is a little-known yet awesome and powerful 'swiss-army-knife' type tool for information gathering and vulnerability scanning fully written in Python. Featuring live demo and practical usage examples</p> <p>Bio:<br/>Sam Stepanyan is an OWASP London Chapter Leader and an Independent Application Security Consultant with over 20 years of experience in the IT industry with a background in software engineering and web application development. Sam has worked for various financial services institutions in the City of London specialising in Application Security consulting, Secure Software Development Lifecycle (SDLC), developer training, source code reviews and vulnerability management. He is also a Subject Matter Expert in Web Application Firewalls (WAF) and SIEM systems. Sam holds a Master’s degree in Software Engineering and a CISSP certification.</p> <p>3. 5 Shifts to Eliminate Burnout, Reconnect To Your Purpose, &amp; Jump Out Of Bed Feeling Excited Again</p> <p>Abstract:<br/>Most IT professionals seem to believe that burning out and being exhausted all the time is normal. Most of them bust their butts working 60+ hour weeks. They have no social lives. They're constantly exhausted. They roll around at night unable to sleep. And worse, every time they wake up there's always some fire they have to put out.</p> <p>It doesn't have to be that way.</p> <p>This session shows you the strategy that allows you to absolutely eliminate burnout, kick stress to the curb, reconnect to your purpose, and actually enjoy your work again.</p> <p>Bio:<br/>Edwin Sarmientois the Managing Director of 15C, a consulting and training company that specializes in designing, implementing and supporting SQL Server infrastructures. He is a 12-year former Microsoft Data Platform MVP and Microsoft Certified Master from Ottawa, Canada (but he’s originally from the Philippines) specializing in high availability, disaster recovery and system infrastructures running on the Microsoft server technology stack. His background in Unix has taken him to the world of DevOps and Docker to containerize SQL Server. He is very passionate about technology but has interests in music, neuroscience, social psychology, professional and organizational development, leadership and management matters when not working with databases.</p> <p>Edwin lives up to his primary mission statement: \"To help people and organizations grow and develop their full potential.\"</p> "
    },
    {
        "group": "Vancouver",
        "repo": "www-chapter-vancouver",
        "name": "Automate Security Testing *and* Security for Microservices",
        "date": "2021-05-20",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Vancouver-Chapter/events/277598475/",
        "timezone": "Canada/Pacific",
        "description": "<p>This is a double header edition of the OWASP Vancouer meet-up series, with intermission and opportunity to socialize and network!</p> <p>----------------------------------------------------------------------------------------</p> <p>How to Build Awesome Security Instrumentation to Automate AppSec Testing and Protection (6:00-7:00pm)<br/>By: Jeff Williams</p> <p>Modern software demands velocity, and traditional “outside in” scanning and firewalling are creating bottlenecks and slowing things down. In this talk, Jeff will approach application security from the “inside out”. We will show you how to create simple agents that get inside a running application (like a profiler or debugger) and give you access to everything you might want to know. We’ll demonstrate real agents that identify vulnerabilities without changing any code, scanning, or extra steps. We’ll identify vulnerabilities, analyze access control, and even prevent RCE attacks. Unlike scanning and firewalling, this approach establishes a safe and powerful way for development, security, and operations teams to collaborate. We’ll discuss how software security instrumentation works, how it’s being used in many organizations, and the implications for the practice of application security.</p> <p>Bio: Jeff brings more than 20 years of security leadership experience as co-founder and Chief Technology Officer of Contrast Security. He recently authored the DZone DevSecOps, IAST, and RASP refcards and speaks frequently at conferences including JavaOne (Java Rockstar), BlackHat, QCon, RSA, OWASP, Velocity, and PivotalOne. Jeff is also a founder and major contributor to OWASP, where he served as Global Chairman for 9 years, and created the OWASP Top 10, OWASPEnterprise Security API, OWASP Application Security Verification Standard, XSS Prevention Cheat Sheet, and many more popular open source projects. Jeff has a BA from Virginia, an MA from George Mason, and a JD from Georgetown. <a href=\"https://www.linkedin.com/in/planetlevel/\" class=\"linkified\">https://www.linkedin.com/in/planetlevel/</a></p> <p>----------------------------------------------------------------------------------------</p> <p>Microservices - Applying Security Pragmatically (7:00-8:00pm)<br/>By: Bipin Kalawade</p> <p>The Federal Trade Commission (FTC) estimates that as many as 9 million Americans have had their identities stolen each year.</p> <p>Modern world wide web applications are rushing to dismantle the monolithic architecture by adopting microservices. Most of the times these applications apply single security solution that they think can fit across the organizations.</p> <p>The aim of this presentation is to talk about different API security patterns that applications can think based on the data they are protecting and applying security solution pragmatically<br/>as one security solution cannot and should not fit for all the needs.<br/>The presentation will also cover different types of security tokens that applications can apply with the real-life scenarios and finally concluding that there is no single solution is better vs another.</p> <p>Learning Objectives:<br/>• Discuss monolithic applications vs microservices and its pros and cons.<br/>• Different types of tokens, SAML vs JWT vs OAuth2.<br/>• Role of Identity Provider and Service Provider.</p> "
    },
    {
        "group": "Rio De Janeiro",
        "repo": "www-chapter-rio-de-janeiro",
        "name": "OWASP Chapter RJ - 1º Biweekly Meeting",
        "date": "2021-04-28",
        "time": "19:30",
        "link": "https://www.meetup.com/owasp-rio-de-janeiro/events/277626321/",
        "timezone": "America/Sao_Paulo",
        "description": "<p>Esse é o primeiro encontro do capítulo no RJ da OWASP em 2021. Veja nossa agenda a seguir:</p> <p>1. Warm-up (10min)<br/>2. Introdução sobre a OWASP e alguns projetos<br/>- O que é o Chapter do Rio de Janeiro<br/>- Nosso planejamento para os próximos encontros<br/>3. OWASP Latam@Home (30min)<br/>4. Agenda de eventos no BR (5 min)</p> <p>Confira mais sobre o capítulo em <a href=\"https://owasp.org/www-chapter-rio-de-janeiro/\" class=\"linkified\">https://owasp.org/www-chapter-rio-de-janeiro/</a>.</p> "
    },
    {
        "group": "Singapore",
        "repo": "www-chapter-singapore",
        "name": "JavaScript SAST from Mayhem to Order",
        "date": "2021-04-28",
        "time": "19:30",
        "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/277604330/",
        "timezone": "Asia/Singapore",
        "description": "<p>Software developers were always left with two hard choices, either use security tools that are not built for them, or use free/open-source tools that generate too many false positives and have poor coverage. One of the prime reasons for this dilemma is that traditionally the security workload was managed by application security teams who would find vulnerabilities and filter through false positives. Now with agile development and DevOps workflows, now there is no option for developers to opt out of secure development.</p> <p>New technology called DataLog solves that problem in a fundamentally different way, giving developers new hope. During this presentation we will go over:<br/>- how static code analysis has changed over the years<br/>- how DataLog technology solves some of the inherent problems of static code analysis such as speed, accuracy and coverage<br/>- how concepts like treating code as data, and partial evaluations are changing the game completely<br/>- what developers can do today to get accuracy, speed, and coverage with SAST</p> <p>Speaker Bio<br/>Sherif Koussa is OWASP Ottawa Chapter Co-Leader, Software Developer, Hacker, and founder and CEO of Software Secured (<a href=\"https://www.softwaresecured.com\" class=\"linkified\">https://www.softwaresecured.com</a>) and Reshift (<a href=\"https://www.reshiftsecurity.com\" class=\"linkified\">https://www.reshiftsecurity.com</a>). In addition to contributing to OWASP Ottawa for over 14 years, Sherif contributed to WebGoat, and OWASP Cheat Sheets. Sherif also helped the SANS and GIAC organizations launch their GSSP-Java and GSSP-NET exams and contributed to a few of their courses. After switching from software development to the field of security, Sherif took on the mission of supporting developers shift security left, and ship more secure code organically. Whether through training, penetration testing as a service or coaching development teams through shifting security, Sherif believes that any AppSec without the developer wouldn’t yield the best results. Sherif’s current venture, Reshift Security, is a static code analysis tool that is built for developers with an experience from the IDE, over to the code review and CI phases.</p> "
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Workshop OWASP x BSSN \"Secure Coding Practice With OWASP\"",
        "date": "2021-04-27",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/277659850/",
        "timezone": "Asia/Jakarta",
        "description": "<p>BIMBINGAN TEKNIS KEAMANAN INFORMASI BAGI PENGEMBANG START-UP DIGITAL Pemanfaatan teknologi informasi untuk mendukung proses bisnis telah menjadi tren insiatif strategi organisasi dalam rangka merebut pasar. Fakta tersebut menjadi katalis bertumbuhnya organisasi berbasis teknologi informasi dan meningkat pesatnya start-up lokal yang bersaing mengembangkan aplikasi. Persaingan Aplikasi yang kaya fitur tersebut terkadang meninggalkan celah besar pada sisi keamanan. Dimana pada kenyataannya seringkali dalam proses pengembangan aplikasi dinilai kurang memperhatikan faktor keamanan. Risiko serangan yang mengintai serta kemungkinan kerugian dari insiden siber menjadi ancaman yang nyata jika eksploitasi melalui kerentanan aplikasi tidak diatasi. Penerapan “Secure Coding” pada pengembangan aplikasi menjadi salah satu langkah solutif bagi startup developer dalam upaya meminimalisir risiko ancaman siber yang ditimbulkan oleh kerentanan aplikasi. Oleh karena itu pada kesempatan kali ini, BSSN berkerjasama dengan OWASP Indonesia menyelenggarakan, Bimbingan Teknis Keamanan Informasi bagi Pengembang Startup Digital: Secure Coding Practice with OWASP yang akan dilaksanakan pada:  Hari/tanggal : Selasa, 27 April 2021  Waktu : 12.00 - 17.00 WIB  Tempat : Aloft South Jakarta Hotel, Jl. TB Simatupang No.Kav 8, RT.2/RW.9, Cilandak Tim., Kec. Ps. Minggu, Kota Jakarta Selatan Untuk berpartisipasi dalam kegiatan ini, mohon berikan data anda dan jawab pertanyaan yang kami berikan dengan sebenar-benarnya pada Form Registrasi : <a href=\"https://s.id/RegSCjkt\" class=\"linkified\">https://s.id/RegSCjkt</a> more</p> "
    },
    {
        "group": "Copenhagen",
        "repo": "www-chapter-copenhagen",
        "name": "NemID, Quantum Computers and the Threat to Security of Digital Signatures",
        "date": "2021-04-29",
        "time": "20:00",
        "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/277670961/",
        "timezone": "Europe/Copenhagen",
        "description": "<p>THE TALKS AND YOUR SPEAKERS:</p> <p>POST-QUANTUM DIGITAL SIGNATURES<br/>Sahana Sridhar:<br/><a href=\"https://www.linkedin.com/in/sahsridh/\" class=\"linkified\">https://www.linkedin.com/in/sahsridh/</a><br/>Former IBM Test Specialist and Master of Science from Norwegian University of Science and Technology (NTNU). Sahana will enlighten you on the findings of her master thesis on post-quantum digital signatures based on identification schemes.</p> <p>THE FAILURES OF NEMID AND THE THREAT OF QUANTUM COMPUTERS<br/>Lars Embøll Nielsen:<br/><a href=\"https://www.linkedin.com/in/qkd/\" class=\"linkified\">https://www.linkedin.com/in/qkd/</a></p> <p>Lars will take you on a journey through the failures of NemID, the legal landscape of digital signatures in EU and why Quantum Computers can be a threat to the way we currently keep digital signatures secure.</p> <p>AS ALWAYS....<br/>... you will have the opportunity to ask questions for the participants</p> <p>Note: THIS IS AN ONLINE EVENT! Link to stream will be available prior to the start.</p> <p>Photo: Michael Dziedzic, unsplash.com</p> "
    },
    {
        "group": "South Florida",
        "repo": "www-chapter-south-florida",
        "name": "OWASP South Florida Chapter Meeting April 2021",
        "date": "2021-04-28",
        "time": "18:00",
        "link": "https://www.meetup.com/South-Florida-OWASP-Chapter/events/277079615/",
        "timezone": "US/Eastern",
        "description": "<p>South Florida OWASP (SFOWASP) Monthly Meeting - April 28, 2021</p> <p>NOTE: This will be hosted virtually due to ongoing COVID-19 public health concerns.</p> <p>Agenda<br/>===========================<br/>+SFOWASP Chapter updates/announcements, etc.</p> <p>+Talk: Beyond SAMM - Raising the AppSec Bar (Kristen Bell, GuidePoint Security)</p> <p>+Virtual Networking<br/>===========================</p> <p>***Talk***<br/>Speaker: Kristen Bell, Application Security Engineering Senior Manager at GuidePoint Security</p> <p>Title: Beyond SAMM - Raising the AppSec Bar</p> <p>Abstract: This talk is geared towards the \"secret sauce\" and how to accomplish effectively and successfully all of the todos within the Software Assurance Maturity Model (SAMM). If you look at OWASP’s SAMM as the ingredients, this talk dives into the actual recipe. The focus is to bridge the gap between AppSec and Development by creating a cultural shift where the role of AppSec is teacher/mentor versus auditor. There will also be a focus on how to maintain the momentum of AppSec Program maturity over time through some tried and true tips &amp; tricks.</p> <p>Speaker's Bio: Kristen is a Senior Manager, Application Security Engineering at GuidePoint Security, who has worked in Application Security for 16+ years. Prior to joining GuidePoint, Kristen consulted for numerous companies performing application security services. Kristen has a background in web applications security pen tests &amp; assessments, conducting database security reviews, building application security programs, providing guidance in secure application design, as well as working with clients to improve their enterprise vulnerability management. Kristen’s ability to bridge the gap between technical and non-technical people, coupled with her strong interpersonal skills, has made her a strong champion for application security frameworks &amp; controls for her customers. For additional details or to connect, you can visit Kristen’s LinkedIn page at www.linkedin.com/in/klsullivan.</p> <p>***Networking Session***<br/>Open to attendees to discuss any topical issue: jobs, remote work, etc.</p> "
    },
    {
        "group": "Northern Virginia",
        "repo": "www-chapter-northern-virginia",
        "name": "Scale Your Security by Embracing Secure Defaults & Eliminating Bug Classes",
        "date": "2021-04-22",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/277448649/",
        "timezone": "US/Eastern",
        "description": "<p>Abstract:<br/>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time. Historically, as an industry, we’ve focused on building tools to identify vulnerabilities. While we’ve built impressive tools, these approaches have failed to address the challenges of modern engineering teams. Specifically, these tools often are too slow, require a prohibitive amount of security engineer time and domain expertise to tune, overwhelm users with false positives, and most importantly, do not ultimately raise a company’s security bar. But there’s another way. Rather than investing in finding more bugs, some modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks that enforce invariants (properties that must always hold), organizations can solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole. In this talk, we’ll present a practical step-by-step methodology for:</p> <p>- Choosing what to focus your AppSec resources on<br/>- How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes<br/>- How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers<br/>- How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>Bio:<br/>Grayson Hardaway is a security researcher at r2c, a startup working on static analysis tools purpose-built for the modern workflow. At r2c, Grayson authors static analysis tailored for finding security vulnerabilities in open source code. Previously, Grayson worked for the US Department of Defense fuzzing and exploiting obscure protocols. When not submitting patches, Grayson is hefting a heavy pack uphill, crafting guitar solos, or learning something new: currently woodworking</p> "
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - April 2021",
        "date": "2021-04-27",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/277504710/",
        "timezone": "US/Central",
        "description": "<p>Chapter information and a presentation --</p> <p>Biometrics and Privacy</p> <p>The business use of biometric identification technology is becoming more prevalent and with it's growing adoption, there is a growing number of state regulations concerning its use and related privacy and data handling issues. This talk will cover how biometric identification works in general and review the various state regulations and guidelines concerning how this unique form of personally identifiable information should be handled and stored.</p> <p>Speaker:<br/>Mary Haskett is the CEO and co-founder of Blink Identity, a venture-backed startup developing a unique privacy-preserving face recognition product that can identify people at a full walking speed and in any lighting conditions. She got her start running a skydiving school and went on to start multiple companies which she grew to profitability without outside funding. She is a beekeeper, Techstars alumni and privacy advocate.</p> "
    },
    {
        "group": "Cleveland",
        "repo": "www-chapter-cleveland",
        "name": "OWASP 2021 with Cleveland Chapter - April Meeting",
        "date": "2021-04-30",
        "time": "18:30",
        "link": "https://www.meetup.com/owasp-cleveland-group/events/277616611/",
        "timezone": "US/Eastern",
        "description": "<p>The OWASP Cleveland Chapter is excited to announce that our next meeting will be held on Friday, April 30, 2021 at 6:30pm EST. Please join us as we review best practices and challenges faced by Cybersecurity professionals; the importance of mentorship, training, and certifications within the community; honeypot planning and considerations for architecture, threat modeling, analysis, and honeypot post-ir outcomes for SMB through enterprise, and much more.</p> <p>The link to attend will be added soon.</p> "
    },
    {
        "group": "Columbus",
        "repo": "www-chapter-columbus",
        "name": "Health: The Most Important Tech Tool",
        "date": "2021-04-22",
        "time": "12:00",
        "link": "https://www.meetup.com/Columbus-OWASP/events/277444023/",
        "timezone": "US/Eastern",
        "description": "<p>Hi everyone! We will start out with news and notes (virtually) and then talk about health and IT.</p> <p>Working in the tech industry often involves spending long hours sitting down, staring at a screen, consuming copious amounts of pizza and caffeine. The work is mentally demanding and can be stressful. In the rush to get everything done, it can be easy to neglect our health. But a healthy body and mind are necessary for effective performance. Based on HR training, research, and personal experience, this session provides realistic suggestions for managing your well-being at work. It covers the connection between physical and mental health, as well as how to discuss these topics with your employer. You’ll leave with a better idea of how to take care of yourself and be a happier, healthier, and more productive person.</p> <p>Bio:<br/>Cassandra Faris is passionate about the human side of technology. She is the Tech Community Manager for the Rocket Technology division of Quicken Loans. Her career has focused on supporting tech professionals through training, community outreach, open source initiatives, marketing, hiring, mentoring, and employee engagement. She is an international speaker who specializes in teaching people how to communicate, be more effective team members, and advance their careers. She is President of the Stir Scholarship for women pursuing technology degrees and President Emeritus of the DogFoodCon tech conference. She has an MBA in Organizational Leadership. When she's not busy with the tech community, she is an avid tabletop gamer, corgi lover, and soccer fan who travels as much as possible.</p> "
    },
    {
        "group": "Dallas",
        "repo": "www-chapter-dallas",
        "name": "OWASP Dallas April Meeting",
        "date": "2021-04-27",
        "time": "12:00",
        "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/276115384/",
        "timezone": "US/Central",
        "description": "<p>Title:</p> <p>OWASP API Security Top 10 - New List, New Threats</p> <p>Description:</p> <p>APIs are constantly changing and have access to an organization’s most sensitive data, and APIs now represent &gt;80% of web traffic. This reality is attracting attackers that are finding new ways of getting what they’re looking for in custom-made APIs. As a response, OWASP has created a new Top 10 specific to API risks and this presentation will explain and discuss each item.</p> <p>Bio:</p> <p>Ran Barth is a Principal Security Engineer at Salt Security. He has a passion for web application security, and he has spent his career deploying enterprise security solutions. Ran currently resides in Plano, TX and is originally from Israel. You can contact him at ranb@salt.security.</p> "
    },
    {
        "group": "Delaware",
        "repo": "www-chapter-delaware",
        "name": "CMD+CTRL Bootcamp - 30-day training event with live cyber range event (CTF)",
        "date": "2021-04-29",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Delaware-Chapter/events/277535142/",
        "timezone": "US/Eastern",
        "description": "<p>Join OWASP Delaware for the April CMD+CTRL Bootcamp - a 30-day training experience (from April 29 to May 30, 2021) that combines over 25 online training courses coupled with an instructor-led live CMD+CTRL Cyber Range event (a.k.a. CTF - capture the flag).</p> <p>This is Security Innovation's (@SecInnovation) newest commercial offering (<a href=\"https://www.securityinnovation.com/training/cmdctrl-bootcamp-solution/\" class=\"linkified\">https://www.securityinnovation.com/training/cmdctrl-bootcamp-solution/</a>) and they are offering OWASP Delaware complimentary seats.</p> <p>(The only thing better than cyber is free cyber. #free #w00t)</p> <p>It promises to be an effective way to close your security training gaps within a month.</p> <p>By registering, you'll gain access to a handpicked group of courses aimed a boosting security postures quickly. They include:</p> <p>Fundamentals of Secure Cloud Development<br/>Fundamentals of Application Security<br/>Fundamentals of Database Security<br/>Creating Secure Code – Web API Foundations<br/>Software Operations and Maintenance<br/>Performing Vulnerability Scans<br/>...and more</p> <p>RSVP here at Meetup to receive the registration URL, then use that link to register directly with Security Innovation.</p> <p>The event starts on Thursday, April 29th, at noon (EDT), with a live event. The remaining event will be self-paced. As an OWASP chapter we will meet periodically over the 30-days to encourage &amp; help each other.</p> <p>PS: Although this event is free, it is not without cost. It will cost you time and effort. Be prepare to \"do the work\".</p> <p>Free bootcamp motivation video: <a href=\"https://youtu.be/ZXsQAXx_ao0\" class=\"embedded\">https://youtu.be/ZXsQAXx_ao0</a></p> "
    },
    {
        "group": "Kansas City",
        "repo": "www-chapter-kansas-city",
        "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting",
        "date": "2021-04-26",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccgbjc/",
        "timezone": "US/Central",
        "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "
    },
    {
        "group": "Nashville",
        "repo": "www-chapter-nashville",
        "name": "Secure Coding Tournament with Secure Code Warrior",
        "date": "2021-05-04",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Nashville-Chapter/events/277409499/",
        "timezone": "US/Central",
        "description": "<p>Secure Code Warrior brings you a defensive security-based tournament from a developer's perspective. The tournament allows you to test your skill against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability. You don’t need programming knowledge as this will be a great way to learn the foundations and intermediates of leveraging code that is not only functional but is also secure. With a variety of languages to play with: C# .NET MVC, C# .NET WebForms, C# .NET Core, GO Basic, Java EE (JSP) &amp; (JSF), Java Spring, JavaScript Node.JS (Express), Python Django, and last but not least, Pseudocode Basic for the non-coders.</p> <p>You can find tournament step-by-step guide here: <a href=\"https://www.youtube.com/watch?v=TwbySIg2z2Y\" class=\"embedded\">https://www.youtube.com/watch?v=TwbySIg2z2Y</a></p> <p>The tournament is run virtually so you can join through your laptop from the most convenient location and time. It should take only a few hours, drop-in as you see fit during the duration of the event to complete all the challenges and win prizes!</p> <p>Instructions for playing:</p> <p>1) Register for the Secure Code Warrior platform here: <a href=\"https://discover.securecodewarrior.com/OWASPNashville.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPNashville.html</a><br/>2) Check your email for the confirmation and access the unique link to create your profile.<br/>3) Once logged in: click \"Tournaments\"<br/>4) Join the OWASP Nashville Secure Coding Tournament</p> <p>The Secure Code Warrior platform will be open before and after the tournament, so feel free to practice in the \"Training\" tab.</p> <p>Monitor the live leaderboard to see how you're performing!</p> <p>If you have any questions, please let us know!</p> "
    },
    {
        "group": "New York City",
        "repo": "www-chapter-new-york-city",
        "name": "Using OWASP Nettacker For Recon and Vulnerability Scanning",
        "date": "2021-05-06",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/277408962/",
        "timezone": "US/Eastern",
        "description": "<p>Abstract:<br/>This talk is about the OWASP Nettacker Project (<a href=\"https://owasp.org/www-project-nettacker/\" class=\"linkified\">https://owasp.org/www-project-nettacker/</a>), one of OWASP's \"Unsung Hero\" projects. Nettacker is a little-known yet awesome and powerful 'swiss-army-knife' type tool for information gathering and vulnerability scanning fully written in Python. Featuring live demo and practical usage examples.</p> <p>Speaker Bio:<br/>Sam Stepanyan (@securestep9) is an OWASP London Chapter Leader and an Independent Application Security Consultant with over 20 years of experience in the IT industry with a background in software engineering and web application development. Sam has worked for various financial services institutions in the City of London specialising in Application Security consulting, Secure Software Development Lifecycle (SDLC), developer training, source code reviews and vulnerability management. He is also a Subject Matter Expert in Web Application Firewalls (WAF) and SIEM systems. Sam holds a Master’s degree in Software Engineering and a CISSP certification.</p> "
    },
    {
        "group": "Orange County",
        "repo": "www-chapter-orange-county",
        "name": "Optimizing Infrastructure\u000bto make Software Development\u000bMore Secure",
        "date": "2021-04-22",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-OC/events/277551663/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: James Chillingworth, CEO and Founder, The Consulting Practice</p> <p>Topic: Optimizing Infrastructure to make Software Development More Secure</p> <p>Abstract:<br/>Traditionally:<br/>The resources that do SOFTWARE DEVELOPMENT and the teams that do INFRASTRUCTURE CONFIGURATION don’t UNDERSTAND each other and don’t even COMMUNICATE very well (GROAN).<br/>Result:<br/>SOFTWARE DEVELOPMENT teams are not aware of the various SECURITY and OPTIMIZATION benefits of INFRASTRUCTURE resulting in LACK OF SECURITY, AND HUGE EFFICIENCIES that are not implemented (OUCH!)<br/>Overview:<br/>Covered in this presentation will be a review of various Infrastructures, fundamental Architectures, and Optimizations available with Physical Environments. Included will be a discussion of:<br/>Where is the S/W development being done and what fundamental security precautions should be in place,<br/>CPU architectures and some of the focused approaches to making Software more secure by using easy-to-understand tools and API’s,<br/>Advanced Storage Technologies that can ensure that Data and Code are: Securely Stored, Easily Backed up, Protected, Categorized, Easy to Access, Easy to Obfuscate, Easy to Replicate, Cheap to Replicate, Fast to Replicate….and the advantages go on!</p> <p>Speaker Bio:<br/>James Chillingworth, CEO and Founder, The Consulting Practice<br/>Throughout his career, James has done Software Development, Database Programming, High Availability Computer Configuration, Network Architecture, Cybersecurity Architecture, Product Management, and Project Management.<br/>Over the last 17 years, James has directed and performed consulting activities, often managing teams of technology consultants, for clients located across North America. Technology focus has been with: SDLC, Performance Analysis and Tuning, Next Generation Firewalls, SIEM, DLP, DNS, DHCP, NAC, Endpoint, Threat Detection, and Malop Tools to name a few.<br/>James is also a planner with Cybersecurity groups: OWASP and ISSA in Los Angeles.<br/>In his spare time, James plays Soccer, Hockey and is also an Actor, Writer and Stand-Up Comedian.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/jameschillingworth/\" class=\"linkified\">https://www.linkedin.com/in/jameschillingworth/</a><br/>Twitter: <a href=\"https://twitter.com/jchilliplanet\" class=\"linkified\">https://twitter.com/jchilliplanet</a></p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "
    },
    {
        "group": "Triangle Nc",
        "repo": "www-chapter-triangle-nc",
        "name": "Automate API testing and push #AppSec left (with live demos)",
        "date": "2021-04-29",
        "time": "12:00",
        "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccgbmc/",
        "timezone": "US/Eastern",
        "description": "<p>In our February meeting, Joe Schottman discussed the terminology of web APIs and how the OWASP top 10 web and API vulnerability lists apply to them. In this meeting, he'll show how to place an interception proxy such as OWASP ZAP in line with software defect testing tools, helping automate API testing and pushing application security left into the CI pipeline. This talk will be a demonstration of the concepts - a hands-on lab will be available through DC919 (targeting the May meeting).</p> "
    },
    {
        "group": "Saint Louis",
        "repo": "www-chapter-saint-louis",
        "name": "Bug Bounty Night",
        "date": "2021-04-29",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-STL/events/277429290/",
        "timezone": "US/Central",
        "description": "<p>Overview of bug bounty programs and how you can participate in this fun and rewarding activity.</p> "
    },
    {
        "group": "Salt Lake City",
        "repo": "www-chapter-salt-lake-city",
        "name": "April 2021 Chapter Meeting",
        "date": "2021-04-29",
        "time": "12:00",
        "link": "https://www.meetup.com/owasp-slc/events/277554172/",
        "timezone": "US/Mountain",
        "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-nw4d0iq9-bBMKHrFITzJMMsDye6FNYg\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-nw4d0iq9-bBMKHrFITzJMMsDye6FNYg</a>) to suggest any additional topics.</p> <p>Agenda:</p> <p>- Application security metrics<br/>- The new OWASP Top 10 update<br/>- Mis-use/abuse test cases and how they can help detect broken access controls</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC April 2021 Chapter Meeting<br/>Time: Apr 29, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/97800663033?pwd=bnA4MTJmdE1BQnExb2o2Qmtrd2ROZz09\" class=\"linkified\">https://zoom.us/j/97800663033?pwd=bnA4MTJmdE1BQnExb2o2Qmtrd2ROZz09</a></p> <p>Meeting ID: 978 0066 3033<br/>Passcode: 693113<br/>One tap mobile<br/>+12532158782,,97800663033#,,,,*693113# US (Tacoma)<br/>+13462487799,,97800663033#,,,,*693113# US (Houston)</p> <p>Dial by your location<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 301 715 8592 US (Washington DC)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 978 0066 3033<br/>Passcode: 693113<br/>Find your local number: <a href=\"https://zoom.us/u/aeiAxXrCOy\" class=\"linkified\">https://zoom.us/u/aeiAxXrCOy</a></p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "Monthly Meeting",
        "date": "2021-05-20",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsycchbbc/",
        "timezone": "US/Pacific",
        "description": "<p>Monthly OWASP meeting</p> "
    },
    {
        "group": "Suffolk",
        "repo": "www-chapter-suffolk",
        "name": "[ONLINE]OWASP Suffolk Chapter - OWASP ZAP for beginners",
        "date": "2021-04-27",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/277007739/",
        "timezone": "Europe/London",
        "description": "<p>AGENDA:<br/>* Introduction<br/>* Practical demo of OWASP ZAP<br/>* Networking<br/>* Open discussion<br/>* Virtual Beer</p> <p>This event will demo how to use OWASP ZAP to test the security of your own web site or application. The demonstration is aimed at the complete beginner and will also provide an overview of a web proxy and vulnerability scanning of web applications.</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "
    },
    {
        "group": "Bristol Uk",
        "repo": "www-chapter-bristol-uk",
        "name": "TBC",
        "date": "2021-05-20",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Bristol/events/277163169/",
        "timezone": "Europe/London",
        "description": "<p>tbc</p> "
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "ARU CSNRG, OWASP Camb & BCS Cyber Forensics “OWASP ModSecurity CRS Project\"",
        "date": "2021-05-06",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/277649895/",
        "timezone": "Europe/London",
        "description": "<p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter, BCS Cybercrime Forensics SG &amp; BCS Dorset/Hampshire Branches.</p> <p>Background</p> <p>OWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.</p> <p>The Cyber Security and Networking (CSN) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP &amp; the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment. These will be achieved through the investigation of threats posed to information systems and understanding the impact of attacks and creation of cyber-based warning systems which gathering threat intelligence, automate threat detection, alert users and neutralising attacks. For network security we are researching securing the next generation of software defined infrastructures from the application API and control/data plane attacks.</p> <p>The BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.</p> <p>Speaker Biographies &amp; Abstracts</p> <p>Christian Folini, Security Engineer, Netnea – “OWASP Mod Security Core Rule Set CRS Project”</p> <p>Bio: Christian Folini, Security Engineer, Netnea &amp; OWASP ModSecurity CRS Project Leader</p> <p>Christian Folini is a security engineer and open source enthusiast. He holds a Ph.D. in medieval history and enjoys defending castles across Europe. Unfortunately, defending medieval castles is not a big business anymore and he turned to defending web servers, which he finds equally challenging. He brings more than ten years of experience with ModSecurity configuration in high-security environments, DDoS defence, and threat modelling.</p> <p>Christian Folini is the author of the second edition of the ModSecurity Handbook and the best-known teacher on the subject. He co-leads the OWASP ModSecurity Core Rule Set project and serves as the program chair of the \"Swiss Cyber Storm\" conference, the prime security conference in Switzerland.</p> <p>Abstract : “OWASP Mod Security Core Rule Set CRS Project”</p> <p>The CRS is a set of generic attack detection rules for use with ModSecurity or compatible web application firewalls. CRS is the 1st line of defence against web application attacks like those summarized in the OWASP Top Ten and all with a minimum of false alerts. This talk demonstrates the installation of the rule set and introduces the most important groups of rules. It covers key concepts like anomaly scoring and thresholds, paranoia levels, stricter siblings and the sampling mode. The important handling of false positives is also covered as well as pre-defined lists of rule exclusions for popular web applications helping to avoid false positives.</p> <p>Provisional Agenda</p> <p>18:00 - Webinar waiting lobby opens<br/>18:15 - Presentation followed by Questions and Answers<br/>19:30 - Closing, with virtual networking</p> "
    },
    {
        "group": "Italy",
        "repo": "www-chapter-italy",
        "name": "OWASP Italy Day 2021",
        "date": "2021-04-28",
        "time": "09:00",
        "link": "https://www.meetup.com/owasp-italy-meetup-group/events/277407026/",
        "timezone": "Europe/Rome",
        "description": "<p>The Open Web Application Security Project, or OWASP, is an international non-profit organization dedicated to web and application security. OWASP is organized as an online community that produces freely-available articles, methodologies, documentation, tools, and technologies in the field of web application security. Many standards, books, tools, and organizations reference the Top OWASP 10 project, including MITRE, PCI DSS, the Defense Information Systems Agency (DISA-STIG), the United States Federal Trade Commission (FTC) and many more. The OWASP Testing Guide includes a \"best practice\" penetration testing framework that users can implement in their own organizations and a \"low level\" penetration testing guide that describes techniques for testing most common web application and web service security issues.</p> <p>OWASP Italy Day 2021 is a half-day conference focused on web application and software security, application security testing tools and technologies.</p> <p>This conference provided a unique opportunity to learn about application security topics and to network with application security professionals/managers, software engineers, software quality engineers/testers and computer science students.</p> <p>More information here:<br/><a href=\"https://owasp.org/www-chapter-italy/events/owasp-day-210428\" class=\"linkified\">https://owasp.org/www-chapter-italy/events/owasp-day-210428</a></p> <p>The connection link will be communicated the day before the event to the registered attendees.</p> "
    },
    {
        "group": "Norway",
        "repo": "www-chapter-norway",
        "name": "Morning meetup: The defender’s new clothes - Eldar Marcussen",
        "date": "2021-04-30",
        "time": "09:00",
        "link": "https://www.meetup.com/OWASP-Norway/events/277527268/",
        "timezone": "Europe/Oslo",
        "description": "<p>We're doing a morning meeting this time, as our speaker is based in Australia.</p> <p>Description:<br/>Proving vulnerabilities in modern web applications is significantly harder than it used to be thanks to WAFs and other protection measures. This talk will discuss and showcase several approaches to bypasses ranging from simple to advanced.</p> <p>Bio:<br/>Eldar Marcussen <a href=\"https://twitter.com/wireghoul\" class=\"linkified\">https://twitter.com/wireghoul</a> is a lead security researcher and penetration tester. He is a long time bug hunter with a large number of published advisories, exploits and conference presentations at leading security conferences all over the world. He was a recipient of the first CVE 10K candidate numbers. In addition to finding vulnerabilities he contributes to and maintain several open source projects in his spare time aimed at web application security and penetration testing. These include graudit, doona, lbmap, dotdotpwn, nikto and more. His tools and research are featured in most security oriented linux distros as well as many industry leading books.</p> "
    },
    {
        "group": "Oakland County",
        "repo": "www-chapter-oakland-county",
        "name": "OWASP Oakland County Meeting",
        "date": "2021-05-13",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Oakland-County-Chapter/events/277503002/",
        "timezone": "US/Eastern",
        "description": "<p>Speaker and topic are TBA</p> <p>5:30PM EDT- social meetup (show up when ever)<br/>7PM EDT - Talk starts</p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-21",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbcc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-20",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbbc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-19",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbzb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-16",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbvb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-15",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbtb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-14",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbsb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-13",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbrb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-12",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbqb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-09",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbmb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-08",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchblb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-07",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbkb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-06",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbjb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-05",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbhb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-02",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbdb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-05-01",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsycchbcb/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-04-30",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsyccgbnc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-04-29",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsyccgbmc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-04-28",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsyccgblc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-04-25",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsyccgbhc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-04-24",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsyccgbgc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-04-23",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsyccgbfc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Cuddalore",
        "repo": "www-chapter-cuddalore",
        "name": "Pentesting Playground in Tamil ",
        "date": "2021-04-22",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Cuddalore-Chapter/events/vhpfhsyccgbdc/",
        "timezone": "Asia/Calcutta",
        "description": "<p>We are back again with a new training event \" PENTESTING PLAYGROUND \" in TAMIL which helps you to kick start your career in cybersecurity. This is a 5 days session from 14 th April to 18th April ( 6:00pm - 8:00 pm). Those who are interested, join us by registering for the event using the following link.</p> <p> <a href=\"https://bit.ly/3g2OH8R\" class=\"linkified\">https://bit.ly/3g2OH8R</a></p> <p>Participation certificate will be provided upon request.</p> <p>for doubts please contact us</p> <p><a href=\"https://www.instagram.com/owaspcuddalore\" class=\"linkified\">https://www.instagram.com/owaspcuddalore</a></p> "
    },
    {
        "group": "Canberra",
        "repo": "www-chapter-canberra",
        "name": "Drop In Session - Canberra OWASP Revamp Online meet and greet",
        "date": "2021-04-28",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Canberra-Chapter/events/277676231/",
        "timezone": "Australia/Canberra",
        "description": "<p>Event: Drop In Session - Canberra OWASP Revamp Online meet and greet<br/>Date: 28th April 2021 6:00 pm - 7:00 pm<br/>Link: Join Zoom Meeting <a href=\"https://zoom.us/j/98065495818\" class=\"linkified\">https://zoom.us/j/98065495818</a><br/>No Registration required, however all enquiries are welcome. Please join and invite all your friends/colleagues who may benefit from our regular events.</p> <p>For more details and OWASP memberships please visit <a href=\"https://owasp.org/www-chapter-canberra/\" class=\"linkified\">https://owasp.org/www-chapter-canberra/</a></p> <p>Enquiries: Akshay.Gupta@owasp.org</p> "
    },
    {
        "group": "Brasov",
        "repo": "www-chapter-brasov",
        "name": "OWASP AppSec Brasov [1]",
        "date": "2021-04-23",
        "time": "11:00",
        "link": "https://www.meetup.com/owasp-brasov/events/277346025/",
        "timezone": "Europe/Bucharest",
        "description": "<p>The next OWASP Brasov Chapter Meeting will be online. We will be live-streaming on Zoom.</p> "
    }
]